
// #Область СлужебныеПеременныеМетодыФормы

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		Результат = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		Результат = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

// #КонецОбласти


// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Операция", Операция);
	Параметры.Свойство("ДокументУчета", ДокументУчета);
	
	Если ЗначениеЗаполнено(Операция) И Не ЗначениеЗаполнено(ДокументУчета) Тогда
		ДокументУчета = Операция.ДокументУчета;
	КонецЕсли;
	
	ПоказатьЗавершенные = Истина;
	
	УстановитьУсловноеОформление();
	ЗаполнитьДеревоСвязей();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьПометкуКнопкиПоказатьЗавершенные();
	УстановитьЗаголовокФормы();
	РазвернутьДеревоСвязей();
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийДереваСвязей

&НаКлиенте
Процедура ДеревоСвязейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекСтрока = Элементы.ДеревоСвязей.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекСтрока.ДокументУчета) Тогда
		
		МодульКлиента().ОткрытьФормуДокументаУчета(ТекСтрока.ДокументУчета, ЭтаФорма);
		
	Иначе
		
		МодульКлиента().ОткрытьФормуОперации(ТекСтрока.Операция, ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	
	ЗаполнитьДеревоСвязей();
	РазвернутьДеревоСвязей();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьЗавершенные(Команда)
	
	ПоказатьЗавершенные = НЕ ПоказатьЗавершенные;
	
	УстановитьПометкуКнопкиПоказатьЗавершенные();
	
	ЗаполнитьДеревоСвязей();
	РазвернутьДеревоСвязей();
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УстановитьОформлениеПредставления();
	УстановитьОформлениеСтатусов();
	УстановитьОформлениеВидимости();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеПредставления()
	
	ДеревоФормы = Элементы.ДеревоСвязей;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ДеревоФормы.ПутьКДанным + "Представление");
	
	ГруппаОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ДеревоФормы.Имя + ".Операция");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Операция;
	
	ГруппаДокументУчета = ГруппаОтбора.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаДокументУчета.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ЭлементОтбора = ГруппаДокументУчета.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ДеревоФормы.Имя + ".ДокументУчета");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = ДокументУчета;
	
	ЭлементОтбора = ГруппаДокументУчета.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДокументУчета");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	ЭлементОтбора = ГруппаДокументУчета.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Операция");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт( , , Истина));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеСтатусов()
	
	ДеревоФормы = Элементы.ДеревоСвязей;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ДеревоФормы.ПутьКДанным + "Статус");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ДеревоФормы.Имя + ".Статус");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ПравоеЗначение = СтатусыОперацийСОшибками();
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеВидимости()
	
	ДеревоФормы = Элементы.ДеревоСвязей;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	Для Каждого ПодчиненныйЭлемент Из ДеревоФормы.ПодчиненныеЭлементы Цикл
		
		ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ПодчиненныйЭлемент.Имя);
		
	КонецЦикла;
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ДеревоФормы.Имя + ".ПоказатьСтроку");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Ложь;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокФормы()
	
	ЭлементыДерева = ДеревоСвязей.ПолучитьЭлементы();
	
	Если ЗначениеЗаполнено(Операция) Тогда
		ПредставлениеКорневогоОбъекта = Строка(Операция);
	Иначе
		ПредставлениеКорневогоОбъекта = Строка(ДокументУчета);
	КонецЕсли;
	
	Заголовок = МодульКлиента().ПараметрыВСтроку(НСтр("ru = 'Связанные документы: %1'"), ПредставлениеКорневогоОбъекта);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкуКнопкиПоказатьЗавершенные()
	
	Элементы.Кнопка_ПоказатьЗавершенные.Пометка = ПоказатьЗавершенные;
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДеревоСвязей()
	
	ЭлементыДереваСвязей = ДеревоСвязей.ПолучитьЭлементы();
	
	Если ЭлементыДереваСвязей.Количество() > 0 Тогда 
		Элементы.ДеревоСвязей.Развернуть(ЭлементыДереваСвязей[0].ПолучитьИдентификатор(), Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СтатусыОперацийСОшибками()
	
	СтатусыОпераций = МодульОбъекта().Перечисление_СтатусыОпераций();
	
	Результат = Новый СписокЗначений;
	Результат.Добавить(СтатусыОпераций.ОшибкаОбработки);
	Результат.Добавить(СтатусыОпераций.НедостаточноСредств);
	
	Возврат Результат;
	
КонецФункции

// #Область ЗаполнениеДереваСвязей

&НаСервере
Процедура ЗаполнитьДеревоСвязей()
	
	Если Не ЗначениеЗаполнено(Операция)
		И Не ЗначениеЗаполнено(ДокументУчета) Тогда
		Возврат;
	КонецЕсли;
	
	Дерево = РеквизитФормыВЗначение("ДеревоСвязей");
	Дерево.Строки.Очистить();
	
	ДобавитьКорневуюСтроку(Дерево.Строки);
	ДобавитьПодчиненныеСтроки(Дерево.Строки);
	ДозаполнитьДанныеСтрок(Дерево.Строки);
	ЗаполнитьВидимостьСтрок(Дерево.Строки);
	
	Дерево.Строки.Сортировать("Дата Возр", Истина);
	
	ЗначениеВРеквизитФормы(Дерево, "ДеревоСвязей");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКорневуюСтроку(СтрокиДерева)
	
	НоваяСтрока = СтрокиДерева.Добавить();
	
	Если ЗначениеЗаполнено(ДокументУчета) Тогда
		НоваяСтрока.ДокументУчета = ДокументУчета;
	Иначе
		НоваяСтрока.Операция = ПерваяОперация(Операция);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПодчиненныеСтроки(СтрокиДерева)
	
	Для каждого СтрокаДерева Из СтрокиДерева Цикл
		
		Если ЗначениеЗаполнено(СтрокаДерева.ДокументУчета) Тогда
			ТаблицаОпераций = МодульОбъекта().ДокументУчета_СписокОпераций(СтрокаДерева.ДокументУчета, , , , Истина);
			ПодчиненныеОперации = ТаблицаОпераций.ВыгрузитьКолонку("ОперацияСсылка");
		Иначе
			ПодчиненныеОперации = МодульОбъекта().Операция_НайтиПодчиненныеОперации(СтрокаДерева.Операция);
		КонецЕсли;
		
		Для Каждого ТекОперация Из ПодчиненныеОперации Цикл
			НоваяСтрока = СтрокаДерева.Строки.Добавить();
			НоваяСтрока.Операция = ТекОперация;
		КонецЦикла;
		
		ДобавитьПодчиненныеСтроки(СтрокаДерева.Строки);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДозаполнитьДанныеСтрок(СтрокиДерева)
	
	Для каждого СтрокаДерева Из СтрокиДерева Цикл
		
		Если ЗначениеЗаполнено(СтрокаДерева.ДокументУчета) Тогда
			СтрокаДерева.Статус = МодульОбъекта().ДокументУчета_ОсновнойСтатус(СтрокаДерева.ДокументУчета);
			СтрокаДерева.Дата = МодульОбъекта().ЗначениеРеквизитаОбъекта_Марк(СтрокаДерева.ДокументУчета, "Дата");
		Иначе
			ДанныеОперации = МодульОбъекта().ЗначенияРеквизитовОбъекта_Марк(СтрокаДерева.Операция, "Дата, ТипОперации");
			СтрокаДерева.Статус = МодульОбъекта().Операция_ОсновнойСтатус(СтрокаДерева.Операция);
			СтрокаДерева.Дата = ДанныеОперации.Дата;
			СтрокаДерева.ТипОперации = ДанныеОперации.ТипОперации;
		КонецЕсли;
		
		ЗаполнитьПредставлениеСтроки(СтрокаДерева);
		ЗаполнитьИндексКартинкиСтроки(СтрокаДерева);
		
		ДозаполнитьДанныеСтрок(СтрокаДерева.Строки);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьВидимостьСтрок(СтрокиДерева)
	
	ЕстьВидимостьСтрок = Ложь;
	
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		
		ЕстьВидимостьПодчиненныхСтрок = ЗаполнитьВидимостьСтрок(СтрокаДерева.Строки);
		
		Если ЕстьВидимостьПодчиненныхСтрок
			Или ПоказатьСтроку(СтрокаДерева) Тогда
			СтрокаДерева.ПоказатьСтроку = Истина;
			ЕстьВидимостьСтрок = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ЕстьВидимостьСтрок;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьИндексКартинкиСтроки(СтрокаДерева)
	
	Если ЗначениеЗаполнено(СтрокаДерева.ДокументУчета) Тогда
		
		СтрокаДерева.ИндексКартинки = 5;
		
	Иначе
		
		СлужебныеОперации = МодульОбъекта().ТипыСлужебныхОпераций();
		Если СлужебныеОперации.Найти(СтрокаДерева.ТипОперации) = Неопределено Тогда
			СтрокаДерева.ИндексКартинки = 5;
		Иначе
			СтрокаДерева.ИндексКартинки = 6;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредставлениеСтроки(СтрокаДерева)
	
	Если ЗначениеЗаполнено(СтрокаДерева.ДокументУчета) Тогда
		ПредставлениеОбъектаСтроки = МодульОбъекта().ПараметрыВСтроку(НСтр("ru = 'Маркировка: %1'"), СтрокаДерева.ДокументУчета);
	Иначе
		ПредставлениеОбъектаСтроки = Строка(СтрокаДерева.Операция);
	КонецЕсли;
	
	СтрокаДерева.Представление = ПредставлениеОбъектаСтроки;
	
КонецПроцедуры

&НаСервере
Функция ПоказатьСтроку(СтрокаДерева)
	
	Если ЗначениеЗаполнено(СтрокаДерева.ДокументУчета)
		Или СтрокаДерева.Операция = Операция Тогда
		Возврат Истина;
	КонецЕсли;
	
	ТипыОперацийБезОтображения = МодульОбъекта().ТипыСлужебныхОперацийБезОтображения();
	Если ТипыОперацийБезОтображения.Найти(СтрокаДерева.ТипОперации) <> Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ПоказатьЗавершенные Тогда
		Возврат Истина;
	КонецЕсли;
	
	СтатусыОпераций = МодульОбъекта().Перечисление_СтатусыОпераций();
	Если СтрокаДерева.Статус = СтатусыОпераций.ОперацияЗавершена Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ПерваяОперация(ТекущаяОперация)
	
	Результат = ТекущаяОперация;
	
	Пока Истина Цикл
		
		ОперацияОснование = МодульОбъекта().ЗначениеРеквизитаОбъекта_Марк(Результат, "ОперацияОснование");
		Если Не ЗначениеЗаполнено(ОперацияОснование) Тогда
			Прервать;
		КонецЕсли;
		
		Результат = ОперацияОснование;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти

// #КонецОбласти
