
// #Область СлужебныеПеременныеИМетодыФормы

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента = Неопределено Тогда
		
		Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
			КэшМодуляКлиента = ВладелецФормы.МодульКлиента();
		Иначе
			ПутьКФорме = ПутьКФормеМодуляКлиента();
			КэшМодуляКлиента = ОткрытьФорму(ПутьКФорме);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат КэшМодуляКлиента;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

// #КонецОбласти


// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Копирование", Копирование);
	Параметры.Свойство("Сертификат", Сертификат);
	Параметры.Свойство("Организация", Организация);
	Параметры.Свойство("Пользователь", Пользователь);
	Параметры.Свойство("ВидСертификата", ВидСертификата);
	
	ЗаполнитьКонтекстФормы();
	УстановитьЗаголовок();
	
	Если Параметры.Свойство("КонтекстОбмена") Тогда
		ПоказатьГруппуПроверкиСертификата(Параметры.КонтекстОбмена, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьЭлементыФормы();
	УстановитьТекущийЭлемент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	МодульКлиента().СохранитьИзмененияНаФорме("ЗаписатьИЗакрыть", ЭтаФорма, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьСертификат(Команда)
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("СертификатПослеВыбора", ЭтаФорма);
	
	МодульКлиента().ОткрытьФормуВыбораСертификата(ОтпечатокСертификата
	, ТребуемыйВидСертификата
	, ЭтаФорма
	, ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьНастройкуПодписания();
	
	ПровестиОпросПользователяИЗакрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьНастройку(Команда)
	
	УдалитьНастройкуПодписания();
	
	Модифицированность = Ложь;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСертификат(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	СкрытьГруппуПроверкиСертификата();
	
	ПодключитьОбработчикОжидания("ПродолжитьПроверкуСертификата", 0.1, Истина);
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СправкаКакОбновитьСертификатНажатие(Элемент)
	
	МодульКлиента().ОткрытьСправкуКакОбновитьСертификат();
	
КонецПроцедуры

&НаКлиенте
Процедура СправкаКакПривязатьСертификатВГИСНажатие(Элемент)
	
	МодульКлиента().ОткрытьСправкуКакПривязатьСертификатВГИС();
	
КонецПроцедуры

&НаКлиенте
Процедура СправкаВходИНастройкаЛичногоКабинетаНажатие(Элемент)
	
	МодульКлиента().ОткрытьСправкуКакНачатьРаботуССервисамиКонтура();
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаОткрытьЛичныйКабинет82Нажатие(Элемент)
	
	МодульКлиента().ОткрытьЛичныйКабинетКонтурМаркировка();
	
КонецПроцедуры

&НаКлиенте
Процедура СправкаКакУстановитьСертификатНажатие(Элемент)
	
	МодульКлиента().ОткрытьСправкуКакУстановитьСертификат();
	
КонецПроцедуры

&НаКлиенте
Процедура СправкаЧтоДелатьЕслиНетСертификатаНажатие(Элемент)
	
	МодульКлиента().ОткрытьСправкуНаКомпьютереНетСертификата();
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиОповещений

&НаКлиенте
Процедура СертификатПослеВыбора(ОписаниеСертификата = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	Если ОписаниеСертификата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ЗаполнитьКонтекстПоОписаниюСертификата(ОписаниеСертификата);
	
	СкрытьГруппуПроверкиСертификата();
	НастроитьЭлементыФормы();
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьСертфикат()
	
	Сертификат = МодульОбъекта().Сертификаты_Записать(ОписаниеСертификатаПоКонтексту());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНастройкуПодписания()
	
	ЗаписатьНастройкуПодписанияНаСервере();
	
	Оповестить("КонтурМаркировка_НастройкаПодписания_Запись");
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьНастройкуПодписания()
	
	УдалитьНастройкуПодписанияНаСервере();
	
	Оповестить("КонтурМаркировка_НастройкаПодписания_Запись");
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкуПодписанияНаСервере()
	
	Если Не ЗначениеЗаполнено(Сертификат) Тогда
		ЗаписатьСертфикат();
	КонецЕсли;
	
	НачатьТранзакцию(МодульОбъекта().РежимУправленияБлокировкой());
	Попытка
		
		Если Не Копирование И Не НоваяНастройка Тогда
			
			Если ОрганизацияНастройки <> Организация
				Или ПользовательНастройки <> Пользователь
				Или СертификатНастройки <> Сертификат Тогда
				УдалитьНастройкуПодписанияНаСервере();
			КонецЕсли;
			
		КонецЕсли;
		
		МодульОбъекта().НастройкаПодписания_Записать(Сертификат, Организация, Пользователь);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	ПользовательНастройки = Пользователь;
	ОрганизацияНастройки = Организация;
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьНастройкуПодписанияНаСервере()
	
	Если Не ЗначениеЗаполнено(СертификатНастройки) Тогда
		Возврат; // Настройки в базе нет
	КонецЕсли;
	
	МодульОбъекта().НастройкаПодписания_Удалить(ОрганизацияНастройки, ПользовательНастройки);
	МодульОбъекта().ПортальныйТокен_Удалить(СертификатНастройки);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовок()
	
	Если Не ЗначениеЗаполнено(ОтпечатокСертификата) Тогда
		ЭтаФорма.Заголовок = НСтр("ru = 'Добавьте настройку подписания'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекущийЭлемент()
	
	Если ЗначениеЗаполнено(Сертификат) Тогда
		ТекущийЭлемент = Элементы.КнопкаПроверитьСертификат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтекстФормы()
	
	Если Не Копирование Тогда
		СертификатНастройки = МодульОбъекта().НастройкаПодписания_Сертификат(Организация, Пользователь);
		НоваяНастройка = Не ЗначениеЗаполнено(СертификатНастройки);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Сертификат) Тогда
		Сертификат = СертификатНастройки;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Сертификат) Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Сертификат);
	КонецЕсли;
	
	ТребуемыйВидСертификата = ВидСертификата;
	ПользовательНастройки = Пользователь;
	ОрганизацияНастройки = Организация;
	
	ЗаполнитьПользователяПоУмолчанию();
	ЗаполнитьОрганизациюПоУмолчанию();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтекстПоОписаниюСертификата(ОписаниеСертификата)
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ОписаниеСертификата);
	
	Сертификат = МодульОбъекта().Сертификаты_Найти(ОтпечатокСертификата);
	
	ЗаполнитьПользователяПоУмолчанию();
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьГруппуПроверкиСертификата()
	
	Элементы.ГруппаПроверкаСертификата.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПоказатьГруппуПроверкиСертификата(КонтекстОбмена, Форма, ПроверкаСертификата = Ложь)
	
	Элементы = Форма.Элементы;
	
	Элементы.ГруппаПроверкаСертификата.Видимость = Истина;
	
	НастроитьГруппуПроверкиУстановкиСертификата(КонтекстОбмена, Форма);
	НастроитьГруппуПроверкиПодписи(КонтекстОбмена, Форма, ПроверкаСертификата);
	НастроитьГруппуПроверкиСрокаДействия(КонтекстОбмена, Форма);
	НастроитьГруппуПроверкиДоступа(КонтекстОбмена, Форма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьГруппуПроверкиУстановкиСертификата(КонтекстОбмена, Форма)
	
	Элементы = Форма.Элементы;
	
	Если СертификатНеУстановлен(КонтекстОбмена) Тогда
		
		Элементы.ГруппаУстановкаУспешно.Видимость = Ложь;
		Элементы.ГруппаУстановкаНеНайден.Видимость = Истина;
		Элементы.ГруппаУстановкаНетЗакрытогоКлюча.Видимость = Ложь;
		Элементы.ГруппаУстановкаСправка.Видимость = Истина;
		
	ИначеЕсли НетЗакрытогоКлюча(КонтекстОбмена) Тогда
		
		Элементы.ГруппаУстановкаУспешно.Видимость = Ложь;
		Элементы.ГруппаУстановкаНеНайден.Видимость = Ложь;
		Элементы.ГруппаУстановкаНетЗакрытогоКлюча.Видимость = Истина;
		Элементы.ГруппаУстановкаСправка.Видимость = Истина;
		
	Иначе
		
		Элементы.ГруппаУстановкаУспешно.Видимость = Истина;
		Элементы.ГруппаУстановкаНеНайден.Видимость = Ложь;
		Элементы.ГруппаУстановкаНетЗакрытогоКлюча.Видимость = Ложь;
		Элементы.ГруппаУстановкаСправка.Видимость = Ложь;
		
		Если Не КонтекстОбмена.ФайловыйРежим Тогда
			
			Если КонтекстОбмена.СертификатУстановленНаСервере Тогда
				ТекстСертификатНайден = НСтр("ru = 'Сертификат найден на сервере'");
			Иначе
				ТекстСертификатНайден = НСтр("ru = 'Сертификат найден на компьютере'");
			КонецЕсли;
			
			Элементы.ТекстСертификатНайден.Заголовок = ТекстСертификатНайден;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьГруппуПроверкиПодписи(КонтекстОбмена, Форма, ПроверкаСертификата)
	
	Элементы = Форма.Элементы;
	
	Если СертификатНеУстановлен(КонтекстОбмена)
		Или НетЗакрытогоКлюча(КонтекстОбмена) Тогда
		Элементы.ГруппаПодпись.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаПодпись.Видимость = Истина;
	
	Если НеУдалосьПодписать(КонтекстОбмена) Тогда
		
		Элементы.ГруппаПодписьУспешно.Видимость = Ложь;
		Элементы.ГруппаПодписьОшибка.Видимость = Истина;
		Элементы.ГруппаПодписьСправка.Видимость = Истина;
		
	Иначе
		
		Если ПроверкаСертификата Тогда
			
			Элементы.ГруппаПодписьУспешно.Видимость = Истина;
			Элементы.ГруппаПодписьОшибка.Видимость = Ложь;
			Элементы.ГруппаПодписьСправка.Видимость = Ложь;
			
		Иначе
			
			Элементы.ГруппаПодпись.Видимость = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьГруппуПроверкиСрокаДействия(КонтекстОбмена, Форма)
	
	Элементы = Форма.Элементы;
	
	Если СертификатНеУстановлен(КонтекстОбмена) Тогда
		
		Элементы.ГруппаСрокДействия.Видимость = Ложь;
		
	ИначеЕсли Не КонтекстОбмена.СертификатДействует Тогда
		
		Элементы.ГруппаСрокДействия.Видимость = Истина;
		Элементы.ГруппаСрокДействияУспешно.Видимость = Ложь;
		Элементы.ГруппаСрокДействияИстек.Видимость = Истина;
		Элементы.ГруппаСрокДействияСправка.Видимость = Истина;
		
	Иначе
		
		Элементы.ГруппаСрокДействия.Видимость = Истина;
		Элементы.ГруппаСрокДействияУспешно.Видимость = Истина;
		Элементы.ГруппаСрокДействияИстек.Видимость = Ложь;
		Элементы.ГруппаСрокДействияСправка.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьГруппуПроверкиДоступа(КонтекстОбмена, Форма)
	
	Элементы = Форма.Элементы;
	
	Если СертификатНеУстановлен(КонтекстОбмена)
		Или НеУдалосьПодписать(КонтекстОбмена) Тогда
		Элементы.ГруппаДоступВСервис.Видимость = Ложь;
		Элементы.ГруппаДоступВГИСМТ.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаДоступВСервис.Видимость = Истина;
	Элементы.ГруппаДоступВГИСМТ.Видимость = Истина;
	
	НетДоступаКПорталу = 
	КонтекстОбмена.ТребуетсяАвторизацияПортала
	И Не КонтекстОбмена.ВыполненаАвторизацияПортала;
	
	Если НетДоступаКПорталу Тогда
		
		Элементы.ГруппаДоступВСервисУспешно.Видимость = Ложь;
		Элементы.ГруппаДоступВСервисОшибка.Видимость = Истина;
		Элементы.ГруппаАвторизуйтесьВСервисе.Видимость = Истина;
		Элементы.ГруппаДоступВСервисСправка.Видимость = Истина;
		
	Иначе
		
		Элементы.ГруппаДоступВСервисУспешно.Видимость = Истина;
		Элементы.ГруппаДоступВСервисОшибка.Видимость = Ложь;
		Элементы.ГруппаАвторизуйтесьВСервисе.Видимость = Ложь;
		Элементы.ГруппаДоступВСервисСправка.Видимость = Ложь;
		
	КонецЕсли;
	
	НетДоступаВГИС = 
	КонтекстОбмена.ТребуетсяАвторизацияГИС
	И Не КонтекстОбмена.ВыполненаАвторизацияГИС;
	
	Если НетДоступаВГИС Тогда
		
		Элементы.ГруппаДоступВГИСМТУспешно.Видимость = Ложь;
		Элементы.ГруппаДоступВГИСМТОшибка.Видимость = Истина;
		Элементы.ГруппаДоступВГИСМТСправка.Видимость = Истина;
		
	Иначе
		
		Элементы.ГруппаДоступВГИСМТУспешно.Видимость = Истина;
		Элементы.ГруппаДоступВГИСМТОшибка.Видимость = Ложь;
		Элементы.ГруппаДоступВГИСМТСправка.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СертификатНеУстановлен(КонтекстОбмена)
	
	Результат = 
	Не КонтекстОбмена.СертификатУстановленНаСервере
	И Не КонтекстОбмена.СертификатУстановленНаКлиенте;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция НетЗакрытогоКлюча(КонтекстОбмена)
	
	Возврат Не КонтекстОбмена.ЕстьЗакрытыйКлюч;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция НеУдалосьПодписать(КонтекстОбмена)
	
	Результат = 
	КонтекстОбмена.НеУдалосьПодписатьФайлы
	Или КонтекстОбмена.НеУдалосьРасшифроватьКонтент;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура НастроитьЭлементыФормы()
	
	Если ВидСертификата = МодульКлиента().Перечисление_ВидыСертификатов().НаФизЛицо Тогда
		
		Элементы.ГруппаПользователь.Видимость = Истина;
		Элементы.Должность.Видимость = Ложь;
		Элементы.ГруппаПодсказкаМЧД.Видимость = Истина;
		Элементы.ФИО.Заголовок = НСтр("ru = 'ФИО'");
		
		Если Пользователь = МодульКлиента().Пользователи_ТекущийПользователь() Тогда
			Элементы.ПодсказкаНастройкиДляДругогоПользователя.Видимость = Ложь;
		Иначе
			Элементы.ПодсказкаНастройкиДляДругогоПользователя.Видимость = Истина;
		КонецЕсли;
		
	Иначе
		Элементы.ГруппаПользователь.Видимость = Ложь;
		Элементы.Должность.Видимость = Истина;
		Элементы.ГруппаПодсказкаМЧД.Видимость = Ложь;
		Элементы.ФИО.Заголовок = НСтр("ru = 'Субъект'");
	КонецЕсли;
	
	Элементы.КнопкаУдалитьНастройку.Видимость = Не Копирование И Не НоваяНастройка;
	
	Если МодульКлиента().ВерсияПлатформыНиже("8.3.12") Тогда
		Элементы.ТекстАвторизуйтесьВСервисе.Заголовок = СокрЛП(ТекстАвторизуйтесь());
		Элементы.ТекстАвторизуйтесьВСервисе.РастягиватьПоГоризонтали = Ложь;
		Элементы.СсылкаОткрытьЛичныйКабинет82.Видимость = Истина;
	Иначе
		Элементы.ТекстАвторизуйтесьВСервисе.Заголовок = ТекстАвторизуйтесьВЛичномКабинете();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОписаниеСертификатаПоКонтексту()
	
	Результат = МодульОбъекта().Новый_Сертификат();
	ЗаполнитьЗначенияСвойств(Результат, ЭтаФорма);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПродолжитьПроверкуСертификата()
	
	КонтекстОбмена = КонтекстОбменаНаСервере();
	
	Если КонтекстОбмена.ТребуетсяАвторизацияПортала Тогда
		
		МодульКлиента().Авторизация_Выполнить(КонтекстОбмена);
		
		КонтекстОбмена.ТребуетсяАвторизацияГИС = Истина;
		КонтекстОбмена.ОтключитьПроверкуАвторизацииГИС = Ложь;
		МодульКлиента().Авторизация_Выполнить(КонтекстОбмена);
		
	КонецЕсли;
	
	ОчиститьСообщения();
	
	ПроверкаСертификата = Истина;
	ПоказатьГруппуПроверкиСертификата(КонтекстОбмена, ЭтаФорма, ПроверкаСертификата);
	
	Функциональность = МодульКлиента().Перечисление_ФункциональностьМодуля();
	МодульКлиента().СтекМетрик_ДобавитьФункциональность(Функциональность.ПроверкаСертификата, Организация);
	
КонецПроцедуры

&НаСервере
Функция КонтекстОбменаНаСервере()
	
	Если Не ЗначениеЗаполнено(Сертификат) Тогда
		ЗаписатьСертфикат();
	КонецЕсли;
	
	КонтекстОбмена = МодульОбъекта().КонтекстОбменаССервисом(Организация, Сертификат);
	
	КонтекстОбмена.ТребуетсяАвторизацияПортала = Истина;
	МодульОбъекта().Авторизация_Выполнить(КонтекстОбмена);
	
	КонтекстОбмена.ТребуетсяАвторизацияГИС = Истина;
	КонтекстОбмена.ОтключитьПроверкуАвторизацииГИС = Ложь;
	МодульОбъекта().Авторизация_Выполнить(КонтекстОбмена);
	
	Возврат КонтекстОбмена;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПользователяПоУмолчанию()
	
	Если ВидСертификата = МодульОбъекта().Перечисление_ВидыСертификатов().НаФизЛицо Тогда
		Если Не ЗначениеЗаполнено(Пользователь) Тогда
			Пользователь = МодульОбъекта().Пользователи_ТекущийПользователь();
		КонецЕсли;
	Иначе
		Пользователь = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОрганизациюПоУмолчанию()
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Организация = МодульОбъекта().НастройкиМодуля().ОрганизацияПоУмолчанию;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ТекстАвторизуйтесьВЛичномКабинете()
	
	
	ЧастиТекста = Новый Массив;
	ЧастиТекста.Добавить(ТекстАвторизуйтесь());
	ЧастиТекста.Добавить(ТекстВЛичномКабинете());
	
	ПараметрыСтроки = Новый Массив;
	ПараметрыСтроки.Добавить(ЧастиТекста);
	
	Возврат Новый ("ФорматированнаяСтрока", ПараметрыСтроки);
	
КонецФункции

&НаКлиенте
Функция ТекстАвторизуйтесь()
	
	Возврат НСтр("ru = 'Авторизуйтесь в '");
	
КонецФункции

&НаКлиенте
Функция ТекстВЛичномКабинете()
	
	ПараметрыСтроки = Новый Массив(5);
	ПараметрыСтроки[0] = НСтр("ru = 'личном кабинете сервиса'");
	ПараметрыСтроки[4] = МодульКлиента().АдресСайтаКонтурМаркировки();
	
	Возврат Новый ("ФорматированнаяСтрока", ПараметрыСтроки);
	
КонецФункции

// #КонецОбласти

// #Область ОпросыПользователей

&НаКлиенте
Процедура ПровестиОпросПользователяИЗакрыть()
	
	КлючиСценариев = МодульКлиента().Перечисление_КлючиСценариевДляОпросов();
	ОписаниеОпроса = МодульКлиента().ОпросПользователяПоСценарию(КлючиСценариев.НастройкиПодписания);
	
	Если ЗначениеЗаполнено(ОписаниеОпроса) Тогда
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПослеОпросаПользователя", ЭтаФорма);
		МодульКлиента().ОткрытьФормуОпросаПользователя(ОписаниеОпроса, ЭтаФорма, ОписаниеОбработчика);
		Возврат;
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОпросаПользователя(РезультатВыбора, ДопПараметры = Неопределено) Экспорт
	
	Закрыть(КодВозвратаДиалога.ОК);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Очистить();
	ПроверяемыеРеквизиты.Добавить("Организация");
	
	Если ВидСертификата = МодульОбъекта().Перечисление_ВидыСертификатов().НаФизЛицо Тогда
		ПроверяемыеРеквизиты.Добавить("Пользователь");
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти
