
// #Область СлужебныеПеременныеИМетодыФормы

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		Результат = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		Результат = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

// #КонецОбласти


// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КонтекстОбновления = Параметры.КонтекстОбновления;
	ОписаниеОбновленияHTML = КонтекстОбновления.ОписаниеОбновления;
	
	НастроитьЭлементыФормы();
	
	МодульОбъекта().СтараяВерсияМодуля_Записать("");
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не ЗакрытиеСКонтекстом Тогда
		Отказ = Истина;
		ЗакрытьСКонтекстом();
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти


// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СсылкаПодробнееОНовойВерсииНажатие(Элемент)
	
	МодульКлиента().ОткрытьСтраницуОбновления();
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаЦентрПоддержкиНажатие(Элемент)
	
	МодульКлиента().ОткрытьЦентрПоддержки();
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаСкачатьОбновлениеМодуляНажатие(Элемент)
	
	Если ЗначениеЗаполнено(КонтекстОбновления.АдресОбновления) Тогда
		МодульКлиента().ОткрытьИнтернетСтраницу(КонтекстОбновления.АдресОбновления);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаСкачатьОбновлениеПодсистемыНажатие(Элемент)
	
	Если ЗначениеЗаполнено(КонтекстОбновления.АдресОбновленияПодсистемы) Тогда
		МодульКлиента().ОткрытьИнтернетСтраницу(КонтекстОбновления.АдресОбновленияПодсистемы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаИнструкцияПоОбновлениюПодсистемыНажатие(Элемент)
	
	МодульКлиента().ОткрытьСправкуОбновлениеПодсистемы();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	КонтекстОбновления.ПолученОтказ = Истина;
	
	ЗакрытьСКонтекстом();
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	КонтекстОбновления.ПолученоСогласие = Истина;
	
	ЗакрытьСКонтекстом();
	
КонецПроцедуры

// #КонецОбласти


// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьЭлементыФормы()
	
	ТекущийЭлемент = Элементы.СсылкаЦентрПоддержки;
	
	Элементы.ОписаниеОбновленияHTML.Видимость = Истина;
	
	Если КонтекстОбновления.ОбновлениеВыполнено Тогда
		
		Элементы.КартинкаУспех.Видимость = Истина;
		Элементы.КнопкаЗакрыть.Видимость = Истина;
		Элементы.ОписаниеОбновленияHTML.Видимость = Ложь;
		Элементы.ТекстИнформации.Заголовок = ТекстУстановленаАктуальнаяВерсия();
		
	ИначеЕсли КонтекстОбновления.НевозможноВыполнитьОбновление Тогда
		
		Элементы.КнопкаЗакрыть.Видимость = Истина;
		Элементы.ГруппаНевозможноОбновить.Видимость = Истина;
		Элементы.ТекстНевозможноОбновить.Заголовок = ТекстНевозможноОбновитьМодуль();
		Элементы.ТекстИнформации.Заголовок = ТекстОбнаруженаНоваяВерсия();
		
		Элементы.СсылкаСкачатьОбновлениеМодуля.Видимость = Истина;
		
		Если КонтекстОбновления.ЕстьОбновлениеПодсистемы Тогда
			Элементы.СсылкаСкачатьОбновлениеПодсистемы.Видимость = Истина;
			Элементы.ГруппаИнструкцияПоОбновлениюПодсистемы.Видимость = Истина;
		КонецЕсли;
		
		ВариантыРасположения = МодульОбъекта().Перечисление_ВариантыРасположенияОбработки();
		Если КонтекстОбновления.РасположениеМодуля = ВариантыРасположения.ВКонфигурации Тогда
			Элементы.СсылкаСкачатьОбновлениеМодуля.Видимость = Истина;
		КонецЕсли;
		
	ИначеЕсли КонтекстОбновления.ЕстьОбновлениеМодуля Тогда
		
		Элементы.КнопкаЗакрыть.Видимость = Истина;
		Элементы.КнопкаОбновить.Видимость = Истина;
		Элементы.ТекстИнформации.Заголовок = ТекстДоступноОбновление();

	Иначе
		
		ВызватьИсключение НСтр("ru = 'Неизвестное состояние обновления'");
		
	КонецЕсли;
	
	НастроитьЭлементыФормыДля82();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормыДля82()
	
	Если Не МодульОбъекта().ВерсияПлатформыНиже("8.3")
		И Не МодульОбъекта().ВерсияРежимаСовместимостиНиже("8.3") Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.КнопкаЗакрыть.Видимость = Ложь;
	
	Элементы.СсылкаЦентрПоддержки.РастягиватьПоГоризонтали = Истина;
	Элементы.СсылкаСкачатьОбновлениеМодуля.РастягиватьПоГоризонтали = Истина;
	Элементы.СсылкаСкачатьОбновлениеПодсистемы.РастягиватьПоГоризонтали = Истина;
	
	Элементы.СсылкаСкачатьОбновлениеМодуля.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
	Элементы.СсылкаСкачатьОбновлениеПодсистемы.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
	
	Элементы.ТекстИнструкцияПоОбновлениюПодсистемы.Заголовок = ТекстИнструкцияПоОбновлениюДля82();
	Элементы.СсылкаИнструкцияПоОбновлениюПодсистемы.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСКонтекстом()
	
	ЗакрытиеСКонтекстом = Истина;
	
	Закрыть(КонтекстОбновления);
	
КонецПроцедуры

&НаСервере
Функция ТекстПричинаОшибки()
	
	ВариантыРасположения = МодульОбъекта().Перечисление_ВариантыРасположенияОбработки();
	ИнформацияОФайлеНаДиске = КонтекстОбновления.ИнформацияОФайлеНаДиске;
	
	Если КонтекстОбновления.ЕстьОбновлениеПодсистемы Тогда
		
		Результат = ТекстТребуетсяОбновлениеПодсистмеы();
		
	ИначеЕсли КонтекстОбновления.ЕстьДоработкиМодуля Тогда
		
		Результат = ТекстМодульДоработан();
		
	ИначеЕсли КонтекстОбновления.РасположениеМодуля = ВариантыРасположения.ВКонфигурации Тогда
		
		Результат = ТекстМодульВСоставеКонфигурации();
		
	ИначеЕсли КонтекстОбновления.РасположениеМодуля = ВариантыРасположения.НаДиске
		И Не ИнформацияОФайлеНаДиске.ДоступенНаСервере
		И Не ИнформацияОФайлеНаДиске.ДоступенНаКлиенте Тогда
		
		Результат = ТекстОшибкаДоступаКФайлу(ИнформацияОФайлеНаДиске.ПутьКФайлу);
		
	Иначе
		
		Результат = ТекстОбратитесьВКлиентскуюПоддержку();
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ТекстНевозможноОбновитьМодуль()
	
	ПричинаОшибки = ТекстПричинаОшибки();
	
	Текст = НСтр("ru = 'Невозможно обновить модуль автоматически. %1'");
	
	Возврат МодульОбъекта().ПараметрыВСтроку(Текст, ПричинаОшибки);
	
КонецФункции

&НаСервере
Функция ТекстДоступноОбновление()
	
	Если КонтекстОбновления.ТребуетсяОбновлениеДанных Тогда
		
		Результат = ТекстТребуетсяОбновлениеДанных();
		
	Иначе
		
		Если КонтекстОбновления.ВыполняетсяОткрытиеМодуля Тогда
			Результат = ТекстОбнаруженаНоваяВерсия();
		Иначе
			Результат = ТекстНоваяВерсияГотоваКУстановке();
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ТекстТребуетсяОбновлениеДанных()
	
	Текст = НСтр("ru = 'Новая версия модуля %1 готова к установке
	|После обновления модуля будет выполнен переход на новую версию данных'");
	
	Возврат МодульОбъекта().ПараметрыВСтроку(Текст, КонтекстОбновления.НоваяВерсияМодуля);
	
КонецФункции

&НаСервере
Функция ТекстОбнаруженаНоваяВерсия()
	
	Текст = НСтр("ru = 'Доступно обновление до версии %1'");
	
	Возврат МодульОбъекта().ПараметрыВСтроку(Текст, КонтекстОбновления.НоваяВерсияМодуля);
	
КонецФункции

&НаСервере
Функция ТекстНоваяВерсияГотоваКУстановке()
	
	Текст = НСтр("ru = 'Новая версия модуля %1 готова к установке'");
	
	Возврат МодульОбъекта().ПараметрыВСтроку(Текст, КонтекстОбновления.НоваяВерсияМодуля);
	
КонецФункции

&НаСервере
Функция ТекстУстановленаАктуальнаяВерсия()
	
	Текст = НСтр("ru = 'Установлена актуальная версия модуля %1
	|Последняя версия поддерживает актуальные требования законодательства и новые возможности сервиса.'");
	
	Возврат МодульОбъекта().ПараметрыВСтроку(Текст, КонтекстОбновления.ТекущаяВерсияМодуля);
	
КонецФункции

&НаСервере
Функция ТекстТребуетсяОбновлениеПодсистмеы()
	
	Возврат НСтр("ru = 'Требуется обновление подсистемы'");
	
КонецФункции

&НаСервере
Функция ТекстОшибкаДоступаКФайлу(ПутьКФайлу)
	
	Текст = НСтр("ru = 'Не удалось получить доступ к файлу Модуля
	|""%1""'");
	
	Возврат МодульОбъекта().ПараметрыВСтроку(Текст, ПутьКФайлу);
	
КонецФункции

&НаСервере
Функция ТекстМодульДоработан()
	
	Текст = НСтр("ru = 'Модуль доработан.
	|%1'");
	
	Возврат МодульОбъекта().ПараметрыВСтроку(Текст, ТекстОбратитесьВКлиентскуюПоддержку());
	
КонецФункции

&НаСервере
Функция ТекстМодульВСоставеКонфигурации()
	
	Текст = НСтр("ru = 'Модуль находится в составе конфигурации.
	|%1'");
	
	Возврат МодульОбъекта().ПараметрыВСтроку(Текст, ТекстОбратитесьВКлиентскуюПоддержку());
	
КонецФункции

&НаСервере
Функция ТекстОбратитесьВКлиентскуюПоддержку()
	
	Результат = НСтр("ru = 'Обратитесь в клиентскую поддержку.'");
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ТекстИнструкцияПоОбновлениюДля82()
	
	Результат = НСтр("ru = 'Для обновления подсистемы, обратитесь в клиентскую поддержку или скачайте и установите файл обновления самостоятельно.'");
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти





