//	Copyright (C) 2012-2025 Engineer Mareev Enterprises
//	Модуль для УТ 10.3 Экспортирует сообщения ASN из документа Корректировка реализации
//	Экспортирует ORDERS c характеристиками или сериями товара. 

//	$Возврат товаров от покупателя по корректировке реализации
//  Экспорт сообщений ASN:
//	 - В 1С оператор (руч.) оформляет документ "Корректировка реализации", который при проведении (авт.) помечается к Экспорту.
//	 - 1С (авт.) экспортирует сообщение ASN.

#Область ПрограммныйИнтерфейс

//	Функция ПолучитьИмяСообщения возвращает имя сообщения
Функция ПолучитьИмяСообщения() Экспорт
	Возврат "asn";
КонецФункции

//	Функция ПолучитьМетаданные возвращает метаданные сообщения
Функция ПолучитьМетаданные() Экспорт
	Возврат Метаданные.Документы.КорректировкаРеализации;
КонецФункции

// Процедура экспортирует один документ "Корректировка поступления"
Процедура Экспортировать(ERPData, КорректировкаРеализации) Экспорт
	
	АктуализироватьУИДыСтрок(КорректировкаРеализации.Ссылка);   
	
	//	Проверим строки документа к экспорту
	Если Не ЕстьСтрокиКЭкспорту(КорректировкаРеализации) Тогда
		Возврат;
	КонецЕсли;
	
	//	Заголовок заказа
	EmeWmsERPEngine.AppendHeaderLine(ERPData);

	ERPData.header.asn_id       = КорректировкаРеализации.УникальныйИдентификатор();

	Если Константы.EmeWmsСоздаватьУникальныеСообщения.Получить() Тогда
		ERPData.header.id	  	= Новый УникальныйИдентификатор;
	Иначе
		ERPData.header.id	  	= ERPData.header.asn_id;		
	КонецЕсли;

	ERPData.header.asn_reg_no	  =	СокрЛП(КорректировкаРеализации.Номер)+"/"+Формат(Год(КорректировкаРеализации.Дата),"ЧГ=4");
	ERPData.header.asn_date	  	  =	КорректировкаРеализации.Дата;
	ERPData.header.erp_doc_type	  = ПолучитьМетаданные().Имя;
	ERPData.header.is_return = 1;
	
	Контрагент = КорректировкаРеализации.Контрагент; 
	
	ERPData.header.supplier_id    =	Контрагент.УникальныйИдентификатор();
	ERPData.header.supplier_code  =	СокрЛП(Контрагент.Код);
	ERPData.header.supplier_name  =	Контрагент.Наименование;
	
	EmeWmsЭкспортКонтрагентов.РазрешитьЭкспорт(Контрагент);
		
	ERPData.header.whs_to_code 	  =	EmeWmsУтилиты.ПолучитьКодСкладаEMEПоСсылке(КорректировкаРеализации.Склад);  // Код склада EME
	ERPData.header.vendor_to_code =	EmeWmsУтилиты.ПолучитьКодОрганизацииEMEПоСсылке(КорректировкаРеализации.Организация);
	ERPData.header.comment        =	Лев(КорректировкаРеализации.Комментарий, 128);
																				  
	//	Экспорт контрагента
	EmeWmsЭкспортКонтрагентов.РазрешитьЭкспорт(КорректировкаРеализации.Контрагент);
	
	//	Использование серий в интеграции
	ИспользоватьСерии = Константы.EmeWmsИспользоватьСерии.Получить();	
	
	//	Строки заказа
	EmeWmsERPEngine.SelectChild(ERPData, "lines");
	Для Каждого СтрокаТовара Из КорректировкаРеализации.Товары Цикл
		//	Не выгружать строку в WMS
		Если СтрокаТовара.EmeWmsНеВыгружать Тогда
			Продолжить;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(СтрокаТовара.Номенклатура)
			ИЛИ Не ЗначениеЗаполнено(СтрокаТовара.ЕдиницаИзмерения) Тогда
			
			Продолжить;
		КонецЕсли;  
		
		// Количество возвращаемого товара
		КоличествоТовара = СтрокаТовара.КоличествоДоИзменения - СтрокаТовара.Количество;
		Если КоличествоТовара <= 0.0 Тогда
			Продолжить;
		КонецЕсли;
		
		РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТовара.Номенклатура, "БазоваяЕдиницаИзмерения, Код, 
																			|ВестиУчетПоСериям, ВестиУчетПоХарактеристикам");
		
		Если Не ЗначениеЗаполнено(РеквизитыНоменклатуры.БазоваяЕдиницаИзмерения) Тогда
			Продолжить;
		КонецЕсли;  
		
		EmeWmsERPEngine.AppendChildLine(ERPData);

		ERPData.lines.id			= СтрокаТовара.EmeWmsУИДСтроки;
		ERPData.lines.asn_line_no	= СтрокаТовара.НомерСтроки;
		ERPData.lines.goods_id		= СтрокаТовара.Номенклатура.УникальныйИдентификатор();
		ERPData.lines.goods_code	= СокрЛП(РеквизитыНоменклатуры.Код);
		ERPData.lines.quantity		= EmeWmsУтилиты.ПересчетВДругуюЕдиницу(КоличествоТовара, 
															 			   СтрокаТовара.ЕдиницаИзмерения,
															 			   РеквизитыНоменклатуры.БазоваяЕдиницаИзмерения);
																		   
		Если ЗначениеЗаполнено(РеквизитыНоменклатуры.БазоваяЕдиницаИзмерения) Тогда
			ERPData.lines.mu_code = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыНоменклатуры.БазоваяЕдиницаИзмерения, "Код"); 
		КонецЕсли;															   
		
		// Серии или серийные номера
		Если Не ИспользоватьСерии Тогда
			РеквизитыНоменклатуры.ВестиУчетПоСериям = Ложь;
		КонецЕсли;
		
		Если РеквизитыНоменклатуры.ВестиУчетПоСериям Тогда // Серии
			Если НЕ СтрокаТовара.СерияНоменклатуры.Пустая() Тогда  
				РеквизитыСерии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТовара.СерияНоменклатуры, "Наименование,СрокГодности");
				
				// Когда Серия - это партия, укажем Серию из документа
				Если ЗначениеЗаполнено(РеквизитыСерии.Наименование) Тогда   
					ERPData.lines.lot_no = РеквизитыСерии.Наименование;             
					ERPData.lines.bbd	 = РеквизитыСерии.СрокГодности;  
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли РеквизитыНоменклатуры.ВестиУчетПоХарактеристикам Тогда // Характеристики
			Если НЕ СтрокаТовара.ХарактеристикаНоменклатуры.Пустая() Тогда
				ERPData.lines.lot_no 	 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовара.ХарактеристикаНоменклатуры, "Наименование");
			КонецЕсли;
		КонецЕсли;

		//#COA Чепиков 27.05.2025 в строках ASN необходимо передавать клиента под которого пришла поставка
		Если ЗначениеЗаполнено(СтрокаТовара.ЗаказПокупателя) И ТипЗнч(СтрокаТовара.ЗаказПокупателя) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			Для каждого СтрокаЗаказа Из СтрокаТовара.ЗаказПокупателя.Товары Цикл
				Если СтрокаЗаказа.Номенклатура = СтрокаТовара.Номенклатура
					И СтрокаЗаказа.Цена = СтрокаТОвара.ЦенаДоИзменения Тогда
					
					Если ЗначениеЗаполнено(СтрокаЗаказа.Поставщик) Тогда
						Поставщик = СтрокаЗаказа.Поставщик;
						ERPData.lines.customer_id = Поставщик.УникальныйИдентификатор();
						
						Если Не EmeWmsЭкспортКонтрагентов.Экспортирован(Поставщик) Тогда
							EmeWmsЭкспортКонтрагентов.ПометитьКЭкспорту(Поставщик);
						КонецЕсли;
						
						Прервать;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;			
		КонецЕсли;
		
		Если СтрокаТовара.Номенклатура.ПометкаУдаления Тогда
			EmeWmsЭкспортНоменклатуры.ПометитьКЭкспортуБезусловно(СтрокаТовара.Номенклатура);
		ИначеЕсли НЕ EmeWmsЭкспортНоменклатуры.Экспортирован(СтрокаТовара.Номенклатура) Тогда
			EmeWmsЭкспортНоменклатуры.РазрешитьЭкспортСГруппами(СтрокаТовара.Номенклатура);
		КонецЕсли;
	КонецЦикла;		

КонецПроцедуры

#КонецОбласти

#Область ЭкспортныеСлужебныеПроцедурыИФункции

//	Процедура ОтменитьЭкспорт отменяет экспорт документа
Процедура ОтменитьЭкспорт(Документ) Экспорт

	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуКорректировокРеализаций.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.КорректировкаРеализации.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Ложь;
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
КонецПроцедуры

//	Функция ПолучитьВыборкуСсылок возвращает выборку ссылок документов для экспорта
Функция ПолучитьВыборкуСсылок() Экспорт
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	EmeWmsПометкиКЭкспортуКорректировокРеализаций.КорректировкаРеализации КАК Ссылка
		|ИЗ
		|	РегистрСведений.EmeWmsПометкиКЭкспортуКорректировокРеализаций КАК EmeWmsПометкиКЭкспортуКорректировокРеализаций
		|ГДЕ
		|	EmeWmsПометкиКЭкспортуКорректировокРеализаций.КЭкспорту";
		
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции

//	Процедура ПометитьКЭкспорту помечает документ к экспорту.
Процедура ПометитьКЭкспорту(Документ) Экспорт

	Если Не РазрешенКЭкспорту(Документ) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуКорректировокРеализаций.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.КорректировкаРеализации.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Истина;
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsПометкиКЭкспортуКорректировокРеализаций.СоздатьМенеджерЗаписи();
	НоваяЗапись.КорректировкаРеализации = Документ.Ссылка;
	НоваяЗапись.КЭкспорту = Истина;
    НоваяЗапись.Записать();  
	
КонецПроцедуры

//	Функция ПомеченКЭкспорту возвращает Истина, если документ помечен к экспорту.
Функция ПомеченКЭкспорту(Документ) Экспорт
	
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуКорректировокРеализаций.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.КорректировкаРеализации.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Возврат Запись.КЭкспорту;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

//	Процедура ПодтвердитьЭкспорт подтверждает экспорт документа
Процедура ПодтвердитьЭкспорт(Документ) Экспорт
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуКорректировокРеализаций.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.КорректировкаРеализации.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Ложь;
		Запись.ДатаЭкспорта = ТекущаяДата();
		НаборЗаписей.Записать();
	КонецЦикла;
КонецПроцедуры

//	Процедура ПометитьКЭкспорту помечает документ на событии при записи
Процедура ПометитьКЭкспортуПриЗаписиКорректировокРеализаций(Источник, Отказ) Экспорт
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//	Помечать, если включен режим пометок к экспорту
	Если Константы.EmeWmsПометкаВключена.Получить() Тогда
		ПометитьКЭкспорту(Источник);
	КонецЕсли;		 
КонецПроцедуры

//	Функция РазрешенКЭкспорту возвращает Истина, если документ РТУ разрешен к экспорту.
Функция РазрешенКЭкспорту(Документ) Экспорт

	ДатаЗапускаИнтеграции = Константы.EmeWmsДатаЗапускаИнтеграции.Получить();
	Если ЗначениеЗаполнено(ДатаЗапускаИнтеграции)
			И Документ.Дата < ДатаЗапускаИнтеграции Тогда
		ОтменитьЭкспорт(Документ);
		Возврат Ложь;
	КонецЕсли;	

	Если Документ.ПометкаУдаления Тогда
		ОтменитьЭкспорт(Документ);
		Возврат Ложь;
	КонецЕсли;

	Если Не Документ.Проведен Тогда
		ОтменитьЭкспорт(Документ);
		Возврат Ложь;
	КонецЕсли; 

	// Экспорт только когда склада-отправитель из EME.WMS (это может быть и группа складов)
	Если EmeWmsУтилиты.ПолучитьКодСкладаEMEПоСсылке(Документ.Склад, Документ.Организация) = неопределено Тогда 
		ОтменитьЭкспорт(Документ);
		Возврат Ложь;
	КонецЕсли;

	// Экспортируются только корректировки по заказу поставщику
	//Если Не ЗначениеЗаполнено(Документ.ДокументПоступления) Тогда
	//	ОтменитьЭкспорт(Документ);
	//	Возврат ложь;
	//КонецЕсли;

	// Чтобы не было повторного экспорта despatch
	Если ДокументКорректировкаРеализацииИмпортирован(Документ.Ссылка) Тогда
		// Это нужно, чтобы после импорта не пытались экспортироваться от события ПриЗаписи
		ОтменитьЭкспорт(Документ.Ссылка); 
		Возврат ложь;
	КонецЕсли;

	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область ЛокальныеСлужебныеПроцедурыИФункции

//	Проверяет есть ли строки к экспорту
Функция ЕстьСтрокиКЭкспорту(КорректировкаРеализации)

	Для Каждого СтрокаТовара Из КорректировкаРеализации.Товары Цикл
		//	Не выгружать строку в WMS
		Если СтрокаТовара.EmeWmsНеВыгружать Тогда
			Продолжить;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(СтрокаТовара.Номенклатура)
			ИЛИ Не ЗначениеЗаполнено(СтрокаТовара.ЕдиницаИзмерения) Тогда
			
			Продолжить;
		КонецЕсли;  
		
		// Количество возвращаемого товара
		КоличествоТовара = СтрокаТовара.КоличествоДоИзменения - СтрокаТовара.Количество;
		Если КоличествоТовара <= 0.0 Тогда
			Продолжить;
		КонецЕсли;
		
		РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТовара.Номенклатура, "БазоваяЕдиницаИзмерения, Код, 
																			|ВестиУчетПоСериям, ВестиУчетПоХарактеристикам");
		
		Если Не ЗначениеЗаполнено(РеквизитыНоменклатуры.БазоваяЕдиницаИзмерения) Тогда
			Продолжить;
		КонецЕсли; 
		
		Возврат Истина;  
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

//	Создать новые УИДы строк и исправить дубли, если возникли (В ТЧ Товары по распоряжениям)
Процедура АктуализироватьУИДыСтрок(ДокументСсылка)  
	
	//	Проверим наличие строк к заполнению реквизита EmeWmsУИДСтроки, прежде чем получать Объект
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИСТИНА КАК ИзменятьEmeWmsУИДСтроки
		|ИЗ
		|	Документ.КорректировкаРеализации.Товары КАК ТЧТовары
		|ГДЕ
		|	ТЧТовары.Ссылка = &Ссылка
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(ТЧТовары.EmeWmsУИДСтроки) 
		|	<> КОЛИЧЕСТВО(РАЗЛИЧНЫЕ 
		|		ВЫБОР
		|			КОГДА ТЧТовары.EmeWmsУИДСтроки > """"
		|				ТОГДА ТЧТовары.EmeWmsУИДСтроки
		|			ИНАЧЕ NULL
		|		КОНЕЦ)";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	// Для исключения дублей УИД в строках ТЧ
	КлючиСтрок 					= Новый Соответствие;
	БылиСозданыИдентификаторы 	= Ложь;

	Документ = ДокументСсылка.ПолучитьОбъект();
	Для Каждого СтрокаТовара Из Документ.Товары Цикл 
		// Генерация специальных UID строк документа при выгрузке
		Если НЕ ЗначениеЗаполнено(СтрокаТовара.EmeWmsУИДСтроки) ИЛИ КлючиСтрок.Получить(СтрокаТовара.EmeWmsУИДСтроки) <> Неопределено Тогда
			СтрокаТовара.EmeWmsУИДСтроки = Новый УникальныйИдентификатор();
			БылиСозданыИдентификаторы 	 = Истина;
		КонецЕсли;
		КлючиСтрок.Вставить(СтрокаТовара.EmeWmsУИДСтроки, 0);
	КонецЦикла;	
	
	Если БылиСозданыИдентификаторы Тогда
		// При записи не перепроводить, не регистрировать по подписке к Эксопрту
		Документ.ОбменДанными.Загрузка = Истина;
		Документ.Записать();
	КонецЕсли;
	
КонецПроцедуры

// Проверяет, был ли этот документ импортирован (по сообщению despatch), в этом случае возвращает истина
Функция ДокументКорректировкаРеализацииИмпортирован(ДокументСсылка)
	Перем НаборЗаписей;
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеКорректировокРеализаций.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(ДокументСсылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Возврат истина;
	КонецЦикла;
	
	возврат ложь; 
КонецФункции

#КонецОбласти

