
// #Область СлужебныеПеременныеИМетодыФормы

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		Результат = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		Результат = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

// #КонецОбласти

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьКонтекст();
	УстановитьЗаголовок();
	ЗаполнитьСпискиВыбора();
	НастроитьЭлементыФормы();
	УстановитьПредставлениеСсылкиВидовПродукции(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	МодульКлиента().СохранитьИзмененияНаФорме("ЗаписатьИЗакрыть", ЭтаФорма, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Очистить();
	
	ПроверяемыеРеквизиты.Добавить("Организация");
	ПроверяемыеРеквизиты.Добавить("ПервыйВидПродукции");
	ПроверяемыеРеквизиты.Добавить("Наименование");
	
	Если СодержитВидПродукции(Перечисления.КонтурМаркировка_ВидыПродукции.Пиво) Тогда
		
		Если МодульОбъекта().ЭтоИП(Организация.ИНН) Тогда
			ПроверяемыеРеквизиты.Добавить("ИдентификаторФИАС");
		Иначе
			ПроверяемыеРеквизиты.Добавить("КПП");
		КонецЕсли;
		
	КонецЕсли;
	
	Если СодержитВидПродукции(Перечисления.КонтурМаркировка_ВидыПродукции.БезалкогольныеНапитки) Тогда
		
		ПроверяемыеРеквизиты.Добавить("ИдентификаторФИАС");
		
		Если Не МодульОбъекта().ЭтоИП(Организация.ИНН) Тогда
			ПроверяемыеРеквизиты.Добавить("КПП");
		КонецЕсли;
		
	КонецЕсли;
	
	Если СодержитВидПродукции(Перечисления.КонтурМаркировка_ВидыПродукции.Бады) Тогда
		
		ПроверяемыеРеквизиты.Добавить("ИдентификаторВЕТИС");
		
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	Если Не МодульКлиента().ПроверитьУстановленнуюВерсиюМодуля() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьЗаполнениеПолей() Тогда
		Возврат;
	КонецЕсли;
	
	Записать();
	
	ПровестиОпросПользователяИЗакрыть();
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПервыйВидПродукцииПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ВидыПродукции) Тогда
		Стр = ВидыПродукции[0];
	Иначе
		Стр = ВидыПродукции.Добавить();
	КонецЕсли;
	
	Стр.ВидПродукции = ПервыйВидПродукции;
	
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВидовПродукцийНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Обработчик = МодульКлиента().ОписаниеОбработчикаОповещения("СписокВидовПродукцийПослеПометки", ЭтаФорма);
	
	КонтекстФормы = МодульКлиента().Новый_ПараметрыФормыРедактированияСписка();
	
	КонтекстФормы.РазрешитьРедактирование = Истина;
	КонтекстФормы.Заголовок               = НСтр("ru = 'Виды продукции'");
	КонтекстФормы.Список                  = СписокВидовПродукции();
	КонтекстФормы.ИспользоватьПометки     = Истина;
	
	МодульКлиента().ОткрытьФормуПросмотраСписка(ЭтаФорма, КонтекстФормы, Обработчик);
	
КонецПроцедуры

// #КонецОбласти

// #Область ОпросыПользователей

&НаКлиенте
Процедура ПровестиОпросПользователяИЗакрыть()
	
	КлючиСценариев = МодульКлиента().Перечисление_КлючиСценариевДляОпросов();
	ОписаниеОпроса = МодульКлиента().ОпросПользователяПоСценарию(КлючиСценариев.Площадки);
	
	Если ЗначениеЗаполнено(ОписаниеОпроса) Тогда
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПослеОпросаПользователя", ЭтаФорма);
		МодульКлиента().ОткрытьФормуОпросаПользователя(ОписаниеОпроса, ЭтаФорма, ОписаниеОбработчика);
		Возврат;
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОпросаПользователя(РезультатВыбора, ДопПараметры = Неопределено) Экспорт
	
	Закрыть();
	
КонецПроцедуры

// #КонецОбласти

// #Область ПроверкаЗаполнения

&НаКлиенте
Функция ПроверитьЗаполнениеПолей()
	
	ОчиститьСообщения();
	
	Возврат ПроверитьЗаполнениеПолейНаСервере();
	
КонецФункции

&НаСервере
Функция ПроверитьЗаполнениеПолейНаСервере()
	
	ЕстьОшибки = Не ПроверитьЗаполнение();
	
	ПроверитьНаДубликаты(ЕстьОшибки);
	
	Возврат Не ЕстьОшибки;
	
КонецФункции

&НаСервере
Процедура ПроверитьНаДубликаты(ЕстьОшибки)
	
	ДубликатПоФИАС = ДубликатПоФИАС();
	ДубликатПоВЕТИС = ДубликатПоВЕТИС();
	
	Если ЗначениеЗаполнено(ДубликатПоФИАС) Тогда
		Если ЗначениеЗаполнено(КПП) Тогда
			ШаблонОшибки = НСтр("ru = 'Идентификатор ФИАС %1 и КПП %2 уже указаны в карточке: %3'");
			ТекстОшибки = МодульОбъекта().ПараметрыВСтроку(ШаблонОшибки, ИдентификаторФИАС, КПП, ДубликатПоФИАС);
		Иначе
			ШаблонОшибки = НСтр("ru = 'Идентификатор ФИАС %1 уже указан в карточке: %2'");
			ТекстОшибки = МодульОбъекта().ПараметрыВСтроку(ШаблонОшибки, ИдентификаторФИАС, ДубликатПоФИАС);
		КонецЕсли;
		МодульОбъекта().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор, "ИдентификаторФИАС");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДубликатПоВЕТИС) Тогда
		ШаблонОшибки = НСтр("ru = 'Идентификатор ВЕТИС %1 уже указан в карточке: %2'");
		ТекстОшибки = МодульОбъекта().ПараметрыВСтроку(ШаблонОшибки, ИдентификаторВЕТИС, ДубликатПоВЕТИС);
		МодульОбъекта().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор, "ИдентификаторВЕТИС");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ОписаниеПлощадкиПоКонтексту()
	
	Результат = МодульОбъекта().Новый_Площадка();
	ЗаполнитьЗначенияСвойств(Результат, ЭтаФорма, , "КодГИСМТ, ВидыПродукции");
	
	Если ЗначениеЗаполнено(КодГИСМТ) Тогда
		Результат.КодГИСМТ = Число(КодГИСМТ);
	КонецЕсли;
	
	Для каждого Стр Из ВидыПродукции Цикл
		Результат.ВидыПродукции.Добавить(Стр.ВидПродукции);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Записать()
	
	ЗаписатьНаСервере();
	
	Оповестить("КонтурМаркировка_Площадка_Изменен", Ссылка);
	
	ОповеститьОбИзменении(Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	ОписаниеМОД = ОписаниеПлощадкиПоКонтексту();
	
	МодульОбъекта().Площадка_Записать(ОписаниеМОД);
	
	Ссылка = ОписаниеМОД.Ссылка;
	ВерсияДанных = ОписаниеМОД.ВерсияДанных;
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтекст()
	
	Параметры.Свойство("Ссылка", Ссылка);
	Параметры.Свойство("СсылкаДляКопирования", СсылкаДляКопирования);
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		ОписаниеМОД = МодульОбъекта().Площадка_Прочитать(Ссылка);
	ИначеЕсли ЗначениеЗаполнено(СсылкаДляКопирования) Тогда
		ОписаниеМОД = МодульОбъекта().Площадка_Прочитать(СсылкаДляКопирования);
		ОписаниеМОД.КодГИСМТ = "";
		ОписаниеМОД.КПП = "";
		ОписаниеМОД.ИдентификаторФИАС = "";
		ОписаниеМОД.ИдентификаторВЕТИС = "";
	Иначе
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ОписаниеМОД, , "Ссылка, КодГИСМТ, ВидыПродукции");
	
	ЭтаФорма.КодГИСМТ = Формат(ОписаниеМОД.КодГИСМТ, "ЧГ=0");
	
	ВидыПродукции.Очистить();
	Для Каждого ВидПродукции Из ОписаниеМОД.ВидыПродукции Цикл
		Стр = ВидыПродукции.Добавить();
		Стр.ВидПродукции = ВидПродукции;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ВидыПродукции) Тогда
		ПервыйВидПродукции = ВидыПродукции[0].ВидПродукции;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовок()
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		
		СтрокаЗаголовка = СокрЛП(Ссылка);
		
	ИначеЕсли ЗначениеЗаполнено(СсылкаДляКопирования) Тогда
		
		СтрокаЗаголовка = НСтр("ru = 'Копирование'");
		
	Иначе
		
		СтрокаЗаголовка = НСтр("ru = 'Создание'");
		
	КонецЕсли;
	
	Заголовок = МодульОбъекта().ПараметрыВСтроку(НСтр(
	"ru = 'Площадка: %1'"), СтрокаЗаголовка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбора()
	
	СписокВыбора = Элементы.КодСтраны.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().СписокСтранМира();
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, МодульОбъекта().СписокСтранМира());
	
	СписокВыбора = Элементы.ПервыйВидПродукции.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().ДопустимыеВидыПродукцииДляПлощадок();
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы()
	
	Элементы.КодСтраны.Видимость = Ложь;
	Элементы.ИдентификаторВЕТИС.Видимость = Ложь;
	Элементы.ПервыйВидПродукции.Видимость = Ложь;
	
	Если СодержитВидПродукции(Перечисления.КонтурМаркировка_ВидыПродукции.Бады) Тогда
		Элементы.ИдентификаторВЕТИС.Видимость = Истина;
	КонецЕсли;
	
	Если ТипПлощадки = Перечисления.КонтурМаркировка_ТипыПлощадок.МОД Тогда
		Элементы.КодСтраны.Видимость = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КодГИСМТ) Тогда
		ЗапретитьРедактированиеКромеНаименования();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗапретитьРедактированиеКромеНаименования()
	
	СтруктураТолькоПросмотр = Новый Структура("ТолькоПросмотр", Истина);
	
	Для каждого Элемент Из Элементы Цикл
		ЗаполнитьЗначенияСвойств(Элемент, СтруктураТолькоПросмотр);
	КонецЦикла;
	
	Элементы.Наименование.ТолькоПросмотр = Ложь;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПредставлениеСсылкиВидовПродукции(Форма)
	
	КоличествоВидовПродукции = Форма.ВидыПродукции.Количество();
	
	Если Не ЗначениеЗаполнено(Форма.ВидыПродукции) Тогда
		Форма.СписокВидовПродукций = НСтр("ru = 'Выбрать'");
		Возврат;
	КонецЕсли;
	
	Представление = "";
	МаксимальнаяДлина = 60;
	ДлинаПредставления = 0;
	КоличествоДобавлено = 0;
	
	ОкончаниеСтроки = НСтр("ru = ' ( + еще %1 )'");
	Разделитель = "";
	
	Для Каждого Стр Из Форма.ВидыПродукции Цикл
		
		ТекПредставление = Разделитель + Строка(Стр.ВидПродукции);
		ДлинаПредставления = ДлинаПредставления + СтрДлина(ТекПредставление);
		Разделитель = ", ";
		
		ЭтоПерваяСтрока = (КоличествоДобавлено = 0);
		ЭтоПоследняяСтрока = (КоличествоДобавлено + 1 = КоличествоВидовПродукции);
		
		Если ЭтоПоследняяСтрока Тогда
			МаксимальнаяДлина = МаксимальнаяДлина + СтрДлина(ОкончаниеСтроки);
		КонецЕсли;
		
		Если ДлинаПредставления > МаксимальнаяДлина И Не ЭтоПерваяСтрока Тогда
			КоличествоЕще = КоличествоВидовПродукции - КоличествоДобавлено;
			Представление = Представление + СтрЗаменить(ОкончаниеСтроки, "%1", КоличествоЕще);
			Прервать;
		КонецЕсли;
		
		Представление = Представление + ТекПредставление;
		КоличествоДобавлено = КоличествоДобавлено + 1;
		
	КонецЦикла;
	
	Форма.СписокВидовПродукций = Представление;
	
КонецПроцедуры

&НаСервере
Функция СписокВидовПродукции()
	
	Результат = Новый СписокЗначений;
	
	Для Каждого ВидПродукции Из МодульОбъекта().ДопустимыеВидыПродукцииДляПлощадок() Цикл
		Отбор = Новый Структура("ВидПродукции", ВидПродукции);
		Пометка = ЗначениеЗаполнено(ВидыПродукции.НайтиСтроки(Отбор));
		Результат.Добавить(ВидПродукции, , Пометка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция СодержитВидПродукции(ВидПродукции)
	
	МассивСтрок = ВидыПродукции.НайтиСтроки(Новый Структура("ВидПродукции", ВидПродукции));
	
	Возврат ЗначениеЗаполнено(МассивСтрок);
	
КонецФункции

&НаСервере
Функция ДубликатПоФИАС()
	
	Если Не ЗначениеЗаполнено(ИдентификаторФИАС) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Т.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурМаркировка_Площадки КАК Т
	|ГДЕ
	|	Т.Ссылка <> &Ссылка
	|	И Т.КПП = &КПП
	|	И Т.ИдентификаторФИАС = &ИдентификаторФИАС");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("КПП", КПП);
	Запрос.УстановитьПараметр("ИдентификаторФИАС", ИдентификаторФИАС);
	
	Результат = МодульОбъекта().ПолучитьРезультатЗапроса(Запрос);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДубликатПоВЕТИС()
	
	Если Не ЗначениеЗаполнено(ИдентификаторВЕТИС) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Т.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурМаркировка_Площадки КАК Т
	|ГДЕ
	|	Т.Ссылка <> &Ссылка
	|	И Т.ИдентификаторВЕТИС = &ИдентификаторВЕТИС");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ИдентификаторВЕТИС", ИдентификаторВЕТИС);
	
	Результат = МодульОбъекта().ПолучитьРезультатЗапроса(Запрос);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СписокВидовПродукцийПослеПометки(СписокЭлементов, ДопПараметры = Неопределено) Экспорт
	
	Если СписокЭлементов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.СписокВидовПродукций.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	ВидыПродукции.Очистить();
	Для каждого Элемент Из СписокЭлементов Цикл
		Если Элемент.Пометка Тогда
			Стр = ВидыПродукции.Добавить();
			Стр.ВидПродукции = Элемент.Значение;
		КонецЕсли;
	КонецЦикла;
	
	УстановитьПредставлениеСсылкиВидовПродукции(ЭтаФорма);
	
	Если ЗначениеЗаполнено(ВидыПродукции) Тогда
		ПервыйВидПродукции = ВидыПродукции[0].ВидПродукции;
	КонецЕсли;
	
	НастроитьЭлементыФормы();
	
КонецПроцедуры

// #КонецОбласти
