
&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		Результат = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		Результат = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

//#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьКонтекстФормы();
	УстановитьОграниченияТиповПолей();
	УстановитьВидимостьПоляХарактеристика();
	УстановитьВидимостьПоляУпаковка();
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьНадписьТекстПересчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	МодульКлиента().СохранитьИзмененияНаФорме("ЗаписатьИЗакрыть", ЭтаФорма, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Добавить("Номенклатура");
	ПроверяемыеРеквизиты.Добавить("Знаменатель");
	ПроверяемыеРеквизиты.Добавить("Числитель");
	
КонецПроцедуры

//#КонецОбласти // ОбработчикиСобытийФормы

//#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УпаковкаПриИзменении(Элемент)
	
	ОбновитьНадписьТекстПересчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьНаСервере();
	
	ОповеститьОВыборе(КлючНоменклатуры1С);
	
КонецПроцедуры

//#КонецОбласти // ОбработчикиСобытийЭлементовШапкиФормы

//#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьКонтекстФормы()
	
	КлючНоменклатуры1С = Параметры.КлючНоменклатуры1С;
	АналитикаНоменклатуры = МодульОбъекта().АналитикаНоменклатуры1С(КлючНоменклатуры1С);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, АналитикаНоменклатуры);
	
	Коэффициент = МодульОбъекта().КоэффициентПересчета_Прочитать(КлючНоменклатуры1С);
	Числитель = Коэффициент.Числитель;
	Знаменатель = Коэффициент.Знаменатель;
	
	ТипыОбъектов = МодульОбъекта().ТипыОбъектовИС();
	ИспользоватьУпаковки = ЗначениеЗаполнено(ТипыОбъектов.Упаковка);
	ИспользоватьХарактеристики = ЗначениеЗаполнено(ТипыОбъектов.Характеристика);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОграниченияТиповПолей()
	
	ТипыОбъектов = МодульОбъекта().ТипыОбъектовИС();
	
	МодульОбъекта().УстановитьОграничениеПоТипу(Элементы.Номенклатура, ТипыОбъектов.Номенклатура);
	
	Если ЗначениеЗаполнено(ТипыОбъектов.Характеристика) Тогда
		МодульОбъекта().УстановитьОграничениеПоТипу(Элементы.Характеристика, ТипыОбъектов.Характеристика);
		МодульОбъекта().УстановитьСвязьЭлементовПоНоменклатуре(Элементы.Характеристика);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипыОбъектов.Упаковка) Тогда
		МодульОбъекта().УстановитьОграничениеПоТипу(Элементы.Упаковка, ТипыОбъектов.Упаковка);
		МодульОбъекта().УстановитьСвязьЭлементовПоНоменклатуре(Элементы.Упаковка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	НастроитьОтметкуНезаполненногоПоляХарактеристика();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьОтметкуНезаполненногоПоляХарактеристика()
	
	НовыйЭлемент = УсловноеОформление.Элементы.Добавить();
	НовыйЭлемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	
	Отборы = НовыйЭлемент.Отбор.Элементы;
	
	ОтборЭлемента = Отборы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОбязательноеЗаполнениеХарактеристики");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ОтборЭлемента = Отборы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ИспользоватьХарактеристики");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ОтборЭлемента = Отборы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Характеристика");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ПолеЭлемента = НовыйЭлемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("Характеристика");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПоляХарактеристика()
	
	Элементы.Характеристика.Видимость = ИспользоватьХарактеристики;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПоляУпаковка()
	
	Элементы.Упаковка.Видимость = ИспользоватьУпаковки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписьТекстПересчета()
	
	ТекстУпаковки = НСтр("ru = 'ед.'");
	Если ЗначениеЗаполнено(Упаковка) Тогда
		ТекстУпаковки = СокрЛП(Упаковка);
	КонецЕсли;
	
	ТекстПересчета = НСтр("ru = '%1 товара содержит '");
	ТекстПересчета = МодульКлиента().ПараметрыВСтроку(ТекстПересчета, ТекстУпаковки);
	
	Элементы.ТекстПересчета.Заголовок = ТекстПересчета;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	АналитикаНоменклатуры = МодульОбъекта().Новый_АналитикаНоменклатуры1С();
	ЗаполнитьЗначенияСвойств(АналитикаНоменклатуры, ЭтаФорма);
	КлючНоменклатуры1С = МодульОбъекта().КлючНоменклатуры1С_Подобрать(АналитикаНоменклатуры);
	
	НачатьТранзакцию(МодульОбъекта().РежимУправленияБлокировкой());
	
	Попытка
		
		МодульОбъекта().КоэффициентПересчета_Заблокировать(КлючНоменклатуры1С);
		
		Запись = РегистрыСведений.КонтурМаркировка_КоэффициентыПересчета.СоздатьМенеджерЗаписи();
		
		Если Не Параметры.Копирование И ЗначениеЗаполнено(Параметры.КлючНоменклатуры1С) Тогда
			МодульОбъекта().КоэффициентПересчета_Заблокировать(Параметры.КлючНоменклатуры1С);
			Запись.КлючНоменклатуры1С = Параметры.КлючНоменклатуры1С;
			Запись.Прочитать();
		КонецЕсли;
		
		Запись.Числитель = Числитель;
		Запись.Знаменатель = Знаменатель;
		Запись.КлючНоменклатуры1С = КлючНоменклатуры1С;
		
		Запись.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	МодульОбъекта().Метрика_Функциональность_ЗаписьКоэффициентаПересчетаВСписке();
	
	Модифицированность = Ложь;
	
КонецПроцедуры

//#КонецОбласти // СлужебныеПроцедурыИФункции