
// #Область СлужебныйПрограммныйИнтерфейс

// См. ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка()
// 
// Параметры:
//  ИдентификаторСеанса - Строка - идентификатор, с которым связана обработка для повторного использования
// 
// Возвращаемое значение:
//  ОбработкаОбъект, ВнешняяОбработка - объект модуля маркировки;
//
Функция МодульКонтурМаркировка(ИдентификаторСеанса) Экспорт
	
	НаименованиеОбработки = "Контур.Маркировка";
	
	Результат = ОбработкаИзПодключенныхВнешнихОбработок(НаименованиеОбработки);
	Если Результат = Неопределено Тогда
		Результат = ОбработкаИзКонфигурации(НаименованиеОбработки);
	КонецЕсли;
	Если Результат = Неопределено Тогда
		Результат = ОбработкаИзСправочникаДополнительныеОтчетыИОбработки(НаименованиеОбработки);
	КонецЕсли;
	Если Результат = Неопределено Тогда
		Результат = ОбработкаИзСправочникаВнешниеОбработки(НаименованиеОбработки);
	КонецЕсли;
	
	Если Результат = Неопределено Тогда
		ТекстОшибки = НСтр("ru = 'Не удалось найти обработку ""%1""'");
		ТекстОшибки = ОбщегоНазначенияКонтурМаркировка.ПараметрыВСтроку(ТекстОшибки, НаименованиеОбработки);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти // СлужебныйПрограммныйИнтерфейс

// #Область ПодключениеВнешнейОбработки

// Создает объект обработки из конфигурации
//
// Параметры:
//  НаименованиеОбработки - Строка
// 
// Возвращаемое значение:
//  ОбработкаОбъект - объект обработки;
//  Неопределено - если найти подходящюю обработку не удалось;
//
Функция ОбработкаИзКонфигурации(НаименованиеОбработки)
	
	ИмяОбработки = СтрЗаменить(НаименованиеОбработки, ".", "");
	ЕстьОбработка = Метаданные.Обработки.Найти(ИмяОбработки) <> Неопределено;
	Если Не ЕстьОбработка Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = ОбщегоНазначенияКонтурМаркировка.СоздатьОбработкуИзКонфигурации(ИмяОбработки);
	
	Возврат Результат;
	
КонецФункции

// Создает объект обработки по имени, если обработка была уже подключена
//
// Параметры:
//  НаименованиеОбработки - Строка
// 
// Возвращаемое значение:
//  ОбработкаОбъект - объект обработки;
//  Неопределено - если обработку создать не удалось;
//
Функция ОбработкаИзПодключенныхВнешнихОбработок(НаименованиеОбработки)
	
	Попытка
		ИмяОбработки = СтрЗаменить(НаименованиеОбработки, ".", "");
		Результат = ОбщегоНазначенияКонтурМаркировка.СоздатьВнешнююОбработкуПоИмени(ИмяОбработки);
	Исключение
		Ошибка = ИнформацияОбОшибке();
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Создает объект обработки из справочника дополнительных отчетов и обработок
//
// Параметры:
//  НаименованиеОбработки - Строка
// 
// Возвращаемое значение:
//  ОбработкаОбъект - объект обработки;
//  Неопределено - если найти подходящюю обработку не удалось;
//
Функция ОбработкаИзСправочникаДополнительныеОтчетыИОбработки(НаименованиеОбработки)
	
	ИмяСправочника = "ДополнительныеОтчетыИОбработки";
	ЕстьСправочник = Метаданные.Справочники.Найти(ИмяСправочника) <> Неопределено;
	Если Не ЕстьСправочник Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Т.ХранилищеОбработки КАК ХранилищеОбработки
	|ИЗ
	|	Справочник.ДополнительныеОтчетыИОбработки КАК Т
	|ГДЕ
	|	НЕ Т.ЭтоГруппа
	|	И НЕ Т.ПометкаУдаления
	|	И Т.ИмяОбъекта = &ИмяОбработки
	|	И Т.Публикация = ЗНАЧЕНИЕ(Перечисление.ВариантыПубликацииДополнительныхОтчетовИОбработок.Используется)");
	ИмяОбработки = СтрЗаменить(НаименованиеОбработки, ".", "");
	Запрос.УстановитьПараметр("ИмяОбработки", ИмяОбработки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	ДвоичныеДанные = Выборка.ХранилищеОбработки.Получить();
	Если Не ЗначениеЗаполнено(ДвоичныеДанные) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = ОбщегоНазначенияКонтурМаркировка.СоздатьВнешнююОбработкуБезПредупреждений(ДвоичныеДанные);
	
	Возврат Результат;
	
КонецФункции

// Создает объект обработки из справочника внешних обработок
//
// Параметры:
//  НаименованиеОбработки - Строка
// Возвращаемое значение:
//  ОбработкаОбъект - объект обработки;
//  Неопределено - если найти подходящюю обработку не удалось;
//
Функция ОбработкаИзСправочникаВнешниеОбработки(НаименованиеОбработки)
	
	ИмяСправочника = "ВнешниеОбработки";
	ЕстьСправочник = Метаданные.Справочники.Найти(ИмяСправочника) <> Неопределено;
	Если Не ЕстьСправочник Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Т.ХранилищеВнешнейОбработки КАК ХранилищеОбработки
	|ИЗ
	|	Справочник.ВнешниеОбработки КАК Т
	|ГДЕ
	|	НЕ Т.ЭтоГруппа
	|	И НЕ Т.ПометкаУдаления
	|	И Т.Наименование = &НаименованиеОбработки
	|	И Т.ВидОбработки = ЗНАЧЕНИЕ(Перечисление.ВидыДополнительныхВнешнихОбработок.Обработка)");
	Запрос.УстановитьПараметр("НаименованиеОбработки", НаименованиеОбработки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	ДвоичныеДанные = Выборка.ХранилищеОбработки.Получить();
	Если Не ЗначениеЗаполнено(ДвоичныеДанные) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = ОбщегоНазначенияКонтурМаркировка.СоздатьВнешнююОбработкуБезПредупреждений(ДвоичныеДанные);
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти // ПодключениеВнешнейОбработки
