
// #Область СлужебныеПеременныеИМетодыФормы

&НаКлиенте
Перем КэшМодуляКлиента;

&НаКлиенте
Перем РезультатЗапроса;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		Результат = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		Результат = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

// #КонецОбласти

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("КодМаркировки", КодМаркировки);
	Параметры.Свойство("ВидПродукции", ВидПродукции);
	Параметры.Свойство("Владелец", Владелец);
	
	Если ЗначениеЗаполнено(Владелец) Тогда
		Организация = МодульОбъекта().Организация_НайтиПоИНН(Владелец.ИНН);
	Иначе
		Организация = МодульОбъекта().НастройкиМодуля().ОрганизацияПоУмолчанию;
	КонецЕсли;
	
	СписокВыбора = Элементы.ВидПродукции.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().ВсеВидыПродукции();
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьЭлементыФормы();
	
	Если ЗначениеЗаполнено(Организация)
		И ЗначениеЗаполнено(КодМаркировки) Тогда
		ПолучитьСтатусКода(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если МодульКлиента().ЭтоЗавершениеРаботыПрограммы(ЗавершениеРаботы) Тогда
		Возврат; // При завершении работы программы серверный вызов недоступен
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РезультатЗапроса) Тогда
		ПровестиОпросПользователяИЗакрыть(Отказ);
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КодМаркировкиПриИзменении(Элемент)
	
	КлючКода = Неопределено;
	НормализованныйКодМаркировки = "";
	
КонецПроцедуры

&НаКлиенте
Процедура КодМаркировкиОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если КодМаркировки <> Элемент.ТекстРедактирования Тогда
		КодМаркировки = Элемент.ТекстРедактирования;
		КлючКода = Неопределено;
		НормализованныйКодМаркировки = "";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КодМаркировки) Тогда
		Возврат;
	КонецЕсли;
	
	НайтиКлючКода();
	
	Если ЗначениеЗаполнено(КлючКода) Тогда
		МодульКлиента().ОткрытьФормуКодаМаркировки(КлючКода);
	Иначе
		МодульКлиента().ОткрытьФормуКодаМаркировки(КодМаркировки);
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьСтатусКода(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не МодульКлиента().ВыполнитьАвторизацию(Организация, ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	Результат = ПолучитьСтатусКодаНаСервере();
	ТехИнформация = Результат.ТехИнформация;
	РезультатЗапроса = Результат.РезультатЗапроса;
	ЭтоСтатусКода = Истина;
	
	Если ЗначениеЗаполнено(РезультатЗапроса) Тогда
		value = МодульКлиента().СвойствоСтруктуры(РезультатЗапроса[КодМаркировки],"value");
		НормализованныйКодМаркировки = МодульКлиента().СвойствоСтруктуры(value,"cis");
	КонецЕсли;
	
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктураОтветаНажатие(Команда)
	
	МодульКлиента().ОткрытьФормуПросмотраСтруктуры(ЭтаФорма
	, РезультатЗапроса
	, НСтр("ru = 'Тех. информация'"));
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктураСтатусаКодаНажатие(Команда)
	
	НайтиКлючКода();
	
	МодульКлиента().ОткрытьФормуПросмотраСтруктуры(ЭтаФорма
	, ОписаниеСтатусаКода(РезультатЗапроса)
	, НСтр("ru = 'Информация о коде'"));
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НастроитьЭлементыФормы()
	
	Элементы.СтруктураСтатусаКода.Видимость = ЭтоСтатусКода;
	Элементы.СтруктураОтвета.Видимость = ЭтоСтатусКода;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтатусКодаНаСервере()
	
	Возврат МодульОбъекта().Маркировка_ТехИнформацияОСтатусеКода(КодМаркировки, Организация, ВидПродукции);
	
КонецФункции

&НаСервере
Функция ОписаниеСтатусаКода(РезультатЗапроса)
	
	Если Не МодульОбъекта().ЭтоСтруктура(РезультатЗапроса)
		И Не МодульОбъекта().ЭтоСоответствие(РезультатЗапроса) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаКодов = МодульОбъекта().Новый_ТаблицаКодов();
	СтрокаКода = ТаблицаКодов.Добавить();
	СтрокаКода.КлючКода = КлючКода;
	МодульОбъекта().ТаблицаКодов_ПрочитатьВсюИнформацию(ТаблицаКодов);
	МодульОбъекта().СтатусыКодовГИСМТ_ЗаполнитьСтроку(СтрокаКода, РезультатЗапроса[КодМаркировки]);
	
	ЗаполненныеЗначения = Новый СписокЗначений;
	Для каждого Колонка Из ТаблицаКодов.Колонки Цикл
		Имя = Колонка.Имя;
		Значение = СтрокаКода[Имя];
		Если ЗначениеЗаполнено(Значение) И Значение <> Ложь Тогда
			ЗаполненныеЗначения.Добавить(Имя, Значение);
		КонецЕсли;
	КонецЦикла;
	ЗаполненныеЗначения.СортироватьПоЗначению();
	
	Результат = Новый Структура;
	Для Каждого Элемент Из ЗаполненныеЗначения Цикл
		Результат.Вставить(Элемент.Значение, Элемент.Представление);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура НормализоватьКодМаркировки()
	
	Если ЗначениеЗаполнено(Организация)
		И МодульКлиента().ВыполнитьАвторизацию(Организация, ЭтаФорма) Тогда
		НормализоватьКодМаркировкиНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НормализоватьКодМаркировкиНаСервере()
	
	ТаблицаКодов = МодульОбъекта().ТаблицаКодов_ЗагрузитьКодыМаркировки(КодМаркировки);
	Если МодульОбъекта().ТаблицаКодов_НормализоватьКоды(ТаблицаКодов, Организация, Ложь) Тогда
		НормализованныйКодМаркировки = ТаблицаКодов[0].КодМаркировки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиКлючКода()
	
	Если Не ЗначениеЗаполнено(КлючКода) Тогда
		КлючКода = МодульКлиента().КодМаркировки_НайтиКлюч(КодМаркировки);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КлючКода) Тогда
		Если Не ЗначениеЗаполнено(НормализованныйКодМаркировки) Тогда
			НормализоватьКодМаркировки();
		КонецЕсли;
		Если ЗначениеЗаполнено(НормализованныйКодМаркировки) Тогда
			КлючКода = МодульКлиента().КодМаркировки_НайтиКлюч(НормализованныйКодМаркировки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// #Область ОпросыПользователей

&НаКлиенте
Процедура ПровестиОпросПользователяИЗакрыть(Отказ)
	
	КлючиСценариев = МодульКлиента().Перечисление_КлючиСценариевДляОпросов();
	ОписаниеОпроса = МодульКлиента().ОпросПользователяПоСценарию(КлючиСценариев.ИнформацияОКоде);
	
	Если ЗначениеЗаполнено(ОписаниеОпроса) Тогда
		Отказ = Истина;
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПослеОпросаПользователя", ЭтаФорма);
		МодульКлиента().ОткрытьФормуОпросаПользователя(ОписаниеОпроса, ЭтаФорма, ОписаниеОбработчика);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОпросаПользователя(РезультатВыбора, ДопПараметры = Неопределено) Экспорт
	
	Закрыть();
	
КонецПроцедуры

// #КонецОбласти // ОпросыПользователей

// #КонецОбласти // СлужебныеПроцедурыИФункции
