
// Описание переменных

&НаКлиенте
Перем КэшМодуляКлиента;

// Методы получения модулей

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		Результат = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		Результат = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Ссылка = Параметры.Ссылка;
	
	ЗаполнитьКонтекст();
	ЗаполнитьСпискиВыбора();
	НастроитьЭлементыФормы();
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.ДеревоНастройкиКомандДокументаЗначение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	МодульКлиента().СохранитьИзмененияНаФорме("ЗаписатьИЗакрыть", ЭтаФорма, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Очистить();
	ПроверяемыеРеквизиты.Добавить("ТипДокумента");
	ПроверяемыеРеквизиты.Добавить("Наименование");
	
	Если Не ЭтоДополнительныйТипДокумента Тогда
		ПроверяемыеРеквизиты.Добавить("ПолеОрганизация");
		ПроверяемыеРеквизиты.Добавить("ТабличнаяЧасть");
		ПроверяемыеРеквизиты.Добавить("ПолеНоменклатура");
		ПроверяемыеРеквизиты.Добавить("ПолеКоличество");
	КонецЕсли;
	
КонецПроцедуры

// Обработчики событий элементов формы

&НаКлиенте
Процедура ЭтоДополнительныйТипДокументаПриИзменении(Элемент)
	
	ТипДокумента = "КонтурМаркировка_";
	Наименование = "";
	
	ЭтоДополнительныйТипДокументаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЭтоДополнительныйТипДокументаПриИзмененииНаСервере()
	
	ЗаполнитьЗначениямиПоУмолчанию();
	ЗаполнитьСпискиВыбора();
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипДокументаПриИзменении(Элемент)
	
	Если ЭтоДополнительныйТипДокумента Тогда
		ТипДокумента = СтрЗаменить(ТипДокумента, " ", "");
	Иначе
		Наименование = Элементы.ТипДокумента.ТекстРедактирования;
	КонецЕсли;
	
	ТипДокументаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ТипДокументаПриИзмененииНаСервере()
	
	ЗаполнитьЗначениямиПоУмолчанию();
	ЗаполнитьСпискиВыбора();
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьПриИзменении(Элемент)
	
	ТабличнаяЧастьПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ТабличнаяЧастьПриИзмененииНаСервере()
	
	ЗаполнитьСпискиВыбораПолейТабличнойЧасти();
	ЗаполнитьПоУмолчаниюПоляТабличнойЧасти();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВСпискеЕслиТоварыПодлежатМаркировкеПриИзменении(Элемент)
	
	Если ПоказатьВСпискеЕслиТоварыПодлежатМаркировке Тогда
		ПоказатьВСпискеЕслиТоварыЗаполнены = Истина;
	КонецЕсли;
	
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТиповОперацийПриАктивизацииСтроки(Элемент)
	
	ТаблицаРеквизитовОперацийУстановитьОтбор();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРеквизитовОперацийПриАктивизацииЯчейки(Элемент)
	
	Если Элемент.ТекущийЭлемент.Имя = "ТаблицаРеквизитовОперацийЗначение" Тогда
		ТекущиеДанные = Элементы.ТаблицаРеквизитовОпераций.ТекущиеДанные;
		МодульКлиента().НастроитьЭлементЗначенияЗаполненияРеквизита(
		Элемент.ТекущийЭлемент, ТекущиеДанные, Не ЭтоДополнительныйТипДокумента);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРеквизитовОперацийПравилоЗаполненияПриИзменении(Элемент)
	
	ТаблицаРеквизитовОперацийПравилоЗаполненияПриИзмененииНаСервере(Элементы.ТаблицаРеквизитовОпераций.ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Процедура ТаблицаРеквизитовОперацийПравилоЗаполненияПриИзмененииНаСервере(ТекущаяСтрока)
	
	ПравилаЗаполнения = МодульОбъекта().Перечисление_ПравилаЗаполненияРеквизитов();
	
	ТекущиеДанные = ТаблицаРеквизитовОпераций.НайтиПоИдентификатору(ТекущаяСтрока);
	Если ТекущиеДанные.ПравилоЗаполнения = ПравилаЗаполнения.ФиксированноеЗначение Тогда
		ТекущиеДанные.Значение = МодульОбъекта().ПустоеЗначениеТипаЛок(ТекущиеДанные.ТипЗначения);
	Иначе
		ТекущиеДанные.Значение = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРеквизитовОперацийЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаРеквизитовОпераций.ТекущиеДанные;
	ПравилаЗаполнения = МодульКлиента().Перечисление_ПравилаЗаполненияРеквизитов();
	
	Если МодульКлиента().ВыборЗначенияИзСправочника(Элемент, ТекущиеДанные, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ПравилоЗаполнения = ПравилаЗаполнения.РеквизитДокумента1С Тогда
		ЗначенияВыбора = ВсеРеквизитыШапкиДокумента(Истина);
	Иначе
		ЗначенияВыбора = МодульКлиента().ДанныеВыбораЗначенияЗаполненияРеквизита(ТекущиеДанные);
	КонецЕсли;
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
	"ТаблицаРеквизитовОперацийЗначениеПослеВыбора", ЭтаФорма);
	
	Если ЗначениеЗаполнено(ЗначенияВыбора) Тогда
		МодульКлиента().ПоказатьДиалогВыбораИзСписка(ОписаниеОбработчика
		, ЗначенияВыбора
		, Элемент
		, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРеквизитовОперацийЗначениеПослеВыбора(ВыбранноеЗначение, ДопПараметры = Неопределено) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ТаблицаРеквизитовОпераций.ТекущиеДанные.Значение = ВыбранноеЗначение.Значение;
	Элементы.ТаблицаРеквизитовОпераций.ЗакончитьРедактированиеСтроки(Ложь);
	
	Модифицированность = Истина;
	
КонецПроцедуры

// Обработчики команд

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьЗаполнениеРеквизитов() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьНаСервере();
	
	МодульКлиента().СброситьКэш();
	
	Оповестить("КонтурМаркировка_НастройкаДокументаУчета_Изменен", Ссылка);
	
	Закрыть();
	
КонецПроцедуры

// Процедуры заполнения списков выбора

&НаСервере
Процедура ЗаполнитьСпискиВыбора()
	
	ЗаполнитьСписокВыбораТипДокумента();
	ЗаполнитьСписокВыбораТабличнаяЧасть();
	ЗаполнитьСпискиВыбораПолейШапки();
	ЗаполнитьСпискиВыбораПолейТабличнойЧасти();
	ЗаполнитьСписокВыбораПравилоЗаполнения();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораТипДокумента()
	
	Если ЭтоДополнительныйТипДокумента Тогда
		Элементы.ТипДокумента.СписокВыбора.Очистить();
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Элементы.ТипДокумента.СписокВыбора) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Док Из Метаданные.Документы Цикл
		Элементы.ТипДокумента.СписокВыбора.Добавить(Док.Имя, Док.Синоним);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораТабличнаяЧасть()
	
	Если ЭтоДополнительныйТипДокумента Тогда
		Возврат;
	КонецЕсли;
	
	МассивРеквизитов = ВсеТабличныеЧастиДокумента();
	МассивРеквизитов.Добавить("<Реквизиты шапки>");
	Элементы.ТабличнаяЧасть.СписокВыбора.ЗагрузитьЗначения(МассивРеквизитов);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбораПолейШапки()
	
	Если ЭтоДополнительныйТипДокумента Тогда
		Возврат;
	КонецЕсли;
	
	МассивРеквизитов = ВсеРеквизитыШапкиДокумента();
	Элементы.ПолеОрганизация.СписокВыбора.ЗагрузитьЗначения(МассивРеквизитов);
	Элементы.ПолеСклад.СписокВыбора.ЗагрузитьЗначения(МассивРеквизитов);
	Элементы.ПолеКонтрагент.СписокВыбора.ЗагрузитьЗначения(МассивРеквизитов);
	Элементы.ПолеСумма.СписокВыбора.ЗагрузитьЗначения(МассивРеквизитов);
	Элементы.ПолеДокументОснование.СписокВыбора.ЗагрузитьЗначения(МассивРеквизитов);
	Элементы.ПолеКомментарий.СписокВыбора.ЗагрузитьЗначения(МассивРеквизитов);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбораПолейТабличнойЧасти()
	
	Если ЭтоДополнительныйТипДокумента Тогда
		Возврат;
	КонецЕсли;
	
	МассивРеквизитов = ВсеРеквизитыТабличнойЧастиДокумента();
	Элементы.ПолеНоменклатура.СписокВыбора.ЗагрузитьЗначения(МассивРеквизитов);
	Элементы.ПолеХарактеристика.СписокВыбора.ЗагрузитьЗначения(МассивРеквизитов);
	Элементы.ПолеУпаковка.СписокВыбора.ЗагрузитьЗначения(МассивРеквизитов);
	Элементы.ПолеСерия.СписокВыбора.ЗагрузитьЗначения(МассивРеквизитов);
	Элементы.ПолеКоличество.СписокВыбора.ЗагрузитьЗначения(МассивРеквизитов);
	Элементы.ПолеЦена.СписокВыбора.ЗагрузитьЗначения(МассивРеквизитов);
	Элементы.ПолеКоличествоУпаковок.СписокВыбора.ЗагрузитьЗначения(МассивРеквизитов);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораПравилоЗаполнения()
	
	ПравилаЗаполнения = МодульОбъекта().Перечисление_ПравилаЗаполненияРеквизитов();
	СписокВыбора = Элементы.ТаблицаРеквизитовОперацийПравилоЗаполнения.СписокВыбора;
	
	ЗначенияСписка = Новый Массив;
	Для Каждого Элемент Из ПравилаЗаполнения Цикл
		Если ЭтоДополнительныйТипДокумента
			И Элемент.Значение = ПравилаЗаполнения.РеквизитДокумента1С Тогда
			Продолжить;
		КонецЕсли;
		ЗначенияСписка.Добавить(Элемент.Значение);
	КонецЦикла;
	
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

// Процедуры заполнения значений по умолчанию

&НаСервере
Процедура ЗаполнитьЗначениямиПоУмолчанию()
	
	ЗаполнитьПоУмолчаниюПоляШапки();
	ЗаполнитьПоУмолчаниюИмяТабличнойЧасти();
	ЗаполнитьПоУмолчаниюПоляТабличнойЧасти();
	ЗаполнитьПоУмолчаниюПризнакПоказатьВСпискеЕслиПроведен();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоУмолчаниюПоляШапки()
	
	МассивРеквизитов = ВсеРеквизитыШапкиДокумента();
	
	Если МассивРеквизитов.Найти("Организация") <> Неопределено Тогда
		ПолеОрганизация = "Организация";
	Иначе
		ПолеОрганизация = "";
	КонецЕсли;
	
	Если МассивРеквизитов.Найти("Склад") <> Неопределено Тогда
		ПолеСклад = "Склад";
	ИначеЕсли МассивРеквизитов.Найти("СкладГруппа") <> Неопределено Тогда
		ПолеСклад = "СкладГруппа";
	Иначе
		ПолеСклад = "";
	КонецЕсли;
	
	Если МассивРеквизитов.Найти("Контрагент") <> Неопределено Тогда
		ПолеКонтрагент = "Контрагент";
	Иначе
		ПолеКонтрагент = "";
	КонецЕсли;
	
	Если МассивРеквизитов.Найти("СуммаДокумента") <> Неопределено Тогда
		ПолеСумма = "СуммаДокумента";
	Иначе
		ПолеСумма = "";
	КонецЕсли;
	
	Если МассивРеквизитов.Найти("ЗаказКлиента") <> Неопределено Тогда
		ПолеДокументОснование = "ЗаказКлиента";
	ИначеЕсли МассивРеквизитов.Найти("ДокументОснование") <> Неопределено Тогда
		ПолеДокументОснование = "ДокументОснование";
	ИначеЕсли МассивРеквизитов.Найти("ИсправляемыйДокументРеализации") <> Неопределено Тогда
		ПолеДокументОснование = "ИсправляемыйДокументРеализации";
	Иначе
		ПолеДокументОснование = "";
	КонецЕсли;
	
	Если МассивРеквизитов.Найти("Комментарий") <> Неопределено Тогда
		ПолеКомментарий = "Комментарий";
	Иначе
		ПолеКомментарий = "";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоУмолчаниюИмяТабличнойЧасти()
	
	МассивРеквизитов = ВсеТабличныеЧастиДокумента();
	
	Если МассивРеквизитов.Найти("Товары") <> Неопределено Тогда
		ТабличнаяЧасть = "Товары";
	Иначе
		ТабличнаяЧасть = "";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоУмолчаниюПоляТабличнойЧасти()
	
	МассивРеквизитов = ВсеРеквизитыТабличнойЧастиДокумента();
	
	Если МассивРеквизитов.Найти("Номенклатура") <> Неопределено Тогда
		ПолеНоменклатура = "Номенклатура";
	Иначе
		ПолеНоменклатура = "";
	КонецЕсли;
	
	Если МассивРеквизитов.Найти("Характеристика") <> Неопределено Тогда
		ПолеХарактеристика = "Характеристика";
	Иначе
		ПолеХарактеристика = "";
	КонецЕсли;
	
	Если МассивРеквизитов.Найти("Упаковка") <> Неопределено Тогда
		ПолеУпаковка = "Упаковка";
	Иначе
		ПолеУпаковка = "";
	КонецЕсли;
	
	Если МассивРеквизитов.Найти("Серия") <> Неопределено Тогда
		ПолеСерия = "Серия";
	Иначе
		ПолеСерия = "";
	КонецЕсли;
	
	Если МассивРеквизитов.Найти("Цена") <> Неопределено Тогда
		ПолеЦена = "Цена";
	Иначе
		ПолеЦена = "";
	КонецЕсли;
	
	Если МассивРеквизитов.Найти("КоличествоУпаковок") <> Неопределено Тогда
		ПолеКоличество = "КоличествоУпаковок";
	ИначеЕсли МассивРеквизитов.Найти("Количество") <> Неопределено Тогда
		ПолеКоличество = "Количество";
	Иначе
		ПолеКоличество = "";
	КонецЕсли;
	
	Если МассивРеквизитов.Найти("КоличествоПотребительскихУпаковок") <> Неопределено Тогда
		ПолеКоличествоУпаковок = "КоличествоПотребительскихУпаковок";
	Иначе
		ПолеКоличествоУпаковок = "";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоУмолчаниюПризнакПоказатьВСпискеЕслиПроведен()
	
	ПоказатьВСпискеЕслиПроведен = ДокументМожноПровести();
	
КонецПроцедуры

// Служебные процедуры и функции

&НаСервере
Процедура ЗаполнитьКонтекст()
	
	ОписаниеНастройки = МодульОбъекта().НастройкиДокументаУчета_Прочитать(Ссылка);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ОписаниеНастройки);
	
	Если ЗначениеЗаполнено(ОписаниеНастройки.ТипДокумента) Тогда
		ТипДокумента = ОписаниеНастройки.ТипДокумента;
	КонецЕсли;
	
	ПоказатьВСпискеЕслиПроведен = Не ОписаниеНастройки.ПоказатьВСпискеЕслиНеПроведен;
	ПоказатьВСпискеЕслиТоварыЗаполнены = Не ОписаниеНастройки.ПоказатьВСпискеЕслиТоварыНеЗаполнены;
	ПоказатьВСпискеЕслиТоварыПодлежатМаркировке = Не ОписаниеНастройки.ПоказатьВСпискеЕслиТоварыНеПодлежатМаркировке;
	
	ЗаполнитьНастройкиКомандДокумента(ОписаниеНастройки.ОтключенныеКоманды);
	ЗаполнитьНастройкиРолейДокумента(ОписаниеНастройки.РолиДокумента);
	
	ЗаполнитьНастройкиЗаполненияОпераций();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиЗаполненияОпераций()
	
	ОписаниеНастройки = МодульОбъекта().НастройкиЗаполненияОпераций_ПрочитатьПоТипуДокумента(ТипДокумента);
	
	Для Каждого Стр Из ОписаниеНастройки.ТаблицаРеквизитов Цикл
		НоваяСтрока = ТаблицаРеквизитовОпераций.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
		Если СписокТиповОпераций.НайтиПоЗначению(Стр.ТипОперации) = Неопределено Тогда
			Элемент = СписокТиповОпераций.Добавить(Стр.ТипОперации);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Элемент Из СписокТиповОпераций Цикл
		Если ОписаниеНастройки.ТипыОпераций.Найти(Элемент.Значение) <> Неопределено Тогда
			Элемент.Пометка = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуРеквизитовОпераций(ПараметрыЗаполнения)
	
	ТипыОпераций = ПараметрыЗаполнения.ТипыОпераций;
	НастройкиЗаполнения = ПараметрыЗаполнения.НастройкиЗаполнения;
	
	Для Каждого Стр Из НастройкиЗаполнения Цикл
		НоваяСтрока = ТаблицаРеквизитовОпераций.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
		Если СписокТиповОпераций.НайтиПоЗначению(Стр.ТипОперации) = Неопределено Тогда
			Элемент = СписокТиповОпераций.Добавить(Стр.ТипОперации);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Элемент Из СписокТиповОпераций Цикл
		Если ТипыОпераций.Найти(Элемент.Значение) <> Неопределено Тогда
			Элемент.Пометка = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиРолейДокумента(РолиДокумента)
	
	РолиДокументовУчета = МодульОбъекта().Перечисление_РолиДокументовУчета();
	Для каждого РольДокумента Из РолиДокументовУчета Цикл
		Пометка = РолиДокумента.Найти(РольДокумента.Значение) <> Неопределено;
		СписокРолейДокумента.Добавить(РольДокумента.Ключ, РольДокумента.Значение, Пометка);
	КонецЦикла;
	
	СформироватьПредставлениеРолейДокумента();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиКомандДокумента(ОтключенныеКоманды, СтрокиДерева = Неопределено, КомандыДерева = Неопределено)
	
	Если СтрокиДерева = Неопределено Тогда
		СтрокиДерева = ДеревоНастройкиКомандДокумента.ПолучитьЭлементы();
	КонецЕсли;
	
	Если КомандыДерева = Неопределено Тогда
		КомандыДерева = СтруктураКомандДокумента();
	КонецЕсли;
	
	ПредставленияКоманд = ПредставленияКомандДокумента();
	
	Для каждого Элемент Из КомандыДерева Цикл
		
		Если ТипЗнч(Элемент) = Тип("Строка") Тогда
			// Это команда
			Пометка = ОтключенныеКоманды.Найти(Элемент) = Неопределено;
			СтрокаКоманды = СтрокиДерева.Добавить();
			СтрокаКоманды.Пометка = Пометка;
			СтрокаКоманды.ИмяКоманды = Элемент;
			СтрокаКоманды.Представление = ПредставленияКоманд[Элемент];
		Иначе
			// Это раздел
			ГруппаКоманд = СтрокиДерева.Добавить();
			ГруппаКоманд.Представление = Элемент.Заголовок;
			ЗаполнитьНастройкиКомандДокумента(ОтключенныеКоманды, ГруппаКоманд.ПолучитьЭлементы(), Элемент.Команды);
			ДеревоНастройкиКомандДокумента_ОбновитьПометкиРодительскихСтрок(ГруппаКоманд);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастройкиКомандДокументаПометкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоНастройкиКомандДокумента.ТекущиеДанные;
	
	Если ТекущиеДанные.Пометка = 2 Тогда
		ТекущиеДанные.Пометка = Ложь;
	КонецЕсли;
	
	ДеревоНастройкиКомандДокумента_ОбновитьПометкиВложенныхСтрок(ТекущиеДанные);
	ДеревоНастройкиКомандДокумента_ОбновитьПометкиРодительскихСтрок(ТекущиеДанные.ПолучитьРодителя());
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастройкиКомандДокумента_ОбновитьПометкиВложенныхСтрок(СтрокаРодителя)
	
	ВложенныеСтроки = СтрокаРодителя.ПолучитьЭлементы();
	Для каждого Строка Из ВложенныеСтроки Цикл
		
		Строка.Пометка = СтрокаРодителя.Пометка;
		ДеревоНастройкиКомандДокумента_ОбновитьПометкиВложенныхСтрок(Строка);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ДеревоНастройкиКомандДокумента_ОбновитьПометкиРодительскихСтрок(СтрокаРодителя)
	
	Если СтрокаРодителя = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Есть0 = Ложь;
	Есть1 = Ложь;
	Есть2 = Ложь;
	Для каждого Строка Из СтрокаРодителя.ПолучитьЭлементы() Цикл
		Есть0 = (Есть0 Или Строка.Пометка = 0);
		Есть1 = (Есть1 Или Строка.Пометка = 1);
		Есть2 = (Есть2 Или Строка.Пометка = 2);
	КонецЦикла;
	
	Если Есть2 Тогда
		Пометка = 2;
	ИначеЕсли Есть1 И Не Есть0 Тогда
		Пометка = 1;
	ИначеЕсли Есть0 И Не Есть1 Тогда
		Пометка = 0;
	Иначе
		Пометка = 2;
	КонецЕсли;
	
	СтрокаРодителя.Пометка = Пометка;
	
	ДеревоНастройкиКомандДокумента_ОбновитьПометкиРодительскихСтрок(СтрокаРодителя.ПолучитьРодителя());
	
КонецПроцедуры

&НаСервере
Функция СтруктураКомандДокумента()
	
	Результат = Новый Массив;
	
	НаборКоманд = МодульОбъекта().Перечисление_КомандыДокумента();
	
	РазделПодборатьНовый = Новый_РазделКомандДокумента();
	РазделПодборатьНовый.Заголовок = НСтр("ru = 'Подобрать коды (в новом документе)'");
	РазделПодборатьНовый.Команды.Добавить(НаборКоманд.НаполнитьНаТСДНачатьРаботу);
	Результат.Добавить(РазделПодборатьНовый);
	
	РазделЗагрузитьНовый = Новый_РазделКомандДокумента();
	РазделЗагрузитьНовый.Заголовок = НСтр("ru = 'Наполнить кодами'");
	РазделЗагрузитьНовый.Команды.Добавить(НаборКоманд.НаполнитьКодамиИзВнешнегоИсточникаНачатьРаботу);
	РазделЗагрузитьНовый.Команды.Добавить(НаборКоманд.НаполнитьКодамиИзДругогоДокументаНачатьРаботу);
	РазделЗагрузитьНовый.Команды.Добавить(НаборКоманд.НаполнитьКодамиИзФайловНачатьРаботу);
	РазделПодборатьНовый.Команды.Добавить(РазделЗагрузитьНовый);
	
	РазделПодборать = Новый_РазделКомандДокумента();
	РазделПодборать.Заголовок = НСтр("ru = 'Подобрать коды'");
	РазделПодборать.Команды.Добавить(НаборКоманд.ЗаказКодов);
	РазделПодборать.Команды.Добавить(НаборКоманд.ПодборСвободныхОстатков);
	РазделПодборать.Команды.Добавить(НаборКоманд.НаполнитьНаТСД);
	Результат.Добавить(РазделПодборать);
	
	РазделЗагрузить = Новый_РазделКомандДокумента();
	РазделЗагрузить.Заголовок = НСтр("ru = 'Наполнить кодами'");
	РазделЗагрузить.Команды.Добавить(НаборКоманд.НаполнитьКодамиИзВнешнегоИсточника);
	РазделЗагрузить.Команды.Добавить(НаборКоманд.НаполнитьКодамиИзДругогоДокумента);
	РазделЗагрузить.Команды.Добавить(НаборКоманд.НаполнитьКодамиИзОснования);
	РазделЗагрузить.Команды.Добавить(НаборКоманд.НаполнитьКодамиИзВходящегоУПД);
	РазделЗагрузить.Команды.Добавить(НаборКоманд.НаполнитьКодамиИзФайлов);
	РазделЗагрузить.Команды.Добавить(НаборКоманд.НаполнитьКодамиИзТабличногоДокумента);
	РазделПодборать.Команды.Добавить(РазделЗагрузить);
	
	РазделПодборать.Команды.Добавить(НаборКоманд.НаполнитьАгрегатамиИзОснования);
	
	РазделОперации = Новый_РазделКомандДокумента();
	РазделОперации.Заголовок = НСтр("ru = 'Операции с кодами'");
	РазделОперации.Команды.Добавить(НаборКоманд.ПечатьКодов);
	РазделОперации.Команды.Добавить(НаборКоманд.ОтчетОНанесении);
	РазделОперации.Команды.Добавить(НаборКоманд.ОтчетОНанесенииНаТСД);
	РазделОперации.Команды.Добавить(НаборКоманд.ВводВоборот);
	РазделОперации.Команды.Добавить(НаборКоманд.ВыводИзОборота);
	РазделОперации.Команды.Добавить(НаборКоманд.ВозвратВОборот);
	РазделОперации.Команды.Добавить(НаборКоманд.ВозвратВОборотНаТСД);
	РазделОперации.Команды.Добавить(НаборКоманд.ОтчетОВыбытии);
	РазделОперации.Команды.Добавить(НаборКоманд.ОтчетОВыбытииНаТСД);
	РазделОперации.Команды.Добавить(НаборКоманд.Перемаркировать);
	РазделОперации.Команды.Добавить(НаборКоманд.КорректировкаСведений);
	РазделОперации.Команды.Добавить(НаборКоманд.УведомлениеОСостоянииКодов);
	РазделОперации.Команды.Добавить(НаборКоманд.АгрегацияКоды);
	РазделОперации.Команды.Добавить(НаборКоманд.ЗарегистрироватьКИТУ);
	РазделОперации.Команды.Добавить(НаборКоманд.РасформироватьКИТУ);
	РазделОперации.Команды.Добавить(НаборКоманд.НаполнитьАгрегатыНаТСД);
	РазделОперации.Команды.Добавить(НаборКоманд.НаполнитьНаборыНаТСД);
	РазделОперации.Команды.Добавить(НаборКоманд.ЗарегистрироватьНаборы);
	РазделОперации.Команды.Добавить(НаборКоманд.АгрегироватьКИГУ);
	РазделОперации.Команды.Добавить(НаборКоманд.ЗарегистрироватьКИГУ);
	РазделОперации.Команды.Добавить(НаборКоманд.СформироватьАТК);
	РазделОперации.Команды.Добавить(НаборКоманд.РасформироватьАТК);
	РазделОперации.Команды.Добавить(НаборКоманд.РасформироватьНаборы);
	Результат.Добавить(РазделОперации);
	
	РазделСохранить = Новый_РазделКомандДокумента();
	РазделСохранить.Заголовок = НСтр("ru = 'Сохранить коды в файл'");
	РазделСохранить.Команды.Добавить(НаборКоманд.СохранитьКодыВФайлCSV);
	РазделСохранить.Команды.Добавить(НаборКоманд.СохранитьКодыВФайлXLS);
	Результат.Добавить(РазделСохранить);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПредставленияКомандДокумента()
	
	НаборКоманд = МодульОбъекта().Перечисление_КомандыДокумента();
	
	Результат = Новый Структура;
	Результат.Вставить(НаборКоманд.ЗаказКодов,                                     "Заказать новые коды");
	Результат.Вставить(НаборКоманд.ПодборСвободныхОстатков,                        "Подобрать свободные коды");
	Результат.Вставить(НаборКоманд.НаполнитьНаТСД,                                 "Наполнить на ТСД");
	Результат.Вставить(НаборКоманд.НаполнитьНаТСДНачатьРаботу,                     "Наполнить на ТСД");
	Результат.Вставить(НаборКоманд.НаполнитьКодамиИзВнешнегоИсточника,             "Из внешнего источника");
	Результат.Вставить(НаборКоманд.НаполнитьКодамиИзВнешнегоИсточникаНачатьРаботу, "Из внешнего источника");
	Результат.Вставить(НаборКоманд.НаполнитьКодамиИзДругогоДокумента,              "Из другого документа");
	Результат.Вставить(НаборКоманд.НаполнитьКодамиИзДругогоДокументаНачатьРаботу,  "Из другого документа");
	Результат.Вставить(НаборКоманд.НаполнитьКодамиИзОснования,                     "Из документа основания");
	Результат.Вставить(НаборКоманд.НаполнитьКодамиИзВходящегоУПД,                  "Из входящего УПД");
	Результат.Вставить(НаборКоманд.НаполнитьКодамиИзФайлов,                        "Из файлов");
	Результат.Вставить(НаборКоманд.НаполнитьКодамиИзФайловНачатьРаботу,            "Из файлов");
	Результат.Вставить(НаборКоманд.НаполнитьКодамиИзТабличногоДокумента,           "Из табличного документа");
	Результат.Вставить(НаборКоманд.НаполнитьАгрегатамиИзОснования,                 "Наполнить агрегатами из основания");
	
	Результат.Вставить(НаборКоманд.ПечатьКодов,                "Напечатать этикетки");
	Результат.Вставить(НаборКоманд.ОтчетОНанесении,            "Создать отчет о нанесении");
	Результат.Вставить(НаборКоманд.ОтчетОНанесенииНаТСД,       "Наполнить отчет о нанесении на ТСД");
	Результат.Вставить(НаборКоманд.ВводВоборот,                "Ввести в оборот");
	Результат.Вставить(НаборКоманд.ВыводИзОборота,             "Вывести из оборота");
	Результат.Вставить(НаборКоманд.ВозвратВОборот,             "Вернуть в оборот");
	Результат.Вставить(НаборКоманд.ВозвратВОборотНаТСД,        "Наполнить возврат в оборот на ТСД");
	Результат.Вставить(НаборКоманд.ОтчетОВыбытии,              "Создать отчет о выбытии");
	Результат.Вставить(НаборКоманд.ОтчетОВыбытииНаТСД,         "Наполнить отчет о выбытии на ТСД");
	Результат.Вставить(НаборКоманд.Перемаркировать,            "Перемаркировать");
	Результат.Вставить(НаборКоманд.КорректировкаСведений,      "Корректировать сведения о кодах");
	Результат.Вставить(НаборКоманд.УведомлениеОСостоянииКодов, "Уведомить о состоянии кодов");
	Результат.Вставить(НаборКоманд.АгрегацияКоды,              "Агрегировать коды");
	Результат.Вставить(НаборКоманд.ЗарегистрироватьКИТУ,       "Зарегистрировать КИТУ");
	Результат.Вставить(НаборКоманд.РасформироватьКИТУ,         "Расформировать КИТУ");
	Результат.Вставить(НаборКоманд.НаполнитьАгрегатыНаТСД,     "Наполнить агрегаты на ТСД");
	Результат.Вставить(НаборКоманд.НаполнитьНаборыНаТСД,       "Наполнить наборы на ТСД");
	Результат.Вставить(НаборКоманд.ЗарегистрироватьНаборы,     "Зарегистрировать наборы");
	Результат.Вставить(НаборКоманд.АгрегироватьКИГУ,           "Наполнить КИГУ");
	Результат.Вставить(НаборКоманд.ЗарегистрироватьКИГУ,       "Зарегистрировать КИГУ");
	Результат.Вставить(НаборКоманд.СформироватьАТК,            "Сформировать АТК");
	Результат.Вставить(НаборКоманд.РасформироватьАТК,          "Расформировать АТК");
	Результат.Вставить(НаборКоманд.РасформироватьНаборы,       "Расформировать наборы");
	
	Результат.Вставить(НаборКоманд.СохранитьКодыВФайлCSV, "Сохранить коды в файл CSV");
	Результат.Вставить(НаборКоманд.СохранитьКодыВФайлXLS, "Сохранить коды в файл XLS");
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Новый_РазделКомандДокумента()
	
	Результат = Новый Структура;
	Результат.Вставить("Заголовок");
	Результат.Вставить("Команды", Новый Массив);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаписатьНаСервере()
	
	ЗаписатьНастройкиДокументаУчета();
	ЗаписатьНастройкиЗаполненияОпераций();
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиДокументаУчета()
	
	ОписаниеНастройки = МодульОбъекта().Новый_НастройкиДокументаУчета();
	ЗаполнитьЗначенияСвойств(ОписаниеНастройки, ЭтаФорма);
	
	ОписаниеНастройки.ТипДокумента = ТипДокумента;
	ОписаниеНастройки.ПоказатьВСпискеЕслиТоварыНеЗаполнены = Не ПоказатьВСпискеЕслиТоварыЗаполнены;
	ОписаниеНастройки.ПоказатьВСпискеЕслиТоварыНеПодлежатМаркировке = Не ПоказатьВСпискеЕслиТоварыПодлежатМаркировке;
	ОписаниеНастройки.ПоказатьВСпискеЕслиНеПроведен = Не ПоказатьВСпискеЕслиПроведен;
	
	ЗаполнитьРолиДокумента(ОписаниеНастройки.РолиДокумента);
	
	ЗаполнитьОтключенныеКомандыДокумента(ОписаниеНастройки.ОтключенныеКоманды);
	
	МодульОбъекта().НастройкиДокументаУчета_Записать(ОписаниеНастройки);
	
	Действие = МодульОбъекта().Перечисление_ДействияМетрики().ЗаписьВБазу;
	МодульОбъекта().Метрика_НастройкиДокумента(Действие, Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиЗаполненияОпераций()
	
	ОписаниеНастройки = ОписаниеНастроекЗаполненияОперацийИзКонтекста();
	
	МодульОбъекта().НастройкиЗаполненияОпераций_Записать(ОписаниеНастройки);
	
	Действие = МодульОбъекта().Перечисление_ДействияМетрики().ЗаписьВБазу;
	МодульОбъекта().Метрика_НастройкиЗаполненияОпераций(Действие, ОписаниеНастройки);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРолиДокумента(РолиДокумента)
	
	МассивРолей = Новый Массив;
	Для Каждого Элемент Из СписокРолейДокумента Цикл
		Если Элемент.Пометка Тогда
			МассивРолей.Добавить(Элемент.Представление);
		КонецЕсли;
	КонецЦикла;
	
	РолиДокумента = МассивРолей;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтключенныеКомандыДокумента(ОтключенныеКоманды, СтрокиДерева = Неопределено)
	
	Если СтрокиДерева = Неопределено Тогда
		СтрокиДерева = РеквизитФормыВЗначение("ДеревоНастройкиКомандДокумента").Строки;
	КонецЕсли;
	
	Для Каждого Строка Из СтрокиДерева Цикл
		Если ЗначениеЗаполнено(Строка.Строки) Тогда
			ЗаполнитьОтключенныеКомандыДокумента(ОтключенныеКоманды, Строка.Строки);
		Иначе
			Если Не Строка.Пометка Тогда
				ОтключенныеКоманды.Добавить(Строка.ИмяКоманды);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы()
	
	Заголовок = "Настройки документа: " + Наименование;
	
	Элементы.ПоказатьВСпискеЕслиТоварыЗаполнены.Доступность = Не ПоказатьВСпискеЕслиТоварыПодлежатМаркировке;
	
	Если ДокументМожноПровести() Тогда
		Элементы.ПоказатьВСпискеЕслиПроведен.Доступность = Истина;
		Элементы.ПоказатьВСпискеЕслиПроведен.Заголовок = НСтр("ru = 'Только если документ проведен'");
	Иначе
		Элементы.ПоказатьВСпискеЕслиПроведен.Доступность = Ложь;
		Элементы.ПоказатьВСпискеЕслиПроведен.Заголовок = НСтр(
		"ru = 'Только если документ проведен (у документа нет функции проведения)'");
	КонецЕсли;
	
	Элементы.СтраницаПоляДокумента.Доступность = Не ЭтоДополнительныйТипДокумента;
	Элементы.ТипДокумента.РежимВыбораИзСписка = Не ЭтоДополнительныйТипДокумента;
	Элементы.ПоказатьВСпискеЕслиТоварыПодлежатМаркировке.Видимость = Не ЭтоДополнительныйТипДокумента;
	Элементы.ПоказатьВСпискеЕслиТоварыЗаполнены.Видимость = Не ЭтоДополнительныйТипДокумента;
	
КонецПроцедуры

&НаСервере
Функция ВсеРеквизитыШапкиДокумента(ВключаяСтандартные = Ложь)
	
	РеквизитыШапки = Новый СписокЗначений;
	
	Если ЗначениеЗаполнено(ТипДокумента)
		И Не ЭтоДополнительныйТипДокумента Тогда
		
		МетаданныеДокумента = Метаданные.Документы.Найти(ТипДокумента);
		
		Если МетаданныеДокумента <> Неопределено Тогда
			
			Для Каждого РеквизитШапки Из МетаданныеДокумента.Реквизиты Цикл
				РеквизитыШапки.Добавить(РеквизитШапки.Имя);
			КонецЦикла;
			
			Для Каждого ОбщийРеквизит Из Метаданные.ОбщиеРеквизиты Цикл
				Если ОбщийРеквизит.Состав.Содержит(МетаданныеДокумента) Тогда
					РеквизитыШапки.Добавить(ОбщийРеквизит.Имя);
				КонецЕсли;
			КонецЦикла;
			
			Если ВключаяСтандартные Тогда
				Для Каждого РеквизитШапки Из МетаданныеДокумента.СтандартныеРеквизиты Цикл
					РеквизитыШапки.Добавить(РеквизитШапки.Имя);
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	РеквизитыШапки.СортироватьПоЗначению();
	
	Возврат РеквизитыШапки.ВыгрузитьЗначения();
	
КонецФункции

&НаСервере
Функция ВсеТабличныеЧастиДокумента()
	
	Результат = Новый Массив;
	
	Если ЗначениеЗаполнено(ТипДокумента)
		И Не ЭтоДополнительныйТипДокумента Тогда
		МетаданныеДокумента = Метаданные.Документы.Найти(ТипДокумента);
		Если МетаданныеДокумента <> Неопределено Тогда
			Для Каждого ТабЧасть Из МетаданныеДокумента.ТабличныеЧасти Цикл
				Результат.Добавить(ТабЧасть.Имя);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ВсеРеквизитыТабличнойЧастиДокумента()
	
	Если ТабличнаяЧасть = "<Реквизиты шапки>" Тогда
		Возврат ВсеРеквизитыШапкиДокумента();
	КонецЕсли;
	
	Результат = Новый Массив;
	
	Если ЗначениеЗаполнено(ТипДокумента)
		И ЗначениеЗаполнено(ТабличнаяЧасть) Тогда
		МетаданныеДокумента = Метаданные.Документы.Найти(ТипДокумента);
		Если МетаданныеДокумента <> Неопределено Тогда
			РеквизитыТЧ = МетаданныеДокумента.ТабличныеЧасти[ТабличнаяЧасть].Реквизиты;
			Для Каждого РеквизитТЧ Из РеквизитыТЧ Цикл
				Результат.Добавить(РеквизитТЧ.Имя);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДокументМожноПровести()
	
	Если ЭтоДополнительныйТипДокумента Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Результат = Истина;
	
	МетаданныеДокумента = Метаданные.Документы.Найти(ТипДокумента);
	Если МетаданныеДокумента <> Неопределено
		И МетаданныеДокумента.Проведение <> Метаданные.СвойстваОбъектов.Проведение.Разрешить Тогда
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПроверитьЗаполнениеРеквизитов()
	
	ЕстьОшибки = Ложь;
	
	ПроверитьТипДокумента(ЕстьОшибки);
	ПроверитьФормулыДопКолонокИУсловийОтбора(ЕстьОшибки);
	ПроверитьНастройкиЗаполненияОпераций(ЕстьОшибки);
	ПроверитьРолиДокумента(ЕстьОшибки);
	
	Возврат Не ЕстьОшибки;
	
КонецФункции

&НаСервере
Процедура ПроверитьТипДокумента(ЕстьОшибки)
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		
		СтарыйТипДокумента = МодульОбъекта().НастройкиДокументаУчета_Прочитать(Ссылка).ТипДокумента;
		
		Если ТипДокумента <> СтарыйТипДокумента Тогда
			ПроверитьНаличиеДокументовПоСтаромуТипу(СтарыйТипДокумента, ЕстьОшибки);
		КонецЕсли;
		
	КонецЕсли;
	
	ПроверитьНаличиеДубликатаНастройки(ЕстьОшибки);
	
	Если ЭтоДополнительныйТипДокумента Тогда
		ПроверитьДопустимостьДополнительногоТипаДокумента(ЕстьОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаличиеДокументовПоСтаромуТипу(СтарыйТипДокумента, ЕстьОшибки)
	
	Если МодульОбъекта().НастройкиДокументовУчета_ЕстьДокументыПоТипу(СтарыйТипДокумента) Тогда
		ТекстОшибки = НСтр("ru = 'Невозможно изменить тип документа, уже есть документы по типу: %1'");
		ТекстОшибки = МодульОбъекта().ПараметрыВСтроку(ТекстОшибки, СтарыйТипДокумента);
		МодульОбъекта().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор, "ТипДокумента");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаличиеДубликатаНастройки(ЕстьОшибки)
	
	ВызыватьИсключение = Ложь;
	НастройкаИБ = МодульОбъекта().НастройкиДокументовУчета_НайтиПоТипуДокумента(ТипДокумента, ВызыватьИсключение);
	
	Если ЗначениеЗаполнено(НастройкаИБ) И НастройкаИБ <> Ссылка Тогда
		ТекстОшибки = НСтр("ru = 'Уже существует настройка по типу документа 1С: %1'");
		ТекстОшибки = МодульОбъекта().ПараметрыВСтроку(ТекстОшибки, ТипДокумента);
		МодульОбъекта().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор, "ТипДокумента");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьДопустимостьДополнительногоТипаДокумента(ЕстьОшибки)
	
	ЗарезервированныйТипДляПроизводства = "КонтурМаркировка_ЗаданиеНаПроизводство";
	
	Если НРег(ТипДокумента) = НРег(ЗарезервированныйТипДляПроизводства) Тогда
		ТекстОшибки = НСтр("ru = 'Тип ""%1"" зарезервирован в модуле, поэтому не может быть дополнительным'");
		ТекстОшибки = МодульОбъекта().ПараметрыВСтроку(ТекстОшибки, ТипДокумента);
		МодульОбъекта().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор, "ТипДокумента");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	ДопустимыйПрефиксТиповДопДокументов = "КонтурМаркировка_";
	
	Если Не МодульОбъекта().СтрокаНачинаетсяС(ТипДокумента, ДопустимыйПрефиксТиповДопДокументов) Тогда
		ТекстОшибки = НСтр("ru = 'Тип дополнительного документа должен начинаться с префикса: %1'");
		ТекстОшибки = МодульОбъекта().ПараметрыВСтроку(ТекстОшибки, ДопустимыйПрефиксТиповДопДокументов);
		МодульОбъекта().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор, "ТипДокумента");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если Метаданные.Документы.Найти(ТипДокумента) <> Неопределено Тогда
		ТекстОшибки = НСтр("ru = 'Тип ""%1"" есть в документах 1С, поэтому не может быть дополнительным'");
		ТекстОшибки = МодульОбъекта().ПараметрыВСтроку(ТекстОшибки, ТипДокумента);
		МодульОбъекта().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор, "ТипДокумента");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьФормулыДопКолонокИУсловийОтбора(ЕстьОшибки)
	
	Если ЭтоДополнительныйТипДокумента Тогда
		Возврат;
	КонецЕсли;
	
	ШаблонОшибки = НСтр("ru = 'Неверная формула: %1'");
	
	Если ЗначениеЗаполнено(ДопКолонка1_Формула)
		И Не ПроверитьФормулу(ДопКолонка1_Формула) Тогда
		ТекстОшибки = МодульОбъекта().ПараметрыВСтроку(ШаблонОшибки, ДопКолонка1_Формула);
		МодульОбъекта().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор, "ДопКолонка1_Формула");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДопКолонка2_Формула)
		И Не ПроверитьФормулу(ДопКолонка2_Формула) Тогда
		ТекстОшибки = МодульОбъекта().ПараметрыВСтроку(ШаблонОшибки, ДопКолонка2_Формула);
		МодульОбъекта().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор, "ДопКолонка2_Формула");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДопКолонка3_Формула)
		И Не ПроверитьФормулу(ДопКолонка3_Формула) Тогда
		ТекстОшибки = МодульОбъекта().ПараметрыВСтроку(ШаблонОшибки, ДопКолонка3_Формула);
		МодульОбъекта().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор, "ДопКолонка3_Формула");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДополнительноеУсловиеОтбора)
		И Не ПроверитьФормулу(ДополнительноеУсловиеОтбора) Тогда
		ТекстОшибки = МодульОбъекта().ПараметрыВСтроку(ШаблонОшибки, ДополнительноеУсловиеОтбора);
		МодульОбъекта().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор, "ДополнительноеУсловиеОтбора");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьФормулу(Формула)
	
	Если ЭтоДополнительныйТипДокумента
		И Найти(Формула, "Документ1С.Склад") > 0 Тогда
		Возврат Истина; // В документе учета не получиться проверить склад 1С
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	&ДопКолонка КАК ДопКолонка
	|ИЗ
	|	ТаблицаДокумента КАК Документ1С";
	
	Если ЭтоДополнительныйТипДокумента Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТаблицаДокумента", "Справочник.КонтурМаркировка_ДокументыУчета");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТаблицаДокумента", "Документ." + ТипДокумента);
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДопКолонка", Формула);
	
	Попытка
		Запрос = Новый Запрос(ТекстЗапроса);
		РезультатЗапроса = Запрос.Выполнить();
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ПроверитьНастройкиЗаполненияОпераций(ЕстьОшибки)
	
	ТаблицаФормы = Элементы.ТаблицаРеквизитовОпераций;
	
	Для Каждого Стр Из ТаблицаРеквизитовОпераций Цикл
		ИндексСтроки = ТаблицаРеквизитовОпераций.Индекс(Стр);
		Если Не МодульОбъекта().ПроверитьЗначениеНастройкиЗаполненияРеквизита(
			Стр, ТипДокумента, УникальныйИдентификатор, ТаблицаФормы, ИндексСтроки) Тогда
			ЕстьОшибки = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьРолиДокумента(ЕстьОшибки)
	
	РолиДокументов = МодульОбъекта().Перечисление_РолиДокументовУчета();
	ЕстьРольОтгрузка = Ложь;
	ЕстьРольКорректировка = Ложь;
	
	Для Каждого Элемент Из СписокРолейДокумента Цикл
		Если Не Элемент.Пометка Тогда
			Продолжить;
		КонецЕсли;
		Если Элемент.Представление = РолиДокументов.Отгрузка Тогда
			ЕстьРольОтгрузка = Истина;
		КонецЕсли;
		Если Элемент.Представление = РолиДокументов.КорректировкаОтгрузки Тогда
			ЕстьРольКорректировка = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьРольОтгрузка И ЕстьРольКорректировка Тогда
		ТекстОшибки = НСтр("ru = """
		+ "Выбрано недопустимое сочетание ролей документа. "
		+ "Уточните выбор и укажите только одно значение: Отгрузка или Корректировка отгрузки.""");
		МодульОбъекта().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор, "ПредставлениеРолейДокумента");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеРолейДокументаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Обработчик = МодульКлиента().ОписаниеОбработчикаОповещения("СписокРолейДокументаПослеРедактирования", ЭтаФорма);
	
	КонтекстФормы = МодульКлиента().Новый_ПараметрыФормыРедактированияСписка();
	
	КонтекстФормы.РазрешитьРедактирование = Истина;
	КонтекстФормы.Заголовок               = НСтр("ru = 'Роли документа учета'");
	КонтекстФормы.Список                  = СписокРолейДокумента;
	КонтекстФормы.ИспользоватьПометки     = Истина;
	
	МодульКлиента().ОткрытьФормуПросмотраСписка(ЭтаФорма, КонтекстФормы, Обработчик);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокРолейДокументаПослеРедактирования(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокРолейДокумента = Результат;
	СформироватьПредставлениеРолейДокумента();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьПредставлениеРолейДокумента()
	
	ТекстПредставленияРолей = "";
	Для Каждого Элемент Из СписокРолейДокумента Цикл
		Если Не Элемент.Пометка Тогда
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекстПредставленияРолей) Тогда
			ТекстПредставленияРолей = ТекстПредставленияРолей + ", " + Элемент.Представление;
		Иначе
			ТекстПредставленияРолей = Элемент.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ТекстПредставленияРолей) Тогда
		ТекстПредставленияРолей = НСтр("ru = '<Роль документа>'");
	КонецЕсли;
	
	ПредставлениеРолейДокумента = ТекстПредставленияРолей;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРеквизитовОперацийУстановитьОтбор()
	
	ТипОперации = Элементы.СписокТиповОпераций.ТекущиеДанные.Значение;
	ЗначениеОтбора = Новый ФиксированнаяСтруктура("ТипОперации", ТипОперации);
	Элементы.ТаблицаРеквизитовОпераций.ОтборСтрок = ЗначениеОтбора;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	Таблица = Элементы.ТаблицаРеквизитовОпераций;
	ПравилаЗаполнения = МодульОбъекта().Перечисление_ПравилаЗаполненияРеквизитов();
	Реквизиты = МодульОбъекта().Перечисление_РеквизитыОперацийДляАвтозаполнения();
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ПолеУО = ЭлементУО.Поля.Элементы.Добавить();
	ПолеУО.Поле = Новый ПолеКомпоновкиДанных(Таблица.ПутьКДанным + "Значение");
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Таблица.Имя + ".ПравилоЗаполнения");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = ПравилаЗаполнения.НеЗаполнять;
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	Для Каждого Страна Из МодульОбъекта().СписокСтранЕАЭС() Цикл
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ПолеУО = ЭлементУО.Поля.Элементы.Добавить();
		ПолеУО.Поле = Новый ПолеКомпоновкиДанных(Таблица.ПутьКДанным + "Значение");
		
		ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Таблица.Имя + ".ИмяРеквизита");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Реквизиты.КодСтраныПолучателя;
		
		ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Таблица.Имя + ".Значение");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Страна.Значение;
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Страна.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ОписаниеНастроекЗаполненияОперацийИзКонтекста()
	
	Результат = МодульОбъекта().Новый_НастройкиЗаполненияОпераций();
	ЗаполнитьЗначенияСвойств(Результат, ЭтаФорма);
	
	Для Каждого Элемент Из СписокТиповОпераций Цикл
		Если Элемент.Пометка Тогда
			Результат.ТипыОпераций.Добавить(Элемент.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаИБ Из Результат.ТаблицаРеквизитов Цикл
		Для Каждого СтрокаФормы Из ТаблицаРеквизитовОпераций Цикл
			Если СтрокаИБ.ТипОперации = СтрокаФормы.ТипОперации
				И СтрокаИБ.ИмяРеквизита = СтрокаФормы.ИмяРеквизита Тогда
				ЗаполнитьЗначенияСвойств(СтрокаИБ, СтрокаФормы);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

