
// #Область СлужебныеПеременныеИМетодыФормы

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента = Неопределено Тогда
		
		Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
			КэшМодуляКлиента = ВладелецФормы.МодульКлиента();
		Иначе
			ПутьКФорме = ПутьКФормеМодуляКлиента();
			КэшМодуляКлиента = ОткрытьФорму(ПутьКФорме);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат КэшМодуляКлиента;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

// #КонецОбласти

// #Область СлужебныйПрограммныйИнтерфейс

&НаКлиенте
Процедура КонтурПлагины_ОбработатьСлужебнуюКоманду(ИмяКоманды, ПараметрыКоманды) Экспорт
	
	МодульКлиента().КонтурПлагины_ОбработатьСлужебнуюКоманду(ИмяКоманды, ПараметрыКоманды);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтурПлагины_ОбработатьСлужебноеСобытие(ИмяСобытия, ПараметрыСобытия, СтандартнаяОбработка) Экспорт
	
	МодульКлиента().КонтурПлагины_ОбработатьСлужебноеСобытие(ИмяСобытия, ПараметрыСобытия, СтандартнаяОбработка);
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьЗаголовок();
	НастроитьЭлементыФормы();
	
	ОбновитьСписок();
	ПроверитьНаличиеОбновлений();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПриАктивизацииСтрокиСпискаПлагинов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурПлагины_ЗагруженНовыйПлагин" Тогда
		ОбновитьСписок();
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовТаблицыФормыПлагины_Список

&НаКлиенте
Процедура Плагины_СписокПриАктивизацииСтроки(Элемент)
	
	ПриАктивизацииСтрокиСпискаПлагинов()
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Плагины_ОткрытьБиблиотеку(Команда)
	
	МодульКлиента().ОткрытьФормуБиблиотекиПлагинов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Плагины_ОбновитьСписок(Команда)
	
	ОбновитьСписок();
	
КонецПроцедуры

&НаКлиенте
Процедура Плагин_Удалить(Команда)
	
	ТекСтрока = Элементы.Плагины_Список.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторПлагина = ТекСтрока.Идентификатор;
	ТекстВопроса = НСтр("ru = 'Плагин и его настройки будут удалены, продолжить?'");
	Обработчик = МодульКлиента().ОписаниеОбработчикаОповещения("Плагин_УдалитьЗавершение", ЭтаФорма, ИдентификаторПлагина);
	МодульКлиента().ПоказатьДиалогВопроса(Обработчик, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура Плагин_Включить(Команда)
	
	ТекСтрока = Элементы.Плагины_Список.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СлужебныеКоманды = МодульКлиента().Перечисление_СлужебныеКомандыБиблиотекиПлагинов();
	
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия.Вставить("Идентификатор", ТекСтрока.Идентификатор);
	ПараметрыСобытия.Вставить("Результат");
	
	МодульКлиента().КонтурПлагины_ОбработатьСлужебнуюКоманду(
		СлужебныеКоманды.ВключитьПлагин,
		ПараметрыСобытия
	);
	
	Результат = ПараметрыСобытия.Результат;
	Если НЕ Результат.Успешно Тогда
		ВызватьИсключение("При выполнении действия возникла ошибка:" + Символы.ПС + Символы.ПС + Результат.ОписаниеОшибки);
	КонецЕсли;
	
	ОбновитьСписок();
	
КонецПроцедуры

&НаКлиенте
Процедура Плагин_Отключить(Команда)
	
	ТекСтрока = Элементы.Плагины_Список.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СлужебныеКоманды = МодульКлиента().Перечисление_СлужебныеКомандыБиблиотекиПлагинов();
	
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия.Вставить("Идентификатор", ТекСтрока.Идентификатор);
	ПараметрыСобытия.Вставить("Результат");
	
	МодульКлиента().КонтурПлагины_ОбработатьСлужебнуюКоманду(
		СлужебныеКоманды.ОтключитьПлагин,
		ПараметрыСобытия
	);
	
	Результат = ПараметрыСобытия.Результат;
	Если НЕ Результат.Успешно Тогда
		ВызватьИсключение("При выполнении действия возникла ошибка:" + Символы.ПС + Символы.ПС + Результат.ОписаниеОшибки);
	КонецЕсли;
	
	ОбновитьСписок();
	
КонецПроцедуры

&НаКлиенте
Процедура Плагин_Открыть(Команда)
	
	ТекДанные = Элементы.Плагины_Список.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФормуНастроекПлагина(ТекДанные.Идентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура Плагины_ЗагрузитьИзФайла(Команда)
	
	Обработчик = МодульКлиента().ОписаниеОбработчикаОповещения("ОбработатьЗагрузкуФайла", ЭтаФорма);
	ПараметрыВыбора = МодульКлиента().Новый_ПараметрыДиалогаВыбораФайла();
	ПараметрыВыбора.Заголовок = НСтр("ru = 'Выберите плагин для загрузки'");
	ПараметрыВыбора.МножественныйВыбор = Ложь;
	
	МодульКлиента().ПоказатьДиалогВыбораФайла(Обработчик, ПараметрыВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура Плагины_ВыгрузитьФайл(Команда)
	
	ТекСтрока = Элементы.Плагины_Список.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Обработчик = МодульКлиента().ОписаниеОбработчикаОповещения(
		"ОбработатьСохранениеФайлаПлагина",
		ЭтаФорма,
		ТекСтрока.Идентификатор
	);
	
	МодульКлиента().ПоказатьДиалогСохраненияФайла(
		Обработчик,
		,
		НСтр("ru = 'Укажите путь для сохранения файла плагина'"),
		ТекСтрока.Идентификатор,
		"epf"
	);
	
КонецПроцедуры

&НаКлиенте
Процедура Плагин_Обновить(Команда)
	
	ТекСтрока = Элементы.Плагины_Список.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Результат = ЗагрузитьПлагинИзСервиса(
		ТекСтрока.Идентификатор,
		ТекСтрока.Представление,
		ТекСтрока.Версия
	);
	
	Если Не Результат.Успешно Тогда
		ВызватьИсключение("Не удалось загрузить плагин: "+Результат.ОписаниеОшибки);
	КонецЕсли;
	
	ОбновитьСписок();
	
КонецПроцедуры

&НаКлиенте
Процедура Плагин_ОткрытьПодробноеОписание(Команда)
	
	ТекущиеДанные = Элементы.Плагины_Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.СсылкаНаСправку) Тогда
		МодульКлиента().ОткрытьИнтернетСтраницу(ТекущиеДанные.СсылкаНаСправку);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьСистемныеКнопки(Команда)
	
	Элементы.ГруппаСистемные.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Плагины_ПроверитьНаличиеОбновлений(Команда)
	
	ПроверитьНаличиеОбновлений();
	ПриАктивизацииСтрокиСпискаПлагинов();
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьЗаголовок()
	
	Настройки = МодульОбъекта().НастройкиМодуля();
	
	Если Настройки.РежимОтладки Тогда
		
		Заголовок = МодульОбъекта().ПараметрыВСтроку(
			НСтр("ru = '%1 (каталог отладки: %2)'"),
			Заголовок,
			Настройки.КаталогОтладки
		);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы()
	
	СлужебныеКоманды = МодульОбъекта().Перечисление_СлужебныеКомандыБиблиотекиПлагинов();
	
	ПараметрыСобытия = Новый Структура("Результат");
	МодульОбъекта().КонтурПлагины_ОбработатьСлужебнуюКоманду(
		СлужебныеКоманды.ПроверитьВозможностьНастройки,
		ПараметрыСобытия
	);
	
	Результат = ПараметрыСобытия.Результат;
	
	Если Не Результат.Успешно Тогда
		
		Элементы.Предупреждение_ОписаниеОшибки.Заголовок = Результат.ОписаниеОшибки;
		Элементы.ГруппаПредупреждениеНастройки.Видимость = Истина;
		
		Элементы.ГруппаКоманднаяПанельСпискаПлагиновОсновная.Доступность = Ложь;
		Элементы.ГруппаПлагин_КоманднаяПанель.Доступность = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписок()
	
	Плагины_Список.Очистить();
	
	СостоянияПлагина = МодульОбъекта().Перечисление_СостоянияПлагина();
	СлужебныеКоманды = МодульОбъекта().Перечисление_СлужебныеКомандыБиблиотекиПлагинов();
	
	ПараметрыСобытия = Новый Структура("Результат");
	МодульОбъекта().КонтурПлагины_ОбработатьСлужебнуюКоманду(
		СлужебныеКоманды.ПолучитьСписокПлагинов,
		ПараметрыСобытия
	);
	
	Для Каждого Плагин Из ПараметрыСобытия.Результат Цикл
		
		СтрокаСписка = Плагины_Список.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСписка, Плагин);
		
		Если СтрокаСписка.Состояние = СостоянияПлагина.Включен Тогда
			СтрокаСписка.КартинкаСтатус = 1;
		КонецЕсли;
		
		Если Не СтрокаСписка.ЕстьОбновление Тогда
			СтрокаСписка.КартинкаОбновление = 1;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаличиеОбновлений()
	
	СлужебныеКоманды = МодульОбъекта().Перечисление_СлужебныеКомандыБиблиотекиПлагинов();
	
	ПараметрыСобытия = Новый Структура("Результат");
	МодульОбъекта().КонтурПлагины_ОбработатьСлужебнуюКоманду(
		СлужебныеКоманды.ПроверитьНаличиеОбновлений,
		ПараметрыСобытия
	);
	
	РезультатПроверки = ПараметрыСобытия.Результат;
	Если Не РезультатПроверки.Успешно Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ОписаниеОбновления Из РезультатПроверки.Данные Цикл
		
		Отбор = Новый Структура("Идентификатор", ОписаниеОбновления.Идентификатор);
		НайденныеСтроки = Плагины_Список.НайтиСтроки(Отбор);
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			НайденнаяСтрока = НайденныеСтроки[0];
			НайденнаяСтрока.ЕстьОбновление = Истина;
			НайденнаяСтрока.КартинкаОбновление = 0;
			НайденнаяСтрока.Описание = ОписаниеОбновления.Описание;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриАктивизацииСтрокиСпискаПлагинов()
	
	ТекСтрока = Элементы.Плагины_Список.ТекущиеДанные;
	
	ЕстьДанные = (ТекСтрока <> Неопределено);
	Элементы.ГруппаПлагины_Право.Видимость = ЕстьДанные;
	
	Если Не ЕстьДанные Тогда
		Возврат;
	КонецЕсли;
	
	СостоянияПлагина = МодульКлиента().Перечисление_СостоянияПлагина();
	
	ПлагинАктивен = Ложь;
	Если ТекСтрока.Состояние = СостоянияПлагина.Включен
		Или ТекСтрока.Состояние = СостоянияПлагина.Отладка
		Или ТекСтрока.Состояние = СостоянияПлагина.ТребуетсяНастройка Тогда
		ПлагинАктивен = Истина;
	КонецЕсли;
	
	Элементы.Плагин_Отключить.Видимость = ПлагинАктивен;
	Элементы.Плагин_Включить.Видимость = Не ПлагинАктивен;
	Элементы.Плагин_Обновить.Видимость = ТекСтрока.ЕстьОбновление И ПлагинАктивен;
	Элементы.Плагин_Открыть.Видимость = ТекСтрока.ЕстьНастройки И ПлагинАктивен;
	Элементы.Плагин_ОткрытьСправку.Видимость = ЗначениеЗаполнено(ТекСтрока.СсылкаНаСправку);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастроекПлагина(Идентификатор)
	
	МодульКлиента().ОткрытьНастройкиПлагина(Идентификатор, ЭтаФорма);
	
КонецПроцедуры 

&НаКлиенте
Функция ЗагрузитьПлагинИзФайла(Идентификатор, Файл)
	
	СлужебныеКоманды = МодульКлиента().Перечисление_СлужебныеКомандыБиблиотекиПлагинов();
	
	ПараметрыСобытия = Новый Структура();
	ПараметрыСобытия.Вставить("ДвоичныеДанные", Файл);
	ПараметрыСобытия.Вставить("Идентификатор", Идентификатор);
	ПараметрыСобытия.Вставить("Представление", Идентификатор);
	ПараметрыСобытия.Вставить("Версия", "");
	
	МодульКлиента().КонтурПлагины_ОбработатьСлужебнуюКоманду(
		СлужебныеКоманды.ЗагрузитьПлагин,
		ПараметрыСобытия
	);
	
	Результат = ПараметрыСобытия.Результат;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЗагрузитьПлагинИзСервиса(Идентификатор, Представление, Версия)
	
	СлужебныеКоманды = МодульКлиента().Перечисление_СлужебныеКомандыБиблиотекиПлагинов();
	
	ПараметрыСобытия = Новый Структура();
	ПараметрыСобытия.Вставить("ДвоичныеДанные", Неопределено);
	ПараметрыСобытия.Вставить("Идентификатор", Идентификатор);
	ПараметрыСобытия.Вставить("Представление", Представление);
	ПараметрыСобытия.Вставить("Версия", Версия);
	
	МодульКлиента().КонтурПлагины_ОбработатьСлужебнуюКоманду(
		СлужебныеКоманды.ЗагрузитьПлагин,
		ПараметрыСобытия
	);
	
	Результат = ПараметрыСобытия.Результат;
	
	Возврат Результат;
	
КонецФункции

// #Область ОбработчикиОписанийОповещений

&НаКлиенте
Процедура ОбработатьЗагрузкуФайла(ВыбранныеФайлы, ДопПараметры = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ВыбранныеФайлы) Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКФайлу = ВыбранныеФайлы[0];
	Файл = МодульКлиента().НовыйФайл(ПутьКФайлу);
	
	// BSLLS:FileSystemAccess-off
	ДвоичныеДанные = Новый ДвоичныеДанные(Файл.ПолноеИмя);
	// BSLLS:FileSystemAccess-on
	
	ЗагрузитьПлагинИзФайла(Файл.ИмяБезРасширения, ДвоичныеДанные);
	
	ОбновитьСписок();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСохранениеФайлаПлагина(ВыбранныеФайлы, ИдентификаторПлагина) Экспорт
	
	Если Не ЗначениеЗаполнено(ВыбранныеФайлы) Тогда
		Возврат;
	КонецЕсли;
	
	СлужебныеКоманды = МодульКлиента().Перечисление_СлужебныеКомандыБиблиотекиПлагинов();
	
	ПутьКФайлу = ВыбранныеФайлы[0];
	
	ФайлПлагина = МодульКлиента().НовыйФайл(ПутьКФайлу);
	Если ФайлПлагина.ИмяБезРасширения <> ИдентификаторПлагина Тогда
		ВызватьИсключение НСтр("ru = 'Имя файла плагина изменять нельзя!'");
	КонецЕсли;
	
	ПараметрыСобытия = Новый Структура("Идентификатор", ИдентификаторПлагина);
	МодульКлиента().КонтурПлагины_ОбработатьСлужебнуюКоманду(
		СлужебныеКоманды.ПолучитьФайлПлагина,
		ПараметрыСобытия
	);
	
	ДвоичныеДанныеФайла = ПараметрыСобытия.Результат;
	ДвоичныеДанныеФайла.Записать(ПутьКФайлу);
	
КонецПроцедуры

&НаКлиенте
Процедура Плагин_УдалитьЗавершение(РезультатВопроса, ИдентификаторПлагина) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	СлужебныеКоманды = МодульКлиента().Перечисление_СлужебныеКомандыБиблиотекиПлагинов();
	
	ИдентификаторПлагина = Элементы.Плагины_Список.ТекущиеДанные.Идентификатор;
	
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия.Вставить("Результат");
	ПараметрыСобытия.Вставить("Идентификатор", ИдентификаторПлагина);
	
	МодульКлиента().КонтурПлагины_ОбработатьСлужебнуюКоманду(
		СлужебныеКоманды.УдалитьПлагин,
		ПараметрыСобытия
	);
	
	Результат = ПараметрыСобытия.Результат;
	
	Если Не Результат.Успешно Тогда
		ТекстОшибки = МодульКлиента().ПараметрыВСтроку(НСтр(
		"ru = 'Не удалось удалить плагин:
		|%1'"),
		Результат.ОписаниеОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	ОбновитьСписок();
	
КонецПроцедуры

// #КонецОбласти

// #КонецОбласти