
&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		Результат = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		Результат = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Ссылка", Ссылка);
	Параметры.Свойство("РежимВыбора", РежимВыбора);
	
	ЗаполнитьДанныеФормы();
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		ПодобратьКлючНоменклатуры1С();
	Иначе
		Ссылка = Неопределено;
	КонецЕсли;
	
	Закрыть(Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормы()
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	Номенклатура = ОбщегоНазначенияКонтурМаркировка.СсылкаПоИдентификатору(Ссылка.КлючНоменклатуры, Ссылка.ТипКлючаНоменклатуры);
	Характеристика = ОбщегоНазначенияКонтурМаркировка.СсылкаПоИдентификатору(Ссылка.КлючХарактеристики, Ссылка.ТипКлючаХарактеристики);
	Упаковка = ОбщегоНазначенияКонтурМаркировка.СсылкаПоИдентификатору(Ссылка.КлючУпаковки, Ссылка.ТипКлючаУпаковки);
	Серия = ОбщегоНазначенияКонтурМаркировка.СсылкаПоИдентификатору(Ссылка.КлючСерии, Ссылка.ТипКлючаСерии);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы()
	
	ТолькоПросмотр = Не РежимВыбора;
	Элементы.Кнопка_Выбрать.Доступность = РежимВыбора;
	
	ТипыОбъектов = МодульОбъекта().ТипыОбъектовИС();
	
	Если ЗначениеЗаполнено(ТипыОбъектов.Номенклатура) Тогда
		МодульОбъекта().УстановитьОграничениеПоТипу(Элементы.Номенклатура, ТипыОбъектов.Номенклатура);
	Иначе
		Элементы.Номенклатура.Видимость = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипыОбъектов.Характеристика) Тогда
		МодульОбъекта().УстановитьОграничениеПоТипу(Элементы.Характеристика, ТипыОбъектов.Характеристика);
		МодульОбъекта().УстановитьСвязьЭлементовПоНоменклатуре(Элементы.Характеристика);
	Иначе
		Элементы.Характеристика.Видимость = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипыОбъектов.Упаковка) Тогда
		МодульОбъекта().УстановитьОграничениеПоТипу(Элементы.Упаковка, ТипыОбъектов.Упаковка);
		МодульОбъекта().УстановитьСвязьЭлементовПоНоменклатуре(Элементы.Упаковка);
	Иначе
		Элементы.Упаковка.Видимость = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипыОбъектов.Серия) Тогда
		МодульОбъекта().УстановитьОграничениеПоТипу(Элементы.Серия, ТипыОбъектов.Серия);
		МодульОбъекта().УстановитьСвязьЭлементовПоНоменклатуреИХарактеристике(Элементы.Серия);
	Иначе
		Элементы.Серия.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПодобратьКлючНоменклатуры1С()
	
	АналитикаНоменклатуры = МодульОбъекта().Новый_АналитикаНоменклатуры1С();
	ЗаполнитьЗначенияСвойств(АналитикаНоменклатуры, ЭтаФорма);
	Ссылка = МодульОбъекта().КлючНоменклатуры1С_Подобрать(АналитикаНоменклатуры);
	
КонецПроцедуры
