
// #Область СлужебныеПеременныеИМетодыФормы

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		Результат = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		Результат = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

// #КонецОбласти

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	
	ЗаполнитьПериодПоУмолчанию();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьЗаголовокПериода();
	УстановитьОтборПоПериоду();
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИзменитьПериод(Команда)
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПослеВыбораПериода", ЭтаФорма);
	МодульКлиента().ПоказатьДиалогРедактированияСтандартногоПериода(ОписаниеОбработчика, Период);
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.РежимВыбора Тогда
		ОповеститьОВыборе(ВыбраннаяСтрока);
	Иначе
		МодульКлиента().ОткрытьФормуТовара(ВыбраннаяСтрока, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	МодульКлиента().ОткрытьФормуОперации(Элемент.ТекущиеДанные.Ссылка, ЭтаФорма);
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиОповещений

&НаКлиенте
Процедура ПослеВыбораПериода(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Период = Результат;
	
	ОграничитьПериод();
	УстановитьЗаголовокПериода();
	ОбновитьСписок();
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьСписок()
	
	УстановитьОтборПоПериоду();
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОграничитьПериод()
	
	Если Не ЗначениеЗаполнено(Период.ДатаНачала)
		И Не ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		Период.Вариант = ВариантСтандартногоПериода.ЭтаНеделя;
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(Период.ДатаНачала) Тогда
		Период.ДатаНачала = НачалоНедели(Период.ДатаОкончания);
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		Период.ДатаОкончания = КонецНедели(Период.ДатаНачала);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоПериоду()
	
	ПараметрДатаНачала = Список.Параметры.Элементы.Найти("ДатаНачала");
	ПараметрДатаОкончания = Список.Параметры.Элементы.Найти("ДатаОкончания");
	
	ПараметрДатаНачала.Значение = Период.ДатаНачала;
	ПараметрДатаОкончания.Значение = Период.ДатаОкончания;
	
	ПараметрДатаНачала.Использование = Истина;
	ПараметрДатаОкончания.Использование = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокПериода()
	
	Если Период.Вариант = ВариантСтандартногоПериода.Месяц
		Или Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод Тогда
		СтрокаПериода = ПредставлениеПериода(Период.ДатаНачала, Период.ДатаОкончания);
	Иначе
		СтрокаПериода = Строка(Период);
	КонецЕсли;
	
	Элементы.Кнопка_Период.Заголовок = СтрокаПериода;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодПоУмолчанию()
	
	Период.Вариант = ВариантСтандартногоПериода.ЭтаНеделя;
	
КонецПроцедуры

// #КонецОбласти
