
&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		Результат = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		Результат = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьФорму();
	
	ТекущаяСтраница = Параметры.ТекущаяСтраница;
	Если ТекущаяСтраница = "НастройкиДокументовУчета" Тогда
		Элементы.Закладки.ТекущаяСтраница = Элементы.Закладка_НастройкиДокументовУчета;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ВладелецФормы = Неопределено Тогда
		Если Найти(ВладелецФормы.ИмяФормы,"Форма_ШаблонЭтикетки")>0 Тогда
			Элементы.Закладки.ТекущаяСтраница = Элементы.Закладка_ПараметрыЭтикеток;
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьСтатусОчисткиУстаревшихДанных();
	ОбновитьНадписьРасписанияОчисткиУстаревшихДанных();
	ОбновитьСтатусВыполненияРегламентныхДействий();
	ОбновитьНадписьРасписаниеРегламентныхДействий();
	ОбновитьНадписьРасписаниеОбновленияМодуля();
	ОбновитьОписаниеСортировкиЭтикеток();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	МодульКлиента().СохранитьИзмененияНаФорме("ЗаписатьИЗакрыть", ЭтаФорма, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурМаркировка_НастройкаДокументаУчета_Изменен" Тогда
		ОбновитьНастройкиДокументовУчета();
	КонецЕсли;
	
	Если ИмяСобытия = "КонтурМаркировка_НастройкиМодуля_Обновлены" И Источник <> ЭтаФорма Тогда
		ЗаполнитьФорму();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ВариантыРасположения = МодульОбъекта().Перечисление_ВариантыРасположенияОбработки();
	
	Если Прокси_Использовать Тогда
		ПроверяемыеРеквизиты.Добавить("Прокси_Адрес");
		ПроверяемыеРеквизиты.Добавить("Прокси_Порт");
		Если ЗначениеЗаполнено(Прокси_Логин) Тогда
			ПроверяемыеРеквизиты.Добавить("Прокси_Пароль");
		КонецЕсли;
	КонецЕсли;
	
	Если ПМ_Использовать Тогда
		Если ПМ_Расположение = ВариантыРасположения.НаДиске Тогда
			ПроверяемыеРеквизиты.Добавить("ПМ_Путь");
		ИначеЕсли ПМ_Расположение = ВариантыРасположения.ВСправочнике Тогда
			ПроверяемыеРеквизиты.Добавить("ПМ_Ссылка");
		ИначеЕсли ПМ_Расположение = ВариантыРасположения.ВКонфигурации Тогда
			ПроверяемыеРеквизиты.Добавить("ПМ_ИмяОбработки");
		Иначе
			ПроверяемыеРеквизиты.Добавить("ПМ_Расположение");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСлужебныеНастройки(Команда)
	
	Элементы.Закладка_СлужебныеНастройки.Видимость = Истина;
	
	Элементы.Закладки.ТекущаяСтраница = Элементы.Закладка_СлужебныеНастройки;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	Если ЗаписатьНастройки() Тогда
		ПровестиОпросПользователяИЗакрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЗаписатьНастройки()
	
	Если Не ПроверитьЗаполнение()
		Или Не ПроверитьПодключениеПМ()
		Или Не ПроверитьЗаполнениеРеквизитов() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОписаниеНастроек = ОписаниеНастроекПоКонтексту();
	
	МодульКлиента().НастройкиМодуля_Записать(ОписаниеНастроек, ЭтаФорма);
	
	Если ОбновленаПериодичностьОчисткиУстаревшихДанных Тогда
		СохранитьПериодичностьОчисткиУстаревшихДанных();
	КонецЕсли;
	
	Если ОбновленоРасписаниеРегламентныхДействий
		Или ОбновленоИмяПользователяДляЗапускаРегламентныхДействий Тогда
		СохранитьПараметрыРегламентныхДействий();
	КонецЕсли;

	Если ОбновленоРасписаниеОбновленияМодуля Тогда
		СохранитьРасписаниеОбновленияМодуля();
	КонецЕсли;
	
	Если ИзмененыМаркируемыеТоварныеГруппы Тогда
		СохранитьМаркируемыеТоварныеГруппы();
	КонецЕсли;
	
	Модифицированность = Ложь;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура СохранитьПериодичностьОчисткиУстаревшихДанных()
	
	ПериодичностьЗаданий = МодульОбъекта().Перечисление_ПериодичностьВыполненияЗаданий();
	ИспользоватьЗадание = (ПериодичностьОчисткиУстаревшихДанных = ПериодичностьЗаданий.ПоРасписанию);
	МодульОбъекта().ОбновитьЗаданиеОчисткиУстаревшихДанных(ИспользоватьЗадание, РасписаниеОчисткиУстаревшихДанных);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьПараметрыРегламентныхДействий()
	
	МодульОбъекта().ОбновитьЗаданиеВыполнитьРегламентныеДействия(РасписаниеРегламентныхДействий, ИмяПользователяДляЗапускаРегламентныхДействий);
	ОбновленоРасписаниеРегламентныхДействий = Ложь;
	ОбновленоИмяПользователяДляЗапускаРегламентныхДействий = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьРасписаниеОбновленияМодуля()
	
	МодульОбъекта().ОбновитьЗаданиеОбновлениеМодуля(РасписаниеОбновленияМодуля, ОбновлятьАвтоматически);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьМаркируемыеТоварныеГруппы()
	
	МассивМаркируемыхТГ = Новый Массив;
	
	Для каждого Стр Из МаркируемыеТоварныеГруппы Цикл
		МаркируемаяТГ = МодульОбъекта().Новый_МаркируемаяТоварнаяГруппа();
		ЗаполнитьЗначенияСвойств(МаркируемаяТГ, Стр);
		МассивМаркируемыхТГ.Добавить(МаркируемаяТГ);
	КонецЦикла;
	
	МодульОбъекта().МаркируемыеТоварныеГруппы_ПерезаписатьНастройки(МассивМаркируемыхТГ);
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьПодключениеПМ()
	
	Результат = Истина;
	
	Если ПМ_Использовать Тогда
		Результат = ПроверитьПодключениеПМНаСервере(ОписаниеНастроекПоКонтексту());
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПроверитьПодключениеПМНаСервере(Настройки)
	
	Возврат МодульОбъекта().ПМ_ПроверитьПодключение(Настройки);
	
КонецФункции

&НаСервере
Функция ОписаниеНастроекПоКонтексту()
	
	Результат = МодульОбъекта().НастройкиМодуля();
	ЗаполнитьЗначенияСвойств(Результат, ЭтаФорма);
	
	Результат.ДопПараметрыПечатиШаблонаЭтикеток.Очистить();
	Для Каждого Стр Из ДопПараметрыЭтикеток Цикл
		ДопПараметр = Новый Структура("Имя,Формула", Стр.Имя, Стр.Формула);
		Результат.ДопПараметрыПечатиШаблонаЭтикеток.Добавить(ДопПараметр);
	КонецЦикла;
	
	Результат.ПМ_ДопПараметры.Очистить();
	Результат.ПМ_БезопасныеДопПараметры.Очистить();
	Для Каждого Стр Из ДопПараметрыПМ Цикл
		Если Стр.ЭтоБезопасноеЗначение Тогда
			Результат.ПМ_БезопасныеДопПараметры.Вставить(Стр.Ключ, Стр.БезопасноеЗначение);
		Иначе
			Результат.ПМ_ДопПараметры.Вставить(Стр.Ключ, Стр.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Если РежимРИБ Тогда
		ЗаполнитьЗначенияСвойств(Результат.НастройкиУзлаРИБ, ЭтаФорма);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьФорму()
	
	ЗаполнитьКонтекстФормы();
	НастроитьТипыЭлементовФормы();
	НастроитьЭлементыФормы(ЭтаФорма, МодульОбъекта());
	НастроитьГруппуПериодичностиОчистки();
	ПоказатьОбработкуВыполненияФоновыхЗаданий82();
	ЗаполнитьСпискиВыбораЭлементовФормы();
	ОбновитьНастройкиДокументовУчета();
	ОбновитьМаркируемыеТоварныеГруппы();
	ЗаполнитьИнструкциюКакПисатьФормулу();
	СкрытьЗакладкуСлужебныхНастроек();
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтекстФормы()
	
	ОбновитьКэш = Истина;
	Настройки = МодульОбъекта().НастройкиМодуля(ОбновитьКэш);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Настройки);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Настройки.НастройкиУзлаРИБ);
	
	ДопПараметрыПечатиШаблонаЭтикеток = Настройки.ДопПараметрыПечатиШаблонаЭтикеток;
	Если ТипЗнч(ДопПараметрыПечатиШаблонаЭтикеток) = Тип("Массив") Тогда
		Для Каждого Стр Из ДопПараметрыПечатиШаблонаЭтикеток Цикл
			НоваяСтрока = ДопПараметрыЭтикеток.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
		КонецЦикла;
	КонецЕсли;
	
	ЗаполнитьТаблицуДопПараметрыПМ(Настройки.ПМ_ДопПараметры, Настройки.ПМ_БезопасныеДопПараметры);
	
	ОписаниеДоработокМодуля = МодульОбъекта().ОписаниеДоработокМодуля();
	РасписаниеОчисткиУстаревшихДанных = МодульОбъекта().РасписаниеОчисткиУстаревшихДанных();
	РасписаниеРегламентныхДействий = МодульОбъекта().РасписаниеРегламентныхДействий();
	ИмяПользователяДляЗапускаРегламентныхДействий = МодульОбъекта().ИмяПользователяДляЗапускаРегламентныхДействий();
	РасписаниеОбновленияМодуля = МодульОбъекта().РасписаниеОбновленияМодуля();
	ИдентификаторИнформационнойБазы = МодульОбъекта().ИдентификаторИнформационнойБазы();
	ЭтоГлавныйУзел = ПланыОбмена.ГлавныйУзел() = Неопределено;
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьЭлементыФормы(Форма, МодульОбработки)
	
	Элементы		 = Форма.Элементы;
	ПМ_Расположение	 = Форма.ПМ_Расположение;
	ПМ_Использовать	 = Форма.ПМ_Использовать;
	Прокси_Использовать = Форма.Прокси_Использовать;
	
	ВариантыРасположения = МодульОбработки.Перечисление_ВариантыРасположенияОбработки();
	
	Элементы.ПМ_Путь.Видимость = (ПМ_Расположение = ВариантыРасположения.НаДиске);
	Элементы.ПМ_Ссылка.Видимость = (ПМ_Расположение = ВариантыРасположения.ВСправочнике);
	Элементы.ПМ_ИмяОбработки.Видимость = (ПМ_Расположение = ВариантыРасположения.ВКонфигурации);
	Элементы.Группа_РасположениеПМ.Доступность = ПМ_Использовать;
	Элементы.Группа_ДопПараметрыПМ.Доступность = ПМ_Использовать;
	
	Элементы.МаркируемыеТоварныеГруппыВидПродукции1С.Видимость = Форма.ОпределенТипВидовПродукции1С;
	
	Элементы.Группа_НастройкиПрокси.Доступность = Прокси_Использовать;
	
	МодульДоработан = ЗначениеЗаполнено(Форма.ОписаниеДоработокМодуля);
	Элементы.Закладка_ОписаниеДоработокМодуля.Видимость = МодульДоработан;
	
	Элементы.АдресТестовогоСервиса.Доступность = Форма.ТестовоеОкружение;
	
	НастроитьЗакладкуОчисткиУстаревшихДанных(Форма, МодульОбработки);
	
	ИспользоватьПлагины = Форма.ИспользоватьПлагины;
	Элементы.ОткрытьСписокПлагинов.Видимость = ИспользоватьПлагины;
	
	РежимОтладки = Форма.РежимОтладки;
	Элементы.КаталогОтладки.Видимость = РежимОтладки;
	Элементы.Кнопка_ВыгрузитьВложенныеОбработки.Видимость = РежимОтладки;
	Элементы.ОписаниеВыгрузкиОбработок.Видимость = РежимОтладки;
	
	Элементы.НадписьРасписаниеОбновленияМодуля.Видимость = Форма.ОбновлятьАвтоматически;
	
	Элементы.ГруппаРИБ.Доступность = Форма.РежимРИБ;
	Элементы.РазрешитьОбменПоВсемОбъектамВГлавномУзле.Доступность = Форма.ЭтоГлавныйУзел;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписьРасписанияОчисткиУстаревшихДанных()
	
	Элементы.НадписьРасписанияОчисткиУстаревшихДанных.Заголовок = Строка(РасписаниеОчисткиУстаревшихДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписьРасписаниеРегламентныхДействий()
	
	Элементы.НадписьРасписаниеРегламентныхДействий.Заголовок = Строка(РасписаниеРегламентныхДействий);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписьРасписаниеОбновленияМодуля()
	
	Элементы.НадписьРасписаниеОбновленияМодуля.Заголовок = Строка(РасписаниеОбновленияМодуля);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьКнопкуВыполненияРегламентныхДействий(РегламентныеДействияВыполняются)
	
	Кнопка = Элементы.Кнопка_ВыполнитьРегламентныеДействия;
	
	Если РегламентныеДействияВыполняются Тогда
		Кнопка.Заголовок = НСтр("ru = 'Выполняются регламентные действия...'");
		Кнопка.Доступность = Ложь;
	Иначе
		Кнопка.Заголовок = НСтр("ru = 'Выполнить регламентные действия'");
		Кнопка.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьКнопкуОчисткиУстаревшихДанных(ОчисткаДанныхВыполняется)
	
	Кнопка = Элементы.Кнопка_ОчисткиУстаревшихДанных;
	
	Если ОчисткаДанныхВыполняется Тогда
		Кнопка.Заголовок = НСтр("ru = 'Выполняется удаление...'");
		Кнопка.Доступность = Ложь;
	Иначе
		Кнопка.Заголовок = НСтр("ru = 'Удалить устаревшие данные сейчас'");
		Кнопка.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьТипыЭлементовФормы()
	
	ТипыОбъектов = МодульОбъекта().ТипыОбъектовИС();
	
	Если ЗначениеЗаполнено(ТипыОбъектов.ВнешняяОбработка) Тогда
		МодульОбъекта().УстановитьОграничениеПоТипу(Элементы.ПМ_Ссылка, ТипыОбъектов.ВнешняяОбработка);
	КонецЕсли;
	
	ТипВидПродукции = ТипыОбъектов.ВидПродукции;
	Если ЗначениеЗаполнено(ТипВидПродукции) Тогда
		ОпределенТипВидовПродукции1С = Истина;
		МодульОбъекта().УстановитьОграничениеПоТипу(Элементы.МаркируемыеТоварныеГруппыВидПродукции1С, ТипВидПродукции);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокЗначениямиПеречисления(Список,СтруктураПеречисления)
	
	Список.Очистить();
	
	Для Каждого Зн Из СтруктураПеречисления Цикл
		Список.Добавить(Зн.Значение);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбораЭлементовФормы()
	
	ЗаполнитьСписокВыбораРасположенияПМ();
	ЗаполнитьСписокВыбораАдресаТестовогоСервиса();
	ЗаполнитьСписокВыбораВидПродукцииПоУмолчанию();
	ЗаполнитьСписокВыбораТипОплатыКодовПоУмолчанию();
	ЗаполнитьСписокВыбораТипИспользованияПоУмолчанию();
	ЗаполнитьСписокВыбораРежимОкругленияПоУмолчанию();
	ЗаполнитьСписокВыбораСпособВводаВОборотПоУмолчанию();
	ЗаполнитьСписокВыбораСпособВыпускаТоваровПоУмолчанию();
	ЗаполнитьСписокВыбораПериодичностьОчисткиУстаревшихДанных();
	ЗаполнитьСписокВыбораСобытиеДляОчисткиПула();
	ЗаполнитьСписокВыбораВидМаркируемойПродукции();
	ЗаполнитьСписокВыбораФорматКодов();
	ЗаполнитьСписокВыбораТипПроизводственногоЗаказа();
	ЗаполнитьСписокВыбораТипУчастникаВводящегоВОборот();
	ЗаполнитьСписокВыбораПланаОбмена();
	ЗаполнитьСписокВыбораИмяПользователяДляЗапускаРегламентныхДействий();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораРасположенияПМ()
	
	ВариантыРасположения = МодульОбъекта().Перечисление_ВариантыРасположенияОбработки();
	
	СписокВыбора = Элементы.ПМ_Расположение.СписокВыбора;
	
	ЗначенияСписка = Новый СписокЗначений;
	ЗначенияСписка.Добавить(ВариантыРасположения.НаДиске);
	ЗначенияСписка.Добавить(ВариантыРасположения.ВСправочнике);
	ЗначенияСписка.Добавить(ВариантыРасположения.ВКонфигурации);
	
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораАдресаТестовогоСервиса()
	
	Адреса = МодульОбъекта().ИнтернетАдреса();
	СписокВыбора = Элементы.АдресТестовогоСервиса.СписокВыбора;
	СписокВыбора.Добавить("", Адреса.СервисКонтурМаркировкаТестовый);
	
	Для каждого Эл Из Адреса Цикл
		Если Найти(Эл.Ключ, "СервисКонтурМаркировкаТестовый") > 0
			И Эл.Значение <> Адреса.СервисКонтурМаркировкаТестовый Тогда
			СписокВыбора.Добавить(Эл.Значение);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораВидПродукцииПоУмолчанию()
	
	СписокВыбора = Элементы.ВидПродукцииПоУмолчанию.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().ВсеВидыПродукции();
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораВидМаркируемойПродукции()
	
	СписокВыбора = Элементы.МаркируемыеТоварныеГруппыВидПродукции.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().ВсеВидыПродукции();
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораТипОплатыКодовПоУмолчанию()
	
	СписокВыбора = Элементы.ТипОплатыКодовПоУмолчанию.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().Перечисление_ТипыОплатыКодов();
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораТипИспользованияПоУмолчанию()
	
	СписокВыбора = Элементы.ТипИспользованияПоУмолчанию.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().Перечисление_ТипыИспользованияКодов();
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораСпособВводаВОборотПоУмолчанию()
	
	СписокВыбора = Элементы.СпособВводаВОборотПоУмолчанию.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().Перечисление_СпособыВводаВОборот();
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораСпособВыпускаТоваровПоУмолчанию()
	
	СписокВыбора = Элементы.СпособВыпускаТоваровПоУмолчанию.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().Перечисление_СпособыВыпускаТоваров();
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораРежимОкругленияПоУмолчанию()
	
	СписокВыбора = Элементы.РежимОкругленияПоУмолчанию.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().Перечисление_РежимыОкругления();
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораПериодичностьОчисткиУстаревшихДанных()
	
	СписокВыбора = Элементы.ПериодичностьОчисткиУстаревшихДанных.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().Перечисление_ПериодичностьВыполненияЗаданий();
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораТипПроизводственногоЗаказа()
	
	СписокВыбора = Элементы.ТипПроизводственногоЗаказаПоУмолчанию.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().Перечисление_ТипыПроизводственныхЗаказов();
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораТипУчастникаВводящегоВОборот()
	
	СписокВыбора = Элементы.ТипУчастникаВводящегоВОборотПоУмолчанию.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().Перечисление_ТипыУчастниковВводящихВОборот();
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораСобытиеДляОчисткиПула()
	
	СписокВыбора = Элементы.СобытиеДляУдаленияПолныхКодов.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().Перечисление_СобытияДляУдаленияПолныхКодов();
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораФорматКодов()
	
	СписокВыбора = Элементы.ФорматКодовПоУмолчанию.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().Перечисление_ФорматыКодов();
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура ТестовоеОкружениеПриИзменении(Элемент)
	
	НастроитьЭлементыФормы(ЭтаФорма, МодульКлиента());
	
КонецПроцедуры

&НаКлиенте
Процедура ПМ_РасположениеПриИзменении(Элемент)
	
	НастроитьЭлементыФормы(ЭтаФорма, МодульКлиента());
	ДопПараметрыПМЗаполнитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПМ_ИспользоватьПриИзменении(Элемент)
	
	НастроитьЭлементыФормы(ЭтаФорма, МодульКлиента());
	
КонецПроцедуры

&НаКлиенте
Процедура Прокси_ИспользоватьПриИзменении(Элемент)
	
	НастроитьЭлементыФормы(ЭтаФорма, МодульКлиента());
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	
	ПроверитьПодключениеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьПодключениеНаСервере()
	
	НастройкиПрокси = НастройкиПроксиПоДаннымФормы();
	ЕстьПодключение = МодульОбъекта().Маркировка_ПроверитьПодключение(НастройкиПрокси);
	
	Если ЕстьПодключение Тогда
		ЗеленыйЦвет = Новый Цвет(0, 128, 0);
		РезультатПроверкиИнтернета = НСтр("ru = 'Подключение успешно установлено!'");
		Элементы.РезультатПроверкиИнтернета.ЦветТекста = ЗеленыйЦвет;
	Иначе
		КрасныйЦвет = Новый Цвет(255, 0, 0);
		РезультатПроверкиИнтернета = НСтр("ru = 'Возникла ошибка установки подключения!'");
		Элементы.РезультатПроверкиИнтернета.ЦветТекста = КрасныйЦвет;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НастройкиПроксиПоДаннымФормы()
	
	Результат = МодульОбъекта().Новый_НастройкиПрокси();
	
	Если Прокси_Использовать Тогда
		
		ВариантыНастроек = МодульОбъекта().Перечисление_ВариантыНастроекПроксиСервера();
		Результат.ВариантНастроек = ВариантыНастроек.СвоиНастроки;
		
		Результат.Адрес	 = Прокси_Адрес;
		Результат.Порт	 = Прокси_Порт;
		Результат.Логин	 = Прокси_Логин;
		Результат.Пароль = Прокси_Пароль;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОбновитьНастройкиДокументовУчета()
	
	НастройкиДокументовУчета.Очистить();
	
	НастройкиДокументов = МодульОбъекта().НастройкиДокументовУчета_ВсеЭлементы();
	
	Для каждого Настройка Из НастройкиДокументов Цикл
		НоваяСтрока = НастройкиДокументовУчета.Добавить();
		НоваяСтрока.Ссылка = Настройка;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьМаркируемыеТоварныеГруппы()
	
	МаркируемыеТоварныеГруппы.Очистить();
	
	ПредставленияПравил = ПредставленияПравилОтраженияВЭДО();
	
	МассивСсылок = МодульОбъекта().МаркируемыеТоварныеГруппы_ВсеЭлементы();
	
	Для каждого МаркируемаяТГ Из МассивСсылок Цикл
		
		ОписаниеМаркируемойТГ = МодульОбъекта().МаркируемаяТоварнаяГруппа_Прочитать(МаркируемаяТГ);
		
		НоваяСтрока = МаркируемыеТоварныеГруппы.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеМаркируемойТГ);
		ПредставлениеПравила = ПредставленияПравил.НайтиПоЗначению(ОписаниеМаркируемойТГ.ОтражениеВЭДО);
		НоваяСтрока.ПредставлениеОтраженияВЭДО = ПредставлениеПравила;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнструкциюКакПисатьФормулу()
	
	ИнструкцияКакПисатьФормулу = НСтр(
	"ru = 'Сложную формулу можно добавить в событие подключаемого модуля ""ПриЗаполненииДополнительногоПараметраЭтикетки"".
	|
	|Если нужно прочитать реквизит, то достаточно указать функцию:
	| - Печать_ЗначениеРеквизитаОбъекта(<Объект>, ""ИмяРеквизита"")
	| - Печать_ЗначениеДопСвойстваОбъекта(<Объект>, ""ИмяРеквизита"")
	| - Печать_ЗначениеДопРеквизитаОбъекта(<Объект>, ""ИмяРеквизита"")
	|Вместо <Объект> нужно указать:
	| - ПараметрыЭтикетки.Организация1С
	| - ПараметрыЭтикетки.Документ1С
	| - ПараметрыЭтикетки.Номенклатура
	| - ПараметрыЭтикетки.Характеристика
	| - ПараметрыЭтикетки.Упаковка
	| - ПараметрыЭтикетки.Серия'");
	
КонецПроцедуры

&НаСервере
Процедура СкрытьЗакладкуСлужебныхНастроек()
	
	Элементы.Закладка_СлужебныеНастройки.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УстановитьУсловноеОформлениеДопПараметровПМ();
	УстановитьУсловноеОформлениеДопПараметровЭтикеток();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеДопПараметровПМ()
	
	Таблица = Элементы.ДопПараметрыПМ;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ПолеУО = ЭлементУО.Поля.Элементы.Добавить();
	ПолеУО.Поле = Новый ПолеКомпоновкиДанных(Таблица.ПутьКДанным + "Значение");
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Таблица.Имя + ".ЭтоБезопасноеЗначение");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ПолеУО = ЭлементУО.Поля.Элементы.Добавить();
	ПолеУО.Поле = Новый ПолеКомпоновкиДанных(Таблица.ПутьКДанным + "БезопасноеЗначение");
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Таблица.Имя + ".ЭтоБезопасноеЗначение");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Ложь;
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеДопПараметровЭтикеток()
	
	Таблица = Элементы.ДопПараметрыЭтикеток;
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ПолеУО = ЭлементУО.Поля.Элементы.Добавить();
	ПолеУО.Поле = Новый ПолеКомпоновкиДанных(Таблица.ПутьКДанным + "Формула");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Таблица.Имя + ".Формула");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Вызвать подключаемый модуль'"));
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиДокументовУчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Настройка = Элементы.НастройкиДокументовУчета.ТекущиеДанные.Ссылка;
	МодульКлиента().ОткрытьФормуНастройкиДокумента(Настройка, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНастройкуДокумента(Команда)
	
	МодульКлиента().ОткрытьФормуНастройкиДокумента(Неопределено, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьНастройкуДокумента(Команда)
	
	Настройка = Элементы.НастройкиДокументовУчета.ТекущиеДанные.Ссылка;
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
	"УдалитьНастройкуДокумента_ПослеСогласия", ЭтаФорма, Настройка);
	
	Если ЕстьДокументыПоТипу(Настройка) Тогда
		ТекстВопроса = НСтр("ru = 'По выбранной настройке есть документы. Продолжить?'");
	Иначе
		ТекстВопроса = НСтр("ru = 'Удалить настройку документа?'");
	КонецЕсли;
	
	МодульКлиента().ПоказатьДиалогВопроса(ОписаниеОбработчика, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаСервере
Функция ЕстьДокументыПоТипу(Настройка)
	
	ТипДокумента = МодульОбъекта().НастройкиДокументаУчета_Прочитать(Настройка).ТипДокумента;
	
	Возврат МодульОбъекта().НастройкиДокументовУчета_ЕстьДокументыПоТипу(ТипДокумента);
	
КонецФункции

&НаКлиенте
Процедура УдалитьНастройкуДокумента_ПослеСогласия(Ответ, Настройка) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		УдалитьНастройкуДокументаНаСервере(Настройка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьНастройкуДокументаНаСервере(Настройка)
	
	ТипДокумента = МодульОбъекта().НастройкиДокументаУчета_Прочитать(Настройка).ТипДокумента;
	
	ОбъектНастройки = Настройка.ПолучитьОбъект();
	ОбъектНастройки.Удалить();
	
	НастройкиЗаполненияОпераций = МодульОбъекта().НастройкиЗаполненияОпераций_НайтиПоТипуДокумента(ТипДокумента);
	Если ЗначениеЗаполнено(НастройкиЗаполненияОпераций) Тогда
		ОбъектНастроек = НастройкиЗаполненияОпераций.ПолучитьОбъект();
		ОбъектНастроек.Удалить();
	КонецЕсли;
	
	ОбновитьНастройкиДокументовУчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ПМ_ПутьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПМ_ПутьПослеВыбораФайла", ЭтаФорма);
	
	ПараметрыВыбора = МодульКлиента().Новый_ПараметрыДиалогаВыбораФайла();
	ПараметрыВыбора.Заголовок = НСтр("ru = 'Выберите файл подключаемого модуля'");
	ПараметрыВыбора.Фильтр = "Внешняя обработка (*.epf)|*.epf";
	
	МодульКлиента().ПоказатьДиалогВыбораФайла(ОписаниеОбработчика, ПараметрыВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПМ_ПутьПослеВыбораФайла(ВыбранныеФайлы, ДопПараметры = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ВыбранныеФайлы) Тогда
		Возврат;
	КонецЕсли;
	
	ПМ_Путь = ВыбранныеФайлы[0];
	
	ДопПараметрыПМЗаполнитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПМ_СсылкаПриИзменении(Элемент)
	
	ДопПараметрыПМЗаполнитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПМ_ИмяОбработкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗначенияСписка = МодульКлиента().СписокОбработокВСоставеКонфигурации();
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПМ_ИмяОбработки_ПослеВыбора", ЭтаФорма);
	
	Если ЗначениеЗаполнено(ПМ_ИмяОбработки) Тогда
		ТекЗначение = ПМ_ИмяОбработки;
	Иначе
		ТекЗначение = "КонтурМаркировкаПМ";
	КонецЕсли;
	
	МодульКлиента().ПоказатьДиалогВыбораИзСписка(ОписаниеОбработчика
	, ЗначенияСписка
	, Элемент
	, ЭтаФорма
	, ТекЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПМ_ИмяОбработки_ПослеВыбора(РезультатВыбора, ДопПараметры = Неопределено) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПМ_ИмяОбработки = РезультатВыбора.Значение;
	
	ДопПараметрыПМЗаполнитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПМ_СохранитьШаблон(Команда)
	
	Фильтр = "Внешняя обработка (*.epf)|*.epf";
	ИмяФайла = "КонтурМаркировкаПМ.epf";
	Расширение = "epf";
	ЗаголовокВыбора = НСтр("ru = 'Выберите файл для сохранения шаблона подключаемого модуля'");
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПМ_СохранитьШаблонПослеВыбораФайла", ЭтаФорма);
	МодульКлиента().ПоказатьДиалогСохраненияФайла(ОписаниеОбработчика, Фильтр, ЗаголовокВыбора, ИмяФайла, Расширение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПМ_СохранитьШаблонПослеВыбораФайла(ВыбранныеФайлы, ДопПараметры = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ВыбранныеФайлы) Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКФайлу = ВыбранныеФайлы[0];
	
	ФайлШаблона = МодульКлиента().ФайлШаблонаПМ();
	
	ФайлШаблона.Записать(ПутьКФайлу);
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонТоварнойЭтикеткиПоУмолчаниюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПослеВыбора = МодульКлиента().ОписаниеОбработчикаОповещения("ШаблонЭтикеткиПослеВыбора", ЭтаФорма, Элемент);
	ТипЭтикетки = ПредопределенноеЗначение("Перечисление.КонтурМаркировка_ТипыЭтикеток.Товарная");
	МодульКлиента().ОткрытьФормуВыбораШаблонаЭтикетки(ПослеВыбора, ШаблонТоварнойЭтикеткиПоУмолчанию, ТипЭтикетки, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонГрупповойЭтикеткиПоУмолчаниюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПослеВыбора = МодульКлиента().ОписаниеОбработчикаОповещения("ШаблонЭтикеткиПослеВыбора", ЭтаФорма, Элемент);
	ТипЭтикетки = ПредопределенноеЗначение("Перечисление.КонтурМаркировка_ТипыЭтикеток.Групповая");
	МодульКлиента().ОткрытьФормуВыбораШаблонаЭтикетки(ПослеВыбора, ШаблонТоварнойЭтикеткиПоУмолчанию, ТипЭтикетки, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонТранспортнойЭтикеткиПоУмолчаниюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПослеВыбора = МодульКлиента().ОписаниеОбработчикаОповещения("ШаблонЭтикеткиПослеВыбора", ЭтаФорма, Элемент);
	ТипЭтикетки = ПредопределенноеЗначение("Перечисление.КонтурМаркировка_ТипыЭтикеток.Транспортная");
	МодульКлиента().ОткрытьФормуВыбораШаблонаЭтикетки(ПослеВыбора, ШаблонТоварнойЭтикеткиПоУмолчанию, ТипЭтикетки, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонЭтикеткиПослеВыбора(РезультатВыбора, Элемент) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма[Элемент.Имя] = РезультатВыбора;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонТоварнойЭтикеткиПоУмолчаниюОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(ШаблонТоварнойЭтикеткиПоУмолчанию) Тогда
		МодульКлиента().ОткрытьФормуШаблонаЭтикетки(ШаблонТоварнойЭтикеткиПоУмолчанию, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонГрупповойЭтикеткиПоУмолчаниюОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(ШаблонГрупповойЭтикеткиПоУмолчанию) Тогда
		МодульКлиента().ОткрытьФормуШаблонаЭтикетки(ШаблонГрупповойЭтикеткиПоУмолчанию, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонТранспортнойЭтикеткиПоУмолчаниюОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(ШаблонТранспортнойЭтикеткиПоУмолчанию) Тогда
		МодульКлиента().ОткрытьФормуШаблонаЭтикетки(ШаблонТранспортнойЭтикеткиПоУмолчанию, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакладкиПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.Закладка_ПараметрыЭтикеток Тогда
		ТекущийЭлемент = Элементы.ДопПараметрыЭтикеток;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаполненПутьКФайлуПМ()
	
	ВариантыРасположения = МодульОбъекта().Перечисление_ВариантыРасположенияОбработки();
	
	Если ПМ_Расположение = ВариантыРасположения.НаДиске Тогда
		Результат = ЗначениеЗаполнено(ПМ_Путь);
	ИначеЕсли ПМ_Расположение = ВариантыРасположения.ВСправочнике Тогда
		Результат = ЗначениеЗаполнено(ПМ_Ссылка);
	ИначеЕсли ПМ_Расположение = ВариантыРасположения.ВКонфигурации Тогда
		Результат = ЗначениеЗаполнено(ПМ_ИмяОбработки);
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьСписокКоэффициентыПересчета(Команда)
	
	МодульКлиента().ОткрытьФормуСпискаКоэффициентовПересчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтраницуСИнформациейОПартионномУчете(Команда)
	
	МодульКлиента().ОткрытьСтраницуСИнформациейОПартионномУчете();
	
КонецПроцедуры

// Выполнение регламентных действий

&НаКлиенте
Процедура ВыполнитьРегламентныеДействия(Команда)
	
	ЗапускатьРегламентныеДействияВФоновомРежиме = (РежимЗапускаРегламентныхДействий = 0);
	
	Если ЗапускатьРегламентныеДействияВФоновомРежиме Тогда

		Если ОбновленоИмяПользователяДляЗапускаРегламентныхДействий Тогда
			ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
			"ВыполнитьРегламентныеДействияВФоновомРежиме_ПослеСогласия", ЭтаФорма);
			
			ТекстВопроса = НСтр("ru = 'Было изменено имя пользователя для запуска регламентных действий. Сохранить настройки перед запуском?'");
			МодульКлиента().ПоказатьДиалогВопроса(ОписаниеОбработчика, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
			
		Иначе
			ВыполнитьРегламентныеДействияВФоновомРежиме_ПослеСогласия(КодВозвратаДиалога.Да);
		КонецЕсли;
		
	Иначе
		
		ВыполнитьРегламентныеДействияВТекущемСеансеНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьЭлементыФормы_ВыполнитьРегламентныеДействия()

	ЗапускатьРегламентныеДействияВФоновомРежиме = (РежимЗапускаРегламентныхДействий = 0);
	
	Если ЗапускатьРегламентныеДействияВФоновомРежиме Тогда
		Элементы.ГруппаВыполнениеРегламентныхДействийПараметры.Видимость = Истина;
		Элементы.Кнопка_ВыполнитьРегламентныеДействия.РасширеннаяПодсказка.Заголовок = "Событие будет вызвано в фоновом режиме";
	Иначе
		Элементы.ГруппаВыполнениеРегламентныхДействийПараметры.Видимость = Ложь;
		Элементы.Кнопка_ВыполнитьРегламентныеДействия.РасширеннаяПодсказка.Заголовок = "Событие будет вызвано в текущем сеансе пользователя";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РежимЗапускаРегламентныхДействийПриИзменении(Элемент)

	НастроитьЭлементыФормы_ВыполнитьРегламентныеДействия();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРегламентныеДействияВФоновомРежиме_ПослеСогласия(Ответ, ДопПараметры = Неопределено) Экспорт

	Если Ответ = КодВозвратаДиалога.Да
		Или Ответ = КодВозвратаДиалога.Нет Тогда
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ЗаписатьНастройки();
		КонецЕсли;
		
		ВыполнитьРегламентныеДействияВФоновомРежимеНаСервере();
		ОбновитьСтатусВыполненияРегламентныхДействий();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьРегламентныеДействияВФоновомРежимеНаСервере()
	
	МодульОбъекта().ЗапуститьВыполнениеРегламентныхДействийВФоновомРежиме();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьРегламентныеДействияВТекущемСеансеНаСервере()
	
	МодульОбъекта().ЗапуститьВыполнениеРегламентныхДействийВТекущемСеансе();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораИмяПользователяДляЗапускаРегламентныхДействий()
	
	СписокВыбора = Элементы.ИмяПользователяДляЗапускаРегламентныхДействий.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().Пользователи_МассивДоступныхПользователей();
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяПользователяДляЗапускаРегламентныхДействийПриИзменении(Элемент)
	
	ОбновленоИмяПользователяДляЗапускаРегламентныхДействий = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусВыполненияРегламентныхДействий() Экспорт
	
	РегламентныеДействияВыполняются = МодульКлиента().РегламентныеДействияВыполняются();
	
	НастроитьКнопкуВыполненияРегламентныхДействий(РегламентныеДействияВыполняются);
	
	Если РегламентныеДействияВыполняются Тогда
		ПодключитьОбработчикОжидания("ОбновитьСтатусВыполненияРегламентныхДействий", 5, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасписаниеРегламентныхДействийНажатие(Элемент)
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
	"РасписаниеРегламентныхДействийПослеИзменения", ЭтаФорма);
	
	МодульКлиента().ПоказатьДиалогРасписанияРегламентногоЗадания(ОписаниеОбработчика, РасписаниеРегламентныхДействий);
	
КонецПроцедуры

&НаКлиенте
Процедура РасписаниеРегламентныхДействийПослеИзменения(НовоеРасписание, ДопПараметры = Неопределено) Экспорт
	
	Если НовоеРасписание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РасписаниеРегламентныхДействий = НовоеРасписание;
	ОбновленоРасписаниеРегламентныхДействий = Истина;
	Модифицированность = Истина;
	
	ОбновитьНадписьРасписаниеРегламентныхДействий();
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНаИнструкциюПоНастройкеРегЗаданияНажатие(Элемент)
	
	МодульКлиента().ОткрытьИнструкциюПоНастройкеРегламентногоЗадания();
	
КонецПроцедуры

// Очистка устаревших данных

&НаКлиенте
Процедура УдалитьУстаревшиеДанные(Команда)
	
	ЗапуститьОчисткуУстаревшихДанных();
	
	ОбновитьСтатусОчисткиУстаревшихДанных();
	
КонецПроцедуры

&НаСервере
Процедура ЗапуститьОчисткуУстаревшихДанных()
	
	МодульОбъекта().ЗапуститьОчисткуУстаревшихДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусОчисткиУстаревшихДанных() Экспорт
	
	ОчисткаДанныхВыполняется = МодульКлиента().ОчисткаУстаревшихДанныхВыполняется();
	
	НастроитьКнопкуОчисткиУстаревшихДанных(ОчисткаДанныхВыполняется);
	
	Если ОчисткаДанныхВыполняется Тогда
		ПодключитьОбработчикОжидания("ОбновитьСтатусОчисткиУстаревшихДанных", 5, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьРасписанияОчисткиУстаревшихДанныхНажатие(Элемент)
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
	"РасписаниеОчисткиУстаревшихДанныхПослеИзменения", ЭтаФорма);
	
	МодульКлиента().ПоказатьДиалогРасписанияРегламентногоЗадания(ОписаниеОбработчика, РасписаниеОчисткиУстаревшихДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура РасписаниеОчисткиУстаревшихДанныхПослеИзменения(НовоеРасписание, ДопПараметры = Неопределено) Экспорт
	
	Если НовоеРасписание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РасписаниеОчисткиУстаревшихДанных = НовоеРасписание;
	ОбновленаПериодичностьОчисткиУстаревшихДанных = Истина;
	Модифицированность = Истина;
	
	ОбновитьНадписьРасписанияОчисткиУстаревшихДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьОчисткиУстаревшихДанныхПриИзменении(Элемент)
	
	ОбновленаПериодичностьОчисткиУстаревшихДанных = Истина;
	
	НастроитьЗакладкуОчисткиУстаревшихДанных(ЭтаФорма, МодульКлиента());
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьЗакладкуОчисткиУстаревшихДанных(Форма, МодульОбработки)
	
	Элементы = Форма.Элементы;
	ПериодичностьЗаданий = МодульОбработки.Перечисление_ПериодичностьВыполненияЗаданий();
	ПериодичностьОчистки = Форма.ПериодичностьОчисткиУстаревшихДанных;
	
	Если ПериодичностьОчистки = ПериодичностьЗаданий.ПоРасписанию Тогда
		Элементы.НадписьРасписанияОчисткиУстаревшихДанных.Видимость = Истина;
	Иначе
		Элементы.НадписьРасписанияОчисткиУстаревшихДанных.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьГруппуПериодичностиОчистки()
	
	Если МодульОбъекта().ВерсияПлатформыНиже("8.3") Тогда
		Элементы.ГруппаПериодичностиОчистки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	КонецЕсли;
	
КонецПроцедуры

// Список объектов из подсистемы

&НаКлиенте
Процедура ОткрытьСписокПодсистемыНажатие(Элемент)
	
	СписокОбъектов = ОбъектыПодсистемыСоСписками();
	
	ЗаголовокВыбора = НСтр("ru = 'Список объектов подсистемы'");
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
	"ОткрытьСписокПодсистемыПослеВыбораОбъекта", ЭтаФорма);
	
	МодульКлиента().ПоказатьДиалогВыбораИзСписка(ОписаниеОбработчика, СписокОбъектов, Элемент, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокПодсистемыПослеВыбораОбъекта(РезультатВыбора, ДопПараметры = Неопределено) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму(РезультатВыбора.Значение + ".ФормаСписка");
	
КонецПроцедуры

&НаСервере
Функция ОбъектыПодсистемыСоСписками()
	
	Возврат МодульОбъекта().ОбъектыПодсистемыСоСписками();
	
КонецФункции

// Выгрузка вложенных обработок

&НаКлиенте
Процедура ВыгрузитьВложенныеОбработки(Команда)
	
	Если Модифицированность
		И Не ЗаписатьНастройки() Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	СписокФайлов = ВыгрузитьВсеВложенныеОбработкиВКаталогОтладки();
	Если Не ЗначениеЗаполнено(СписокФайлов) Тогда
		Возврат;
	КонецЕсли;
	
	МодульКлиента().СообщитьПользователюЛок(НСтр("ru = 'Записаны на диск:'"), УникальныйИдентификатор);
	Для каждого ПутьКФайлу Из СписокФайлов Цикл
		МодульКлиента().СообщитьПользователюЛок(ПутьКФайлу, УникальныйИдентификатор);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ВыгрузитьВсеВложенныеОбработкиВКаталогОтладки()
	
	Возврат МодульОбъекта().ВыгрузитьВсеВложенныеОбработкиВКаталогОтладки();
	
КонецФункции

// Обработка фоновых заданий 8.2

&НаСервере
Процедура ПоказатьОбработкуВыполненияФоновыхЗаданий82()
	
	ПоказатьОбработку = МодульОбъекта().МожноВыполнятьОбработкуФоновыхЗаданийНаКлиенте();
	
	Элементы.ГруппаОбработкиФоновыхЗаданий82.Видимость = ПоказатьОбработку;
	Элементы.ГруппаОбработкиФоновыхЗаданий82_1.Видимость = ПоказатьОбработку;
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьОткрытьОбработкуФоновыхЗаданий82Нажатие(Элемент)
	
	МодульКлиента().ОткрытьФормуОбработкиМодально("Форма_ВыполнениеФоновыхЗаданий", ЭтаФорма);
	
КонецПроцедуры

// КонтурПлагины

&НаКлиенте
Процедура ИспользоватьПлагиныПриИзменении(Элемент)
	
	НастроитьЭлементыФормы(ЭтаФорма, МодульКлиента());
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокПлагинов(Команда)
	
	МодульКлиента().ОткрытьФормуСпискаПлагинов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РежимТестированияПлагиновПриИзменении(Элемент)
	
	НастроитьЭлементыФормы(ЭтаФорма, МодульКлиента());
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогОтладкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("КаталогОтладкиПослеВыбора", ЭтаФорма);
	
	ЗаголовокДиалога = НСтр("ru = 'Выберите каталог отладки'");
	
	МодульКлиента().ПоказатьДиалогВыбораКаталога(ОписаниеОбработчика, ЗаголовокДиалога, КаталогОтладки);
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогОтладкиПослеВыбора(ВыбранныйКаталог, ДопПараметры = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ВыбранныйКаталог) Тогда
		Возврат;
	КонецЕсли;
	
	КаталогОтладки = ВыбранныйКаталог[0];
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьЗаполнениеРеквизитов()
	
	ЕстьОшибки = Ложь;
	
	ПроверитьЗаполненныеРеквизиты(ЕстьОшибки);
	ПроверитьУникальностьМаркируемыхТоварныхГрупп(ЕстьОшибки);
	
	Возврат Не ЕстьОшибки;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьЗаполненныеРеквизиты(ЕстьОшибки)
	
	ПроверитьНастройкиДопКолонок(ЕстьОшибки);
	ПроверитьМаркируемыеТоварныеГруппы(ЕстьОшибки);
	ПроверитьПараметрыОчисткиУстаревшихДанных(ЕстьОшибки);
	ПроверитьВидПродукции1С(ЕстьОшибки);
	ПроверитьНастройкиРИБ(ЕстьОшибки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНастройкиДопКолонок(ЕстьОшибки)
	
	ШаблонОшибки = НСтр("ru = 'Неверный тип колонки: %1'");
	
	Если ДопКолонка1_Видимость 
		И ЗначениеЗаполнено(ДопКолонка1_ТипКолонки)
		И Не ПроверитьТипДопКолонки(ДопКолонка1_ТипКолонки) Тогда
		ТекстСообщения = МодульКлиента().ПараметрыВСтроку(ШаблонОшибки, ДопКолонка1_ТипКолонки);
		МодульКлиента().СообщитьПользователюЛок(ТекстСообщения, УникальныйИдентификатор, "ДопКолонка1_ТипКолонки");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если ДопКолонка2_Видимость 
		И ЗначениеЗаполнено(ДопКолонка2_ТипКолонки)
		И Не ПроверитьТипДопКолонки(ДопКолонка2_ТипКолонки) Тогда
		ТекстСообщения = МодульКлиента().ПараметрыВСтроку(ШаблонОшибки, ДопКолонка2_ТипКолонки);
		МодульКлиента().СообщитьПользователюЛок(ТекстСообщения, УникальныйИдентификатор, "ДопКолонка2_ТипКолонки");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если ДопКолонка3_Видимость 
		И ЗначениеЗаполнено(ДопКолонка3_ТипКолонки)
		И Не ПроверитьТипДопКолонки(ДопКолонка3_ТипКолонки) Тогда
		ТекстСообщения = МодульКлиента().ПараметрыВСтроку(ШаблонОшибки, ДопКолонка3_ТипКолонки);
		МодульКлиента().СообщитьПользователюЛок(ТекстСообщения, УникальныйИдентификатор, "ДопКолонка3_ТипКолонки");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьМаркируемыеТоварныеГруппы(ЕстьОшибки)
	
	ТекстОшибки = НСтр("ru = 'Необходимо заполнить вид продукции.'");
	Для каждого Стр Из МаркируемыеТоварныеГруппы Цикл
		Если Не ЗначениеЗаполнено(Стр.ВидПродукции) Тогда
			МодульКлиента().СообщитьОбОшибкеВСтрокеТабЧасти(ТекстОшибки
			, УникальныйИдентификатор, Элементы.МаркируемыеТоварныеГруппы
			, "ВидПродукции", МаркируемыеТоварныеГруппы.Индекс(Стр));
			ЕстьОшибки = Истина;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьУникальностьМаркируемыхТоварныхГрупп(ЕстьОшибки)
	
	ШаблонОшибки = НСтр("ru = 'Удалите дублируемый вид продукции в таблице маркируемых товаров: %1'");
	
	Для каждого Стр Из МаркируемыеТоварныеГруппы Цикл
		
		ВидПродукции = Стр.ВидПродукции;
		
		ПараметрыОтбора = Новый Структура("ВидПродукции", ВидПродукции);
		НайденныеСтроки = МаркируемыеТоварныеГруппы.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеСтроки.Количество() > 1 Тогда
			ТекстОшибки = МодульКлиента().ПараметрыВстроку(ШаблонОшибки, ВидПродукции);
			МодульКлиента().СообщитьОбОшибкеВСтрокеТабЧасти(ТекстОшибки
				, УникальныйИдентификатор, Элементы.МаркируемыеТоварныеГруппы
				, "ВидПродукции", МаркируемыеТоварныеГруппы.Индекс(Стр));
			ЕстьОшибки = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПараметрыОчисткиУстаревшихДанных(ЕстьОшибки)
	
	МинимальныйСрокЖизниКода = 30;
	Если ПериодУдаленияКодовДляПечатиДоАннулирования > МинимальныйСрокЖизниКода Тогда
		ЕстьОшибки = Истина;
		Поле = "ПериодУдаленияКодовДляПечатиДоАннулирования";
		ТекстОшибки = НСтр("ru = 'Удалять коды для печати можно не раньше чем за 29 дней до аннулирования ГИС МТ'");
		МодульКлиента().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор, Поле);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВидПродукции1С(ЕстьОшибки)
	
	ТекстОшибки = НСтр("ru = 'Необходимо заполнить вид продукции 1С.'");
	
	ЕстьЗаполненныйВидПродукции1С = Ложь;
	Для Каждого Стр Из МаркируемыеТоварныеГруппы Цикл
		Если ЗначениеЗаполнено(Стр.ВидПродукции1С) Тогда
			ЕстьЗаполненныйВидПродукции1С = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьЗаполненныйВидПродукции1С Тогда
		Для Каждого Стр Из МаркируемыеТоварныеГруппы Цикл
			Если Не ЗначениеЗаполнено(Стр.ВидПродукции1С) Тогда
				МодульКлиента().СообщитьОбОшибкеВСтрокеТабЧасти(ТекстОшибки
				, УникальныйИдентификатор, Элементы.МаркируемыеТоварныеГруппы
				, "ВидПродукции1С", МаркируемыеТоварныеГруппы.Индекс(Стр));
				ЕстьОшибки = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНастройкиРИБ(ЕстьОшибки)
	
	Если Не РежимРИБ Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПланОбмена) Тогда
		ЕстьОшибки = Истина;
		ТекстОшибки = НСтр("ru = 'Необходимо заполнить план обмена'");
		Поле = "ПланОбмена";
		МодульКлиента().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор, Поле);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Узел) Тогда
		ЕстьОшибки = Истина;
		ТекстОшибки = НСтр("ru = 'Необходимо заполнить узел плана обмена'");
		Поле = "Узел";
		МодульКлиента().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор, Поле);
	КонецЕсли;
	
	КодУзла = МодульКлиента().ЗначениеРеквизитаОбъекта_Марк(Узел, "Код");
	Если Не ЗначениеЗаполнено(КодУзла) Тогда
		ЕстьОшибки = Истина;
		ТекстОшибки = НСтр("ru = 'Необходимо заполнить код узла плана обмена'");
		Поле = "Узел";
		МодульКлиента().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор, Поле);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПрефиксИБ) Тогда
		ЕстьОшибки = Истина;
		ТекстОшибки = НСтр("ru = 'Необходимо заполнить префикс информационной базы'");
		Поле = "ПрефиксИБ";
		МодульКлиента().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор, Поле);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьТипДопКолонки(ТипКолонки)
	
	Попытка
		ОписаниеТипа = Новый ОписаниеТипов(ТипКолонки);
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

// #Область МаркируемыеТоварныеГруппы

&НаКлиенте
Процедура МаркируемыеТоварныеГруппыПриИзменении(Элемент)
	
	УстановитьПризнакИзмененыМаркируемыеТоварныеГруппы();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПризнакИзмененыМаркируемыеТоварныеГруппы()
	
	Если Не ИзмененыМаркируемыеТоварныеГруппы Тогда
		ИзмененыМаркируемыеТоварныеГруппы = Истина;
		Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура МаркируемыеТоварныеГруппыПредставлениеОтраженияВЭДОНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.МаркируемыеТоварныеГруппы.ТекущиеДанные;
	СписокВыбора = ПредставленияПравилОтраженияВЭДО();
	
	Если Не МодульКлиента().ВидПродукцииДопускаетОСУ(ТекущиеДанные.ВидПродукции) Тогда
		ОСУ = ПредопределенноеЗначение("Перечисление.КонтурМаркировка_ПравилаОтраженияВЭДО.ОСУ");
		СписокВыбора.Удалить(СписокВыбора.НайтиПоЗначению(ОСУ));
	КонецЕсли;
	
	Обработчик = МодульКлиента().ОписаниеОбработчикаОповещения(
	"МаркируемыеТоварныеГруппыПредставлениеОтраженияВЭДОПослеВыбора", ЭтаФорма, ТекущиеДанные);
	
	МодульКлиента().ПоказатьДиалогВыбораИзСписка(Обработчик, СписокВыбора, Элемент, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура МаркируемыеТоварныеГруппыПредставлениеОтраженияВЭДОПослеВыбора(РезультатВыбора, ТекущиеДанные) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.ОтражениеВЭДО = РезультатВыбора.Значение;
	ТекущиеДанные.ПредставлениеОтраженияВЭДО = РезультатВыбора.Представление;
	
	УстановитьПризнакИзмененыМаркируемыеТоварныеГруппы();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПредставленияПравилОтраженияВЭДО()
	
	ПУ = ПредопределенноеЗначение("Перечисление.КонтурМаркировка_ПравилаОтраженияВЭДО.ПУ");
	ОСУ = ПредопределенноеЗначение("Перечисление.КонтурМаркировка_ПравилаОтраженияВЭДО.ОСУ");
	НеОтражать = ПредопределенноеЗначение("Перечисление.КонтурМаркировка_ПравилаОтраженияВЭДО.НеОтражать");
	
	Результат = Новый СписокЗначений;
	Результат.Добавить(ПУ, НСтр("ru = 'ПУ (Только поэкземплярный учет)'"));
	Результат.Добавить(ОСУ, НСтр("ru = 'ОСУ (Допускается объемно-сортовой учет)'"));
	Результат.Добавить(НеОтражать, НСтр("ru = 'Не отражать'"));
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура МаркируемыеТоварныеГруппыВидПродукцииПриИзменении(Элемент)
	
	ВыбранныйВидПродукции = Элементы.МаркируемыеТоварныеГруппы.ТекущиеДанные.ВидПродукции;
	ОСУ = ПредопределенноеЗначение("Перечисление.КонтурМаркировка_ПравилаОтраженияВЭДО.ОСУ");
	
	Если Элементы.МаркируемыеТоварныеГруппы.ТекущиеДанные.ОтражениеВЭДО = ОСУ
		И Не МодульКлиента().ВидПродукцииДопускаетОСУ(ВыбранныйВидПродукции) Тогда
		Элементы.МаркируемыеТоварныеГруппы.ТекущиеДанные.ОтражениеВЭДО = Неопределено;
		Элементы.МаркируемыеТоварныеГруппы.ТекущиеДанные.ПредставлениеОтраженияВЭДО = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти // МаркируемыеТоварныеГруппы

// #Область ОпросыПользователей

&НаКлиенте
Процедура ПровестиОпросПользователяИЗакрыть()
	
	КлючиСценариев = МодульКлиента().Перечисление_КлючиСценариевДляОпросов();
	ОписаниеОпроса = МодульКлиента().ОпросПользователяПоСценарию(КлючиСценариев.ОбщиеНастройки);
	
	Если ЗначениеЗаполнено(ОписаниеОпроса) Тогда
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПослеОпросаПользователя", ЭтаФорма);
		МодульКлиента().ОткрытьФормуОпросаПользователя(ОписаниеОпроса, ЭтаФорма, ОписаниеОбработчика);
		Возврат;
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОпросаПользователя(РезультатВыбора, ДопПараметры = Неопределено) Экспорт
	
	Закрыть();
	
КонецПроцедуры

// #КонецОбласти

// #Область ДополнительныеПараметрыПМ

&НаКлиенте
Процедура ДопПараметрыПМЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДопПараметрыПМ.ТекущиеДанные;
	
	Элемент.ВыбиратьТип = (ТекущиеДанные.Значение = Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ДопПараметрыПМБезопасноеЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДопПараметрыПМ.ТекущиеДанные;
	
	Элемент.ВыбиратьТип = (ТекущиеДанные.БезопасноеЗначение = Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ДопПараметрыПМЗначениеОчистка(Элемент, СтандартнаяОбработка)
	
	Элемент.ВыбиратьТип = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДопПараметрыПМБезопасноеЗначениеОчистка(Элемент, СтандартнаяОбработка)
	
	Элемент.ВыбиратьТип = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДопПараметрыПМЗаполнить(Команда)
	
	ДопПараметрыПМЗаполнитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ДопПараметрыПМЗаполнитьНаСервере()
	
	Если Не ПМ_Использовать
		Или Не ЗаполненПутьКФайлуПМ() Тогда
		Возврат;
	КонецЕсли;
	
	Настройки = ОписаниеНастроекПоКонтексту();
	
	ПМ_ДопПараметры = МодульОбъекта().ПМ_ДополнительныеПараметры(Настройки);
	МодульОбъекта().ЗаполнитьПоляСтруктуры(ПМ_ДопПараметры, Настройки.ПМ_ДопПараметры);
	
	ПМ_БезопасныеДопПараметры = МодульОбъекта().ПМ_БезопасныеДополнительныеПараметры(Настройки);
	МодульОбъекта().ЗаполнитьПоляСтруктуры(ПМ_БезопасныеДопПараметры, Настройки.ПМ_БезопасныеДопПараметры);
	
	ЗаполнитьТаблицуДопПараметрыПМ(ПМ_ДопПараметры, ПМ_БезопасныеДопПараметры);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуДопПараметрыПМ(ДопПараметры, БезопасныеДопПараметры)
	
	ДопПараметрыПМ.Очистить();
	
	Для Каждого Элемент Из ДопПараметры Цикл
		ЗаполнитьЗначенияСвойств(ДопПараметрыПМ.Добавить(), Элемент);
	КонецЦикла;
	
	Для Каждого Элемент Из БезопасныеДопПараметры Цикл
		Стр = ДопПараметрыПМ.Добавить();
		Стр.Ключ = Элемент.Ключ;
		Стр.БезопасноеЗначение = Элемент.Значение;
		Стр.ЭтоБезопасноеЗначение = Истина;
	КонецЦикла;
	
	ДопПараметрыПМ.Сортировать("Ключ");
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбновлениеМодуля

&НаКлиенте
Процедура ОбновлятьАвтоматическиПриИзменении(Элемент)
	
	ОбновленоРасписаниеОбновленияМодуля = Истина;
	Модифицированность = Истина;
	
	НастроитьЭлементыФормы(ЭтаФорма, МодульКлиента());
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьРасписаниеОбновленияМодуляНажатие(Элемент)
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
	"РасписаниеОбновленияМодуляПослеИзменения", ЭтаФорма);
	
	МодульКлиента().ПоказатьДиалогРасписанияРегламентногоЗадания(ОписаниеОбработчика, РасписаниеОбновленияМодуля);
	
КонецПроцедуры

&НаКлиенте
Процедура РасписаниеОбновленияМодуляПослеИзменения(НовоеРасписание, ДопПараметры = Неопределено) Экспорт
	
	Если НовоеРасписание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РасписаниеОбновленияМодуля = НовоеРасписание;
	ОбновленоРасписаниеОбновленияМодуля = Истина;
	Модифицированность = Истина;
	
	ОбновитьНадписьРасписаниеОбновленияМодуля();
	
КонецПроцедуры

// #КонецОбласти

// #Область РИБ

&НаСервере
Процедура ЗаполнитьСписокВыбораПланаОбмена()
	
	СписокВыбора = Элементы.ПланОбмена.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().ВсеТипыСсылокПлановОбменаРИБ();
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура РежимРИБПриИзменении(Элемент)
	
	НастроитьЭлементыФормы(ЭтаФорма, МодульКлиента());
	РежимРИБПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура РежимРИБПриИзмененииНаСервере()
	
	Элементы.ПланОбмена.АвтоОтметкаНезаполненного = РежимРИБ;
	Элементы.Узел.АвтоОтметкаНезаполненного = РежимРИБ;
	Элементы.ПрефиксИБ.АвтоОтметкаНезаполненного = РежимРИБ;
	
	Если Не ЗначениеЗаполнено(ПрефиксИБ) Тогда
		ЗаполнитьПрефиксИБ();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПрефиксИБ()
	
	ПрефиксИБ = МодульОбъекта().ТипыОбъектовИС().ПрефиксИБ;
	
КонецПроцедуры

&НаКлиенте
Процедура ПланОбменаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ПланОбмена) Тогда
		Узел = ТекущийУзелПланаОбмена();
	Иначе
		Узел = Неопределено;
		ПрефиксИБ = "";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ТекущийУзелПланаОбмена()
	
	Возврат МодульОбъекта().ТекущийУзелПланаОбмена(ПланОбмена);
	
КонецФункции

&НаКлиенте
Процедура РазрешитьОбменПоВсемОбъектамВГлавномУзлеПриИзменении(Элемент)
	
	Если РазрешитьОбменПоВсемОбъектамВГлавномУзле Тогда
		
		РазрешитьОбменПоВсемОбъектамВГлавномУзле = Ложь;
		
		ТекстВопроса = НСтр(
		"ru = '%1
		|
		|Продолжить?'");
		ТекстВопроса = МодульКлиента().ПараметрыВСтроку(ТекстВопроса, Элементы.ПодсказкаРазрешитьОбменПоВсемОбъектамВГлавномУзле.Заголовок);
		
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
		"РазрешитьОбменПоВсемОбъектамВГлавномУзле_ПослеСогласия", ЭтаФорма);
		
		МодульКлиента().ПоказатьДиалогВопроса(ОписаниеОбработчика, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьОбменПоВсемОбъектамВГлавномУзле_ПослеСогласия(Ответ, ДопПараметры) Экспорт
	
	РазрешитьОбменПоВсемОбъектамВГлавномУзле = (Ответ = КодВозвратаДиалога.Да);
	
КонецПроцедуры

// #КонецОбласти

// #Область СортировкаЭтикеток

&НаКлиенте
Процедура НастройкаСортировкиЭтикетокПоУмолчаниюНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Обработчик = МодульКлиента().ОписаниеОбработчикаОповещения(
	"НастройкиСортировкиЭтикетокПослеРедактирования", ЭтаФорма);
	
	НастройкиСортировкиЭтикеток = НастройкиСортировкиЭтикетокПоКонтексту();
	
	МодульКлиента().ОткрытьНастройкиСортировкиЭтикеток(ЭтаФорма, НастройкиСортировкиЭтикеток, Обработчик);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиСортировкиЭтикетокПослеРедактирования(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьНастройкиСортировкиЭтикетокПоУмолчанию(Результат);
	ОбновитьОписаниеСортировкиЭтикеток(Результат);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОписаниеСортировкиЭтикеток(НастройкиСортировкиЭтикеток = Неопределено)
	
	Если НЕ ЗначениеЗаполнено(НастройкиСортировкиЭтикеток) Тогда
		НастройкиСортировкиЭтикеток = НастройкиСортировкиЭтикетокПоКонтексту();
	КонецЕсли;
	
	ПредставлениеНастроек = НСтр("ru='Настроить порядок этикеток'");
	ЕстьНастройкиСортировки = ЗначениеЗаполнено(НастройкиСортировкиЭтикеток.ПолеСортировкиЭтикеток1);
	
	Если ЕстьНастройкиСортировки Тогда
		ПредставлениеНастроек = ПредставлениеСортировкиЭтикеток(НастройкиСортировкиЭтикеток);
	КонецЕсли;
	
	ПредставлениеСортировкиЭтикеток = ПредставлениеНастроек;
	
КонецПроцедуры

&НаКлиенте
Функция НастройкиСортировкиЭтикетокПоКонтексту()
	
	Результат = МодульКлиента().Новый_ПараметрыСортировкиЭтикеток();
	
	Для Сч = 1 По МодульКлиента().КоличествоПараметровСортировкиЭтикеток() Цикл
		
		КлючПолеСортировки = "ПолеСортировкиЭтикеток" + Сч;
		КлючНаправлениеСортировки = "НаправлениеСортировкиЭтикеток" + Сч;
		
		Результат[КлючПолеСортировки] = ЭтаФорма[КлючПолеСортировки + "ПоУмолчанию"];
		Результат[КлючНаправлениеСортировки] = ЭтаФорма[КлючНаправлениеСортировки + "ПоУмолчанию"];
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьНастройкиСортировкиЭтикетокПоУмолчанию(ПараметрыСортировки)
	
	Для Сч = 1 По МодульКлиента().КоличествоПараметровСортировкиЭтикеток() Цикл
		
		КлючПолеСортировки = "ПолеСортировкиЭтикеток" + Сч;
		КлючНаправлениеСортировки = "НаправлениеСортировкиЭтикеток" + Сч;
		
		ЭтаФорма[КлючПолеСортировки + "ПоУмолчанию"] = ПараметрыСортировки[КлючПолеСортировки];
		ЭтаФорма[КлючНаправлениеСортировки + "ПоУмолчанию"] = ПараметрыСортировки[КлючНаправлениеСортировки];
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПредставлениеСортировкиЭтикеток(ПараметрыСортировки)
	
	Возврат МодульОбъекта().ПредставлениеСортировкиЭтикеток(ПараметрыСортировки);
	
КонецФункции

// #КонецОбласти
