//	Copyright (C) 2012-2024 Engineer Mareev Enterprises
//	Модуль для ERP 2.5
//	Импортирует DESPATCH в документ Реализация товаров услуг c характеристиками или сериями товара, и марками ЧЗ (опционально). 

//	$Отгрузка товаров (неордерная схема)
//	Импорт сообщений DESPATCH:
//	 - Оператор EME.WMS (руч.) формирует пачку заказов, просчитывает ее, подбирает.
//	 - После закрытия заказа EME.WMS (авт.) экспортирует сообщение DESPATCH.
//	 - 1C (авт.) импортирует сообщение DESPATCH. При несовпадении количеств или ассортимента товаров 1С (авт.) корректирует документ "Реализация товаров услуг", проводит его и посылает менеджеру,  ответственному за документ реализации, сообщение о несовпадениях по почте, указанной в контактах менеджера (пользователя ИБ). При отсутствии такового адреса, сообщения уйдут по списку рассылки, настроенному в обработке отладки.

#Область ПрограммныйИнтерфейс

//	Импорт Реализации товаров услуг
Процедура Импортировать(ERPData, Трассировка, ТемаСообщения) Экспорт
	
	Если ERPData.header.order_no = "" Тогда // Отгрузка импортируется только на основе заказа (или самой реализации)
		Возврат;
	КонецЕсли;
	
	Если ERPData.header.erp_doc_type <> ПолучитьМетаданные().Имя Тогда
		Возврат;
	КонецЕсли;
	
    //	Не импортируем на статусах
	Если ERPData.header.order_status = "Перемещается в пикинг/OA" Тогда
		EmeWmsERPEngine.Success(ERPData); 				
		Возврат;				
	КонецЕсли;
	
    // Импортируем на этих статусах
	Если  ERPData.header.order_status <> "В пачке" 
		И ERPData.header.order_status <> "Подобран"
		И ERPData.header.order_status <> "Упакован" 
		И ERPData.header.order_status <> "Ушел со склада"   
		И ERPData.header.order_status <> "Подтвержден"   
		И ERPData.header.order_status <> "Закрыт" Тогда 	
		
		Возврат;
	КонецЕсли;
	
	//	Идентификатор документа WMS
	ИдЕМЕ = ERPData.header.order_id;
	//	Номер документа WMS
	НомерЕМЕ = ERPData.header.order_no;
	
	//	Проверки
	Контрагент = EmeWmsУтилиты.ПолучитьСсылкуНаКонтрагента(ERPData.header.customer_id);
	Если Контрагент.Ссылка.Пустая() Тогда
		EmeWmsERPEngine.ErrorHeader(ERPData, "SPLBAD"); 
		Возврат;
	КонецЕсли;
	
	//	Соберем товары и количества
	КодЗоны 		= Неопределено;
	КартаТоваров 	= Новый Соответствие;
	СерийныеНомера 	= Новый Соответствие;
	ПолучитьКоличестваТоваров(ERPData, КодЗоны, КартаТоваров, СерийныеНомера);
	
	//	Получим склад-отправитель по коду EME
	КодСклада = ERPData.header.whs_code;
	КодОрганизации = ERPData.header.vendor_code;
	СкладСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаСкладПоКодуEME(КодСклада, КодЗоны, КодОрганизации);
	Если СкладСсылка.Пустая() Тогда
		EmeWmsERPEngine.ErrorHeader(ERPData, "WHSBAD");
		Возврат;
	КонецЕсли;
	
	//	Ссылка на документ-основание (реализация)
	Реализация = EmeWmsУтилиты.ПолучитьСсылкуНаРеализациюТоваровУслуг(ИдЕМЕ);	
	
	Если Реализация.Пустая() Тогда  // Создать новый документ
		EmeWmsERPEngine.ErrorHeader(ERPData, "ORDBAD"); // Ошибка отсутствия документа
		Возврат;
	КонецЕсли;
	
	//	Если были ошибки
	Если EmeWmsERPEngine.HasErrors(ERPData) Тогда
		Возврат;
	КонецЕсли;
	
	//*** Проверки сделали, пишем в базу данных 1C ***
	Реализация = Реализация.ПолучитьОбъект(); // Обработать исходный документ  
	
	//Если Не Реализация.Проведен Тогда    		
	//	EmeWmsERPEngine.WarningHeader(ERPData, "NOTPST");
	//	СоздатьОтметкуОбИмпорте(Реализация.Ссылка, ИдЕМЕ);
	//	Возврат;                   		
	//КонецЕсли;
	
	Если Реализация.ПометкаУдаления Тогда
		EmeWmsERPEngine.WarningHeader(ERPData, "NOTPST");
		СоздатьОтметкуОбИмпорте(Реализация.Ссылка, ИдЕМЕ);
		Возврат;
	КонецЕсли;
	
	//	Маршрутный лист     
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	МаршрутныйЛист.Ссылка КАК МаршрутныйЛистСсылка
		|ИЗ
		|	Документ.МаршрутныйЛист КАК МаршрутныйЛист
		|ГДЕ  
		|	НЕ МаршрутныйЛист.ПометкаУдаления
		|	И МаршрутныйЛист.ДокОснование ССЫЛКА Документ.РеализацияТоваровУслуг
		|	И МаршрутныйЛист.ДокОснование = &ДокОснование
		|
		|УПОРЯДОЧИТЬ ПО
		|	МаршрутныйЛист.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("ДокОснование", Реализация.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		МаршрутныйЛист = Неопределено;
	Иначе		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		МаршрутныйЛист = ВыборкаДетальныеЗаписи.МаршрутныйЛистСсылка.ПолучитьОбъект();
		МаршрутныйЛист.ОбменДанными.Загрузка = Истина;
	КонецЕсли;
			
	// 	Изменим EmeWmsСтатус заказа
	Если ERPData.header.order_status = "В пачке" Тогда
		Реализация.EmeWmsСтатус = "В работе";
		Реализация.Статус = ПредопределенноеЗначение("Перечисление.СтатусМаршрутов.НаСборке");
	ИначеЕсли ERPData.header.order_status = "Подобран" Тогда
		Реализация.EmeWmsСтатус = "Собран";		
		Реализация.Статус = ПредопределенноеЗначение("Перечисление.СтатусМаршрутов.Собран");				
	ИначеЕсли ERPData.header.order_status = "Упакован" Тогда // На статусе корректировать ТЧ
		//	Печать документов из 1С
		Реализация.EmeWmsСтатус = "Проверен";		
		Реализация.Статус = ПредопределенноеЗначение("Перечисление.СтатусМаршрутов.Проверен");				
	ИначеЕсли ERPData.header.order_status = "Ушел со склада" Тогда
		Реализация.EmeWmsСтатус = "Отправлен";		
		Реализация.Статус = ПредопределенноеЗначение("Перечисление.СтатусМаршрутов.Отправлен");
	ИначеЕсли ERPData.header.order_status = "Подтвержден" ИЛИ ERPData.header.order_status = "Закрыт" Тогда
		Реализация.EmeWmsСтатус = "К проведению";
        Реализация.Статус = ПредопределенноеЗначение("Перечисление.СтатусМаршрутов.Выдан");
	КонецЕсли;	
	
	//	Регистр сведений статусы доставки
	СтатусыДоставки_ЛА(Реализация);
	
	//	Маршрутного лист: Статус, Сборщик, Комплектовщик, Количество мест, Время начала сборки, Время конца сборки 
	Если МаршрутныйЛист <> Неопределено Тогда
		МаршрутныйЛист.Статус = Реализация.Статус;	
		
		//	Сборщик
		Если ЗначениеЗаполнено(ERPData.header.operator_loaded) Тогда       		
			МаршрутныйЛист.Кладовщик = Справочники.ИнформационныеКарты.НайтиПоНаименованию(ERPData.header.operator_loaded);
			
			Если Не ЗначениеЗаполнено(Реализация.КладовщикТСД) Тогда
				Реализация.КладовщикТСД = МаршрутныйЛист.Кладовщик;
			КонецЕсли;
		КонецЕсли;

		//	Комплектовщик
		Если ЗначениеЗаполнено(ERPData.header.operator_control) Тогда       		
			МаршрутныйЛист.Кладовщик1 = Справочники.ИнформационныеКарты.НайтиПоНаименованию(ERPData.header.operator_control);
		КонецЕсли;
		
		//	Количество мест
        МаршрутныйЛист.КоличествоМест = ERPData.header.bulk_qty;
		
		// 	Время начала сборки, Время конца сборки 
	    Запрос = Новый Запрос;
	    Запрос.Текст = "ВЫБРАТЬ                       
		               |	Таблица.header_id,
	                   |	Таблица.control_scan_date
	                   |ПОМЕСТИТЬ ВТ_Таблица
	                   |ИЗ
	                   |	&Таблица КАК Таблица
	                   |ГДЕ
	                   |	Таблица.control_scan_date <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	                   |;
	                   |
	                   |////////////////////////////////////////////////////////////////////////////////
	                   |ВЫБРАТЬ
	                   |	МИНИМУМ(ВТ_Таблица.control_scan_date) КАК ВремяНачалаСборки,
	                   |	МАКСИМУМ(ВТ_Таблица.control_scan_date) КАК ВремяКонцаСборки
	                   |ИЗ
	                   |	ВТ_Таблица КАК ВТ_Таблица
	                   |
	                   |СГРУППИРОВАТЬ ПО
	                   |	ВТ_Таблица.header_id";		

		Запрос.УстановитьПараметр("Таблица", ERPData.ChildTables[0]);    
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			ВыборкаДетальныеЗаписи.Следующий();  
			
			МаршрутныйЛист.ВремяНачалаСборкиСборщиком = ВыборкаДетальныеЗаписи.ВремяНачалаСборки;
			МаршрутныйЛист.ВремяКонцаСборки 		  = ВыборкаДетальныеЗаписи.ВремяКонцаСборки;   
		КонецЕсли;
		
		//	Время конца проверки			
		//	?		
	КонецЕсли;
	
	//	Только данные о статусе
	Если ERPData.header.order_status = "Подобран" ИЛИ ERPData.header.order_status = "В пачке" Тогда	
		// При записи не перепроводить, не регистрировать по подписке к Эксопрту
		Реализация.ОбменДанными.Загрузка = Истина;
		Реализация.Записать(РежимЗаписиДокумента.Запись);
		
		Если МаршрутныйЛист <> Неопределено Тогда
			МаршрутныйЛист.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
		
		EmeWmsERPEngine.Success(ERPData); 		
		Возврат;				
	КонецЕсли;
		
	//	Валюта регламентированного учета
	мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	//	Коррекция табличной части товара по фактическому приходу
	Если НЕ EmeWmsУтилиты.ПроверитьТоварыНаСоответствие(Реализация, КартаТоваров) Тогда
		//	Перемещение на склад недостач
		Если ERPData.header.order_status = "Упакован" 
			И ЗначениеЗаполнено(Реализация.Контрагент) И Не Реализация.Контрагент.НеУдалятьКратность Тогда
			
			СкладНедостач = EmeWmsУтилиты.ПолучитьСкладНедостачДляСклада(Реализация.Склад);				
			Если ЗначениеЗаполнено(СкладНедостач) Тогда     
				ОформитьПеремещениеНаСкладНедостач(ERPData, ИдЕМЕ, НомерЕМЕ, Реализация, СкладНедостач, КартаТоваров);
			КонецЕсли;			
		КонецЕсли;
		
		EmeWmsУтилиты.СкорректироватьТабличнуюЧасть(Реализация, КартаТоваров);	
		
		//	Пересчет реквизитов ТЧ товары
		Для Каждого СтрокаТовара Из Реализация.Товары Цикл
			//	Пересчитываем только строки добавленные при Импорте
			Если ЗначениеЗаполнено(СтрокаТовара.СтавкаНДС) Тогда
				Продолжить;
			КонецЕсли;
			
			//	Выполнить общие действия для всех документов при изменении номенклатуры.
			ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(СтрокаТовара, Реализация);			
			
			//	Заполняем реквизиты табличной части.
			ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(СтрокаТовара, Реализация, "Реализация");
			ОбработкаТабличныхЧастей.ЗаполнитьСпособСписанияОстаткаТоваровТабЧасти(СтрокаТовара, Реализация);

			//	Заполнение цены зависит от розничности операции.
			ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуЦенуПродажиТабЧасти(СтрокаТовара, Реализация, мВалютаРегламентированногоУчета); 
																
			//ЗаписьЖурналаРегистрации("Сообщение", УровеньЖурналаРегистрации.Предупреждение, , ,Строка(СтрокаТовара.Цена));
													
			//	Рассчитать реквизиты табличной части.
			ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТовара, Реализация);
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТовара, Реализация);					
		КонецЦикла;
		
		Реализация.Комментарий = ERPData.header.comment + "(Документ скорректирован на основании отгрузки EME:" + НомерЕМЕ + ")";		
	Иначе
		//	Если документ не корректируется, добавить комментарий об импорте
		Реализация.Комментарий = ERPData.header.comment + "(Документ соответствует отгрузке EME:" + НомерЕМЕ + ")";
	КонецЕсли;  

	//	Проставление в строках даты и времени подтверждения артикула на контроле с ТСД
	Для Каждого СтрокаТовары Из Реализация.Товары Цикл
		Если Не ЗначениеЗаполнено(СтрокаТовары.EmeWmsУИДСтроки) Тогда
			Продолжить;
		КонецЕсли;     
		
		НайденнаяСтрока = ERPData.ChildTables[0].Найти(СтрокаТовары.EmeWmsУИДСтроки, "order_line_id");
	    Если НайденнаяСтрока <> Неопределено Тогда
	        СтрокаТовары.EmeWmsКонтроль = НайденнаяСтрока.control_scan_date;
	    КонецЕсли;		
	КонецЦикла;
	
	//	Количество факт в Маршрутном листе
	Если МаршрутныйЛист <> Неопределено Тогда	
		КартаТоваровДокумента = EmeWmsУтилиты.КопироватьСоответствие(КартаТоваров);
		
		Для Каждого СтрокаТовара Из МаршрутныйЛист.Товары Цикл
			Ключ = EmeWmsУтилиты.СоздатьКлючТовара(СтрокаТовара.Номенклатура, 
												   Неопределено, 
												   СтрокаТовара.ХарактеристикаНоменклатуры);

			КоличествоТоваров = ?(КартаТоваровДокумента.Получить(Ключ) = Неопределено, 0.0, КартаТоваровДокумента.Получить(Ключ));
			Коэффициент 	  = ?(СтрокаТовара.Коэффициент > 0, СтрокаТовара.Коэффициент, 1);			

			КолвоЕИ = Цел(КоличествоТоваров/Коэффициент);				
            МинКол = Мин(СтрокаТовара.Количество, КолвоЕИ); 
			
       		СтрокаТовара.КоличествоФакт = МинКол;
            КартаТоваровДокумента.Вставить(Ключ, КоличествоТоваров - МинКол*Коэффициент);				
		КонецЦикла;  
		
		МаршрутныйЛист.Записать(РежимЗаписиДокумента.Запись);		
	КонецЕсли;  
	
	//	Пометить для асинхронного проведения 
	Если ERPData.header.order_status = "Подтвержден" ИЛИ ERPData.header.order_status = "Закрыт" ИЛИ Реализация.Проведен Тогда
		EmeWmsПроведениеДокументов.ПометитьДокументКПроведению(Реализация.Ссылка);
	КонецЕсли;		
	
	//	Добавляет марки в ТЧ ШтрихкодыУпаковок документа
	//Если Константы.EmeWmsИмпортироватьМаркиЧЗ.Получить() Тогда  
	//	Параметры = Новый Структура;
	//	Параметры.Вставить("ERPData",		ERPData);
	//	Параметры.Вставить("ЗаказОбъект",	Реализация);
	//	ПолучитьТаблицуМарок(Параметры);
	//	
	//	Реализация.ШтрихкодыУпаковок.Очистить(); 
	//	ДобавитьМаркиВТЧШтрихкодыУпаковок(Реализация.ШтрихкодыУпаковок, Параметры.ТаблицаМарок);
	//КонецЕсли;        	
	
	СоздатьОтметкуОбИмпорте(Реализация.Ссылка, ИдЕМЕ);
	Реализация.Записать(РежимЗаписиДокумента.Запись);
	
	EmeWmsERPEngine.Success(ERPData); 
КонецПроцедуры

#КонецОбласти

#Область ЭкспортныеСлужебныеПроцедурыИФункции
//	Функция ПолучитьИмяСообщения возвращает имя сообщения
Функция ПолучитьИмяСообщения() Экспорт
	Возврат "despatch";
КонецФункции

//	Функция ПолучитьМетаданные возвращает метаданные сообщения
Функция ПолучитьМетаданные() Экспорт
	Возврат Метаданные.Документы.РеализацияТоваровУслуг;
КонецФункции

#КонецОбласти

#Область ЛокальныеСлужебныеПроцедурыИФункции

//	Оформить перемещение на склад недостач
Процедура ОформитьПеремещениеНаСкладНедостач(ERPData, ИдЕМЕ, НомерЕМЕ, Реализация, СкладНедостач, КартаТоваров)
	
    СкладНенайдено = Справочники.Склады.НайтиПоНаименованию("Ненайдено");
	Если Не ЗначениеЗаполнено(СкладНенайдено) Тогда
		СкладНенайдено = СкладНедостач;
	КонецЕсли;
	
	КартаТоваровВходящая = Новый Соответствие;
	Для Каждого Элем Из КартаТоваров Цикл
		КартаТоваровВходящая.Вставить(Элем.Ключ, Элем.Значение);
	КонецЦикла;
	
	КартаТоваровДокумента = EmeWmsУтилиты.ПолучитьКартуТоваровДокумента(Реализация);
	
	//	Заполним серии в строках с товаром
	КартаНедостач 		 = Новый Соответствие;            
	ТоварСсылка  		 = Неопределено;
	СерияСсылка 		 = Неопределено;
	ХарактеристикаСсылка = Неопределено;		
	Для Каждого Элем Из КартаТоваровДокумента Цикл  
		EmeWmsУтилиты.РазобратьКлючНаСсылки(Элем.Ключ, ТоварСсылка, СерияСсылка, ХарактеристикаСсылка);
		
		Если Не ЗначениеЗаполнено(СерияСсылка) Тогда
			Продолжить;
		КонецЕсли;
		
		Ключ = EmeWmsУтилиты.СоздатьКлючТовара(ТоварСсылка, Неопределено, ХарактеристикаСсылка);
		
		КоличествоТоваров = ?(КартаТоваровВходящая.Получить(Ключ) = Неопределено, 0.0, КартаТоваровВходящая.Получить(Ключ));
		
		Если Элем.Значение >= КоличествоТоваров Тогда
			КартаТоваровВходящая.Удалить(Ключ);
			КартаТоваровВходящая.Вставить(Элем.Ключ, КоличествоТоваров);
		Иначе     
			КартаТоваровВходящая.Вставить(Ключ, КоличествоТоваров - Элем.Значение);				
			КартаТоваровВходящая.Вставить(Элем.Ключ, Элем.Значение);
		КонецЕсли;
	КонецЦИкла;
	
	//	Заполним карту недостач с сериями		
	Для Каждого Элем Из КартаТоваровДокумента Цикл  
		КоличествоТоваров = ?(КартаТоваровВходящая.Получить(Элем.Ключ) = Неопределено, 0.0, КартаТоваровВходящая.Получить(Элем.Ключ));
		
		Если Элем.Значение > КоличествоТоваров Тогда
			КартаНедостач.Вставить(Элем.Ключ, Элем.Значение - КоличествоТоваров);
		КонецЕсли;
	КонецЦикла;
		
	СоздатьИзменитьДокументПеремещенияНаСкладНедостач(ERPData, ИдЕМЕ, НомерЕМЕ, Реализация, КартаНедостач, СкладНенайдено);
	
КонецПроцедуры

// 	Пересчитывает количества упаковок товара в ТЧ Товары
Процедура ПересчитатьУпаковкиДокумента(Документ)
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоУпаковок");
	Для Каждого СтрокаТовара Из Документ.Товары Цикл
		СтрокаТовара.Коэффициент = СтрокаТовара.ЕдиницаИзмерения.Коэффициент;
		ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТовара, Документ);
	КонецЦикла;
КонецПроцедуры  

//	Карта товаров: ключ = UID товара + UID серии + UID характеристики, значение = количество в ед.хранения
Процедура ПолучитьКоличестваТоваров(ERPData, КодЗоны, КартаТоваров, СерийныеНомера)
	
	//	Использование серий в интеграции
	ИспользоватьСерии = Константы.EmeWmsИспользоватьСерии.Получить();	
	
	// Весь товар в сообщении 
	КартаКлючей = Новый Соответствие;
	EmeWmsERPEngine.SelectChild(ERPData, "lines");
	Пока EmeWmsERPEngine.NextChildLine(ERPData) Цикл
		//	Проверим товар
		УИДТовара = ERPData.lines.goods_id;
		УИДЕдиницы = ERPData.lines.pack_id;
		Если УИДТовара = "" Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "GDSNUL");
			Продолжить
		КонецЕсли;
		
		ТоварСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаТовар(УИДТовара);
		Если ТоварСсылка.Пустая() Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "GDSBAD");
			Продолжить
		КонецЕсли;
		
		ЕдиницаИзмерения = EmeWmsУтилиты.ПолучитьСсылкуНаЕдиницуИзмерения(УИДЕдиницы);
		Если ЕдиницаИзмерения.Пустая() Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "PCKBAD");
			Продолжить
		КонецЕсли;

		РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТоварСсылка, "БазоваяЕдиницаИзмерения, 
																				|ВестиУчетПоСериям, ВестиУчетПоХарактеристикам"); 
		Если Не ИспользоватьСерии Тогда
			РеквизитыНоменклатуры.ВестиУчетПоСериям = Ложь;
		КонецЕсли;
		
		СерияНоменклатуры 		   	= Неопределено;
		ХарактеристикаНоменклатуры 	= Неопределено;
		
		Если РеквизитыНоменклатуры.ВестиУчетПоСериям Тогда   
			СерияНоменклатуры = EmeWmsУтилиты.ПолучитьСериюПоНаименованию(ERPData.lines.lot_no, ТоварСсылка);
		ИначеЕсли РеквизитыНоменклатуры.ВестиУчетПоХарактеристикам Тогда
			ХарактеристикаНоменклатуры = EmeWmsУтилиты.ПолучитьХарактеристикуПоНаименованию(ERPData.lines.lot_no, ТоварСсылка);
		КонецЕсли;
		
		КодЗоны 			= ERPData.lines.zone_code;
		КлючТовара 			= EmeWmsУтилиты.СоздатьКлючТовара(ТоварСсылка, СерияНоменклатуры, ХарактеристикаНоменклатуры);
		КоличествоВБазовой 	= EmeWmsУтилиты.ПересчетВДругуюЕдиницу(ERPData.lines.shipped_qty, 
																   ЕдиницаИзмерения, 
																   РеквизитыНоменклатуры.БазоваяЕдиницаИзмерения); 
																   
		КоличествоПоКарте 	= ?(КартаТоваров.Получить(КлючТовара) = Неопределено, 0, КартаТоваров.Получить(КлючТовара));
		КартаТоваров.Вставить(КлючТовара, КоличествоПоКарте + КоличествоВБазовой);
		// Это для привязки серийных номеров к товару
		КартаКлючей.Вставить(ERPData.lines.id, КлючТовара);
	КонецЦикла;
	
	// Заполнить карту серийных номеров товара (строка номеров по ключам товара)
	EmeWmsERPEngine.SelectChild(ERPData, "numbers");
	Пока EmeWmsERPEngine.NextChildLine(ERPData) Цикл 
		УИДСтроки = ERPData.numbers.despatch_line_id;
		КлючТовара = КартаКлючей.Получить(УИДСтроки); 
		
		// Номер серии: WMS "-" = 1С "Неизвестная серия"	
		СерийныйНомер = ?(ERPData.numbers.serial_no <> "-", ERPData.numbers.serial_no, "Неизвестная серия");																
		
		СтрокаНомеров = СерийныеНомера.Получить(КлючТовара);
		СерийныеНомера.Вставить(КлючТовара, ?(СтрокаНомеров = Неопределено, СерийныйНомер, СтрокаНомеров + "," + СерийныйНомер));
	КонецЦикла;	

КонецПроцедуры

// Функция возвращает ссылку на документ Перемещение товаров по ИД EME
Функция НайтиДокументПеремещенияТоваров(ИдЕМЕ)
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Перемещение.Ссылка КАК Ссылка,
		|	Перемещение.Ссылка.ПометкаУдаления КАК ПометкаУдаления
		|ИЗ
		|	РегистрСведений.EmeWmsОтметкиОбИмпортеПеремещенийТоваровКакОтгрузка КАК Перемещение
		|ГДЕ
		|	Перемещение.ID = &ИдЕМЕ";
	Запрос.УстановитьПараметр("ИдЕМЕ", ИдЕМЕ);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Если Выборка.ПометкаУдаления Тогда
			ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ДокументОбъект.УстановитьПометкуУдаления(Ложь);
		КонецЕсли;
		
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Документы.ПеремещениеТоваров.ПустаяСсылка();

КонецФункции

// Функция создает документ перемещения на склад недостач по карте товаров различий, возвращает ссылку на документ перемещения
Функция СоздатьИзменитьДокументПеремещенияНаСкладНедостач(ERPData, ИдЕМЕ, НомерЕМЕ, Распоряжение, КартаНедостач, СкладНенайдено)
	
	ИдРаспоряжение = "" + Распоряжение.Ссылка.УникальныйИдентификатор();
	ДокументСсылка = НайтиДокументПеремещенияТоваров(ИдРаспоряжение);
	Если ДокументСсылка.Пустая() Тогда 
		Если КартаНедостач.Количество() = 0 Тогда
			Возврат Документы.ПеремещениеТоваров.ПустаяСсылка();
		КонецЕсли;
		
		Документ = Документы.ПеремещениеТоваров.СоздатьДокумент();
		Документ.Заполнить(Распоряжение);
		Документ.ДокументОснование 			  = Распоряжение.Ссылка;
		Документ.Дата 						  = ТекущаяДата();
		Документ.Организация 				  = Распоряжение.Организация;
		Документ.СкладОтправитель 			  = Распоряжение.Склад;
		Документ.СкладПолучатель 			  = СкладНенайдено;
		Документ.ОтражатьВБухгалтерскомУчете  = Истина;
		Документ.ОтражатьВУправленческомУчете = Истина;
		Документ.ВидОперации 				  = Перечисления.ВидыОперацийПеремещениеТоваров.ТоварыПродукция;
		
		Документ.Комментарий = "Создан на основании документа прихода EME: " +
			НомерЕМЕ + " (" + ИдЕМЕ + ")" + " (" + ERPData.header.comment + ")";
	Иначе
		//	При повторном импорте не перезаполняем		
		Возврат Документы.ПеремещениеТоваров.ПустаяСсылка();	
	
		Документ = ДокументСсылка.ПолучитьОбъект();
		Документ.Товары.Очистить();
		Документ.Комментарий = "Изменен на основании документа прихода EME: " +
			НомерЕМЕ + " (" + ИдЕМЕ + ")" + " (" + ERPData.header.comment + ")";
	КонецЕсли;
		
	EmeWmsУтилиты.СкорректироватьТЧДокумента(Документ.Товары, КартаНедостач, Истина);
	//EmeWmsУтилиты.ЗаполнитьСерииТоваровПоДокументуОснованию(Документ.Товары, Распоряжение);	

	//	Валюта регламентированного учета
	мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();	
	
   	//	Карта заказов
	КартаЗаказов = Новый Соответствие;	
	Для Каждого СтрокаТовара из Распоряжение.Товары Цикл
		ТоварСсылка			= СтрокаТовара.Номенклатура;
		ТоварСерия 			= Неопределено;
		ТоварХарактеристика = Неопределено;
		
		РеквизитыТовара = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТоварСсылка, "ВестиУчетПоСериям, ВестиУчетПоХарактеристикам");
		Если РеквизитыТовара.ВестиУчетПоСериям Тогда
			ТоварСерия = СтрокаТовара.СерияНоменклатуры;
		ИначеЕсли РеквизитыТовара.ВестиУчетПоХарактеристикам Тогда
			ТоварХарактеристика = СтрокаТовара.ХарактеристикаНоменклатуры;
		КонецЕсли;                                          
		
		КлючТовара = EmeWmsУтилиты.СоздатьКлючТовара(СтрокаТовара.Номенклатура, ТоварСерия, ТоварХарактеристика);
		КартаЗаказов.Вставить(КлючТовара, СтрокаТовара.ЗаказПокупателя);
	КонецЦикла;	
	
	//	Пересчет реквизитов ТЧ товары
	Для Каждого СтрокаТовара Из Документ.Товары Цикл
		//	Пересчитываем только строки добавленные при Импорте
		Если ЗначениеЗаполнено(СтрокаТовара.Качество) Тогда
			Продолжить;
		КонецЕсли;
		
		//	Выполнить общие действия для всех документов при изменении номенклатуры.
		ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(СтрокаТовара, Документ);			
		
		УстановитьЦенуНоменклатуры(Документ, СтрокаТовара, мВалютаРегламентированногоУчета);

		СтрокаТовара.Качество = Справочники.Качество.Новый;
		
		Если Не ЗначениеЗаполнено(СтрокаТовара.Причина) Тогда
			СтрокаТовара.Причина = ПредопределенноеЗначение("Перечисление.ПричиныКорректировки.Недовоз");
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТовара.КомментарийКПричине) Тогда
			СтрокаТовара.КомментарийКПричине = Строка(СтрокаТовара.Причина);
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(СтрокаТовара.ДокументРезерва) Тогда
			Продолжить;
		КонецЕсли;
		
		//	Документ резерва
		ТоварСсылка			= СтрокаТовара.Номенклатура;
		ТоварСерия 			= Неопределено;
		ТоварХарактеристика = Неопределено;
		
		РеквизитыТовара = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТоварСсылка, "ВестиУчетПоСериям, ВестиУчетПоХарактеристикам");
		Если РеквизитыТовара.ВестиУчетПоСериям Тогда
			ТоварСерия = СтрокаТовара.СерияНоменклатуры;
		ИначеЕсли РеквизитыТовара.ВестиУчетПоХарактеристикам Тогда
			ТоварХарактеристика = СтрокаТовара.ХарактеристикаНоменклатуры;
		КонецЕсли;                                          
		
		КлючТовара = EmeWmsУтилиты.СоздатьКлючТовара(СтрокаТовара.Номенклатура, ТоварСерия, ТоварХарактеристика);
		
		ДокументРезерва = КартаЗаказов.Получить(КлючТовара);
		Если ЗначениеЗаполнено(ДокументРезерва) Тогда
			 СтрокаТовара.ДокументРезерва = ДокументРезерва;
		КонецЕсли;
	КонецЦикла;
		
	ПересчитатьУпаковкиДокумента(Документ);

	Документ.Записать(РежимЗаписиДокумента.Запись);
	СоздатьОтметкуОбИмпортеПеремещенияТоваров(Документ, ИдРаспоряжение);
	EmeWmsПроведениеДокументов.ПометитьДокументКПроведению(Документ.Ссылка, 2);
	
	Возврат Документ.Ссылка; 
	
КонецФункции

// Создает в регистре пометку об импорте документа реализации с номером EME
Процедура СоздатьОтметкуОбИмпорте(Документ, ИдЕМЕ)
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеРеализацийТоваровУслуг.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.ДатаИмпорта = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsОтметкиОбИмпортеРеализацийТоваровУслуг.СоздатьМенеджерЗаписи();
	НоваяЗапись.ID = ИдЕМЕ;
	НоваяЗапись.Ссылка = Документ.Ссылка;
	НоваяЗапись.ДатаИмпорта = ТекущаяДата();
    НоваяЗапись.Записать(); 
 
КонецПроцедуры

// Создает в регистре отметку об импорте Перемещения товаров с ID прихода EME
Процедура СоздатьОтметкуОбИмпортеПеремещенияТоваров(Документ, ИдЕМЕ)
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеПеремещенийТоваровКакОтгрузка.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.ДатаИмпорта = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsОтметкиОбИмпортеПеремещенийТоваровКакОтгрузка.СоздатьМенеджерЗаписи();
	НоваяЗапись.ID = ИдЕМЕ;
	НоваяЗапись.Ссылка = Документ.Ссылка;
	НоваяЗапись.ДатаИмпорта = ТекущаяДата();
    НоваяЗапись.Записать(); 
КонецПроцедуры

//	Устанавливает статус Маршрутного листа в регистре сведений СтатусыДоставки_ЛА
Процедура СтатусыДоставки_ЛА(РеализацияОбъект)
	
	НаборЗаписей = РегистрыСведений.СтатусыДоставки_ЛА.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(РеализацияОбъект.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.Статус = РеализацияОбъект.Статус;
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.СтатусыДоставки_ЛА.СоздатьМенеджерЗаписи(); 
	НоваяЗапись.Период = ТекущаяДата();
	НоваяЗапись.Объект = РеализацияОбъект.Ссылка;
	НоваяЗапись.Статус = РеализацияОбъект.Статус;
    НоваяЗапись.Записать(); 
	
КонецПроцедуры

//	Производит заполнение и установку необходимых полей при изменении товара в табличной части.
// Вызывается из:
//  ТоварыНоменклатураПриИзменении()
//  ВнешнееСобытие()
//
Процедура УстановитьЦенуНоменклатуры(Перемещение, СтрокаТабличнойЧасти, мВалютаРегламентированногоУчета)

	Если Не (Перемещение.СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.НТТ
		     или Перемещение.СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.НТТ) Тогда
		СтрокаТабличнойЧасти.Цена = 0;
	ИначеЕсли (Не Перемещение.СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.НТТ) 
		    И (Перемещение.СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.НТТ) Тогда
		ВалютаДокумента    = мВалютаРегламентированногоУчета;
		КурсДокумента      = 1;
		КратностьДокумента = 1;

		// Тип цен устанавливает склад получатель.
		СтрокаТабличнойЧасти.Цена = Ценообразование.ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура, 
										СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры,
		                              	Перемещение.СкладПолучатель.ТипЦенРозничнойТорговли, Перемещение.Дата, 
										СтрокаТабличнойЧасти.ЕдиницаИзмерения,
		                              	ВалютаДокумента, КурсДокумента, КратностьДокумента);
	ИначеЕсли Перемещение.СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
		ВалютаДокумента    = мВалютаРегламентированногоУчета;
		КурсДокумента      = 1;
		КратностьДокумента = 1;

		СтрокаТабличнойЧасти.Цена = УправлениеРозничнойТорговлей.ПолучитьРозничнуюЦену(СтрокаТабличнойЧасти.Номенклатура,, 
															Перемещение.СкладОтправитель,
		                                                  	мВалютаРегламентированногоУчета, Перемещение.Дата,
		                                                  	СтрокаТабличнойЧасти.ЕдиницаИзмерения,
		                                                  	ВалютаДокумента, КурсДокумента, КратностьДокумента);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область МаркиЧЗ 

//	Добавляет марки в ТЧ ШтрихкодыУпаковок документа
Процедура ДобавитьМаркиВТЧШтрихкодыУпаковок(ТЧШтрихкодыУпаковок, ТаблицаМарок)  
	
	Для Каждого СтрокаМарок Из ТаблицаМарок Цикл
		//	Штрихкод марки
		ШтрихкодУпаковки = НайтиСоздатьШтрихкодУпаковки(СтрокаМарок);
		
		//  Штрихкод упаковки
		Если ЗначениеЗаполнено(СтрокаМарок.ШтрихкодКороба) Тогда
			ШтрихкодУпаковки = НайтиСоздатьШтрихкодМонотоварнойУпаковки(СтрокаМарок, СтрокаМарок.ШтрихкодКороба, ШтрихкодУпаковки);
			
			//	Штрихкод паллеты
			Если ЗначениеЗаполнено(СтрокаМарок.ШтрихкодПаллеты) Тогда
				ШтрихкодУпаковки = НайтиСоздатьШтрихкодМонотоварнойУпаковки(СтрокаМарок, СтрокаМарок.ШтрихкодПаллеты, ШтрихкодУпаковки);				
			КонецЕсли;
		КонецЕсли;
		
		//	Поиск Штрихкода в Штрихкодах упаковки проверяемого документа
		Отбор = Новый Структура();
		Отбор.Вставить("ШтрихкодУпаковки", ШтрихкодУпаковки);
			
		МассивСтрок = ТЧШтрихкодыУпаковок.НайтиСтроки(Отбор);
		Если МассивСтрок.Количество() > 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		СтрокаШтрихкода = ТЧШтрихкодыУпаковок.Добавить();
		СтрокаШтрихкода.ШтрихкодУпаковки = ШтрихкодУпаковки;
	КонецЦикла;
	
КонецПроцедуры   

//	Находит или создает новую строку в справочнике ШтрикодыУпаковокТовара
Функция НайтиСоздатьШтрихкодМонотоварнойУпаковки(СтрокаМарок, ЗначениеШтрихкода, ВложенныйШтрихкод)
	
	Штрихкод = Справочники.ШтрихкодыУпаковокТоваров.НайтиПоРеквизиту("ЗначениеШтрихкода", ЗначениеШтрихкода);
	Если Штрихкод.Пустая() Тогда
		ШтрихкодОбъект = Справочники.ШтрихкодыУпаковокТоваров.СоздатьЭлемент();
		ШтрихкодОбъект.ЗначениеШтрихкода  = ЗначениеШтрихкода;
		ШтрихкодОбъект.ТипШтрихкода 	  = Перечисления.ТипыШтрихкодов.GS1_DataMatrix;
		ШтрихкодОбъект.ТипУпаковки 		  = Перечисления.ТипыУпаковок.МонотоварнаяУпаковка;
		ШтрихкодОбъект.Количество	   	  = 1;
		ШтрихкодОбъект.ДатаУпаковки 	  = ТекущаяДата();
	Иначе
		ШтрихкодОбъект = Штрихкод.ПолучитьОбъект();
		
		//	Поиск Штрихкода в Штрихкодах упаковки проверяемого документа
		Отбор = Новый Структура();
		Отбор.Вставить("Штрихкод", ВложенныйШтрихкод);
			
		МассивСтрок = ШтрихкодОбъект.ВложенныеШтрихкоды.НайтиСтроки(Отбор);
		Если МассивСтрок.Количество() > 0 Тогда 
			Возврат ШтрихкодОбъект.Ссылка;
		КонецЕсли;		
	КонецЕсли;
			
	НоваяСтрока = ШтрихкодОбъект.ВложенныеШтрихкоды.Добавить();
	НоваяСтрока.Штрихкод = ВложенныйШтрихкод;
	
	ШтрихкодОбъект.Записать();
	
	Возврат ШтрихкодОбъект.Ссылка;   	
	
КонецФункции

//	Находит или создает новую строку в справочнике ШтрикодыУпаковокТовара
Функция НайтиСоздатьШтрихкодУпаковки(СтрокаМарок)
	
	Штрихкод = Справочники.ШтрихкодыУпаковокТоваров.НайтиПоРеквизиту("ЗначениеШтрихкода", СтрокаМарок.ЗначениеШтрихкода);
	Если Не Штрихкод.Пустая() Тогда
		Возврат Штрихкод;
	КонецЕсли;
	
	Штрихкод = Справочники.ШтрихкодыУпаковокТоваров.СоздатьЭлемент(); 
	ЗаполнитьЗначенияСвойств(Штрихкод, СтрокаМарок, , "Количество");
	
	Штрихкод.ТипШтрихкода 	= Перечисления.ТипыШтрихкодов.GS1_DataMatrix;
	Штрихкод.ТипУпаковки 	= Перечисления.ТипыУпаковок.МаркированныйТовар;
	Штрихкод.Количество	    = 1;
	Штрихкод.ДатаУпаковки 	= ТекущаяДата();
	
	Штрихкод.Записать();
	
	Возврат Штрихкод.Ссылка;   	
	
КонецФункции

//  Получить таблицу марок
Процедура ПолучитьТаблицуМарок(Параметры)
	
	ERPData		 = Параметры.ERPData;
	ТаблицаМарок = РазметитьТаблицуМарок();
	НаименованияРеквизитов = "ВестиУчетПоСериям, ВестиУчетПоХарактеристикам";
	
	EmeWmsERPEngine.SelectChild(ERPData, "sscc");
	Пока EmeWmsERPEngine.NextChildLine(ERPData) Цикл  
		ТоварСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаТовар(ERPData.sscc.goods_id);
		Если ТоварСсылка.Пустая() Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "GDSBAD");
			Продолжить
		КонецЕсли;            
		
		РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТоварСсылка, НаименованияРеквизитов);
		
		Если НЕ EmeWmsУтилиты.ПродукцияМаркируемаяДляГИСМ(ТоварСсылка) Тогда 
			Продолжить;
		КонецЕсли;
		
		СерияНоменклатуры 		   	= Неопределено;
		ХарактеристикаНоменклатуры 	= Неопределено;
		
		// Серия или Характеристика			
		Если РеквизитыНоменклатуры.ВестиУчетПоСериям Тогда   
			СерияНоменклатуры = EmeWmsУтилиты.ПолучитьСериюПоНомеру(ERPData.sscc.lot_no, ТоварСсылка);
		Иначе                  
			Если РеквизитыНоменклатуры.ВестиУчетПоХарактеристикам Тогда      
				ХарактеристикаНоменклатуры = EmeWmsУтилиты.ПолучитьХарактеристикуПоНаименованию(ERPData.sscc.lot_no, ТоварСсылка);
			КонецЕсли;                           
		КонецЕсли;                           
					
		КодМарки = ERPData.sscc.true_sign;
		Если ЗначениеЗаполнено(КодМарки) Тогда
			СтрокаМарки = ТаблицаМарок.Добавить();
			СтрокаМарки.Номенклатура 	  = ТоварСсылка;
			СтрокаМарки.Характеристика 	  = ХарактеристикаНоменклатуры;
			СтрокаМарки.Серия 			  = СерияНоменклатуры;
			СтрокаМарки.Упаковка 		  = EmeWmsУтилиты.ПолучитьБазовуюЕдиницуИзмерения(ТоварСсылка);
			СтрокаМарки.Количество		  = ERPData.sscc.quantity;
			СтрокаМарки.ЗначениеШтрихкода = EmeWmsУтилиты.КодМаркиВЗначениеСоСкобками(КодМарки);
			СтрокаМарки.ШтрихкодКороба	  = EmeWmsУтилиты.КодМаркиВЗначениеСоСкобками(ERPData.sscc.box_sscc);
			СтрокаМарки.ШтрихкодПаллеты   = EmeWmsУтилиты.КодМаркиВЗначениеСоСкобками(ERPData.sscc.pallet_sscc);			
		КонецЕсли;
	КонецЦикла;	
		
	Параметры.Вставить("ТаблицаМарок", ТаблицаМарок);

	//	Тестирование Интеграции марок, подберем случайным образом необходиоме количество марок по Номенклатуре
	// ТестированиеИмпортаМарок(Параметры);
	
КонецПроцедуры

//	Создает таблицу для отгруженных марок ЧЗ из sscc сообщения despatch
Функция РазметитьТаблицуМарок()
	ТаблицаМарок = Новый ТаблицаЗначений;
	ТаблицаМарок.Колонки.Добавить("Номенклатура");
	ТаблицаМарок.Колонки.Добавить("Характеристика");
	ТаблицаМарок.Колонки.Добавить("Упаковка");
	ТаблицаМарок.Колонки.Добавить("Серия");
	ТаблицаМарок.Колонки.Добавить("Количество");
	ТаблицаМарок.Колонки.Добавить("ЗначениеШтрихкода");
	ТаблицаМарок.Колонки.Добавить("ШтрихкодКороба");
	ТаблицаМарок.Колонки.Добавить("ШтрихкодПаллеты");
	
	Возврат ТаблицаМарок;
КонецФункции

#КонецОбласти

#Область ТестированиеМарокЧЗ 

//	Сгенерировать штрихкоды упаковок
Процедура СгенерироватьШтрихкодыУпаковкок(Параметры)         
	
	ГСЧ = Новый ГенераторСлучайныхЧисел(День(ТекущаяДата())*84600 + Час(ТекущаяДата())*3600 + Минута(ТекущаяДата())*60 + Секунда(ТекущаяДата()));	
	
	//	Минимальное количество генерируемых марок
	Количество  = ?(Параметры.СтрокаТовара.Количество > 10, 10, Параметры.СтрокаТовара.Количество * Параметры.СтрокаТовара.Коэффициент);
		
	//	Значение штрихкода короба должно быть уникальным (15 попыток получить уникальный ШК)
	Для н = 1 По 15 Цикл
		ШККороба = СоздатьРандомныйШК(ГСЧ);				
		ШКСсылка = Справочники.ШтрихкодыУпаковокТоваров.НайтиПоРеквизиту("ЗначениеШтрихкода", ШККороба);
		
		Если НЕ ЗначениеЗаполнено(ШКСсылка) Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла; 

	
	Для МаркаПоТовару = 1 По Количество Цикл
		
		Если Не EmeWmsУтилиты.ПродукцияМаркируемаяДляГИСМ(Параметры.СтрокаТовара.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		//	Значение штрихкода должно быть уникальным (15 попыток получить уникальный ШК)
		Для н = 1 По 15 Цикл
			ШКМарки  = СоздатьРандомныйШК(ГСЧ);				
			ШКСсылка = Справочники.ШтрихкодыУпаковокТоваров.НайтиПоРеквизиту("ЗначениеШтрихкода", ШКМарки);
			
			Если НЕ ЗначениеЗаполнено(ШКСсылка) Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла; 
		
		Если ЗначениеЗаполнено(ШКСсылка) Тогда
			ТекстСообщения = НСтр("ru='Штрихкоды упаковок не заполнены, дублируются номера Штрихкода'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		Параметры.Вставить("ЗначениеШтрихкода", ШКМарки);
		
		//	Пераые три марки упакуем в короб
		Если МаркаПоТовару < 4 Тогда
			Параметры.Вставить("ШтрихкодКороба", ШККороба);
		Иначе
			Параметры.Вставить("ШтрихкодКороба", "");
		КонецЕсли;
		
		СоздатьНовыйШКВСправочнике(Параметры);		
		
	КонецЦикла;
	
	Параметры.Удалить("ЗначениеШтрихкода");
	Параметры.Удалить("ШтрихкодКороба");
		
КонецПроцедуры

//	Записать в справочник новый штрихкод упаковки
Процедура СоздатьНовыйШКВСправочнике(Параметры)
	
	НовыйЭлемент = Справочники.ШтрихкодыУпаковокТоваров.СоздатьЭлемент(); 

	ЗаполнитьЗначенияСвойств(НовыйЭлемент, Параметры.СтрокаТовара);
	
	Если ЗначениеЗаполнено(Параметры.СтрокаТовара.ЕдиницаИзмерения) Тогда
		НовыйЭлемент.Упаковка = Параметры.СтрокаТовара.ЕдиницаИзмерения;
	Иначе
		НовыйЭлемент.Упаковка = EmeWmsУтилиты.ПолучитьБазовуюЕдиницуИзмерения(Параметры.СтрокаТовара.Номенклатура);
	КонецЕсли;

	НовыйЭлемент.ЗначениеШтрихкода	= Параметры.ЗначениеШтрихкода;
	НовыйЭлемент.ТипШтрихкода		= Перечисления.ТипыШтрихкодов.GS1_DataMatrix;
	НовыйЭлемент.ТипУпаковки        = Перечисления.ТипыУпаковок.МаркированныйТовар;
	НовыйЭлемент.Количество			= 1;
	НовыйЭлемент.ДатаУпаковки 	 	= ТекущаяДата();
	НовыйЭлемент.Записать();	

	СтрокаМарки = Параметры.ТаблицаМарок.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаМарки, НовыйЭлемент);
	СтрокаМарки.ШтрихкодКороба = Параметры.ШтрихкодКороба; 
	
КонецПроцедуры

//	Сгенерировать случайный штрихкод
Функция СоздатьРандомныйШК(ГСЧ)
	
	СтрокаЦифр = "0123456789";
	СтрокаБукв = "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWYZ,-.!?%></;*'_+=()";
	
	// (01)04602443466045(21)P=uxqUQfzw'Ut
	СтрокаШК = "(01)";
	Для инд1 = 1 По 14 Цикл                         
		Позиция1 = ГСЧ.СлучайноеЧисло(1,10);
		СтрокаШК = СтрокаШК + Сред(СтрокаЦифр, Позиция1, 1);
	КонецЦикла;
	СтрокаШК = СтрокаШК + "(21)";
	Для инд1 = 1 По 13 Цикл
		Позиция1 = ГСЧ.СлучайноеЧисло(1, СтрДлина(СтрокаБукв));
		СтрокаШК = СтрокаШК + Сред(СтрокаБукв, Позиция1, 1);
	КонецЦикла; 
	
	Возврат СтрокаШК;
	
КонецФункции    

//	Тестирование Интеграции марок, подберем случайным образом необходиоме количество марок по Номенклатуре
Процедура ТестированиеИмпортаМарок(Параметры)

	Если ЗначениеЗаполнено(Параметры.ТаблицаМарок) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТовара Из Параметры.ЗаказОбъект.Товары Цикл
		Если Не EmeWmsУтилиты.ПродукцияМаркируемаяДляГИСМ(СтрокаТовара.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;  
		
		Если ЗначениеЗаполнено(СтрокаТовара.ЕдиницаИзмерения) Тогда
			Упаковка = СтрокаТовара.ЕдиницаИзмерения;
		Иначе
			Упаковка = EmeWmsУтилиты.ПолучитьБазовуюЕдиницуИзмерения(СтрокаТовара.Номенклатура);
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки
		|ПОМЕСТИТЬ ВТ_ШтрихкодыУпаковок
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.ШтрихкодыУпаковок КАК РеализацияТоваровУслугШтрихкодыУпаковок
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ШтрихкодУпаковки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ &КоличествоМарок
		|	ШтрихкодыУпаковокТоваров.Номенклатура КАК Номенклатура,
		|	ШтрихкодыУпаковокТоваров.Характеристика КАК Характеристика,
		|	ШтрихкодыУпаковокТоваров.Упаковка КАК Упаковка,
		|	ШтрихкодыУпаковокТоваров.Серия КАК Серия,
		|	ШтрихкодыУпаковокТоваров.Количество КАК Количество,
		|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода КАК ЗначениеШтрихкода
		|ИЗ
		|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ШтрихкодыУпаковок КАК ВТ_ШтрихкодыУпаковок
		|		ПО ШтрихкодыУпаковокТоваров.Ссылка = ВТ_ШтрихкодыУпаковок.ШтрихкодУпаковки
		|ГДЕ
		|	ВТ_ШтрихкодыУпаковок.ШтрихкодУпаковки ЕСТЬ NULL
		|	И НЕ ШтрихкодыУпаковокТоваров.ПометкаУдаления
		|	И ШтрихкодыУпаковокТоваров.Номенклатура = &Номенклатура
		|	И ШтрихкодыУпаковокТоваров.Характеристика = &Характеристика
		|	И ШтрихкодыУпаковокТоваров.Упаковка = &Упаковка
		|	И ШтрихкодыУпаковокТоваров.Серия = &Серия
		|	И ШтрихкодыУпаковокТоваров.ТипУпаковки = &ТипУпаковки
		|	И ШтрихкодыУпаковокТоваров.ТипШтрихкода = &ТипШтрихкода";
				
		КоличествоМарок = ?(СтрокаТовара.Количество > 10, 10, СтрокаТовара.Количество * СтрокаТовара.Коэффициент);                		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&КоличествоМарок", СтрЗаменить(Строка(КоличествоМарок), Символы.НПП, "")); 
		
		Запрос.УстановитьПараметр("Номенклатура", 	 СтрокаТовара.Номенклатура);
		Запрос.УстановитьПараметр("Характеристика",  СтрокаТовара.ХарактеристикаНоменклатуры);
		Запрос.УстановитьПараметр("Упаковка", 		 Упаковка);
		Запрос.УстановитьПараметр("Серия", 			 СтрокаТовара.СерияНоменклатуры);
		Запрос.УстановитьПараметр("ТипУпаковки", 	 Перечисления.ТипыУпаковок.МаркированныйТовар);
		Запрос.УстановитьПараметр("ТипШтрихкода", 	 Перечисления.ТипыШтрихкодов.GS1_DataMatrix);
	
		РезультатЗапроса = Запрос.Выполнить();   
		
		Если РезультатЗапроса.Пустой() Тогда         
			Параметры.Вставить("СтрокаТовара", СтрокаТовара);
			СгенерироватьШтрихкодыУпаковкок(Параметры);
			
			Продолжить;
		КонецЕсли;
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтрокаМарки = Параметры.ТаблицаМарок.Добавить();
            ЗаполнитьЗначенияСвойств(СтрокаМарки, ВыборкаДетальныеЗаписи);
		КонецЦикла;
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти