
#Если Сервер Или ТолстыйКлиентУправляемоеПриложение Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Признак "Клиент (управляемое приложение)" и инструкция препроцессора установлены
// для поддержки толстого клиента в управляемом приложении в режиме клиент-сервер
// Смотрите п.2 в статье ИТС https://its.1c.ru/db/v8std#content:680:hdoc

// #Область СлужебныйПрограммныйИнтерфейс

// См. ОбщегоНазначенияКонтурМаркировка.РежимУправленияБлокировкой()
//
Функция РежимУправленияБлокировкой() Экспорт
	
	РежимыУправления = Метаданные.СвойстваОбъектов.РежимУправленияБлокировкойДанныхПоУмолчанию;
	ТекущийРежимБлокировки = Метаданные.РежимУправленияБлокировкойДанных;
	
	Если ТекущийРежимБлокировки = РежимыУправления.АвтоматическийИУправляемый Тогда
		Результат = РежимУправленияБлокировкойДанных.Автоматический;
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// См. ОбщегоНазначенияКонтурМаркировка.ИспользуетсяУправляемыйРежимБлокировок()
//
Функция ИспользуетсяУправляемыйРежимБлокировок() Экспорт
	
	РежимыУправления = Метаданные.СвойстваОбъектов.РежимУправленияБлокировкойДанныхПоУмолчанию;
	ТекущийРежимБлокировки = Метаданные.РежимУправленияБлокировкойДанных;
	
	Результат = (ТекущийРежимБлокировки = РежимыУправления.Управляемый);
	
	Возврат Результат;
	
КонецФункции

// См. ОбщегоНазначенияКонтурМаркировка.МенеджерОбъектаПоПолномуИмени()
//
Функция МенеджерОбъектаПоПолномуИмени(ПолноеИмя) Экспорт
	
	ЧастиИмени = ОбщегоНазначенияКонтурМаркировка.РазделитьСтроку(ПолноеИмя, ".");
	Если ЧастиИмени.Количество() < 2 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИмяКласса = ЧастиИмени[0];
	ИмяОбъекта = ЧастиИмени[1];
	
	Менеджеры = Новый Соответствие;
	Менеджеры.Вставить(НРег("Документ"), Документы);
	Менеджеры.Вставить(НРег("Справочник"), Справочники);
	Менеджеры.Вставить(НРег("Перечисление"), Перечисления);
	Менеджеры.Вставить(НРег("БизнесПроцесс"), БизнесПроцессы);
	Менеджеры.Вставить(НРег("Задача"), Задачи);
	Менеджеры.Вставить(НРег("ПланОбмена"), ПланыОбмена);
	Менеджеры.Вставить(НРег("ПланВидовХарактеристик"), ПланыВидовХарактеристик);
	
	Менеджер = Менеджеры[НРег(ИмяКласса)];
	Если Менеджер = Неопределено Тогда
		ТекстОшибки = НСтр("ru = 'Не удалось получить менеджер класса метаданных: '") + ИмяКласса;
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Возврат Менеджер[ИмяОбъекта];
	
КонецФункции

// См. ОбщегоНазначенияКонтурМаркировка.ВерсияРежимаСовместимости()
//
Функция ВерсияРежимаСовместимости() Экспорт
	
	РежимСовместимости = Метаданные.РежимСовместимости;
	
	Если РежимСовместимости = Метаданные.СвойстваОбъектов.РежимСовместимости.НеИспользовать Тогда
		Результат = ОбщегоНазначенияКонтурМаркировка.ВерсияПлатформы();
	Иначе
		Результат = Строка(РежимСовместимости);
		Результат = СтрЗаменить(Результат, "Версия", "");
		Результат = СтрЗаменить(Результат, "Version", "");
		Результат = СтрЗаменить(Результат, "_", ".");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// См. ОбщегоНазначенияКонтурМаркировка.ВерсияПлатформыНиже()
//
Функция ВерсияПлатформыНиже(Версия) Экспорт
	
	ВерсияПлатформы = ОбщегоНазначенияКонтурМаркировка.ВерсияПлатформы();
	
	Возврат (ОбщегоНазначенияКонтурМаркировка.СравнитьВерсии(ВерсияПлатформы, Версия) < 0);
	
КонецФункции

// См. ОбщегоНазначенияКонтурМаркировка.ВерсияРежимаСовместимостиНиже()
//
Функция ВерсияРежимаСовместимостиНиже(Версия) Экспорт
	
	Возврат (ОбщегоНазначенияКонтурМаркировка.СравнитьВерсии(ВерсияРежимаСовместимости(), Версия) < 0);
	
КонецФункции

// См. ОбщегоНазначенияКонтурМаркировка.ЕстьНеобходимыеМетаданные()
//
Функция ЕстьНеобходимыеМетаданные(СтрокаМетаданных) Экспорт
	
	Результат = Истина;
	МассивИмен = ОбщегоНазначенияКонтурМаркировка.РазделитьСтроку(СтрокаМетаданных, ".", Истина);
	КоличествоИмен = МассивИмен.Количество();
	
	// КоличествоИмен = 2 для проверки наличия объекта, например 					Справочники.КонтурEDI_Сообщения
	// КоличествоИмен = 4 для проверки наличия реквизита\ресурса и т.д., например	Справочники.КонтурEDI_Сообщения.Реквизиты.Организация
	// КоличествоИмен = 6 для проверки наличия реквизита таб. части, например		Справочники.КонтурEDI_Сообщения.ТабличныеЧасти.ДополнительныеРеквизиты.Реквизиты.ЗначениеСтрока
	
	Если КоличествоИмен <> 2 И КоличествоИмен <> 4 И КоличествоИмен <> 6 Тогда
		
		Результат = Ложь;
		
	Иначе
		
		ТекущиеМетаданные = Метаданные;
		КоличествоПоисков = КоличествоИмен / 2;
		
		Для Сч = 1 По КоличествоПоисков Цикл
			
			Владелец = МассивИмен[Сч * 2 - 2];
			Реквизит = МассивИмен[Сч * 2 - 1];
			
			Если Сч = 1 Тогда
				Владелец = ИмяКлассаМетаданных(Владелец);
			КонецЕсли;
			
			ТекущиеМетаданные = ТекущиеМетаданные[Владелец].Найти(Реквизит);
			Если ТекущиеМетаданные = Неопределено Тогда
				Результат = Ложь;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// См. ОбщегоНазначенияКонтурМаркировка.СравнитьВерсии()
//
Функция СравнитьВерсии(Версия1, Версия2) Экспорт
	
	// Для составных номеров версий берем только первую часть
	Строка1 = Сред(Версия1, 1, Найти(Версия1, "-") - 1);
	Строка2 = Сред(Версия2, 1, Найти(Версия2, "-") - 1);
	Строка1 = Сред(Строка1, 1, Найти(Строка1, "/") - 1);
	Строка2 = Сред(Строка2, 1, Найти(Строка2, "/") - 1);
	
	ОписаниеЧисла = Новый ОписаниеТипов("Число");
	
	Результат = 0;
	
	Пока ЗначениеЗаполнено(Строка1)
		Или ЗначениеЗаполнено(Строка2) Цикл
		
		Поз = Найти(Строка1, ".");
		Если Поз = 0 Тогда
			Подстрока1 = СокрЛП(Строка1);
			Строка1 = "";
		Иначе
			Подстрока1 = СокрЛП(Лев(Строка1, Поз - 1));
			Строка1 = Сред(Строка1, Поз + 1);
		КонецЕсли;
		
		Поз = Найти(Строка2, ".");
		Если Поз = 0 Тогда
			Подстрока2 = СокрЛП(Строка2);
			Строка2 = "";
		Иначе
			Подстрока2 = СокрЛП(Лев(Строка2, Поз - 1));
			Строка2 = Сред(Строка2, Поз + 1);
		КонецЕсли;
		
		НомерВерсии1 = ОписаниеЧисла.ПривестиЗначение(Подстрока1);
		НомерВерсии2 = ОписаниеЧисла.ПривестиЗначение(Подстрока2);
		
		Результат = НомерВерсии1 - НомерВерсии2;
		
		Если Результат <> 0 Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает описание защиты от опасных действий
// с отключенным предупреждением об опасных действиях
// 
// Возвращаемое значение:
//  ОписаниеЗащитыОтОпасныхДействий
//
Функция ОписаниеЗащитыБезПредупреждений() Экспорт
	
	Результат = Новый("ОписаниеЗащитыОтОпасныхДействий");
	
	Результат.ПредупреждатьОбОпасныхДействиях = Ложь;
	
	Возврат Результат;
	
КонецФункции

// Проверяет наличие механизма платформы, предупреждающего об опасных действиях.
// Механизм доступен начиная с версии платформы 8.3.8 и выше
//
// Возвращаемое значение:
//  Булево - Истина, если механизм предупреждений безопасности есть
//
Функция ЕстьЗащитаОтОпасныхДействий() Экспорт
	
	Свойства = Новый Структура("ЗащитаОтОпасныхДействий, UnsafeOperationProtection");
	ЗаполнитьЗначенияСвойств(Свойства, ПользователиИнформационнойБазы.ТекущийПользователь());
	
	Если Свойства.ЗащитаОтОпасныхДействий <> Неопределено
		Или Свойства.UnsafeOperationProtection <> Неопределено Тогда
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Определяет в каком приложении запущена обработка
//
// Возвращаемое значение:
//  Булево - Истина, если обработка запущена в толстом клиенте в режиме обычного приложения
//
Функция ЭтоОбычноеПриложение() Экспорт
	
	Результат = Ложь;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Результат = Истина;
	#КонецЕсли
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти // СлужебныйПрограммныйИнтерфейс

// #Область СлужебныеПроцедурыИФункции

// Возвращает нормализованное имя класса метаданных
//
// Параметры:
//  ПроизвольноеИмяКласса - Строка - любой вариант имени класса;
// 
// Возвращаемое значение:
//  Строка - нормализованное имя класса;
//
Функция ИмяКлассаМетаданных(ПроизвольноеИмяКласса)
	
	ИменаКлассов = Новый Соответствие;
	
	Класс = "Справочники";
	ИменаКлассов.Вставить(НРег(Класс), Класс);
	ИменаКлассов.Вставить(НРег("Справочник"), Класс);
	ИменаКлассов.Вставить(НРег("СправочникСсылка"), Класс);
	ИменаКлассов.Вставить(НРег("СправочникОбъект"), Класс);
	
	Класс = "Документы";
	ИменаКлассов.Вставить(НРег(Класс), Класс);
	ИменаКлассов.Вставить(НРег("Документ"), Класс);
	ИменаКлассов.Вставить(НРег("ДокументСсылка"), Класс);
	ИменаКлассов.Вставить(НРег("ДокументОбъект"), Класс);
	
	Класс = "ПланыВидовХарактеристик";
	ИменаКлассов.Вставить(НРег(Класс), Класс);
	ИменаКлассов.Вставить(НРег("ПланВидовХарактеристик"), Класс);
	ИменаКлассов.Вставить(НРег("ПланВидовХарактеристикСсылка"), Класс);
	ИменаКлассов.Вставить(НРег("ПланВидовХарактеристикОбъект"), Класс);
	
	Класс = "ПланыОбмена";
	ИменаКлассов.Вставить(НРег(Класс), Класс);
	ИменаКлассов.Вставить(НРег("ПланОбмена"), Класс);
	ИменаКлассов.Вставить(НРег("ПланОбменаСсылка"), Класс);
	ИменаКлассов.Вставить(НРег("ПланОбменаОбъект"), Класс);
	
	Класс = "БизнесПроцессы";
	ИменаКлассов.Вставить(НРег(Класс), Класс);
	ИменаКлассов.Вставить(НРег("БизнесПроцесс"), Класс);
	ИменаКлассов.Вставить(НРег("БизнесПроцессСсылка"), Класс);
	ИменаКлассов.Вставить(НРег("БизнесПроцессОбъект"), Класс);
	
	Класс = "Задачи";
	ИменаКлассов.Вставить(НРег(Класс), Класс);
	ИменаКлассов.Вставить(НРег("Задача"), Класс);
	ИменаКлассов.Вставить(НРег("ЗадачаСсылка"), Класс);
	ИменаКлассов.Вставить(НРег("ЗадачаОбъект"), Класс);
	
	Класс = "Перечисления";
	ИменаКлассов.Вставить(НРег(Класс), Класс);
	ИменаКлассов.Вставить(НРег("Перечисление"), Класс);
	ИменаКлассов.Вставить(НРег("ПеречислениеСсылка"), Класс);
	ИменаКлассов.Вставить(НРег("ПеречислениеОбъект"), Класс);
	
	Класс = "Константы";
	ИменаКлассов.Вставить(НРег(Класс), Класс);
	ИменаКлассов.Вставить(НРег("Константа"), Класс);
	ИменаКлассов.Вставить(НРег("КонстантаСсылка"), Класс);
	ИменаКлассов.Вставить(НРег("КонстантаОбъект"), Класс);
	
	Класс = "Отчеты";
	ИменаКлассов.Вставить(НРег(Класс), Класс);
	ИменаКлассов.Вставить(НРег("Отчет"), Класс);
	ИменаКлассов.Вставить(НРег("ОтчетОбъект"), Класс);
	
	Класс = "Обработки";
	ИменаКлассов.Вставить(НРег(Класс), Класс);
	ИменаКлассов.Вставить(НРег("Обработка"), Класс);
	ИменаКлассов.Вставить(НРег("ОбработкаОбъект"), Класс);
	
	Класс = "ВнешниеОтчеты";
	ИменаКлассов.Вставить(НРег(Класс), Класс);
	ИменаКлассов.Вставить(НРег("ВнешнийОтчет"), Класс);
	ИменаКлассов.Вставить(НРег("ВнешнийОтчетОбъект"), Класс);
	
	Класс = "ВнешниеОбработки";
	ИменаКлассов.Вставить(НРег(Класс), Класс);
	ИменаКлассов.Вставить(НРег("ВнешняяОбработка"), Класс);
	ИменаКлассов.Вставить(НРег("ВнешняяОбработкаОбъект"), Класс);
	
	Класс = "РегистрыСведений";
	ИменаКлассов.Вставить(НРег(Класс), Класс);
	ИменаКлассов.Вставить(НРег("РегистрСведений"), Класс);
	
	Класс = "РегистрыНакопления";
	ИменаКлассов.Вставить(НРег(Класс), Класс);
	ИменаКлассов.Вставить(НРег("РегистрНакопления"), Класс);
	
	Класс = "ОбщиеМодули";
	ИменаКлассов.Вставить(НРег(Класс), Класс);
	ИменаКлассов.Вставить(НРег("ОбщийМодуль"), Класс);
	
	Класс = "РегламентныеЗадания";
	ИменаКлассов.Вставить(НРег(Класс), Класс);
	ИменаКлассов.Вставить(НРег("РегламентноеЗадание"), Класс);
	
	Класс = "Подсистемы";
	ИменаКлассов.Вставить(НРег(Класс), Класс);
	ИменаКлассов.Вставить(НРег("Подсистема"), Класс);
	
	Результат = ИменаКлассов[НРег(ПроизвольноеИмяКласса)];
	
	Если Результат = Неопределено Тогда
		ШаблонОшибки = НСтр("ru = 'Не удалось нормализовать имя класса метаданных: %1'");
		ТекстОшибки = ОбщегоНазначенияКонтурМаркировка.ПараметрыВСтроку(ШаблонОшибки, ПроизвольноеИмяКласса);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти // СлужебныеПроцедурыИФункции

#КонецЕсли
