
// #Область СлужебныеПеременныеИМетодыФормы

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		Результат = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		Результат = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

// #КонецОбласти

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьКонтекст();
	НастроитьЭлементыФормы();
	УстановитьУсловноеОформление();
	ОбновитьСписокНоменклатуры();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурМаркировка_НастройкиМодуля_Обновлены" И Источник <> ЭтаФорма Тогда
		
		ЗаполнитьВидыПродукции1С();
		ОбновитьСписокНоменклатуры();
		
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьТоварыМаркировки(Команда)
	
	Если ИспользоватьДеревоНоменклатуры Тогда
		ВыделенныеСтроки = Элементы.ДеревоНоменклатуры.ВыделенныеСтроки;
	Иначе
		ВыделенныеСтроки = Элементы.СписокНоменклатуры.ВыделенныеСтроки;
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(ВыделенныеСтроки) Тогда
		ТекстСообщения = НСтр("ru = 'Необходимо выделить номенклатуру'");
		МодульКлиента().СообщитьПользователюЛок(ТекстСообщения, УникальныйИдентификатор);
		Возврат;
	КонецЕсли;
	
	МассивНоменклатуры = Новый Массив;
	Для каждого Строка Из ВыделенныеСтроки Цикл
		Если ИспользоватьДеревоНоменклатуры Тогда
			МассивНоменклатуры.Добавить(ДеревоНоменклатуры.НайтиПоИдентификатору(Строка).Ссылка);
		Иначе
			МассивНоменклатуры.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;
	
	МодульКлиента().СоздатьТоварыМаркировки(МассивНоменклатуры, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьСписокНоменклатуры();
	
КонецПроцедуры

&НаКлиенте
Процедура СопоставитьВидыПродукции(Команда)
	
	МодульКлиента().ОткрытьФормуНастроекМодуля(ЭтаФорма);
	ОбновитьСписокНоменклатуры();
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяПоля = Поле.Имя;
	Если ИмяПоля = "СписокНоменклатурыСсылкаНеПодлежитМаркировке"
		Или ИмяПоля = "СписокНоменклатурыКодТНВЭД"
		Или ИмяПоля = "СписокНоменклатурыВидДокументаСертификации"
		Или ИмяПоля = "СписокНоменклатурыНомерДокументаСертификации"
		Или ИмяПоля = "СписокНоменклатурыДатаДокументаСертификации"
		Или ИмяПоля = "СписокНоменклатурыНомерЛицензииНаНедра"
		Или ИмяПоля = "СписокНоменклатурыДатаЛицензииНаНедра" Тогда
		ВыборПоляЭлемента(ИмяПоля, ТекущиеДанные, Элемент);
	Иначе
		СтандартнаяОбработка= Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ДеревоНоменклатуры.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяПоля = Поле.Имя;
	
	Если ИмяПоля = "ДеревоНоменклатурыСсылкаНеПодлежитМаркировке"
		Или ИмяПоля = "ДеревоНоменклатурыКодТНВЭД"
		Или ИмяПоля = "ДеревоНоменклатурыВидДокументаСертификации"
		Или ИмяПоля = "ДеревоНоменклатурыНомерДокументаСертификации"
		Или ИмяПоля = "ДеревоНоменклатурыДатаДокументаСертификации"
		Или ИмяПоля = "ДеревоНоменклатурыНомерЛицензииНаНедра"
		Или ИмяПоля = "ДеревоНоменклатурыДатаЛицензииНаНедра" Тогда
		ВыборПоляЭлемента(ИмяПоля, ТекущиеДанные, Элемент);
	Иначе
		ОткрытьЗначение(ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНесопоставленныеПоВидуПродукцииПриИзменении(Элемент)
	
	ОбновитьСписокНоменклатуры();
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьКонтекст()
	
	ИспользоватьДеревоНоменклатуры = Не МодульОбъекта().ЗапросПоддерживаетЧтениеИдентификатора();
	ДоступныГруппыНоменклатуры = МодульОбъекта().СправочникНоменклатурыСодержитГруппы();
	ПолноеИмяНоменклатуры = МодульОбъекта().ПолноеИмяСправочникаНоменклатуры();
	ИмяПоляВидПродукцииНоменклатуры = МодульОбъекта().ИмяПоляВидПродукцииСправочникаНоменклатура(Ложь);
	ЗаполнитьВидыПродукции1С();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВидыПродукции1С()
	
	ВидыПродукции1С.Очистить();
	
	ВидыПродукции1СИзНастроек = МодульОбъекта().МаркируемыеТоварныеГруппы_ВидыПродукции1С();
	ВидыПродукции1С.ЗагрузитьЗначения(ВидыПродукции1СИзНастроек);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы()
	
	Элементы.ГруппаДерево.Видимость = ИспользоватьДеревоНоменклатуры;
	Элементы.ГруппаСписок.Видимость = Не ИспользоватьДеревоНоменклатуры;
	
	Элементы.ПоказатьНесопоставленныеПоВидуПродукции.Видимость = (ВидыПродукции1С.Количество() > 0);
	
	НастроитьСписокНоменклатуры();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокНоменклатуры()
	
	Если ИспользоватьДеревоНоменклатуры Тогда
		ОбновитьДеревоНоменклатуры();
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Элементы.СписокНоменклатуры.ТекущаяСтрока;
	
	СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("НемаркируемыеГруппы", НемаркируемыеГруппыНоменклатуры());
	
	ИспользоватьОтборПоВидуПродукции = (ВидыПродукции1С.Количество() > 0 И Не ПоказатьНесопоставленныеПоВидуПродукции);
	УстановитьИспользованиеОтбораПоВидуПродукции(ИспользоватьОтборПоВидуПродукции);
	
	Элементы.СписокНоменклатуры.Обновить();
	
	Если ЗначениеЗаполнено(ТекущаяСтрока) Тогда
		Элементы.СписокНоменклатуры.ТекущаяСтрока = ТекущаяСтрока;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьИспользованиеОтбораПоВидуПродукции(Использование)
	
	ПолеВидПродукции = Новый ПолеКомпоновкиДанных(ИмяПоляВидПродукцииНоменклатуры);
	
	Для Каждого Отбор Из СписокНоменклатуры.Отбор.Элементы Цикл
		Если Отбор.ЛевоеЗначение = ПолеВидПродукции Тогда
			Отбор.Использование = Использование;
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	Если Использование Тогда
		ЭлементОтбора = СписокНоменклатуры.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоляВидПродукцииНоменклатуры);
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение = ВидыПродукции1С;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДеревоНоменклатуры()
	
	Номенклатура = Неопределено;
	ТекущаяСтрока = Элементы.ДеревоНоменклатуры.ТекущаяСтрока;
	Если ТекущаяСтрока <> Неопределено Тогда
		Номенклатура = ДеревоНоменклатуры.НайтиПоИдентификатору(ТекущаяСтрока).Ссылка;
	КонецЕсли;
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос(ТекстЗапроса_ТаблицаНоменклатуры());
	Запрос.УстановитьПараметр("ВидыПродукции", ВидыПродукции1С);
	ТаблицаНоменклатуры = Запрос.Выполнить().Выгрузить();
	
	МодульОбъекта().ЗаполнитьВТаблицеКлючиПоОбъектам1С(ТаблицаНоменклатуры, "Ссылка", "КлючНоменклатуры", "ТипКлючаНоменклатуры");
	МодульОбъекта().ПоместитьТаблицуВЗапрос(МенеджерВТ, ТаблицаНоменклатуры, "ТаблицаНоменклатуры", "КлючНоменклатуры, ТипКлючаНоменклатуры");
	
	Запрос = Новый Запрос(ТекстЗапроса_ДеревоНоменклатуры());
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.УстановитьПараметр("НемаркируемыеГруппы", НемаркируемыеГруппыНоменклатуры());
	
	СвойстваОбъектов = МодульОбъекта().Перечисление_СвойстваОбъектов1С();
	Запрос.УстановитьПараметр("НеПодлежитМаркировке", СвойстваОбъектов.НеПодлежитМаркировке);
	Запрос.УстановитьПараметр("КодТНВЭД", СвойстваОбъектов.КодТНВЭД);
	Запрос.УстановитьПараметр("ВидДокументаСертификации", СвойстваОбъектов.ВидДокументаСертификации);
	Запрос.УстановитьПараметр("НомерДокументаСертификации", СвойстваОбъектов.НомерДокументаСертификации);
	Запрос.УстановитьПараметр("ДатаДокументаСертификации", СвойстваОбъектов.ДатаДокументаСертификации);
	Запрос.УстановитьПараметр("НомерЛицензииНаНедра", СвойстваОбъектов.НомерЛицензииНаНедра);
	Запрос.УстановитьПараметр("ДатаЛицензииНаНедра", СвойстваОбъектов.ДатаЛицензииНаНедра);
	РезультатЗапроса = Запрос.Выполнить();
	
	Дерево = РеквизитФормыВЗначение("ДеревоНоменклатуры");
	Дерево.Строки.Очистить();
	
	СтрокиГрупп = Новый Соответствие;
	ЗаполнитьДеревоНоменклатуры(РезультатЗапроса, Дерево, СтрокиГрупп);
	ЗначениеВРеквизитФормы(Дерево, "ДеревоНоменклатуры");
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Элементы.ДеревоНоменклатуры.ТекущаяСтрока = СтрокаДереваПоЗначениюПоля("Ссылка", Номенклатура, ДеревоНоменклатуры);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьСписокНоменклатуры()
	
	Если ИспользоватьДеревоНоменклатуры Тогда
		Возврат;
	КонецЕсли;
	
	СписокНоменклатуры.ТекстЗапроса = ТекстЗапроса_СписокНоменклатуры();
	СписокНоменклатуры.ОсновнаяТаблица = ПолноеИмяНоменклатуры;
	СписокНоменклатуры.ДинамическоеСчитываниеДанных = Истина;
	
	СвойстваОбъектов = МодульОбъекта().Перечисление_СвойстваОбъектов1С();
	СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("НеПодлежитМаркировке", СвойстваОбъектов.НеПодлежитМаркировке);
	СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("КодТНВЭД", СвойстваОбъектов.КодТНВЭД);
	СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("ВидДокументаСертификации", СвойстваОбъектов.ВидДокументаСертификации);
	СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("НомерДокументаСертификации", СвойстваОбъектов.НомерДокументаСертификации);
	СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("ДатаДокументаСертификации", СвойстваОбъектов.ДатаДокументаСертификации);
	СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("НомерЛицензииНаНедра", СвойстваОбъектов.НомерЛицензииНаНедра);
	СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("ДатаЛицензииНаНедра", СвойстваОбъектов.ДатаЛицензииНаНедра);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УстановитьУсловноеОформление_НеПодлежитМаркировке(Элементы.СписокНоменклатуры);
	УстановитьУсловноеОформление_НеПодлежитМаркировке(Элементы.ДеревоНоменклатуры);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление_НеПодлежитМаркировке(ТаблицаФормы)
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ТаблицаФормы.ПутьКДанным);
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".НеПодлежитМаркировке");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(235, 235, 235));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(150, 150, 150));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборПоляЭлемента(ИмяПоля, ТекущиеДанные, Элемент)
	
	СвойстваОбъектов = МодульКлиента().Перечисление_СвойстваОбъектов1С();
	
	Если Найти(ИмяПоля, "СсылкаНеПодлежитМаркировке") > 0 Тогда
		
		ЗаписатьСвойствоНоменклатуры(СвойстваОбъектов.НеПодлежитМаркировке, Не ТекущиеДанные.СсылкаНеПодлежитМаркировке);
		
	ИначеЕсли Найти(ИмяПоля, "КодТНВЭД") > 0 Тогда
		
		ДлинаКода = 10;
		Подсказка = НСтр("ru = 'Код ТНВЭД'");
		ТекущийКод = ТекущиеДанные.КодТНВЭД;
		
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
		"ИзменитьСвойствоНоменклатуры", ЭтаФорма, СвойстваОбъектов.КодТНВЭД);
		
		МодульКлиента().ПоказатьДиалогВводаСтроки(ОписаниеОбработчика, ТекущийКод, Подсказка, ДлинаКода);
		
	ИначеЕсли Найти(ИмяПоля, "ВидДокументаСертификации") > 0 Тогда
		
		ВидыДокументов = МодульКлиента().Перечисление_ВидыДокументовОбязательнойСертификации();
		
		СписокВидов = Новый СписокЗначений;
		СписокВидов.Добавить(ВидыДокументов.СертификатСоответствия);
		СписокВидов.Добавить(ВидыДокументов.ДекларацияСоответствия);
		СписокВидов.Добавить(ВидыДокументов.СвидетельствоГосРегистрации);
		СписокВидов.Добавить("","<Очистить значение>");
		
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
		"ИзменитьСвойствоНоменклатуры", ЭтаФорма, СвойстваОбъектов.ВидДокументаСертификации);
		
		МодульКлиента().ПоказатьДиалогВыбораИзСписка(ОписаниеОбработчика, СписокВидов, Элемент, ЭтаФорма);
		
	ИначеЕсли Найти(ИмяПоля, "НомерДокументаСертификации") > 0 Тогда
		
		Подсказка = НСтр("ru = 'Номер документа сертификации'");
		ТекущийНомер = ТекущиеДанные.НомерДокументаСертификации;
		
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
		"ИзменитьСвойствоНоменклатуры", ЭтаФорма, СвойстваОбъектов.НомерДокументаСертификации);
		
		МодульКлиента().ПоказатьДиалогВводаСтроки(ОписаниеОбработчика, ТекущийНомер, Подсказка);
		
	ИначеЕсли Найти(ИмяПоля, СвойстваОбъектов.ДатаДокументаСертификации) > 0 Тогда
		
		Подсказка = НСтр("ru = 'Дата документа сертификации'");
		ЧастьДаты = ЧастиДаты.Дата;
		ТекДата = ТекущиеДанные.ДатаДокументаСертификации;
		
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
		"ИзменитьСвойствоНоменклатуры", ЭтаФорма, СвойстваОбъектов.ДатаДокументаСертификации);
		
		МодульКлиента().ПоказатьДиалогВводаДаты(ОписаниеОбработчика, ТекДата, Подсказка, ЧастьДаты);
		
	ИначеЕсли Найти(ИмяПоля, "НомерЛицензииНаНедра") > 0 Тогда
		
		Подсказка = НСтр("ru = 'Номер лицензии на пользование недрами'");
		ТекущийНомер = ТекущиеДанные.НомерЛицензииНаНедра;
		
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
		"ИзменитьСвойствоНоменклатуры", ЭтаФорма, СвойстваОбъектов.НомерЛицензииНаНедра);
		
		МодульКлиента().ПоказатьДиалогВводаСтроки(ОписаниеОбработчика, ТекущийНомер, Подсказка);
		
	ИначеЕсли Найти(ИмяПоля, "ДатаЛицензииНаНедра") > 0 Тогда
		
		Подсказка = НСтр("ru = 'Дата лицензии на пользование недрами'");
		ЧастьДаты = ЧастиДаты.Дата;
		ТекДата = ТекущиеДанные.ДатаЛицензииНаНедра;
		
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
		"ИзменитьСвойствоНоменклатуры", ЭтаФорма, СвойстваОбъектов.ДатаЛицензииНаНедра);
		
		МодульКлиента().ПоказатьДиалогВводаДаты(ОписаниеОбработчика, ТекДата, Подсказка, ЧастьДаты);
		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСвойствоНоменклатуры(Значение, ИмяСвойства) Экспорт
	
	Если Значение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("ЭлементСпискаЗначений") Тогда
		НовоеЗначение = Значение.Значение;
	Иначе
		НовоеЗначение = Значение;
	КонецЕсли;
	
	ЗаписатьСвойствоНоменклатуры(ИмяСвойства, НовоеЗначение);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСвойствоНоменклатуры(ИмяСвойства, НовоеЗначение)
	
	Если ИспользоватьДеревоНоменклатуры Тогда
		ВыделенныеСтроки = Элементы.ДеревоНоменклатуры.ВыделенныеСтроки;
	Иначе
		ВыделенныеСтроки = Элементы.СписокНоменклатуры.ВыделенныеСтроки;
	КонецЕсли;
	
	МассивНоменклатуры = Новый Массив;
	Для каждого Строка Из ВыделенныеСтроки Цикл
		Если ИспользоватьДеревоНоменклатуры Тогда
			МассивНоменклатуры.Добавить(ДеревоНоменклатуры.НайтиПоИдентификатору(Строка).Ссылка);
		Иначе
			МассивНоменклатуры.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;
	
	МодульОбъекта().ДопСвойство_Записать(МассивНоменклатуры, ИмяСвойства, НовоеЗначение);
	
	ОбновитьСписокНоменклатуры();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоНоменклатуры(Результат, Дерево, СтрокиГрупп)
	
	ВыборкаГруппы = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией, "Ссылка");
	
	Пока ВыборкаГруппы.Следующий() Цикл
		
		Если ВыборкаГруппы.ТипЗаписи() = ТипЗаписиЗапроса.ИтогПоИерархии Тогда
			
			СтрокаГруппы = Дерево.Строки.Добавить();
			СтрокиГрупп.Вставить(ВыборкаГруппы.Ссылка, СтрокаГруппы);
			
			ЗаполнитьДеревоНоменклатуры(ВыборкаГруппы, СтрокаГруппы, СтрокиГрупп);
			
		ИначеЕсли ВыборкаГруппы.ТипЗаписи() = ТипЗаписиЗапроса.ИтогПоГруппировке Тогда
			
			Если ЗначениеЗаполнено(ВыборкаГруппы.Ссылка) Тогда
				СтрокаГруппы = СтрокиГрупп[ВыборкаГруппы.Ссылка];
				Если СтрокаГруппы = Неопределено Тогда
					СтрокаГруппы = Дерево.Строки.Добавить();
					СтрокиГрупп.Вставить(ВыборкаГруппы.Ссылка, СтрокаГруппы);
				КонецЕсли;
			Иначе
				СтрокаГруппы = Дерево; // Итог по номенклатуре без группы
			КонецЕсли;
			
			Выборка = ВыборкаГруппы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока Выборка.Следующий() Цикл
				
				Строка = СтрокиГрупп[Выборка.Ссылка];
				Если Строка = Неопределено Тогда
					Строка = СтрокаГруппы.Строки.Добавить();
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(Строка, Выборка);
				ЗаполнитьНомерКартинкиВСтрокеНоменклатуры(Строка, Выборка);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНомерКартинкиВСтрокеНоменклатуры(Строка, Выборка)
	
	Если Выборка.ЭтоГруппа = Истина Тогда
		Строка.НомерКартинки = 7;
	Иначе
		Строка.НомерКартинки = 10;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ТекстЗапроса_СписокНоменклатуры()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Спр.Ссылка КАК Ссылка,
	|	Спр.ВидПродукции1С КАК ВидПродукции1С,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(Свойство_НеПодлежитМаркировке.Значение, ЛОЖЬ) КАК БУЛЕВО) КАК СсылкаНеПодлежитМаркировке,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(Свойство_КодТНВЭД.Значение, """") КАК СТРОКА(1000)) КАК КодТНВЭД,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(Свойство_ВидДокументаСертификации.Значение, """") КАК СТРОКА(1000)) КАК ВидДокументаСертификации,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(Свойство_НомерДокументаСертификации.Значение, """") КАК СТРОКА(1000)) КАК НомерДокументаСертификации,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(Свойство_ДатаДокументаСертификации.Значение, """") КАК ДАТА) КАК ДатаДокументаСертификации,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(Свойство_НомерЛицензииНаНедра.Значение, """") КАК СТРОКА(1000)) КАК НомерЛицензииНаНедра,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(Свойство_ДатаЛицензииНаНедра.Значение, """") КАК ДАТА) КАК ДатаЛицензииНаНедра,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ЕСТЬNULL(Свойство_НеПодлежитМаркировке.Значение, ЛОЖЬ) = ИСТИНА
	|					ИЛИ Спр.Родитель В (&НемаркируемыеГруппы)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК БУЛЕВО) КАК НеПодлежитМаркировке
	|{ВЫБРАТЬ
	|	Ссылка.*,
	|	ВидПродукции1С,
	|	СсылкаНеПодлежитМаркировке,
	|	КодТНВЭД,
	|	НеПодлежитМаркировке,
	|	ВидДокументаСертификации,
	|	НомерДокументаСертификации,
	|	ДатаДокументаСертификации,
	|	НомерЛицензииНаНедра,
	|	ДатаЛицензииНаНедра}
	|ИЗ
	|	Справочник.Номенклатура КАК Спр
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_СвойстваОбъектов1С КАК Свойство_НеПодлежитМаркировке
	|		ПО (УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Спр.Ссылка) = Свойство_НеПодлежитМаркировке.КлючОбъекта)
	|			И (Свойство_НеПодлежитМаркировке.ИмяСвойства = &НеПодлежитМаркировке)}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_СвойстваОбъектов1С КАК Свойство_КодТНВЭД
	|		ПО (УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Спр.Ссылка) = Свойство_КодТНВЭД.КлючОбъекта)
	|			И (Свойство_КодТНВЭД.ИмяСвойства = &КодТНВЭД)}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_СвойстваОбъектов1С КАК Свойство_ВидДокументаСертификации
	|		ПО (УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Спр.Ссылка) = Свойство_ВидДокументаСертификации.КлючОбъекта)
	|			И (Свойство_ВидДокументаСертификации.ИмяСвойства = &ВидДокументаСертификации)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_СвойстваОбъектов1С КАК Свойство_НомерДокументаСертификации
	|		ПО (УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Спр.Ссылка) = Свойство_НомерДокументаСертификации.КлючОбъекта)
	|			И (Свойство_НомерДокументаСертификации.ИмяСвойства = &НомерДокументаСертификации)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_СвойстваОбъектов1С КАК Свойство_ДатаДокументаСертификации
	|		ПО (УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Спр.Ссылка) = Свойство_ДатаДокументаСертификации.КлючОбъекта)
	|			И (Свойство_ДатаДокументаСертификации.ИмяСвойства = &ДатаДокументаСертификации)}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_СвойстваОбъектов1С КАК Свойство_НомерЛицензииНаНедра
	|		ПО (УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Спр.Ссылка) = Свойство_НомерЛицензииНаНедра.КлючОбъекта)
	|			И (Свойство_НомерЛицензииНаНедра.ИмяСвойства = &НомерЛицензииНаНедра)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_СвойстваОбъектов1С КАК Свойство_ДатаЛицензииНаНедра
	|		ПО (УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Спр.Ссылка) = Свойство_ДатаЛицензииНаНедра.КлючОбъекта)
	|			И (Свойство_ДатаЛицензииНаНедра.ИмяСвойства = &ДатаЛицензииНаНедра)}
	|{ГДЕ
	|	Спр.Ссылка.*,
	|	(ВЫРАЗИТЬ(ЕСТЬNULL(Свойство_НеПодлежитМаркировке.Значение, ЛОЖЬ) КАК БУЛЕВО)) КАК СсылкаНеПодлежитМаркировке,
	|	(ВЫРАЗИТЬ(ЕСТЬNULL(Свойство_КодТНВЭД.Значение, """") КАК СТРОКА(1000))) КАК КодТНВЭД,
	|	(ВЫРАЗИТЬ(ЕСТЬNULL(Свойство_ВидДокументаСертификации.Значение, """") КАК СТРОКА(1000))) КАК ВидДокументаСертификации,
	|	(ВЫРАЗИТЬ(ЕСТЬNULL(Свойство_НомерДокументаСертификации.Значение, """") КАК СТРОКА(1000))) КАК НомерДокументаСертификации,
	|	(ВЫРАЗИТЬ(ЕСТЬNULL(Свойство_ДатаДокументаСертификации.Значение, """") КАК ДАТА)) КАК ДатаДокументаСертификации,
	|	(ВЫРАЗИТЬ(ЕСТЬNULL(Свойство_НомерЛицензииНаНедра.Значение, """") КАК СТРОКА(1000))) КАК НомерЛицензииНаНедра,
	|	(ВЫРАЗИТЬ(ЕСТЬNULL(Свойство_ДатаЛицензииНаНедра.Значение, """") КАК ДАТА)) КАК ДатаЛицензииНаНедра,
	|	(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ЕСТЬNULL(Свойство_НеПодлежитМаркировке.Значение, ЛОЖЬ) = ИСТИНА
	|						ИЛИ Спр.Родитель В (&НемаркируемыеГруппы)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ КАК БУЛЕВО)) КАК НеПодлежитМаркировке}";
	
	Результат = СтрЗаменить(Результат, "Справочник.Номенклатура", ПолноеИмяНоменклатуры);
	
	Если Не ДоступныГруппыНоменклатуры Тогда
		Результат = СтрЗаменить(Результат, "Спр.Родитель", "НЕОПРЕДЕЛЕНО");
	КонецЕсли;
	
	ПолеВидПродукции1С = "НЕОПРЕДЕЛЕНО";
	Если ЗначениеЗаполнено(ИмяПоляВидПродукцииНоменклатуры)
		И ВидыПродукции1С.Количество() > 0 Тогда
		ПолеВидПродукции1С = "Спр." + СокрЛП(ИмяПоляВидПродукцииНоменклатуры);
	КонецЕсли;
	Результат = СтрЗаменить(Результат, "Спр.ВидПродукции1С", ПолеВидПродукции1С);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ТекстЗапроса_ТаблицаНоменклатуры()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Ссылка КАК Ссылка,
	|	Т.Родитель КАК Родитель,
	|	Т.ЭтоГруппа КАК ЭтоГруппа
	|ИЗ
	|	Справочник.Номенклатура КАК Т
	|ГДЕ
	|	НЕ Т.ПометкаУдаления
	|	И &УсловиеПоВидуПродукции";
	
	Если Не ДоступныГруппыНоменклатуры Тогда
		Результат = СтрЗаменить(Результат, "Т.Родитель", "НЕОПРЕДЕЛЕНО");
		Результат = СтрЗаменить(Результат, "Т.ЭтоГруппа", "НЕОПРЕДЕЛЕНО");
	КонецЕсли;
	
	УсловиеПоВидуПродукции = "ИСТИНА";
	Если ЗначениеЗаполнено(ИмяПоляВидПродукцииНоменклатуры)
		И ВидыПродукции1С.Количество() > 0
		И Не ПоказатьНесопоставленныеПоВидуПродукции Тогда
		УсловиеПоВидуПродукции = ("Т." + СокрЛП(ИмяПоляВидПродукцииНоменклатуры) + " В (&ВидыПродукции)");
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, "Справочник.Номенклатура", ПолноеИмяНоменклатуры);
	Результат = СтрЗаменить(Результат, "&УсловиеПоВидуПродукции", УсловиеПоВидуПродукции);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ТекстЗапроса_ДеревоНоменклатуры()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаНоменклатуры.Ссылка КАК Ссылка,
	|	ТаблицаНоменклатуры.ЭтоГруппа КАК ЭтоГруппа,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(Свойство_НеПодлежитМаркировке.Значение, ЛОЖЬ) КАК БУЛЕВО) КАК СсылкаНеПодлежитМаркировке,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(Свойство_КодТНВЭД.Значение, """") КАК СТРОКА(1000)) КАК КодТНВЭД,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(Свойство_ВидДокументаСертификации.Значение, """") КАК СТРОКА(1000)) КАК ВидДокументаСертификации,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(Свойство_НомерДокументаСертификации.Значение, """") КАК СТРОКА(1000)) КАК НомерДокументаСертификации,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(Свойство_ДатаДокументаСертификации.Значение, """") КАК ДАТА) КАК ДатаДокументаСертификации,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(Свойство_НомерЛицензииНаНедра.Значение, """") КАК СТРОКА(1000)) КАК НомерЛицензииНаНедра,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(Свойство_ДатаЛицензииНаНедра.Значение, """") КАК ДАТА) КАК ДатаЛицензииНаНедра,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ЕСТЬNULL(Свойство_НеПодлежитМаркировке.Значение, ЛОЖЬ) = ИСТИНА
	|					ИЛИ ТаблицаНоменклатуры.Родитель В (&НемаркируемыеГруппы)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК БУЛЕВО) КАК НеПодлежитМаркировке
	|ИЗ
	|	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_СвойстваОбъектов1С КАК Свойство_НеПодлежитМаркировке
	|		ПО ТаблицаНоменклатуры.КлючНоменклатуры = Свойство_НеПодлежитМаркировке.КлючОбъекта
	|			И ТаблицаНоменклатуры.ТипКлючаНоменклатуры = Свойство_НеПодлежитМаркировке.ТипКлючаОбъекта
	|			И (Свойство_НеПодлежитМаркировке.ИмяСвойства = &НеПодлежитМаркировке)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_СвойстваОбъектов1С КАК Свойство_КодТНВЭД
	|		ПО ТаблицаНоменклатуры.КлючНоменклатуры = Свойство_КодТНВЭД.КлючОбъекта
	|			И ТаблицаНоменклатуры.ТипКлючаНоменклатуры = Свойство_КодТНВЭД.ТипКлючаОбъекта
	|			И (Свойство_КодТНВЭД.ИмяСвойства = &КодТНВЭД)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_СвойстваОбъектов1С КАК Свойство_ВидДокументаСертификации
	|		ПО ТаблицаНоменклатуры.КлючНоменклатуры = Свойство_ВидДокументаСертификации.КлючОбъекта
	|			И ТаблицаНоменклатуры.ТипКлючаНоменклатуры = Свойство_ВидДокументаСертификации.ТипКлючаОбъекта
	|			И (Свойство_ВидДокументаСертификации.ИмяСвойства = &ВидДокументаСертификации)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_СвойстваОбъектов1С КАК Свойство_НомерДокументаСертификации
	|		ПО ТаблицаНоменклатуры.КлючНоменклатуры = Свойство_НомерДокументаСертификации.КлючОбъекта
	|			И ТаблицаНоменклатуры.ТипКлючаНоменклатуры = Свойство_НомерДокументаСертификации.ТипКлючаОбъекта
	|			И (Свойство_НомерДокументаСертификации.ИмяСвойства = &НомерДокументаСертификации)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_СвойстваОбъектов1С КАК Свойство_ДатаДокументаСертификации
	|		ПО ТаблицаНоменклатуры.КлючНоменклатуры = Свойство_ДатаДокументаСертификации.КлючОбъекта
	|			И ТаблицаНоменклатуры.ТипКлючаНоменклатуры = Свойство_ДатаДокументаСертификации.ТипКлючаОбъекта
	|			И (Свойство_ДатаДокументаСертификации.ИмяСвойства = &ДатаДокументаСертификации)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_СвойстваОбъектов1С КАК Свойство_НомерЛицензииНаНедра
	|		ПО ТаблицаНоменклатуры.КлючНоменклатуры = Свойство_НомерЛицензииНаНедра.КлючОбъекта
	|			И ТаблицаНоменклатуры.ТипКлючаНоменклатуры = Свойство_НомерЛицензииНаНедра.ТипКлючаОбъекта
	|			И (Свойство_НомерЛицензииНаНедра.ИмяСвойства = &НомерЛицензииНаНедра)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_СвойстваОбъектов1С КАК Свойство_ДатаЛицензииНаНедра
	|		ПО ТаблицаНоменклатуры.КлючНоменклатуры = Свойство_ДатаЛицензииНаНедра.КлючОбъекта
	|			И ТаблицаНоменклатуры.ТипКлючаНоменклатуры = Свойство_ДатаЛицензииНаНедра.ТипКлючаОбъекта
	|			И (Свойство_ДатаЛицензииНаНедра.ИмяСвойства = &ДатаЛицензииНаНедра)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаНоменклатуры.ЭтоГруппа УБЫВ
	|ИТОГИ ПО
	|	Ссылка ТОЛЬКО ИЕРАРХИЯ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция НемаркируемыеГруппыНоменклатуры()
	
	Если Не ДоступныГруппыНоменклатуры Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Возврат МодульОбъекта().Номенклатура1С_НеПодлежитМаркировке(Истина);
	
КонецФункции

Функция СтрокаДереваПоЗначениюПоля(ИмяПоля, ЗначениеПоля, Дерево)
	
	Результат = Неопределено;
	
	Для Каждого СтрокаДерева Из Дерево.ПолучитьЭлементы() Цикл
		
		Если СтрокаДерева[ИмяПоля] = ЗначениеПоля Тогда
			Результат = СтрокаДерева.ПолучитьИдентификатор();
			Прервать;
		КонецЕсли;
		
		Результат = СтрокаДереваПоЗначениюПоля(ИмяПоля, ЗначениеПоля, СтрокаДерева);
		Если Результат <> Неопределено Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти
