// Copyright (C) 2012-2025 Engineer Mareev Enterprises
//	Модуль для УТ 10.3 Экспорт документов Списания товаров с характеристиками или сериями

//	$Списание товаров (по инициативе 1C)
//  Экспорт сообщений OFFWRITE:
//	- В 1С оператор (руч.) оформляет документ "Списание товаров", который при проведении (авт.) помечается к Экспорту.
//	- 1С (авт.) экспортирует сообщение OFFWRITE.
//	- WMS (авт.) импортирует сообщение OFFWRITE и создает документ Списание товаров.

#Область ПрограммныйИнтерфейс

//	Функция ПолучитьИмяСообщения возвращает имя сообщения
Функция ПолучитьИмяСообщения() Экспорт
	Возврат "offwrite";
КонецФункции

//	Функция ПолучитьМетаданные возвращает метаданные сообщения
Функция ПолучитьМетаданные() Экспорт
	Возврат Метаданные.Документы.СписаниеТоваров;
КонецФункции

//	Процедура Экспортировать экспортирует один документ Списание недостач товаров (с сериями)
Процедура Экспортировать(ERPData, Документ) Экспорт

	АктуализироватьУИДыСтрок(Документ.Ссылка);   
	
	//	Заголовок сообщения
	EmeWmsERPEngine.AppendHeaderLine(ERPData);
	
	ERPData.header.offwrite_id  = Документ.УникальныйИдентификатор();
	Если Константы.EmeWmsСоздаватьУникальныеСообщения.Получить() Тогда
		ERPData.header.id	  	= Новый УникальныйИдентификатор;
	Иначе
		ERPData.header.id	  	= ERPData.header.offwrite_id;		
	КонецЕсли;
	ERPData.header.offwrite_reg_no	=  СокрЛП(Документ.Номер)+"/"+Формат(Год(Документ.Дата),"ЧГ=4");
	
	ERPData.header.po_id      	= Документ.УникальныйИдентификатор();
	ERPData.header.po_reg_no	= СокрЛП(Документ.Номер)+"/"+Формат(Год(Документ.Дата),"ЧГ=4");
	ERPData.header.erp_doc_type	= ПолучитьМетаданные().Имя;
	ERPData.header.whs_code 	= EmeWmsУтилиты.ПолучитьКодСкладаEMEПоСсылке(Документ.Склад, Документ.Организация);  // Код склада EME
	ERPData.header.vendor_code 	= EmeWmsУтилиты.ПолучитьКодОрганизацииEMEПоСсылке(Документ.Организация);
	ERPData.header.is_repacking = 0;
	ERPData.header.reason_code  = "A01"; // Внутреннее перемещение/оптимизация
	ERPData.header.comment     	= Лев(Документ.Комментарий, 128);

	// Для строк сообщения
	КодЗоны						= EmeWmsУтилиты.ПолучитьКодЗоныEMEПоСсылке(Документ.Склад);
	КодСтатуса 					= EmeWmsУтилиты.ПолучитьКодСтатусаТовараПоСсылкеНаСклад(Документ.Склад);

	//	Использование серий в интеграции
	ИспользоватьСерииНастройка = Константы.EmeWmsИспользоватьСерии.Получить();	

	//	Строки ТЧ товары
	//	В этой версии WMS - только числовые ID строк.
	УИДСтроки = 0;
	EmeWmsERPEngine.SelectChild(ERPData, "lines");
	Для Каждого СтрокаТовара Из Документ.Товары Цикл 
		EmeWmsERPEngine.AppendChildLine(ERPData);  
		УИДСтроки = УИДСтроки + 1;

		// Исходный товар
		Товар			  			= СтрокаТовара.Номенклатура;
		
		ERPData.lines.id			= УИДСтроки;
		ERPData.lines.zone_code 	= КодЗоны;
		ERPData.lines.goods_id		= Товар.УникальныйИдентификатор();
		ERPData.lines.goods_code	= СокрЛП(Товар.Код);
		
		БазоваяЕдиницаИзмерения 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовара.Номенклатура, "БазоваяЕдиницаИзмерения");		
		ERPData.lines.mu_code		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(БазоваяЕдиницаИзмерения, "Код");
		ERPData.lines.quantity		= СтрокаТовара.Количество;
		ERPData.lines.stock_status	= КодСтатуса;
		
		// Выгружаем серии или характеристики товара
		ВидНоменклатуры 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовара.Номенклатура, "ВидНоменклатуры");
		ИспользоватьСерии 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Товар, "ВестиУчетПоСериям");    

		Если Не ИспользоватьСерииНастройка Тогда
			ИспользоватьСерии = Ложь;
		КонецЕсли;

		// Серии или серийные номера
		Если ИспользоватьСерии Тогда // Серии
			Если ЗначениеЗаполнено(СтрокаТовара.СерияНоменклатуры) Тогда
				НаименованиеСерии= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовара.СерияНоменклатуры, "Наименование");
				Если ЗначениеЗаполнено(НаименованиеСерии) Тогда 
					СрокГодности = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовара.СерияНоменклатуры, "СрокГодности");
					ERPData.lines.lot_no = НаименованиеСерии;
					ERPData.lines.bbd 	 = СрокГодности;
				КонецЕсли;
			КонецЕсли;
		Иначе // Характеристики
			ИспользоватьХарактеристики = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Товар,  "ВестиУчетПоХарактеристикам");
			Если ИспользоватьХарактеристики Тогда
				Если ЗначениеЗаполнено(СтрокаТовара.ХарактеристикаНоменклатуры) Тогда
					ERPData.lines.lot_no = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовара.ХарактеристикаНоменклатуры, "Наименование");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

		Если НЕ EmeWmsЭкспортНоменклатуры.Экспортирован(СтрокаТовара.Номенклатура) Тогда
			EmeWmsЭкспортНоменклатуры.РазрешитьЭкспортСГруппами(СтрокаТовара.Номенклатура);
		КонецЕсли;
		
	КонецЦикла;	
КонецПроцедуры 

#КонецОбласти

#Область ЭкспортныеСлужебныеПроцедурыИФункции

//	Функция ПолучитьВыборкуСсылок возвращает выборку ссылок для экспорта
Функция ПолучитьВыборкуСсылок() Экспорт
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	EmeWmsПометкиКЭкспортуСписанийТоваров.СписаниеТоваров КАК Ссылка
		|ИЗ
		|	РегистрСведений.EmeWmsПометкиКЭкспортуСписанийТоваров КАК EmeWmsПометкиКЭкспортуСписанийТоваров
		|ГДЕ
		|	EmeWmsПометкиКЭкспортуСписанийТоваров.КЭкспорту";
		
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции

//	Функция РазрешенКЭкспорту возвращает Истина, если Сборка товаров разрешена к экспорту.
Функция РазрешенКЭкспорту(Документ) Экспорт
	
	ДатаЗапускаИнтеграции = Константы.EmeWmsДатаЗапускаИнтеграции.Получить();
	Если ЗначениеЗаполнено(ДатаЗапускаИнтеграции)
			И Документ.Дата < ДатаЗапускаИнтеграции Тогда
		ОтменитьЭкспорт(Документ);
		Возврат Ложь;
	КонецЕсли;	

	Если Документ.ПометкаУдаления Тогда
		ОтменитьЭкспорт(Документ);
		Возврат Ложь;
	КонецЕсли;

	Если НЕ Документ.Проведен Тогда
		ОтменитьЭкспорт(Документ);
		Возврат Ложь;
	КонецЕсли;

	// Не выгружать заново импортированные документы
	Если СписаниеТоваровИмпортировано(Документ) Тогда
		ПодтвердитьЭкспорт(Документ);
		Возврат Ложь;
	КонецЕсли;

	// #IBS 27.10.2023 По складам не WMS не экспортировать
	КодСклада = EmeWmsУтилиты.ПолучитьКодСкладаEMEПоСсылке(Документ.Склад, Документ.Организация);
	Если НЕ ЗначениеЗаполнено(КодСклада) Тогда
		ОтменитьЭкспорт(Документ);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат истина;
	
КонецФункции

//	Процедура ПометитьКЭкспорту помечает 
Процедура ПометитьКЭкспорту(Документ) Экспорт
	Если Не РазрешенКЭкспорту(Документ) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуСписанийТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.СписаниеТоваров.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Истина;
		Запись.Дата = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsПометкиКЭкспортуСписанийТоваров.СоздатьМенеджерЗаписи();
	НоваяЗапись.СписаниеТоваров = Документ.Ссылка;
	НоваяЗапись.КЭкспорту = Истина;
	НоваяЗапись.Дата = ТекущаяДата();
    НоваяЗапись.Записать(); 
КонецПроцедуры

//	Процедура ОтменитьЭкспорт отменяет экспорт документа.
Процедура ОтменитьЭкспорт(Документ) Экспорт
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуСписанийТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.СписаниеТоваров.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Ложь;
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
КонецПроцедуры

//	Функция ПомеченКЭкспорту возвращает Истина, если Списание недостач товаров помечено к экспорту.
Функция ПомеченКЭкспорту(Документ) Экспорт
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуСписанийТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.СписаниеТоваров.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Возврат Запись.КЭкспорту;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции

//	Процедура ПодтвердитьЭкспорт подтверждает экспорт Списания недостач товаров
Процедура ПодтвердитьЭкспорт(Документ) Экспорт
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуСписанийТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.СписаниеТоваров.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Ложь;
		Запись.ДатаЭкспорта = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
КонецПроцедуры

//	Процедура ПометитьКЭкспорту помечает Сборку товаров при записи.
Процедура ПометитьКЭкспортуПриЗаписиСписанияТоваров(Источник, Отказ) Экспорт
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//	Помечать, если включен режим пометок к экспорту
	Если Константы.EmeWmsПометкаВключена.Получить() Тогда
		ПометитьКЭкспорту(Источник);
	КонецЕсли;		 
КонецПроцедуры

#КонецОбласти

#Область ЛокальныеСлужебныеПроцедурыИФункции

//	Проверить, было ли импортировано Списание недостач товаров
Функция СписаниеТоваровИмпортировано(Документ)
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеСписанийТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Возврат Истина;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции

//	Создать новые УИДы строк и исправить дубли, если возникли (В ТЧ Товары по распоряжениям)
Функция АктуализироватьУИДыСтрок(ДокументСсылка)
	Документ = ДокументСсылка.ПолучитьОбъект();
	// Для УИД строк ТЧ
	КлючиСтрок = Новый Соответствие;
	БылиСозданыИдентификаторы = Ложь;
	Для Каждого СтрокаТовара Из Документ.Товары Цикл 
		// Генерация специальных UID строк документа при выгрузке
		Если НЕ ЗначениеЗаполнено(СтрокаТовара.EmeWmsУИДСтроки) ИЛИ КлючиСтрок.Получить(СтрокаТовара.EmeWmsУИДСтроки) <> Неопределено Тогда
			СтрокаТовара.EmeWmsУИДСтроки = Новый УникальныйИдентификатор();
			БылиСозданыИдентификаторы = Истина;
		КонецЕсли;
		КлючиСтрок.Вставить(СтрокаТовара.EmeWmsУИДСтроки, 0);
	КонецЦикла;	
	
	Если БылиСозданыИдентификаторы Тогда
		// При записи не перепроводить, не регистрировать по подписке к Эксопрту
		Документ.ОбменДанными.Загрузка = Истина;
		Документ.Записать();
	КонецЕсли;
КонецФункции

#КонецОбласти
