
&НаКлиенте
Перем КэшМодуляКлиента;

// #Область СлужебныеПеременныеИМетодыФормы

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		Результат = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		Результат = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

// #КонецОбласти

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьКонтекстФормы();
	СформироватьЗаголовокСпискаТоваров();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Организация) Тогда
		СформироватьОтчет();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если МодульКлиента().ЭтоЗавершениеРаботыПрограммы(ЗавершениеРаботы) Тогда
		Возврат; // При завершении работы программы серверный вызов недоступен
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтчетТабличныйДокумент.ВысотаТаблицы) Тогда
		ПровестиОпросПользователяИЗакрыть(Отказ);
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти


// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьОтчет();
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийРеквизитовФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	КонтекстОтчета.Организация = Организация;
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровГиперссылкаНажатие(Элемент)
	
	Обработчик = МодульКлиента().ОписаниеОбработчикаОповещения("СписокТоваровПослеРедактирования", ЭтаФорма);
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.КонтурМаркировка_Товары"));
	
	КонтекстФормы = МодульКлиента().Новый_ПараметрыФормыРедактированияСписка();
	
	КонтекстФормы.РазрешитьРедактирование = Истина;
	КонтекстФормы.Заголовок               = НСтр("ru = 'Список товаров для отчета по виртуальному остатку'");
	КонтекстФормы.Список                  = СписокТоваров;
	КонтекстФормы.МассивТипов             = МассивТипов;
	
	МодульКлиента().ОткрытьФормуПросмотраСписка(ЭтаФорма, КонтекстФормы, Обработчик);
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьКонтекстФормы()
	
	КонтекстОтчета = Параметры.КонтекстОтчета;
	
	СписокТоваров = КонтекстОтчета.СписокТоваров;
	Если ЗначениеЗаполнено(КонтекстОтчета.Организация) Тогда
		Организация = КонтекстОтчета.Организация;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет()
	
	Если Не МодульКлиента().ВыполнитьАвторизацию(Организация, ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьОтчетНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетНаСервере()
	
	ОтчетТабличныйДокумент.Очистить();
	
	МодульОбъекта().ОтчетПоВиртуальномуСкладу_Сформировать(КонтекстОтчета, ОтчетТабличныйДокумент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровПослеРедактирования(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокТоваров = Результат;
	КонтекстОтчета.СписокТоваров = СписокТоваров;
	СформироватьЗаголовокСпискаТоваров();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьЗаголовокСпискаТоваров()
	
	Если СписокТоваров.Количество() > 0 Тогда
		Элементы.СписокТоваровГиперссылка.Заголовок = СписокТоваров;
	Иначе
		Элементы.СписокТоваровГиперссылка.Заголовок = "<все товары>";
	КонецЕсли;

КонецПроцедуры

// #КонецОбласти

// #Область ОпросыПользователей

&НаКлиенте
Процедура ПровестиОпросПользователяИЗакрыть(Отказ)
	
	КлючиСценариев = МодульКлиента().Перечисление_КлючиСценариевДляОпросов();
	ОписаниеОпроса = МодульКлиента().ОпросПользователяПоСценарию(КлючиСценариев.ОтчетПоВиртуальномуСкладу);
	
	Если ЗначениеЗаполнено(ОписаниеОпроса) Тогда
		Отказ = Истина;
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПослеОпросаПользователя", ЭтаФорма);
		МодульКлиента().ОткрытьФормуОпросаПользователя(ОписаниеОпроса, ЭтаФорма, ОписаниеОбработчика);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОпросаПользователя(РезультатВыбора, ДопПараметры = Неопределено) Экспорт
	
	Закрыть();
	
КонецПроцедуры

// #КонецОбласти
