// Copyright (C) 2012-2025 Engineer Mareev Enterprises

//	Модуль для УТ10.3 экспорт Возвратов товаров от покупателя (с сериями и характеристиками)

//	$Возврат товаров от покупателя
//  Экспорт сообщений ASN:
//	 - В 1C (руч.) оператор оформляет документ "Возврат товаров от покупателя", который при проведении (авт.) помечается к экспорту.
//	 - 1C (авт.) экспортирует сообщение ASN.
//	 - EME.WMS (авт.) импортирует сообщение ASN и создает возвратный документ ASN.

#Область ПрограммныйИнтерфейс  

// Процедура Экспортировать экспортирует один документ Возврат товаров от покупателя с сериями (или характеристиками)
Процедура Экспортировать(ERPData, Документ) Экспорт
	
	АктуализироватьУИДыСтрок(Документ.Ссылка);
	
	//	Заголовок заказа
	EmeWmsERPEngine.AppendHeaderLine(ERPData);
	
	ERPData.header.asn_id       = Документ.УникальныйИдентификатор();

	Если Константы.EmeWmsСоздаватьУникальныеСообщения.Получить() Тогда
		ERPData.header.id	  	= Новый УникальныйИдентификатор;
	Иначе
		ERPData.header.id	  	= ERPData.header.asn_id;		
	КонецЕсли;

	ERPData.header.asn_reg_no	  =	СокрЛП(Документ.Номер)+"/"+Формат(Год(Документ.Дата),"ЧГ=4");
	ERPData.header.asn_date	  	  =	Документ.Дата;
	ERPData.header.erp_doc_type	  = ПолучитьМетаданные().Имя;
	ERPData.header.ref_reg_no  	  =	Документ.НомерВходящегоДокументаЭлектронногоОбмена;
	ERPData.header.is_return = 1;
	
	Контрагент = Документ.Контрагент; 
	
	ERPData.header.supplier_id    =	Контрагент.УникальныйИдентификатор();
	ERPData.header.supplier_code  =	СокрЛП(Контрагент.Код);
	ERPData.header.supplier_name  =	Контрагент.Наименование;
	
	EmeWmsЭкспортКонтрагентов.РазрешитьЭкспорт(Контрагент);
		
	ERPData.header.whs_to_code 	  =	EmeWmsУтилиты.ПолучитьКодСкладаEMEПоСсылке(Документ.СкладОрдер);  // Код склада EME
	ERPData.header.vendor_to_code =	EmeWmsУтилиты.ПолучитьКодОрганизацииEMEПоСсылке(Документ.Организация);
	ERPData.header.comment        =	Лев(Документ.Комментарий, 128);
																				  
	//	Использование серий в интеграции
	ИспользоватьСерииНастройка = Константы.EmeWmsИспользоватьСерии.Получить();	

	//	Строки заказа
	EmeWmsERPEngine.SelectChild(ERPData, "lines");
	Для Каждого СтрокаТовара Из Документ.Товары Цикл 
		Товар = СтрокаТовара.Номенклатура;
				
		EmeWmsERPEngine.AppendChildLine(ERPData);
		
		ERPData.lines.id			= СтрокаТовара.EmeWmsУИДСтроки;
		ERPData.lines.asn_line_no	= СтрокаТовара.НомерСтроки;
		ERPData.lines.goods_id		= СтрокаТовара.Номенклатура.УникальныйИдентификатор();
		ERPData.lines.goods_code	= СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовара.Номенклатура, "Код"));
		ERPData.lines.quantity		= СтрокаТовара.Количество;
		// Для основной единицы - берется значение из номенклатуры, для кода по классификатору
		ЕдиницаИзмерения 			= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовара.Номенклатура, "БазоваяЕдиницаИзмерения");
		ERPData.lines.mu_code		= ЕдиницаИзмерения.Код; 
		
		// Выгружаем серии или характеристики товара
		ИспользоватьСерии 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Товар, "ВестиУчетПоСериям");    
		
		Если Не ИспользоватьСерииНастройка Тогда
			ИспользоватьСерии = Ложь;
		КонецЕсли;

		Если ИспользоватьСерии Тогда // Серии
			// Здесь в сериях номер не заполняется, только наименование, содержащее номер и дату документа в виде текста.
			СерийныйНомер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовара.СерияНоменклатуры, "Наименование");
			СрокГодности = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовара.СерияНоменклатуры, "СрокГодности");
			Если ЗначениеЗаполнено(СерийныйНомер) Тогда 
				ERPData.lines.lot_no = СерийныйНомер;
				ERPData.lines.bbd = СрокГодности;
			КонецЕсли;
		Иначе // Характеристики
			ИспользоватьХарактеристики = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Товар,  "ВестиУчетПоХарактеристикам");
			Если ИспользоватьХарактеристики Тогда
				Если ЗначениеЗаполнено(СтрокаТовара.ХарактеристикаНоменклатуры) Тогда
					ERPData.lines.lot_no = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовара.ХарактеристикаНоменклатуры, "Наименование");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ EmeWmsЭкспортНоменклатуры.Экспортирован(СтрокаТовара.Номенклатура) Тогда
			EmeWmsЭкспортНоменклатуры.РазрешитьЭкспортСГруппами(СтрокаТовара.Номенклатура);
		КонецЕсли;      
		
		
		//#COA Чепиков 27.05.2025 в строках ASN необходимо передавать клиента под которого пришла поставка
		Если ЗначениеЗаполнено(СтрокаТовара.ЗаказПокупателя) И ТипЗнч(СтрокаТовара.Заказ) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			Покупатель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовара.Заказ, "Контрагент");
			ERPData.lines.customer_id = Покупатель.УникальныйИдентификатор();
		КонецЕсли;
		
		//#COA Чепиков 27.05.2025 в строках АСН нужно передавать цену
		ERPData.lines.price = СтрокаТовара.Цена;    
		
		// EmeWmsЭкспортНоменклатуры.ПометитьКЭкспортуБезусловно(СтрокаТовара.Номенклатура);
	КонецЦикла;	  
	
КонецПроцедуры   

//	Функция ПолучитьИмяСообщения возвращает имя сообщения
Функция ПолучитьИмяСообщения() Экспорт
	Возврат "asn";
КонецФункции

//	Функция ПолучитьМетаданные возвращает метаданные сообщения
Функция ПолучитьМетаданные() Экспорт
	Возврат Метаданные.Документы.ВозвратТоваровОтПокупателя;
КонецФункции

#КонецОбласти

#Область ЭкспортныеСлужебныеПроцедурыИФункции

//	Функция ПолучитьВыборкуСсылок возвращает выборку ссылок для экспорта
Функция ПолучитьВыборкуСсылок() Экспорт
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	EmeWmsПометкиКЭкспортуВозвратовТоваровОтПокупателя.ВозвратТоваровОтПокупателя КАК Ссылка
		|ИЗ
		|	РегистрСведений.EmeWmsПометкиКЭкспортуВозвратовТоваровОтПокупателя КАК EmeWmsПометкиКЭкспортуВозвратовТоваровОтПокупателя
		|ГДЕ
		|	EmeWmsПометкиКЭкспортуВозвратовТоваровОтПокупателя.КЭкспорту";
		
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции

//	Функция РазрешенКЭкспорту возвращает Истина, если документ Возврат товаров от покупателя разрешен к экспорту.
Функция РазрешенКЭкспорту(Документ) Экспорт
	
	ДатаЗапускаИнтеграции = Константы.EmeWmsДатаЗапускаИнтеграции.Получить();
	Если ЗначениеЗаполнено(ДатаЗапускаИнтеграции)
			И Документ.Дата < ДатаЗапускаИнтеграции Тогда
		ОтменитьЭкспорт(Документ);
		Возврат Ложь;
	КонецЕсли;	
	
	// В УТ10.3 определяется иначе
	// Если не используется ордерная схема для данного ордера, не экспортируем
	//Если НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ.Склад, "ИспользоватьОрдернуюСхемуПриПоступлении") Тогда
	//	ОтменитьЭкспорт(Документ);
	//	Возврат Ложь;
	//КонецЕсли;
	
	Если Документ.ПометкаУдаления Тогда
		ОтменитьЭкспорт(Документ);
		Возврат Ложь;
	КонецЕсли;

	//#COA Чепиков 27.05.2025 по результатам тестирования, пожелание Заказчика выгружать не проведенные. 
	//Проводить при импорте Receipt в статусе "Закрыт".
	//Если Не Документ.Проведен Тогда
	//	ОтменитьЭкспорт(Документ);
	//	Возврат Ложь;
	//КонецЕсли;
	
	// По складам не WMS не экспортировать
	КодСклада = EmeWmsУтилиты.ПолучитьКодСкладаEMEПоСсылке(Документ.СкладОрдер);
	Если НЕ ЗначениеЗаполнено(КодСклада) Тогда
		ОтменитьЭкспорт(Документ);
		Возврат Ложь;
	КонецЕсли;

	// Не выгружать заново импортированные документы
	Если ВозвратТоваровОтПокупателяИмпортирован(Документ) Тогда
		ПодтвердитьЭкспорт(Документ);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат истина;
	
КонецФункции

//	Процедура ПометитьКЭкспорту помечает документ ВозвратТоваровОтПокупателя к экспорту
Процедура ПометитьКЭкспорту(Документ) Экспорт

	Если Не РазрешенКЭкспорту(Документ) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуВозвратовТоваровОтПокупателя.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ВозвратТоваровОтПокупателя.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Истина;
		Запись.Дата = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsПометкиКЭкспортуВозвратовТоваровОтПокупателя.СоздатьМенеджерЗаписи();
	НоваяЗапись.ВозвратТоваровОтПокупателя = Документ.Ссылка;
	НоваяЗапись.КЭкспорту = Истина;
	НоваяЗапись.Дата = ТекущаяДата();
    НоваяЗапись.Записать(); 
		 
КонецПроцедуры

//	Процедура ОтменитьЭкспорт отменяет экспорт документа ВозвратТоваровОтПокупателя
Процедура ОтменитьЭкспорт(Документ) Экспорт

	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуВозвратовТоваровОтПокупателя.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ВозвратТоваровОтПокупателя.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Ложь;
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
КонецПроцедуры

//	Функция ПомеченКЭкспорту возвращает Истина, если документ Возвратов товаров от покупателя помечен к экспорту.
Функция ПомеченКЭкспорту(Документ) Экспорт
	
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуВозвратовТоваровОтПокупателя.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ВозвратТоваровОтПокупателя.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Возврат Запись.КЭкспорту;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

//	Процедура ПодтвердитьЭкспорт подтверждает экспорт документа Возврат товаров от покупателя.
Процедура ПодтвердитьЭкспорт(Документ) Экспорт

	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуВозвратовТоваровОтПокупателя.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ВозвратТоваровОтПокупателя.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Ложь;
		Запись.ДатаЭкспорта = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
КонецПроцедуры

//	Процедура ПометитьКЭкспорту помечает документ Возврата товаров от покупателя при записи.
Процедура ПометитьКЭкспортуПриЗаписиВозвратаТоваровОтПокупателя(Источник, Отказ) Экспорт

	ПометитьКЭкспорту(Источник);
		 
КонецПроцедуры

#КонецОбласти

#Область ЛокальныеСлужебныеПроцедурыИФункции

// Создать новые УИДы строк и исправить дубли, если возникли
Функция АктуализироватьУИДыСтрок(ДокументСсылка)
	Документ = ДокументСсылка.ПолучитьОбъект();
	// Для УИД строк ТЧ
	КлючиСтрок = Новый Соответствие;
	БылиСозданыИдентификаторы = Ложь;
	Для Каждого СтрокаТовара Из Документ.Товары Цикл 
		// Генерация специальных UID строк документа при выгрузке
		Если НЕ ЗначениеЗаполнено(СтрокаТовара.EmeWmsУИДСтроки) ИЛИ КлючиСтрок.Получить(СтрокаТовара.EmeWmsУИДСтроки) <> Неопределено Тогда
			СтрокаТовара.EmeWmsУИДСтроки = Новый УникальныйИдентификатор();
			БылиСозданыИдентификаторы = Истина;
		КонецЕсли;
		КлючиСтрок.Вставить(СтрокаТовара.EmeWmsУИДСтроки, 0);
	КонецЦикла;	
	
	Если БылиСозданыИдентификаторы Тогда
		Документ.Записать();
	КонецЕсли;
КонецФункции

// Проверить, был импортирован документ Возврата товаров от покупателя, или нет.
Функция ВозвратТоваровОтПокупателяИмпортирован(Документ)
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеВозвратовТоваровОтПокупателя.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Возврат Истина;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции

#КонецОбласти
