// Copyright (C) 2012-2025 Engineer Mareev Enterprises     
// Модуль для УТ10.3

//	$Номенклатура
//	Загрузка данных о номенклатурах
//	- В EME.WMS оператор корректирует данные карточки товара (ВГХ и другие).
//	- EME.WMS (авт.) экспортирует сообщение GOODS.
//	- 1C (авт.) импортирует сообщение GOODS и корректирует ВГХ номенклатуры.

#Область ПрограммныйИнтерфейс 

//	Импортирует одно сообщение
Процедура Импортировать(ERPData, Трассировка, ТемаСообщения) Экспорт
	
	//*** Делаем проверки ***

	Ссылка = EmeWmsУтилиты.ПолучитьСсылкуНаТовар(ERPData.header.id);
	Если Ссылка.Пустая() Тогда
		EmeWmsERPEngine.ErrorHeader(ERPData, "GDSBAD");
	КонецЕсли;
	Товар = Ссылка.ПолучитьОбъект();
	
	//	Проверим упаковки
	EmeWmsERPEngine.SelectChild(ERPData, "packs");
	Пока EmeWmsERPEngine.NextChildLine(ERPData) Цикл  
		Если ERPData.packs.is_eme_created <> 1 Тогда // Проверка только для единиц, созданных в 1С
			Ссылка = EmeWmsУтилиты.ПолучитьСсылкуНаЕдиницуИзмерения(ERPData.packs.id);
			Если Ссылка.Пустая() Тогда
				EmeWmsERPEngine.ErrorChild(ERPData, "PCKBAD");
			КонецЕсли;
		Иначе
			// ИД упаковки должен быть стандартным УИД-36
			Если СтрДлина(СокрЛП(ERPData.packs.id)) <> 36 Тогда
				EmeWmsERPEngine.ErrorChild(ERPData, "PCKBAD");
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	//	Если были ошибки в номенклатуре - выйдем
	Если EmeWmsERPEngine.HasErrors(ERPData) Тогда
		Возврат
	КонецЕсли;
							
	//*** Проверки сделали, пишем в базу данных 1C ***
		
	EmeWmsERPEngine.SelectChild(ERPData, "packs");
	Пока EmeWmsERPEngine.NextChildLine(ERPData) Цикл
		ЕдиницаИзмеренияСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаЕдиницуИзмерения(ERPData.packs.id);
		// Создадим новую упаковку, если её нет, с пришедшим ID
		Если ЕдиницаИзмеренияСсылка.Пустая() Тогда
			НовыйGUID = Новый УникальныйИдентификатор(ERPData.packs.id);
			ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
			ЕдиницаИзмерения.УстановитьСсылкуНового(Справочники.ЕдиницыИзмерения.ПолучитьСсылку(НовыйGUID));

			ЕдиницаИзмерения.Владелец 			= Товар.Ссылка;                          
			ЕдиницаИзмерения.Наименование 		= СокрЛП(ERPData.packs.pack_code);
			ЕдиницаИзмерения.Коэффициент		= ERPData.packs.factor;
			ЕдиницаИзмерения.ЕдиницаПоКлассификатору = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду(ERPData.packs.mu_code);			
		Иначе
			ЕдиницаИзмерения = ЕдиницаИзмеренияСсылка.ПолучитьОбъект();
			//	Исправить ранее импортированные упаковки без нужных реквизитов, базовую единицу не трогать
			Если ЕдиницаИзмерения.Ссылка <> Товар.ЕдиницаХраненияОстатков
				И НЕ ЗначениеЗаполнено(ЕдиницаИзмеренияСсылка.Наименование) Тогда 
				
				ЕдиницаИзмерения.Наименование = СокрЛП(ERPData.packs.pack_code);
				ЕдиницаИзмерения.Коэффициент  = ERPData.packs.factor;
				ЕдиницаИзмерения.ЕдиницаПоКлассификатору = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду(ERPData.packs.mu_code);
			КонецЕсли;
		КонецЕсли;
				
		//	Обновим ВГХ
		ЕдиницаИзмерения.Высота  = 	ERPData.packs.height * 10;		//	Размеры из сантиметров в миллиметры
		ЕдиницаИзмерения.Ширина  = 	ERPData.packs.width * 10;		//	Размеры из сантиметров в миллиметры
		ЕдиницаИзмерения.Длина	 = 	ERPData.packs.length * 10;		//	Размеры из сантиметров в миллиметры
		ЕдиницаИзмерения.Объем   = 	ERPData.packs.volume / 1000000; //	Объем из см3 в м3
		ЕдиницаИзмерения.Вес     = 	ERPData.packs.brutto; 		    //	Вес в килограммах
		
		ЕдиницаИзмерения.ОбменДанными.Загрузка = Истина;
		ЕдиницаИзмерения.Записать();
	КонецЦикла;    
	
	//	Запишем новые ШК	
	EmeWmsERPEngine.SelectChild(ERPData, "bar_codes");
	Пока EmeWmsERPEngine.NextChildLine(ERPData) Цикл
		Если НЕ ШтрихкодНоменклатурыСуществует(Товар.Ссылка, ERPData.bar_codes.bar_code) Тогда
			УпаковкаСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаЕдиницуИзмерения(ERPData.bar_codes.pack_id);
			Если ЗначениеЗаполнено(УпаковкаСсылка) Тогда
				ЗаписатьНовыйШтрихкодТовара(Товар.Ссылка, УпаковкаСсылка, ERPData.bar_codes.bar_code);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Товар.ОбменДанными.Загрузка = Истина;
	Товар.Записать();  
	
	EmeWmsERPEngine.Success(ERPData);

КонецПроцедуры

//	Функция ПолучитьМетаданные возвращает метаданные сообщения
Функция ПолучитьМетаданные() Экспорт
	Возврат Метаданные.Справочники.Номенклатура;
КонецФункции

//	Функция ПолучитьИмяСообщения возвращает имя сообщения
Функция ПолучитьИмяСообщения() Экспорт
	Возврат "goods";
КонецФункции

#КонецОбласти

#Область ЛокальныеСлужебныеПроцедурыИФункции

//	Записать в регистр штрихкодов новый штрихкод
Процедура ЗаписатьНовыйШтрихкодТовара(ТоварСсылка, УпаковкаСсылка, Штрихкод)

	НаборЗаписей = РегистрыСведений.Штрихкоды.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Штрихкод.Установить(Штрихкод);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.Штрихкоды.СоздатьМенеджерЗаписи();
	НоваяЗапись.Штрихкод 		 = Штрихкод;
	НоваяЗапись.Владелец	 	 = ТоварСсылка;
	НоваяЗапись.ТипШтрихкода     = ПолучитьТипШтрихкода(Штрихкод);
	НоваяЗапись.ЕдиницаИзмерения = УпаковкаСсылка;
	НоваяЗапись.Качество		 = Справочники.Качество.Новый;
    НоваяЗапись.Записать();    
	
КонецПроцедуры

//	Проверить, есть ли такой штрихкод номенклатуры
Функция ШтрихкодНоменклатурыСуществует(ТоварСсылка, ЗначениеШтрихкода)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
	|	ШтрихкодыНоменклатуры.Владелец КАК Номенклатура
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Владелец = &Номенклатура
	|	И ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";

	Запрос.УстановитьПараметр("Штрихкод", ЗначениеШтрихкода);
	Запрос.УстановитьПараметр("Номенклатура", ТоварСсылка);

	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();  
	
КонецФункции

//	Возврашает тип штрихкода по длине
Функция ПолучитьТипШтрихкода(Знач Штрихкод)
	
	Попытка
		ЧтениеШтрихкода = ОбщегоНазначения.ОбщийМодуль("ШтрихкодыУпаковокКлиентСервер").ПараметрыШтрихкода(СокрЛП(Штрихкод));
		Возврат ЧтениеШтрихкода.ТипШтрихкода;
	Исключение
	КонецПопытки;
	
	Возврат ПредопределенноеЗначение("ПланВидовХарактеристик.ТипыШтрихкодов.EAN13"); 
	
КонецФункции

#КонецОбласти
