//	Copyright (C) 2012-2025 Engineer Mareev Enterprises
//	Модуль для УТ 10.3
//	Импортирует TRANSFER (по инициативе WMS) в документ Перемещение товаров c характеристиками или сериями товара 

//	$Перемещениет товаров межскладское (неордерная схема)
//	Импорт сообщений TRANSFER:
//	 - Оператор EME.WMS (руч.) создает документ Перемещение, подбирает товары и ячейки, проводит и закрывает его.
//	 - После закрытия документа EME.WMS (авт.) экспортирует сообщение TRANSFER.
//	 - 1C (авт.) импортирует сообщение TRANSFER, создает документ "Перемещение товаров" помечает его к проведению.

#Область ПрограммныйИнтерфейс

//	Функция ПолучитьИмяСообщения возвращает имя сообщения
Функция ПолучитьИмяСообщения() Экспорт
	Возврат "transfer";
КонецФункции

//	Функция ПолучитьМетаданные возвращает метаданные сообщения
Функция ПолучитьМетаданные() Экспорт
	Возврат Метаданные.Документы.ПеремещениеТоваров;
КонецФункции

//	Импорт Перемещения товаров
Процедура Импортировать(ERPData, Трассировка, ТемаСообщения) Экспорт
	
	 // Перемещение импортируется только без предзаказа из 1C
	Если ЗначениеЗаполнено(ERPData.header.erp_doc_type) Тогда
		Возврат;
	КонецЕсли;
	
	//	Идентификатор документа WMS
	ИдЕМЕ = ERPData.header.transfer_id;
	//	Номер документа WMS
	НомерЕМЕ = ERPData.header.transfer_reg_no;
	
	//	Соберем товары и количества
	КодЗоныОтправителя 	= Неопределено;
	КодЗоныПолучателя 	= Неопределено;
	КартаТоваров 	= Новый Соответствие;
	ПолучитьКоличестваТоваров(ERPData, КодЗоныОтправителя, КодЗоныПолучателя, КартаТоваров);
	
	//	Проверки
	//	Получим склады по коду EME
	КодСкладаОтправителя = ERPData.header.whs_code;
	КодСкладаПолучателя = ERPData.header.whs_to_code;
	КодОрганизации = ERPData.header.vendor_code;

	// Получим организацию по коду EME
	ОрганизацияСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаОрганизациюПоКодуEME(КодОрганизации);
	Если ОрганизацияСсылка.Пустая() Тогда
		EmeWmsERPEngine.ErrorHeader(ERPData, "VNDBAD");
		Возврат;
	КонецЕсли;
	
	СкладОтправитель = EmeWmsУтилиты.ПолучитьСсылкуНаСкладПоКодуEME(КодСкладаОтправителя, КодЗоныОтправителя, КодОрганизации);
	Если СкладОтправитель.Пустая() Тогда
		EmeWmsERPEngine.ErrorHeader(ERPData, "WHSBAD");
		Возврат;
	КонецЕсли;
	
	СкладПолучатель = EmeWmsУтилиты.ПолучитьСсылкуНаСкладПоКодуEME(КодСкладаПолучателя, КодЗоныПолучателя, КодОрганизации);
	Если СкладПолучатель.Пустая() Тогда
		EmeWmsERPEngine.ErrorHeader(ERPData, "WTOBAD");
		Возврат;
	КонецЕсли;
	
	//	Если были ошибки
	Если EmeWmsERPEngine.HasErrors(ERPData) Тогда
		Возврат;
	КонецЕсли;
	
	// Если склад отправитель и склад получатель равны, ничего не создаем в 1С.
	Если СкладОтправитель = СкладПолучатель Тогда
		EmeWmsERPEngine.Success(ERPData);
	КонецЕсли;

	//*** Проверки сделали, пишем в базу данных 1C ***
	
	СоздатьИзменитьДокументПеремещенияТоваров(ERPData, ИдЕМЕ, НомерЕМЕ, ОрганизацияСсылка, СкладОтправитель, СкладПолучатель, КартаТоваров);
	
	EmeWmsERPEngine.Success(ERPData);
КонецПроцедуры

#КонецОбласти

#Область ЛокальныеСлужебныеПроцедурыИФункции

// Функция создает документ перемещения товаров по карте товаров, возвращает ссылку на документ перемещения
Функция СоздатьИзменитьДокументПеремещенияТоваров(ERPData, ИдЕМЕ, НомерЕМЕ, ОрганизацияСсылка, СкладОтправитель, СкладПолучатель, КартаТоваров)
	
	ДокументСсылка = НайтиДокументПеремещенияТоваров(ИдЕМЕ);
	Если ДокументСсылка.Пустая() Тогда
		Документ = Документы.ПеремещениеТоваров.СоздатьДокумент();
		Документ.Дата 				= ТекущаяДата();
		Документ.Организация 		= ОрганизацияСсылка;
		Документ.СкладОтправитель 	= СкладОтправитель;
		Документ.СкладПолучатель 	=  СкладПолучатель;
		Документ.ОтражатьВБухгалтерскомУчете = Истина;
		Документ.ОтражатьВУправленческомУчете = Истина;
		Документ.ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.ТоварыПродукция;
		
		Документ.Комментарий = "Создан на основании документа прихода EME: " +
			НомерЕМЕ + " (" + ИдЕМЕ + ")" + " (" + ERPData.header.comment + ")";
	Иначе
		Документ = ДокументСсылка.ПолучитьОбъект();
		Документ.Комментарий = "Изменен на основании документа прихода EME: " +
			НомерЕМЕ + " (" + ИдЕМЕ + ")" + " (" + ERPData.header.comment + ")";
	КонецЕсли;
		
	EmeWmsУтилиты.СкорректироватьТЧДокумента(Документ.Товары, КартаТоваров, Истина);		
	ПересчитатьУпаковкиДокумента(Документ);
	Документ.EmeWmsСтатус = "К проведению";

	Документ.Записать(РежимЗаписиДокумента.Запись);
	
	СоздатьОтметкуОбИмпортеПеремещенияТоваров(Документ, ИдЕМЕ);

	EmeWmsПроведениеДокументов.ПометитьДокументКПроведению(Документ.Ссылка, 0);
	
	Возврат Документ.Ссылка;
КонецФункции

// Функция возвращает ссылку на документ Перемещение товаров по ИД EME
Функция НайтиДокументПеремещенияТоваров(ИдЕМЕ)
	Перем Запрос, док1;
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Перемещение.Ссылка КАК Ссылка
		|ИЗ
		|	
		|РегистрСведений.EmeWmsОтметкиОбИмпортеПеремещенийТоваров КАК Перемещение
		|ГДЕ
		|	Перемещение.ID = &ИдЕМЕ";
	Запрос.УстановитьПараметр("ИдЕМЕ", ИдЕМЕ);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		док1 = Выборка.Ссылка.ПолучитьОбъект();
		Если НЕ док1.ПометкаУдаления Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Документы.ПеремещениеТоваров.ПустаяСсылка();

КонецФункции

// Создает в регистре пометку об импорте документа перемещения товаров с идентификатором EME
Процедура СоздатьОтметкуОбИмпортеПеремещенияТоваров(Документ, ИдЕМЕ)
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеПеремещенийТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.ДатаИмпорта = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsОтметкиОбИмпортеПеремещенийТоваров.СоздатьМенеджерЗаписи();
	НоваяЗапись.ID = ИдЕМЕ;
	НоваяЗапись.Ссылка = Документ.Ссылка;
	НоваяЗапись.ДатаИмпорта = ТекущаяДата();
    НоваяЗапись.Записать(); 
 
КонецПроцедуры

//	Карта товаров: ключ = UID товара + UID серии + UID характеристики, значение = количество в ед.хранения
Процедура ПолучитьКоличестваТоваров(ERPData, КодЗоныОтправителя, КодЗоныПолучателя, КартаТоваров)

	//	Использование серий в интеграции
	ИспользоватьСерии = Константы.EmeWmsИспользоватьСерии.Получить();	

	// Весь товар в сообщении 
	КартаКлючей = Новый Соответствие;
	EmeWmsERPEngine.SelectChild(ERPData, "lines");
	Пока EmeWmsERPEngine.NextChildLine(ERPData) Цикл
		//	Проверим товар
		УИДТовара = ERPData.lines.goods_id;
		УИДЕдиницы = ERPData.lines.pack_id;
		Если УИДТовара = "" Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "GDSNUL");
			Продолжить
		КонецЕсли;
		
		ТоварСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаТовар(УИДТовара);
		Если ТоварСсылка.Пустая() Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "GDSBAD");
			Продолжить
		КонецЕсли;
		
		ЕдиницаИзмерения = EmeWmsУтилиты.ПолучитьСсылкуНаЕдиницуИзмерения(УИДЕдиницы);
		Если ЕдиницаИзмерения.Пустая() Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "PCKBAD");
			Продолжить
		КонецЕсли;

		РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТоварСсылка, "ВестиУчетПоСериям, ВестиУчетПоХарактеристикам"); 

		// Серии или серийные номера
		Если Не ИспользоватьСерии Тогда
			РеквизитыНоменклатуры.ВестиУчетПоСериям = Ложь;
		КонецЕсли;

		СерияНоменклатуры 		   	= Неопределено;
		ХарактеристикаНоменклатуры 	= Неопределено;
		
		Если РеквизитыНоменклатуры.ВестиУчетПоСериям Тогда   
			СерийныйНомер 	 = ERPData.lines.lot_no;
			ДатаГодности  	 = ERPData.lines.bbd;
			ДатаПроизводства = ERPData.lines.prd; 
			
			СерияНоменклатуры = EmeWmsУтилиты.ПолучитьСериюПоНаименованию(ERPData.lines.lot_no, ТоварСсылка);
		ИначеЕсли РеквизитыНоменклатуры.ВестиУчетПоХарактеристикам Тогда
			ХарактеристикаНоменклатуры = EmeWmsУтилиты.ПолучитьХарактеристикуПоНаименованию(ERPData.lines.lot_no, ТоварСсылка);
		КонецЕсли;
		
		КодЗоныОтправителя 	= ERPData.lines.zone_code;
		КодЗоныПолучателя 	= ERPData.lines.zone_to_code;
		
		КлючТовара = EmeWmsУтилиты.СоздатьКлючТовара(ТоварСсылка, СерияНоменклатуры, ХарактеристикаНоменклатуры);
		КоличествоВБазовой 	= EmeWmsУтилиты.ПересчетВДругуюЕдиницу(ERPData.lines.quantity, 
																  ЕдиницаИзмерения, 
																  EmeWmsУтилиты.ПолучитьБазовуюЕдиницуИзмерения(ТоварСсылка));
		КоличествоПоКарте = ?(КартаТоваров.Получить(КлючТовара) = Неопределено, 0, КартаТоваров.Получить(КлючТовара));
		КартаТоваров.Вставить(КлючТовара, КоличествоПоКарте + КоличествоВБазовой);
		// Это для привязки серийных номеров к товару
		КартаКлючей.Вставить(ERPData.lines.id, КлючТовара);
	КонецЦикла;
	
КонецПроцедуры

// Пересчитывает количества упаковок товара в ТЧ Товары
Процедура ПересчитатьУпаковкиДокумента(Документ)
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоУпаковок");
	Для Каждого СтрокаТовара Из Документ.Товары Цикл
		СтрокаТовара.Коэффициент = СтрокаТовара.ЕдиницаИзмерения.Коэффициент;
		ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТовара, Документ);
	КонецЦикла;
КонецПроцедуры    


#КонецОбласти

