// Copyright (C) 2012-2025 Engineer Mareev Enterprises
// Модуль для УТ 10.3

// 	$Приход товаров (не ордерная схема)
//	Импорт сообщений RECEIPT:
//	 - Оператор EME.WMS (руч.) создает документ прихода на основе ASN.
//	 - После закрытия документа прихода EME.WMS (авт.) экспортирует сообщение RECEIPT.
//	 - 1C (авт.) импортирует сообщение RECEIPT.
//	 - 1С (авт.) При несовпадении данных документа 1С по товарам с фактически принятыми, корректируется документ "Поступление товаров услуг".
//	 - 1C (авт.) документ "Поступление товаров услуг" проводится, в комментарий заносится информация о документе WMS, на основании которого документ принят (скорректирован).

#Область ПрограммныйИнтерфейс  

// Функция ПолучитьИмяСообщения возвращает имя сообщения
Функция ПолучитьИмяСообщения() Экспорт
	Возврат "receipt";
КонецФункции

// Функция ПолучитьМетаданные возвращает метаданные сообщения
Функция ПолучитьМетаданные() Экспорт
	Возврат Метаданные.Документы.ПоступлениеТоваровУслуг;
КонецФункции

// Импорт сообщения receiot по документу Поступление товаров услуг с сериями (или харакеристиками)
// изменяет статус на отгружен и сравнивает количества отгруженного
Процедура Импортировать(ERPData, Трассировка, ТемаСообщения) Экспорт
	
	// Импорт receipt только на основании Поступления товаров услуг
	Если ERPData.header.erp_doc_type <> ПолучитьМетаданные().Имя Тогда
		Возврат;
	КонецЕсли;
	
	// Принимать только сообщение для закрытого или подтвержденного документа.
	Если Не EmeWmsСтатусы.ДокументЗакрыт(ERPData) Тогда
		возврат;
	КонецЕсли;  

	Если ERPData.header.is_partly = 1 Тогда // Принимать только закрывающий receipt
		возврат;
	КонецЕсли;  
	
	Если ERPData.header.asn_id = "" Тогда // Поступление импортируется только на основе ASN. Без ASN - ОприходованиеТоваров.
		Возврат;
	КонецЕсли;
	
	НомерЕМЕ	= ERPData.header.receipt_reg_no;
	ИдЕМЕ 		= ERPData.header.receipt_id;       
	
	//	Соберем товары и количества
	Оператор		= "";
	КодЗоны 	 	= Неопределено;
	КодЗоныБрака 	= Неопределено;
	КартаТоваров 	= Новый Соответствие;
	КартаБрака 	 	= Новый Соответствие;       
	КартаОснований 	= Новый Соответствие;       
	ПолучитьКоличестваТоваровСБраком(ERPData, КодЗоны, КодЗоныБрака, КартаТоваров, КартаБрака, КартаОснований, Оператор);

	ОрганизацияСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаОрганизациюПоКодуEME(ERPData.header.vendor_to_code);
	Если ОрганизацияСсылка.Пустая() Тогда
		EmeWmsERPEngine.ErrorHeader(ERPData, "VNDBAD");
		Возврат;
	КонецЕсли;
	
	// Ссылка на документ-основание из ASN (Поступление товаров услуг)
	ПТУСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаПоступлениеТоваровУслуг(ERPData.header.asn_id);
	Если ПТУСсылка.Пустая() Тогда
		EmeWmsERPEngine.ErrorHeader(ERPData, "ASNBAD");
	КонецЕсли;
	
	//	Если были ошибки
	Если EmeWmsERPEngine.HasErrors(ERPData) Тогда
		Возврат;
	КонецЕсли;
	
	//*** Проверки сделали, пишем в базу данных 1C ***
	
	ПТУ	= ПТУСсылка.ПолучитьОбъект();

	// #COA Чепиков 27.08.2025
	//Первичный документ не редактировать, отклонения перемещать на склад: Склад "НЕДОСТАЧА", Склад "НЕДОСТАЧА Удаленка", 1Склад "БРАК" (карантин)
	//Если излишек - создается документ "Оприходование излишков" на основной склад (из документа), не проводится.
	//При проведении Оприходования излишек выгружаем в EME.WMS сообщение Change с изменением статуса товара с Z -> N
		
	КартаТоваровДокумента = EmeWmsУтилиты.ПолучитьКартуТоваровДокумента(ПТУСсылка);
	//ТаблицаРазличий = EmeWmsУтилиты.ПолучитьТаблицуРазличий(КартаТоваровДокумента, КартаТоваров);		
	//Если ТаблицаРазличий.Количество() > 0 Тогда
		//ТекстРасхождений = EmeWmsУтилиты.ПолучитьКраткоеОписаниеРазличий(ПТУСсылка, ERPData.header.asn_reg_no, ТаблицаРазличий);
		//Если ERPData.header.state = "NEW" Тогда 
		//	Тема = "Расхождение данных по принятым товарам в исходном Приходном ордере и документе прихода wms";
		//	EmeWmsУтилиты.ДобавитьНапоминаниеИнтеграции(ТекстРасхождений, ПТУСсылка);
		//КонецЕсли;                    
				
		//EmeWmsУтилиты.СкорректироватьТЧДокумента(ПТУ.Товары, КартаТоваров, Истина);
		//ПересчитатьУпаковкиДокумента(ПТУ);
	//	ПТУ.Комментарий = "Документ скорректирован на основании документа прихода EME: " + ERPData.header.receipt_reg_no + " (" + ERPData.header.comment + ")";
	//Иначе
	//	ПТУ.Комментарий = "Документ принят без изменений на основании документа прихода EME: " + ERPData.header.receipt_reg_no + " (" + ERPData.header.comment + ")";
	//КонецЕсли;
	
	//	Оператор, отгрузивший строку
	Если ЗначениеЗаполнено(Оператор) Тогда       		
		ОператорСсылка = Справочники.ИнформационныеКарты.НайтиПоНаименованию(Оператор);
		Если ЗначениеЗаполнено(ОператорСсылка) Тогда
			ПТУ.Кладовщик1 = ОператорСсылка; 
		КонецЕсли;
	КонецЕсли;

	//	Время начало проверки, Дата время прихода от поставщика
	Если ЗначениеЗаполнено(ERPData.header.end_of_unloading_fact) Тогда          
		ПТУ.ВремяНачалоПроверки = ERPData.header.end_of_unloading_fact;		
		ПТУ.ДатаВремяПриходаОтПоставщика = ERPData.header.end_of_unloading_fact;
	КонецЕсли;

	Комментарий = " Документ принят на основании документа прихода EME: " + ERPData.header.receipt_reg_no + " (" + ERPData.header.comment + ")";
	ПТУ.Комментарий = СтрЗаменить(ПТУ.Комментарий, Комментарий, "") + Комментарий;
	
	//	Количество мест
	ПТУ.КоличествоМест = ERPData.header.bulk_qty;
	ПТУ.Записать();

	//	Асинхронное проведение.
	EmeWmsПроведениеДокументов.ПометитьДокументКПроведению(ПТУ.Ссылка, 0);
	
	//	Перемещение на склад "Брака"
	Если КартаБрака.Количество() > 0 Тогда				
		//	Заполним серии в строках с браком
		ТоварСсылка 		 = Неопределено;
		СерияСсылка 		 = Неопределено;
		ХарактеристикаСсылка = Неопределено;		
		Для Каждого Элем Из КартаТоваровДокумента Цикл
			EmeWmsУтилиты.РазобратьКлючНаСсылки(Элем.Ключ, ТоварСсылка, СерияСсылка, ХарактеристикаСсылка);

			Если Не ЗначениеЗаполнено(СерияСсылка) Тогда
				Продолжить;
			КонецЕсли;

			Ключ = EmeWmsУтилиты.СоздатьКлючТовара(ТоварСсылка, Неопределено, ХарактеристикаСсылка);
			
			КоличествоБрака  = ?(КартаБрака.Получить(Ключ) = Неопределено, 0.0, КартаБрака.Получить(Ключ));
			Если Элем.Значение >= КоличествоБрака Тогда
				КартаБрака.Удалить(Ключ);
				КартаБрака.Вставить(Элем.Ключ, КоличествоБрака);
			Иначе     
				КартаБрака.Вставить(Ключ, КоличествоБрака - Элем.Значение);				
				КартаБрака.Вставить(Элем.Ключ, Элем.Значение);
			КонецЕсли;
		КонецЦикла;			
		
		СкладБрака = EmeWmsУтилиты.ПолучитьСкладБракаДляСклада(ПТУ.СкладОрдер);
		Если ЗначениеЗаполнено(СкладБрака) Тогда
			СоздатьИзменитьДокументПеремещенияНаСкладБрака(ERPData, ИдЕМЕ, НомерЕМЕ, ПТУ, КартаБрака, СкладБрака, КартаОснований);			
		КонецЕсли;		
	КонецЕсли;
	
	//	Перемещение на склад "Недостач"
	СкладНедостач = EmeWmsУтилиты.ПолучитьСкладНедостачДляСклада(ПТУ.СкладОрдер);	
	Если ЗначениеЗаполнено(СкладНедостач) Тогда 
		//	Заполним серии в строках с товаром
		КартаНедостач 		 = Новый Соответствие;            
		ТоварСсылка  		 = Неопределено;
		СерияСсылка 		 = Неопределено;
		ХарактеристикаСсылка = Неопределено;		
		Для Каждого Элем Из КартаТоваровДокумента Цикл  
			EmeWmsУтилиты.РазобратьКлючНаСсылки(Элем.Ключ, ТоварСсылка, СерияСсылка, ХарактеристикаСсылка);
			
			Если Не ЗначениеЗаполнено(СерияСсылка) Тогда
				Продолжить;
			КонецЕсли;
			
			Ключ = EmeWmsУтилиты.СоздатьКлючТовара(ТоварСсылка, Неопределено, ХарактеристикаСсылка);
			
			КоличествоТоваров = ?(КартаТоваров.Получить(Ключ) = Неопределено, 0.0, КартаТоваров.Получить(Ключ));
			
			Если Элем.Значение >= КоличествоТоваров Тогда
				КартаТоваров.Удалить(Ключ);
				КартаТоваров.Вставить(Элем.Ключ, КоличествоТоваров);
			Иначе     
				КартаТоваров.Вставить(Ключ, КоличествоТоваров - Элем.Значение);				
				КартаТоваров.Вставить(Элем.Ключ, Элем.Значение);
			КонецЕсли;
		КонецЦИкла;
		
		//Для Каждого Элем Из КартаТоваров Цикл
		//	Сообщить(Строка(Элем.Ключ) + " " + Строка(Элем.Значение));
		//КонецЦикла;
		
		//	Заполним карту недостач с сериями		
		Для Каждого Элем Из КартаТоваровДокумента Цикл  
			КоличествоТоваров = ?(КартаТоваров.Получить(Элем.Ключ) = Неопределено, 0.0, КартаТоваров.Получить(Элем.Ключ));
			
			Если Элем.Значение > КоличествоТоваров Тогда
				КартаНедостач.Вставить(Элем.Ключ, Элем.Значение - КоличествоТоваров);
			КонецЕсли;
		КонецЦикла;
		
		//	Для склада "С №2" брак перемещать на склад недостач
		Если Не ЗначениеЗаполнено(СкладБрака) И КартаБрака.Количество() > 0 И ПТУ.СкладОрдер.Наименование = "С №2" Тогда
			Для Каждого Элем Из КартаБрака Цикл  
				КоличествоТоваров = ?(КартаНедостач.Получить(Элем.Ключ) = Неопределено, 0.0, КартаНедостач.Получить(Элем.Ключ));
				
				КартаНедостач.Вставить(Элем.Ключ, Элем.Значение + КоличествоТоваров);
			КонецЦикла;			
		КонецЕсли;
		
		СоздатьИзменитьДокументПеремещенияНаСкладНедостач(ERPData, ИдЕМЕ, НомерЕМЕ, ПТУ, КартаНедостач, СкладНедостач, КартаОснований);
	КонецЕсли;		
	
	СоздатьОтметкуОбИмпортеПоступленияТоваровУслуг(ПТУ.Ссылка, ИдЕМЕ);
	
	Трассировка = Трассировка + ПТУ + Символы.ПС;
	ТемаСообщения = "Принят приход по документу Поступление товаров услуг по приходу EME " + ERPData.header.receipt_reg_no;
	
	EmeWmsERPEngine.Success(ERPData); 
	
КонецПроцедуры

#КонецОбласти

#Область ЛокальныеСлужебныеПроцедурыИФункции

//	В карте товаров - всё принятое, в карте брака - только брак
// 	Карта товаров: ключ = UID товара + UID серии + UID характеристики, значение = количество в ед.хранения
Процедура ПолучитьКоличестваТоваровСБраком(ERPData, КодЗоны, КодЗоныБрака, КартаТоваров, КартаБрака, КартаОснований, Оператор)
	
	//	Использование серий в интеграции
	ИспользоватьСерии = Константы.EmeWmsИспользоватьСерии.Получить();	

	КлючиТоваров = Новый Соответствие();
	НомераСерий = Новый Соответствие;        
	СерийныеНомера = Новый Соответствие;
	НомераХарактеристик = Новый Соответствие;
	
	// Заполнить карту серийных номеров товара (строка номеров по номеру строки)
	EmeWmsERPEngine.SelectChild(ERPData, "numbers");
	Пока EmeWmsERPEngine.NextChildLine(ERPData) Цикл 
		// Номер серии: WMS "-" = 1С "Неизвестная серия"	
		СерийныйНомер = ?(ERPData.numbers.serial_no <> "-", ERPData.numbers.serial_no, "Неизвестная серия");
		
		КлючСтроки = ERPData.numbers.receipt_line_id;
		СтрокаНомеров = СерийныеНомера.Получить(КлючСтроки);
		СерийныеНомера.Вставить(КлючСтроки, ?(СтрокаНомеров = неопределено, СерийныйНомер, СтрокаНомеров + "," + СерийныйНомер));
	КонецЦикла;	

	// Весь товар в сообщении
	EmeWmsERPEngine.SelectChild(ERPData, "lines");
	Пока EmeWmsERPEngine.NextChildLine(ERPData) Цикл
		//	Проверим товар
		УИДТовара = ERPData.lines.goods_id;
		УИДЕдиницы = ERPData.lines.pack_id;
		Если УИДТовара = "" Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "GDSNUL");
			Продолжить
		КонецЕсли;
		
		ТоварСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаТовар(УИДТовара);
		Если ТоварСсылка.Пустая() Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "GDSBAD");
			Продолжить
		КонецЕсли;
		
		ЕдиницаИзмерения = EmeWmsУтилиты.ПолучитьСсылкуНаЕдиницуИзмерения(УИДЕдиницы);
		Если ЕдиницаИзмерения.Пустая() Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "PCKBAD");
			Продолжить
		КонецЕсли;
		
		РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТоварСсылка, "ВестиУчетПоСериям, ВестиУчетПоХарактеристикам"); 

		Если Не ИспользоватьСерии Тогда
			РеквизитыНоменклатуры.ВестиУчетПоСериям = Ложь;
		КонецЕсли;
		
		СерияНоменклатуры 		   	= Неопределено;
		ХарактеристикаНоменклатуры 	= Неопределено;
		
		Если РеквизитыНоменклатуры.ВестиУчетПоСериям Тогда   
			СерийныйНомер 	 = ERPData.lines.lot_no;
			ДатаГодности  	 = ERPData.lines.bbd;
			ДатаПроизводства = ERPData.lines.prd; 
			
			СерияНоменклатуры = EmeWmsУтилиты.ПолучитьСериюПоНаименованию(ERPData.lines.lot_no, ТоварСсылка);
		ИначеЕсли РеквизитыНоменклатуры.ВестиУчетПоХарактеристикам Тогда
			ХарактеристикаНоменклатуры = EmeWmsУтилиты.ПолучитьХарактеристикуПоНаименованию(ERPData.lines.lot_no, ТоварСсылка);
		КонецЕсли;
		
		// Номера серий по строкам
		НомераСерий.Вставить(ERPData.lines.id, СерияНоменклатуры);
		НомераХарактеристик.Вставить(ERPData.lines.id, ХарактеристикаНоменклатуры);
		
		КлючиТоваров.Вставить(ERPData.lines.id, ТоварСсылка);
		КодЗоны = ERPData.lines.zone_to_code;
		КлючТовара = EmeWmsУтилиты.СоздатьКлючТовара(ТоварСсылка, СерияНоменклатуры, ХарактеристикаНоменклатуры);
		КоличествоВБазовой = EmeWmsУтилиты.ПересчетВДругуюЕдиницу(ERPData.lines.receipt_qty, ЕдиницаИзмерения, ТоварСсылка.БазоваяЕдиницаИзмерения);
		КоличествоПоКарте = ?(КартаТоваров.Получить(КлючТовара) = неопределено, 0.0, КартаТоваров.Получить(КлючТовара));
		
		КартаТоваров.Вставить(КлючТовара, КоличествоПоКарте + КоличествоВБазовой);
		Если EmeWmsСтатусы.ИспользоватьКакСтатус(ERPData.lines.stock_status) = "B" Тогда // Добавим количество в карту брака, Z
			КодЗоныБрака = ERPData.lines.zone_to_code;
			КоличествоПоКарте = ?(КартаБрака.Получить(КлючТовара) = неопределено, 0.0, КартаБрака.Получить(КлючТовара));
			КартаБрака.Вставить(КлючТовара, КоличествоПоКарте + КоличествоВБазовой);
			
			//	Маппинг кодов оснований EME.WMS и причин корректировки 1С
			//	E07	Поставщик - Поставщик
			//	E10	Пересорт - Пересорт
			//	E08	Брак - Брак
			//	E09	Недостача - Недостача
			//	E25	Нет маркировки – Нет маркировки											
			Если ЗначениеЗаполнено(ERPData.lines.reason_code) Тогда				
				Если ERPData.lines.reason_code = "E07" Тогда
					КартаОснований.Вставить(КлючТовара, Новый Структура("Причина, КомментарийКПричине", 
						ПредопределенноеЗначение("Перечисление.ПричиныКорректировки.Поставщик"), ERPData.lines.comment));	            
				ИначеЕсли ERPData.lines.reason_code = "E10" Тогда
					КартаОснований.Вставить(КлючТовара, Новый Структура("Причина, КомментарийКПричине", 
						ПредопределенноеЗначение("Перечисление.ПричиныКорректировки.Пересорт"), ERPData.lines.comment));	            					
				ИначеЕсли ERPData.lines.reason_code = "E08" Тогда
					КартаОснований.Вставить(КлючТовара, Новый Структура("Причина, КомментарийКПричине", 
						ПредопределенноеЗначение("Перечисление.ПричиныКорректировки.Брак"), ERPData.lines.comment));	            					
				ИначеЕсли ERPData.lines.reason_code = "E09" Тогда
					КартаОснований.Вставить(КлючТовара, Новый Структура("Причина, КомментарийКПричине", 
						ПредопределенноеЗначение("Перечисление.ПричиныКорректировки.Недостача"), ERPData.lines.comment));	            					
				ИначеЕсли ERPData.lines.reason_code = "E25" Тогда
					КартаОснований.Вставить(КлючТовара, Новый Структура("Причина, КомментарийКПричине", 
						ПредопределенноеЗначение("Перечисление.ПричиныКорректировки.НетМаркировки"), ERPData.lines.comment));	            					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;    
		
		//	Логин оператора, отгрузившего строку
		Если ЗначениеЗаполнено(ERPData.lines.loaded_by) И Не ЗначениеЗаполнено(Оператор)  Тогда 
			Оператор = СокрЛП(ERPData.lines.loaded_by);
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(КодЗоныБрака) ИЛИ КодЗоны = КодЗоныБрака Тогда
		КодЗоныБрака = "BRAK"; // По умолчанию, если в строках не заполнено
	КонецЕсли;
	
КонецПроцедуры

// Функция создает документ перемещения на склад брака по карте товаров брака, возвращает ссылку на документ перемещения
Функция СоздатьИзменитьДокументПеремещенияНаСкладБрака(ERPData, ИдЕМЕ, НомерЕМЕ, Распоряжение, КартаБрака, СкладБрака, КартаОснований)
	
	//	Использование серий в интеграции
	ИспользоватьСерии = Константы.EmeWmsИспользоватьСерии.Получить();	

	ИдРаспоряжение = "b" + Распоряжение.Ссылка.УникальныйИдентификатор();
	ДокументСсылка = НайтиДокументПеремещенияТоваров(ИдРаспоряжение);
	Если ДокументСсылка.Пустая() Тогда
		Документ = Документы.ПеремещениеТоваров.СоздатьДокумент();
		Документ.Заполнить(Распоряжение);
		Документ.ДокументОснование 			  = Распоряжение.Ссылка;
		Документ.Дата 						  = ТекущаяДата();
		Документ.Организация 				  = Распоряжение.Организация;
		Документ.СкладОтправитель 			  = Распоряжение.СкладОрдер;
		Документ.СкладПолучатель 			  = СкладБрака;
		Документ.ОтражатьВБухгалтерскомУчете  = Истина;
		Документ.ОтражатьВУправленческомУчете = Истина;
		Документ.ВидОперации 				  = Перечисления.ВидыОперацийПеремещениеТоваров.ТоварыПродукция;
		
		Документ.Комментарий = "Создан на основании документа прихода EME: " +
			НомерЕМЕ + " (" + ИдЕМЕ + ")" + " (" + ERPData.header.comment + ")";
	Иначе
		Документ = ДокументСсылка.ПолучитьОбъект(); 
		Документ.Товары.Очистить();		
		Документ.Комментарий = "Изменен на основании документа прихода EME: " +
			НомерЕМЕ + " (" + ИдЕМЕ + ")" + " (" + ERPData.header.comment + ")";
	КонецЕсли;
		
	EmeWmsУтилиты.СкорректироватьТЧДокумента(Документ.Товары, КартаБрака, Истина);
	//EmeWmsУтилиты.ЗаполнитьСерииТоваровПоДокументуОснованию(Документ.Товары, Распоряжение);
	
	//	Валюта регламентированного учета
	мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();	
	
   	//	Карта заказов
	КартаЗаказов = Новый Соответствие;	
	Для Каждого СтрокаТовара из Распоряжение.Товары Цикл
		ТоварСсылка			= СтрокаТовара.Номенклатура;
		ТоварСерия 			= Неопределено;
		ТоварХарактеристика = Неопределено;
		
		РеквизитыТовара = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТоварСсылка, "ВестиУчетПоСериям, ВестиУчетПоХарактеристикам");
		Если РеквизитыТовара.ВестиУчетПоСериям Тогда
			ТоварСерия = СтрокаТовара.СерияНоменклатуры;
		ИначеЕсли РеквизитыТовара.ВестиУчетПоХарактеристикам Тогда
			ТоварХарактеристика = СтрокаТовара.ХарактеристикаНоменклатуры;
		КонецЕсли;                                          
		
		КлючТовара = EmeWmsУтилиты.СоздатьКлючТовара(СтрокаТовара.Номенклатура, ТоварСерия, ТоварХарактеристика);
		КартаЗаказов.Вставить(КлючТовара, СтрокаТовара.Заказ);
	КонецЦикла;	

	//	Пересчет реквизитов ТЧ товары
	Для Каждого СтрокаТовара Из Документ.Товары Цикл
		//	Пересчитываем только строки добавленные при Импорте
		Если ЗначениеЗаполнено(СтрокаТовара.Качество) Тогда
			Продолжить;
		КонецЕсли;
		
		//	Выполнить общие действия для всех документов при изменении номенклатуры.
		ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(СтрокаТовара, Документ);			
		
		УстановитьЦенуНоменклатуры(Документ, СтрокаТовара, мВалютаРегламентированногоУчета);

		СтрокаТовара.Качество = Справочники.Качество.Новый;
				
        //	Ключ товара
		ТоварСсылка			= СтрокаТовара.Номенклатура;
		ТоварСерия 			= Неопределено;
		ТоварХарактеристика = Неопределено;
		
		РеквизитыТовара = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТоварСсылка, "ВестиУчетПоСериям, ВестиУчетПоХарактеристикам");
		Если РеквизитыТовара.ВестиУчетПоСериям Тогда
			ТоварСерия = СтрокаТовара.СерияНоменклатуры;
		ИначеЕсли РеквизитыТовара.ВестиУчетПоХарактеристикам Тогда
			ТоварХарактеристика = СтрокаТовара.ХарактеристикаНоменклатуры;
		КонецЕсли;                                          
		
		КлючТовара = EmeWmsУтилиты.СоздатьКлючТовара(СтрокаТовара.Номенклатура, ТоварСерия, ТоварХарактеристика);
		
		//	Документ резерва
		Если ЗначениеЗаполнено(СтрокаТовара.ДокументРезерва) Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументРезерва = КартаЗаказов.Получить(КлючТовара);
		Если ЗначениеЗаполнено(ДокументРезерва) Тогда
			 СтрокаТовара.ДокументРезерва = ДокументРезерва;
		КонецЕсли;		

		Если Не ИспользоватьСерии Тогда
			КлючТовара = EmeWmsУтилиты.СоздатьКлючТовара(СтрокаТовара.Номенклатура, Неопределено, ТоварХарактеристика);
		КонецЕсли;

		//	Причины корректировки
		ПричиныКорректировки = КартаОснований.Получить(КлючТовара);
		Если ЗначениеЗаполнено(ПричиныКорректировки) Тогда
			КартаОснований.Удалить(КлючТовара);
			
			Если ТипЗнч(ПричиныКорректировки) = Тип("Структура") Тогда
				ЗаполнитьЗначенияСвойств(СтрокаТовара, ПричиныКорректировки); 
			КонецЕсли;
		Иначе			 
			 СтрокаТовара.Причина = ПредопределенноеЗначение("Перечисление.ПричиныКорректировки.Брак");
		КонецЕсли;

		Если Не ЗначениеЗаполнено(СтрокаТовара.КомментарийКПричине) Тогда
			СтрокаТовара.КомментарийКПричине = Строка(СтрокаТовара.Причина);
		КонецЕсли;
		
	КонецЦикла;

	ПересчитатьУпаковкиДокумента(Документ);

	Документ.Записать(РежимЗаписиДокумента.Запись);
	СоздатьОтметкуОбИмпортеПеремещенияТоваров(Документ, ИдРаспоряжение);
	EmeWmsПроведениеДокументов.ПометитьДокументКПроведению(Документ.Ссылка, 1);
	
	Возврат Документ.Ссылка;
	
КонецФункции

// Функция создает документ перемещения на склад недостач по карте товаров различий, возвращает ссылку на документ перемещения
Функция СоздатьИзменитьДокументПеремещенияНаСкладНедостач(ERPData, ИдЕМЕ, НомерЕМЕ, Распоряжение, КартаНедостач, СкладНедостач, КартаОснований)
	
	//	Использование серий в интеграции
	ИспользоватьСерии = Константы.EmeWmsИспользоватьСерии.Получить();	

	ИдРаспоряжение = "" + Распоряжение.Ссылка.УникальныйИдентификатор();
	ДокументСсылка = НайтиДокументПеремещенияТоваров(ИдРаспоряжение);
	Если ДокументСсылка.Пустая() Тогда 
		Если КартаНедостач.Количество() = 0 Тогда
			Возврат Документы.ПеремещениеТоваров.ПустаяСсылка();
		КонецЕсли;
		
		Документ = Документы.ПеремещениеТоваров.СоздатьДокумент();
		Документ.Заполнить(Распоряжение);
		Документ.ДокументОснование 			  = Распоряжение.Ссылка;
		Документ.Дата 						  = ТекущаяДата();
		Документ.Организация 				  = Распоряжение.Организация;
		Документ.СкладОтправитель 			  = Распоряжение.СкладОрдер;
		Документ.СкладПолучатель 			  = СкладНедостач;
		Документ.ОтражатьВБухгалтерскомУчете  = Истина;
		Документ.ОтражатьВУправленческомУчете = Истина;
		Документ.ВидОперации 				  = Перечисления.ВидыОперацийПеремещениеТоваров.ТоварыПродукция;
		
		Документ.Комментарий = "Создан на основании документа прихода EME: " +
			НомерЕМЕ + " (" + ИдЕМЕ + ")" + " (" + ERPData.header.comment + ")";
	Иначе
		Документ = ДокументСсылка.ПолучитьОбъект();
		Документ.Товары.Очистить();
		Документ.Комментарий = "Изменен на основании документа прихода EME: " +
			НомерЕМЕ + " (" + ИдЕМЕ + ")" + " (" + ERPData.header.comment + ")";
	КонецЕсли;
		
	EmeWmsУтилиты.СкорректироватьТЧДокумента(Документ.Товары, КартаНедостач, Истина);
	//EmeWmsУтилиты.ЗаполнитьСерииТоваровПоДокументуОснованию(Документ.Товары, Распоряжение);	

	//	Валюта регламентированного учета
	мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();	
	
   	//	Карта заказов
	КартаЗаказов = Новый Соответствие;	
	Для Каждого СтрокаТовара из Распоряжение.Товары Цикл
		ТоварСсылка			= СтрокаТовара.Номенклатура;
		ТоварСерия 			= Неопределено;
		ТоварХарактеристика = Неопределено;
		
		РеквизитыТовара = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТоварСсылка, "ВестиУчетПоСериям, ВестиУчетПоХарактеристикам");
		Если РеквизитыТовара.ВестиУчетПоСериям Тогда
			ТоварСерия = СтрокаТовара.СерияНоменклатуры;
		ИначеЕсли РеквизитыТовара.ВестиУчетПоХарактеристикам Тогда
			ТоварХарактеристика = СтрокаТовара.ХарактеристикаНоменклатуры;
		КонецЕсли;                                          
		
		КлючТовара = EmeWmsУтилиты.СоздатьКлючТовара(СтрокаТовара.Номенклатура, ТоварСерия, ТоварХарактеристика);
		КартаЗаказов.Вставить(КлючТовара, СтрокаТовара.Заказ);
	КонецЦикла;	
	
	//	Пересчет реквизитов ТЧ товары
	Для Каждого СтрокаТовара Из Документ.Товары Цикл
		//	Выполнить общие действия для всех документов при изменении номенклатуры.
		ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(СтрокаТовара, Документ);			
		
		УстановитьЦенуНоменклатуры(Документ, СтрокаТовара, мВалютаРегламентированногоУчета);

		СтрокаТовара.Качество = Справочники.Качество.Новый;
				
        //	Ключ товара
		ТоварСсылка			= СтрокаТовара.Номенклатура;
		ТоварСерия 			= Неопределено;
		ТоварХарактеристика = Неопределено;
		
		РеквизитыТовара = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТоварСсылка, "ВестиУчетПоСериям, ВестиУчетПоХарактеристикам");
		Если РеквизитыТовара.ВестиУчетПоСериям Тогда
			ТоварСерия = СтрокаТовара.СерияНоменклатуры;
		ИначеЕсли РеквизитыТовара.ВестиУчетПоХарактеристикам Тогда
			ТоварХарактеристика = СтрокаТовара.ХарактеристикаНоменклатуры;
		КонецЕсли;                                          
		
		КлючТовара = EmeWmsУтилиты.СоздатьКлючТовара(СтрокаТовара.Номенклатура, ТоварСерия, ТоварХарактеристика);

		//	Документ резерва
		Если ЗначениеЗаполнено(СтрокаТовара.ДокументРезерва) Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументРезерва = КартаЗаказов.Получить(КлючТовара);
		Если ЗначениеЗаполнено(ДокументРезерва) Тогда
			 СтрокаТовара.ДокументРезерва = ДокументРезерва;
		КонецЕсли;
		
		Если Не ИспользоватьСерии Тогда
			КлючТовара = EmeWmsУтилиты.СоздатьКлючТовара(СтрокаТовара.Номенклатура, Неопределено, ТоварХарактеристика);
		КонецЕсли;
		
		//	Причины корректировки
		ПричиныКорректировки = КартаОснований.Получить(КлючТовара);
		Если ЗначениеЗаполнено(ПричиныКорректировки) Тогда
			Если ТипЗнч(ПричиныКорректировки) = Тип("Структура") Тогда
				ЗаполнитьЗначенияСвойств(СтрокаТовара, ПричиныКорректировки); 
			КонецЕсли;
		Иначе
			СтрокаТовара.Причина = ПредопределенноеЗначение("Перечисление.ПричиныКорректировки.Недовоз");
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаТовара.КомментарийКПричине) Тогда
			СтрокаТовара.КомментарийКПричине = Строка(СтрокаТовара.Причина);
		КонецЕсли;	

	КонецЦикла;
		
	ПересчитатьУпаковкиДокумента(Документ);

	Документ.Записать(РежимЗаписиДокумента.Запись);
	СоздатьОтметкуОбИмпортеПеремещенияТоваров(Документ, ИдРаспоряжение);
	EmeWmsПроведениеДокументов.ПометитьДокументКПроведению(Документ.Ссылка, 2);
	
	Возврат Документ.Ссылка; 
	
КонецФункции

// Пересчитывает количества упаковок товара в ТЧ Товары
Процедура ПересчитатьУпаковкиДокумента(Документ)
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоУпаковок");
	Для Каждого СтрокаТовара Из Документ.Товары Цикл
		СтрокаТовара.Коэффициент = СтрокаТовара.ЕдиницаИзмерения.Коэффициент;
		ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТовара, Документ);
	КонецЦикла;
КонецПроцедуры    

// Производит заполнение и установку необходимых полей при изменении товара в табличной части.
// Вызывается из:
//  ТоварыНоменклатураПриИзменении()
//  ВнешнееСобытие()
//
Процедура УстановитьЦенуНоменклатуры(Перемещение, СтрокаТабличнойЧасти, мВалютаРегламентированногоУчета)

	Если Не (Перемещение.СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.НТТ
		     или Перемещение.СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.НТТ) Тогда
		СтрокаТабличнойЧасти.Цена = 0;
	ИначеЕсли (Не Перемещение.СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.НТТ) 
		    И (Перемещение.СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.НТТ) Тогда
		ВалютаДокумента    = мВалютаРегламентированногоУчета;
		КурсДокумента      = 1;
		КратностьДокумента = 1;

		// Тип цен устанавливает склад получатель.
		СтрокаТабличнойЧасти.Цена = Ценообразование.ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура, 
										СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры,
		                              	Перемещение.СкладПолучатель.ТипЦенРозничнойТорговли, Перемещение.Дата, 
										СтрокаТабличнойЧасти.ЕдиницаИзмерения,
		                              	ВалютаДокумента, КурсДокумента, КратностьДокумента);
	ИначеЕсли Перемещение.СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
		ВалютаДокумента    = мВалютаРегламентированногоУчета;
		КурсДокумента      = 1;
		КратностьДокумента = 1;

		СтрокаТабличнойЧасти.Цена = УправлениеРозничнойТорговлей.ПолучитьРозничнуюЦену(СтрокаТабличнойЧасти.Номенклатура,, 
															Перемещение.СкладОтправитель,
		                                                  	мВалютаРегламентированногоУчета, Перемещение.Дата,
		                                                  	СтрокаТабличнойЧасти.ЕдиницаИзмерения,
		                                                  	ВалютаДокумента, КурсДокумента, КратностьДокумента);
	КонецЕсли;

КонецПроцедуры

// Создает в регистре отметку об импорте документа Поступление товаров услуг с ID прихода в EME
Процедура СоздатьОтметкуОбИмпортеПоступленияТоваровУслуг(Документ, ИдEME)
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеПоступленийТоваровУслуг.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.ДатаИмпорта = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsОтметкиОбИмпортеПоступленийТоваровУслуг.СоздатьМенеджерЗаписи();
	НоваяЗапись.ID = ИдEME;
	НоваяЗапись.Ссылка = Документ.Ссылка;
	НоваяЗапись.ДатаИмпорта = ТекущаяДата();
    НоваяЗапись.Записать(); 
КонецПроцедуры

// Создает в регистре отметку об импорте Перемещения товаров с ID прихода EME
Процедура СоздатьОтметкуОбИмпортеПеремещенияТоваров(Документ, ИдЕМЕ)
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеПеремещенийТоваровКакОтгрузка.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.ДатаИмпорта = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsОтметкиОбИмпортеПеремещенийТоваровКакОтгрузка.СоздатьМенеджерЗаписи();
	НоваяЗапись.ID = ИдЕМЕ;
	НоваяЗапись.Ссылка = Документ.Ссылка;
	НоваяЗапись.ДатаИмпорта = ТекущаяДата();
    НоваяЗапись.Записать(); 
КонецПроцедуры

// Функция возвращает ссылку на документ Перемещение товаров по ИД EME
Функция НайтиДокументПеремещенияТоваров(ИдЕМЕ)
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Перемещение.Ссылка КАК Ссылка,
		|	Перемещение.Ссылка.ПометкаУдаления КАК ПометкаУдаления
		|ИЗ
		|	РегистрСведений.EmeWmsОтметкиОбИмпортеПеремещенийТоваровКакОтгрузка КАК Перемещение
		|ГДЕ
		|	Перемещение.ID = &ИдЕМЕ";
	Запрос.УстановитьПараметр("ИдЕМЕ", ИдЕМЕ);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Если Выборка.ПометкаУдаления Тогда
			ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ДокументОбъект.УстановитьПометкуУдаления(Ложь);
		КонецЕсли;
		
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Документы.ПеремещениеТоваров.ПустаяСсылка();

КонецФункции

#КонецОбласти
