
&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		Результат = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		Результат = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	
	НастроитьВидимостьКоманд();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурМаркировка_Товар_Изменен" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	Если Копирование Тогда
		
		МодульКлиента().ОткрытьФормуТовара(Элемент.ТекущаяСтрока, ЭтаФорма, Истина);
		
	Иначе
		
		МодульКлиента().ОткрытьФормуТовара(Неопределено, ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Параметры.РежимВыбора Тогда
		ОповеститьОВыборе(ВыбраннаяСтрока);
	Иначе
		МодульКлиента().ОткрытьФормуТовара(ВыбраннаяСтрока, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	МодульКлиента().ОткрытьФормуТовара(Элемент.ТекущаяСтрока, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьТовар(Команда)

	ТекСтрока = Элементы.Список.ТекущиеДанные;
	Если НЕ ТекСтрока = Неопределено Тогда
		ОповеститьОВыборе(ТекСтрока.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТовар(Команда)
	
	МодульКлиента().ОткрытьФормуДобавленияТовара(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТоварыВСО(Команда)
	
	ТоварМаркировки = Неопределено;
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		ТоварМаркировки = ТекущиеДанные.Ссылка;
	КонецЕсли;
	
	Попытка
		ОбщийМодульВСО = МодульКлиента().ОбщийМодуль("ВзаимодействиеКонтурМаркировкаВСОКлиент");
	Исключение
		МодульКлиента().СообщитьПользователюЛок(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	ОбщийМодульВСО.ОткрытьФормуСпискаТоваров(ТоварМаркировки, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьКоманд()
	
	Элементы.Кнопка_Выбрать.Видимость = Параметры.РежимВыбора;
	
	ЕстьПодсистемаВСО = МодульОбъекта().ЕстьПодсистемаВСО();
	
	Элементы.Гиперссылка_ОткрытьТоварыВСО.Видимость = ЕстьПодсистемаВСО;
	
	ДоступенПереносИзРегистраПлагинаОСУ = МодульОбъекта().ДоступенПереносИзРегистраПлагинаОСУ();
	Элементы.Кнопка_ЗагрузитьПоДаннымДиадок.Видимость = ДоступенПереносИзРегистраПлагинаОСУ;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	МодульКлиента().ОткрытьФормуОбработки("Форма_ЗагрузкаТоваров", ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзНоменклатуры1С(Команда)
	
	Если Не МодульКлиента().ПроверитьУстановленнуюВерсиюМодуля() Тогда
		Возврат;
	КонецЕсли;
	
	МодульКлиента().ЗагрузитьТоварыИзНоменклатуры1С(УникальныйИдентификатор);
	ПровестиОпросПользователя();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПоДаннымДиадок(Команда)
	
	Если Не МодульКлиента().ПроверитьУстановленнуюВерсиюМодуля() Тогда
		Возврат;
	КонецЕсли;
	
	МодульКлиента().ЗагрузитьТоварыПоДаннымДиадок(УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИзНациональногоКаталога(Команда)
	
	Если Не МодульКлиента().ПроверитьУстановленнуюВерсиюМодуля() Тогда
		Возврат;
	КонецЕсли;
	
	МассивGTIN = МодульКлиента().Товары_ВсеGTIN();
	МодульКлиента().ОбновитьТоварыИзНациональногоКаталога(МассивGTIN, УникальныйИдентификатор);
	ПровестиОпросПользователя();
	
КонецПроцедуры

&НаСервере
Функция КонтекстОтчетаПоВиртуальномуСкладу()
	
	Результат = МодульОбъекта().Новый_ОтчетПоВиртуальномуСкладу_Контекст();
	
	Результат.ФормаИнициатор = "Форма_Товары_Список";
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Для Каждого Строка Из ВыделенныеСтроки Цикл
		Результат.СписокТоваров.Добавить(Строка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьОтчетПоВиртуальномуСкладу(Команда)
	
	Контекст = КонтекстОтчетаПоВиртуальномуСкладу();
	МодульКлиента().ОткрытьФормуОтчетаПоВиртуальномуСкладу(ЭтаФорма, Контекст);
	
КонецПроцедуры

// Опросы пользователей

&НаКлиенте
Процедура ПровестиОпросПользователя()
	
	КлючиСценариев = МодульКлиента().Перечисление_КлючиСценариевДляОпросов();
	ОписаниеОпроса = МодульКлиента().ОпросПользователяПоСценарию(КлючиСценариев.Товары);
	
	Если Не ЗначениеЗаполнено(ОписаниеОпроса)
		Или Не ОпросПодходитПоВидамПродукции(ОписаниеОпроса) Тогда
		Возврат;
	КонецЕсли;
	
	МодульКлиента().ОткрытьФормуОпросаПользователя(ОписаниеОпроса, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Функция ОпросПодходитПоВидамПродукции(ОписаниеОпроса)
	
	ВидыПродукцииТоваров = МодульКлиента().Товары_ВсеВидыПродукции();
	Для каждого ВидПродукции Из ВидыПродукцииТоваров Цикл
		Если Не ЗначениеЗаполнено(ВидПродукции) Тогда
			Продолжить;
		КонецЕсли;
		Если МодульКлиента().ОпросПодходитПоВидуПродукции(ОписаниеОпроса, ВидПродукции) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

