
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("ТипФайла");
	Поля.Добавить("ИмяФайла");
	Поля.Добавить("Идентификатор");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Данные.ИмяФайла) Тогда
		Представление = Данные.ИмяФайла;
	ИначеЕсли ЗначениеЗаполнено(Данные.Идентификатор) Тогда
		Представление = Данные.ТипФайла + " (" + Данные.Идентификатор + ")";
	Иначе
		Представление = Данные.ТипФайла;
	КонецЕсли;
	
КонецПроцедуры
