// #Область ОписаниеПеременных

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		Результат = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		Результат = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

// #КонецОбласти

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастроитьДоступностьФормы();
	
	УстановитьЗаголовкиГиперссылок();
	ЗаполнитьИнформациюОМодуле();
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПослеВыбораКоманды(Результат, ДопПараметры = Неопределено) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Значение = "ОткрытьРедакторДокументаУчета" Тогда
		ОткрытьРедакторДокументаУчета();
	ИначеЕсли Результат.Значение = "ОткрытьРедакторКодаМаркировки" Тогда
		ОткрытьРедакторКодаМаркировки();
	ИначеЕсли Результат.Значение = "ПроверитьДублиСвязейКодов" Тогда
		ПроверитьДублиСвязейКодов();
	ИначеЕсли Результат.Значение = "ПросмотретьТаблицуКодовОтчетаВСО" Тогда
		ПросмотретьТаблицуКодовОтчетаВСО();
	ИначеЕсли Результат.Значение = "ОткрытьРедакторОперации" Тогда
		ОткрытьРедакторОперации();
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Коды маркировки

&НаКлиенте
Процедура ОткрытьПодменюКодовМаркировки(Команда)
	
	СписокКоманд = СписокКомандКодыМаркировки();
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПослеВыбораКоманды", ЭтаФорма);
	МодульКлиента().ПоказатьДиалогВыбораИзМеню(ЭтаФорма, ОписаниеОбработчика
	, СписокКоманд
	, Элементы["Кнопка_ПодменюКодыМаркировки"]);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРедакторКодаМаркировки()
	
	МодульКлиента().ОткрытьФормуРедактораКодаМаркировки();
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьДублиСвязейКодов()
	
	АдресХранилища = ДублиСвязейКодов();
	
	Если ЗначениеЗаполнено(АдресХранилища) Тогда
		
		ТекстВопроса = НСтр("ru='Удалить дубли связей кодов?'");
		
		КнопкиОтвета = Новый СписокЗначений;
		КнопкиОтвета.Добавить("Удалить", "Удалить дубли");
		КнопкиОтвета.Добавить("Открыть", "Открыть таблицу дублей");
		
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПослеВыбораДействияДублейСвязей"
		, ЭтаФорма
		, Новый Структура("АдресХранилища", АдресХранилища));
		
		МодульКлиента().ПоказатьДиалогВопроса(ОписаниеОбработчика, ТекстВопроса, КнопкиОтвета);
		
	Иначе
		МодульКлиента().СообщитьПользователюЛок(НСтр("ru='Дубли не найдены'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораДействияДублейСвязей(Ответ, ДопПараметры = Неопределено) Экспорт
	
	Если Ответ = "Удалить" Тогда
		УдалитьДублиСвязейКодовНаСервере(ДопПараметры.АдресХранилища);
	ИначеЕсли Ответ = "Открыть" Тогда
		МодульКлиента().ОткрытьФормуПросмотраТаблицы(ЭтаФорма, ДопПараметры.АдресХранилища);
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Документы учета

&НаКлиенте
Процедура ОткрытьПодменюДокументовУчета(Команда)
	
	СписокКоманд = СписокКомандДокументыУчета();
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПослеВыбораКоманды", ЭтаФорма);
	МодульКлиента().ПоказатьДиалогВыбораИзМеню(ЭтаФорма, ОписаниеОбработчика
	, СписокКоманд
	, Элементы["Кнопка_ПодменюДокументУчета"]);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРедакторДокументаУчета()
	
	МодульКлиента().ОткрытьФормуРедактораДокументаУчета();
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

// Операции

&НаКлиенте
Процедура ОткрытьПодменюОперации(Команда)
	
	СписокКоманд = СписокКомандОперации();
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПослеВыбораКоманды", ЭтаФорма);
	МодульКлиента().ПоказатьДиалогВыбораИзМеню(ЭтаФорма, ОписаниеОбработчика
	, СписокКоманд
	, Элементы["Кнопка_ПодменюОперации"]);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРедакторОперации()
	
	МодульКлиента().ОткрытьФормуРедактораОперации();
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

// ВСО

&НаКлиенте
Процедура ОткрытьПодменюВСО(Команда)
	
	СписокКоманд = СписокКомандВСО();
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПослеВыбораКоманды", ЭтаФорма);
	МодульКлиента().ПоказатьДиалогВыбораИзМеню(ЭтаФорма, ОписаниеОбработчика
	, СписокКоманд
	, Элементы["Кнопка_ПодменюВСО"]);
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотретьТаблицуКодовОтчетаВСО()
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПослеВыбораОтчетаСОборудования", ЭтаФорма);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
	
	ОписаниеОбъектаДляВыбора = ОписаниеОбъектаДляВыбора(Тип("ДокументСсылка.КонтурМаркировкаВСО_ОтчетСОборудования"));
	ОписаниеОбъектаДляВыбора.ПараметрыФормы = ПараметрыФормы;
	
	МодульКлиента().ОткрытьФормуВыбораОбъектаИС(ОписаниеОбъектаДляВыбора, ЭтаФорма, ОписаниеОбработчика);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораОтчетаСОборудования(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АдресТаблицы = ПоместитьКодыОтчетаВСОВХранилище(Результат);
	
	МодульКлиента().ОткрытьФормуПросмотраТаблицы(ЭтаФорма, АдресТаблицы, Истина);
	
КонецПроцедуры

// Прочее

&НаКлиенте
Процедура ВыполнитьРегламентныеДействия(Команда)
	
	ВзаимодействиеКонтурМаркировка.ВыполнитьРегламентныеДействия(Новый Структура());
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокОтложенныхФункцийНажатие(Элемент)
	
	СписокОтложенныхФункций = СписокОтложенныхФункций();
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
	"ПослеИзмененияСпискаОтложенныхФункций"
	, ЭтаФорма
	, СписокОтложенныхФункций.ВерсияСписка);
	
	МодульКлиента().ОткрытьФормуПросмотраСтруктуры(ЭтаФорма
	, СписокОтложенныхФункций.ДатыВключения
	, Элемент.Заголовок
	, Истина
	, ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеИзмененияСпискаОтложенныхФункций(Результат, ВерсияСписка = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокФункций = МодульКлиента().Новый_СписокОтложенныхФункций();
	СписокФункций.ВерсияСписка = ВерсияСписка;
	СписокФункций.ДатыВключения = Результат;
	
	МодульКлиента().СписокОтложенныхФункций_Записать(СписокФункций);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВременныхФункцийНажатие(Элемент)
	
	СписокВременныхФункций = СписокВременныхФункций();
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
	"ПослеИзмененияСпискаВременныхФункций"
	, ЭтаФорма
	, СписокВременныхФункций.ВерсияСписка);
	
	МодульКлиента().ОткрытьФормуПросмотраСтруктуры(ЭтаФорма
	, СписокВременныхФункций.ДатыОтключения
	, Элемент.Заголовок
	, Истина
	, ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеИзмененияСпискаВременныхФункций(Результат, ВерсияСписка = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокФункций = МодульКлиента().Новый_СписокВременныхФункций();
	СписокФункций.ВерсияСписка = ВерсияСписка;
	СписокФункций.ДатыОтключения = Результат;
	
	МодульКлиента().СписокВременныхФункций_Записать(СписокФункций);
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция СписокКомандКодыМаркировки()
	
	Результат = Новый СписокЗначений;
	
	Результат.Добавить("ОткрытьРедакторКодаМаркировки"
	, "Редактор кода маркировки"
	, , БиблиотекаКартинок.КонтурМаркировка_Датаматрикс);
	
	Результат.Добавить("ПроверитьДублиСвязейКодов"
	, "Проверить дубли связей кодов"
	, , БиблиотекаКартинок.КонтурМаркировка_КолокольчикКрасный);
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция СписокКомандДокументыУчета()
	
	Результат = Новый СписокЗначений;
	
	Результат.Добавить("ОткрытьРедакторДокументаУчета"
	, "Редактор документа учета"
	, , БиблиотекаКартинок.КонтурМаркировка_СвязанныеДокументы);
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция СписокКомандОперации()
	
	Результат = Новый СписокЗначений;
	
	Результат.Добавить("ОткрытьРедакторОперации"
	, "Редактор операции"
	, , БиблиотекаКартинок.КонтурМаркировка_СвязанныеДокументы);
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция СписокКомандВСО()
	
	Результат = Новый СписокЗначений;
	
	Результат.Добавить("ПросмотретьТаблицуКодовОтчетаВСО"
	, "Таблица кодов отчета"
	, , БиблиотекаКартинок.Документ);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ОписаниеОбъектаДляВыбора(ТипОбъекта)
	
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипОбъекта);
	
	Результат = МодульОбъекта().НовоеОписаниеВидаДокументаДляВыбора();
	
	Если ОбъектМетаданных <> Неопределено Тогда
		Результат.Представление = ОбъектМетаданных.Синоним;
		Результат.ПолноеИмяОбъекта = ОбъектМетаданных.ПолноеИмя();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура НастроитьДоступностьФормы()
	
	Элементы.Кнопка_ПодменюВСО.Доступность = МодульОбъекта().ЕстьПодсистемаВСО();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовкиГиперссылок()
	
	СписокВременныхФункций = СписокВременныхФункций();
	ВерсияВременныхФункций = СписокВременныхФункций.ВерсияСписка;
	
	ШаблонЗаголовка = НСтр("ru='Список временных функций (вер.%1)'");
	Элементы.СписокВременныхФункций.Заголовок = МодульОбъекта().ПараметрыВСтроку(ШаблонЗаголовка, ВерсияВременныхФункций);
	
	СписокОтложенныхФункций = СписокОтложенныхФункций();
	ВерсияОтложенныхФункций = СписокОтложенныхФункций.ВерсияСписка;
	
	ШаблонЗаголовка = НСтр("ru='Список отложенных функций (вер.%1)'");
	Элементы.СписокОтложенныхФункций.Заголовок = МодульОбъекта().ПараметрыВСтроку(ШаблонЗаголовка, ВерсияВременныхФункций);
	
КонецПроцедуры

&НаСервере
Функция СписокОтложенныхФункций()
	
	Возврат МодульОбъекта().СписокОтложенныхФункций();
	
КонецФункции

&НаСервере
Функция СписокВременныхФункций()
	
	Возврат МодульОбъекта().СписокВременныхФункций();
	
КонецФункции

&НаСервере
Процедура ЗаполнитьИнформациюОМодуле()
	
	ДанныеДляТехподдержки = МодульОбъекта().ИнформацияДляТехПоддержки();
	
	ИнформацияОМодуле 		= ДанныеДляТехподдержки.ИнформацияОМодуле;
	ИнформацияОНастройках 	= ДанныеДляТехподдержки.ИнформацияОНастройкахМодуля;
	
	ВерсияМодуля 		= ИнформацияОМодуле.ВерсияМодуля;
	ПодключаемыеМодуль 	= ИнформацияОНастройках.ПодключаемыйМодуль;
	ИспользуетсяРИБ 	= Формат(ЗначениеЗаполнено(ПланыОбмена.ГлавныйУзел()), "БЛ='Не используется (либо центральный узел)'; БИ=Используется");
	
	Если ПодключаемыеМодуль = "Подключен" Тогда
		ПодключаемыеМодуль = МодульОбъекта().ПМ_ВерсияОбработки();
	КонецЕсли;
	
	ШаблонИнформацииОМодуле = НСтр("ru='Версия модуля: %1
	|Подключаемые модуль: %2
	|РИБ: %3'");
	
	ТекстИнформацияОМодуле = МодульОбъекта().ПараметрыВСтроку(ШаблонИнформацииОМодуле, ВерсияМодуля, ПодключаемыеМодуль, ИспользуетсяРИБ);
	
КонецПроцедуры

&НаСервере
Функция ДублиСвязейКодов()
	
	Результат = Неопределено;
	ТаблицаДублей = Новый ТаблицаЗначений;
	
	СхемаКомпоновкиДанных = МодульОбъекта().МакетОбработки("МакетСКДОтчетаОДублированииСвязейКодов");
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	
	// Из схемы возьмем настройки по умолчанию
	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Макет = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных
	, КомпоновщикНастроек.ПолучитьНастройки()
	,,
	, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(Макет);
	
	// Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаДублей);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Если ЗначениеЗаполнено(ТаблицаДублей) Тогда
		Результат = ПоместитьВоВременноеХранилище(ТаблицаДублей, ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура УдалитьДублиСвязейКодовНаСервере(АдресХранилища)
	
	ТаблицаДублей = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	МодульОбъекта().ПоместитьТаблицуВЗапрос(МенеджерВТ, ТаблицаДублей, "ТаблицаДублей", "КлючКода");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СвязиКлючейКодов.КлючКода КАК КлючКода,
	|	СвязиКлючейКодов.ПорцияЗаписей КАК ПорцияЗаписей
	|ИЗ
	|	ТаблицаДублей КАК ТаблицаДублей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_СвязиКлючейКодов КАК СвязиКлючейКодов
	|		ПО ТаблицаДублей.КлючКода = СвязиКлючейКодов.КлючКода
	|			И ТаблицаДублей.ПорцияЗаписей = СвязиКлючейКодов.ПорцияЗаписей
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорцияЗаписей
	|ИТОГИ ПО
	|	ПорцияЗаписей");
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	РезультатЗапроса = Запрос.Выполнить();
	
	МенеджерВТ.Закрыть();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	МодульОбщегоНазначения = МодульОбъекта().МодульОбщегоНазначения();
	НачатьТранзакцию(МодульОбъекта().РежимУправленияБлокировкой());
	
	Попытка
		
		СвязиКлючейКодов_ЗаблокироватьПоТаблице(РезультатЗапроса);
		
		ВыборкаПорция = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПорция.Следующий() Цикл
			
			ПорцияЗаписей = ВыборкаПорция.ПорцияЗаписей;
			Если Не ЗначениеЗаполнено(ПорцияЗаписей) Тогда
				ПорцияЗаписей = МодульОбщегоНазначения.НовыйУникальныйИдентификаторПервойВерсии();
			КонецЕсли;
			
			Набор = РегистрыСведений.КонтурМаркировка_СвязиКлючейКодов.СоздатьНаборЗаписей();
			Набор.Отбор.ПорцияЗаписей.Установить(ПорцияЗаписей);
			Набор.Прочитать();
			
			ТаблицаНабора = Набор.Выгрузить();
			ТаблицаНабора.Индексы.Добавить("КлючКода");
			
			Выборка = ВыборкаПорция.Выбрать();
			Пока Выборка.Следующий() Цикл
				СтрНабора = ТаблицаНабора.Найти(Выборка.КлючКода, "КлючКода");
				Если СтрНабора <> Неопределено Тогда
					ТаблицаНабора.Удалить(СтрНабора);
				КонецЕсли;
			КонецЦикла;
			
			Если ТаблицаНабора.Количество() < Набор.Количество() Тогда
				Набор.Загрузить(ТаблицаНабора);
				Набор.Записать();
			КонецЕсли;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		Ошибка = ИнформацияОбОшибке();
		ВызватьИсключение Ошибка;
		
	КонецПопытки;
	
	УдалитьИзВременногоХранилища(АдресХранилища);
	МодульОбъекта().СообщитьПользователюЛок(НСтр("ru='Дубли связей удалены'"));
	
КонецПроцедуры

&НаСервере
Процедура СвязиКлючейКодов_ЗаблокироватьПоТаблице(Таблица, ИмяКолонки = "ПорцияЗаписей")
	
	Поле = "ПорцияЗаписей";
	ИмяОбъекта = "РегистрСведений.КонтурМаркировка_СвязиКлючейКодов";
	МодульОбъекта().ЗаблокироватьПоТаблице(ИмяОбъекта, Поле, Таблица, ИмяКолонки);
	
КонецПроцедуры

&НаСервере
Функция ПоместитьКодыОтчетаВСОВХранилище(ОтчетСОборудования)
	
	ДанныеДляХранилища = Документы.КонтурМаркировкаВСО_ОтчетСОборудования.ПрочитатьДанныеИзХранилища(ОтчетСОборудования.ДанныеОтчета);
	
	Возврат ПоместитьВоВременноеХранилище(ДанныеДляХранилища, ЭтаФорма.УникальныйИдентификатор);
	
КонецФункции

// #КонецОбласти