// Copyright (C) 2012-2025 Engineer Mareev Enterprises
// Модуль для УТ 10.3

// Экспортирует REMAINS на дату по складам из регистра сведений EmeWmsМаппингСкладов

//	$Сверка остатков товаров
//	Экспорт сообщений REMAINS:
//	Оператор 1C (руч.) выгружает остатки в сообщении REMAINS. Остатки выгружаются по складам, для которых задан код соответствия EME.WMS в регистре сведений EmeWmsМаппингСкладов.
//	EME.WMS (руч.) загружает текущие остатки 1С в виртуальную ячейку 888.
//	EME.WMS (руч.) выгружает остатки EME.WMS в сообщении REMAINS.
//	EME.WMS (руч.) в модуле сверки проверят текущие остатки 1С и EME.WMS.

#Область ПрограммныйИнтерфейс  

//	Функция ПолучитьИмяСообщения возвращает имя сообщения
Функция ПолучитьИмяСообщения() Экспорт
	Возврат "remains";
КонецФункции

// Процедура ЭкспортироватьВсеОстатки экспортирует остатки товаров и движения регистра
Процедура ЭкспортироватьВсеОстатки(ERPData, ДатаВыгрузки)
			
	Запрос			= Новый Запрос;
	Запрос.Текст	= "
		  |ВЫБРАТЬ РАЗЛИЧНЫЕ
		  |	Склады.Ссылка КАК Склад,
		  | EmeWmsМаппингСкладов.КодСкладаEME КАК СкладEME,
		  | ВЫБОР 
		  |		КОГДА EmeWmsМаппингСкладов.ИспользоватьЗоны ТОГДА EmeWmsМаппингСкладов.КодЗоны
		  |		ИНАЧЕ НЕОПРЕДЕЛЕНО
		  |	КОНЕЦ КАК ЗонаEME,
		  | EmeWmsМаппингСкладов.СтоковыйСтатус КАК СтоковыйСтатус,
		  |	EmeWmsМаппингСкладов.КодОрганизации КАК КодОрганизацииEME
		  |ПОМЕСТИТЬ ВТ_Склады
		  |ИЗ
		  |	Справочник.Склады КАК Склады
		  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.EmeWmsМаппингСкладов КАК EmeWmsМаппингСкладов
		  |		ПО (EmeWmsМаппингСкладов.Сторона1С И EmeWmsМаппингСкладов.КодСкладаEME > """" И Склады.Ссылка = EmeWmsМаппингСкладов.Склад)
		  |ГДЕ
		  |	НЕ Склады.ПометкаУдаления
		  //|  И Склады.Наименование = ""С №2""
		  |;
		  |
		  |////////////////////////////////////////////////////////////////////////////////
		  |ВЫБРАТЬ РАЗЛИЧНЫЕ
		  |	ВТ_Склады.СкладEME КАК СкладEME,
		  |	ВТ_Склады.ЗонаEME КАК ЗонаEME
		  |ИЗ
	 	  |	ВТ_Склады КАК ВТ_Склады
		  |УПОРЯДОЧИТЬ ПО
		  | СкладEME,
		  |	ЗонаEME		   
		  |;
	      |
		  |////////////////////////////////////////////////////////////////////////////////
		  |ВЫБРАТЬ
		  |	Остатки.Склад КАК Склад,
		  |	Остатки.Номенклатура КАК Номенклатура,
		  |	Остатки.СерияНоменклатуры КАК Серия,
		  |	СУММА(Остатки.КоличествоОстаток) КАК ВНаличии
		  |ПОМЕСТИТЬ ВТ_Остатки
		  |ИЗ
		  |	РегистрНакопления.ТоварыНаСкладах.Остатки(
		  |			&КонецПериода,
		  |			Склад В
		  |				(ВЫБРАТЬ
		  |					вт_Склады.Склад
		  |				ИЗ
		  |					вт_Склады)) КАК Остатки
		  |ГДЕ 
       	  |	НЕ Остатки.Номенклатура.Услуга
		  |	И НЕ Остатки.Номенклатура.ПометкаУдаления
		  |
		  |СГРУППИРОВАТЬ ПО
		  |	Остатки.Склад,
		  |	Остатки.Номенклатура,
		  |	Остатки.СерияНоменклатуры 
		  |ИМЕЮЩИЕ
		  |	СУММА(Остатки.КоличествоОстаток) > 0
		  |;
		  |
		  |////////////////////////////////////////////////////////////////////////////////
		  |ВЫБРАТЬ
		  |	Склады.СкладEME КАК СкладEME,
		  | Склады.ЗонаEME КАК ЗонаEME, 
		  | Склады.СтоковыйСтатус КАК СтоковыйСтатус,		  
		  |	Склады.КодОрганизацииEME КАК КодОрганизацииEME,
		  |	ВТ_Остатки.Номенклатура КАК Номенклатура,
		  |	ВТ_Остатки.Номенклатура.Код КАК НоменклатураКод,
		  |	ВТ_Остатки.Номенклатура.ЕдиницаХраненияОстатков КАК НоменклатураЕдиницаИзмерения,
		  |	ВТ_Остатки.Номенклатура.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору.Код КАК НоменклатураЕдиницаИзмеренияКод,
		  |	ВТ_Остатки.Серия КАК Серия,
		  |	ВТ_Остатки.ВНаличии КАК ВНаличии,
		  |	ВТ_Остатки.Номенклатура.ВестиУчетПоСериям КАК ИспользоватьСерии,
		  | ЕСТЬNULL(СправочникСерииНоменклатуры.Наименование, """") КАК СерияНаименование,
		  | ЕСТЬNULL(СправочникСерииНоменклатуры.СрокГодности, ДАТАВРЕМЯ(1, 1, 1)) КАК СерияГоденДо,
		  | ДАТАВРЕМЯ(1, 1, 1) КАК СерияДатаПроизводства
		  |ИЗ
		  |	ВТ_Остатки КАК ВТ_Остатки  
		  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Склады КАК Склады
		  |     	ПО (ВТ_Остатки.Склад = Склады.Склад)
		  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
		  |     	ПО (СправочникНоменклатура.Ссылка = ВТ_Остатки.Номенклатура)		  		
		  |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК СправочникВидыНоменклатуры
		  |     ПО СправочникВидыНоменклатуры.Ссылка = СправочникНоменклатура.ВидНоменклатуры		  
		  |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СправочникСерииНоменклатуры
		  |     ПО СправочникСерииНоменклатуры.Ссылка = ВТ_Остатки.Серия
		  |;
		  |
		  |////////////////////////////////////////////////////////////////////////////////
		  |ВЫБРАТЬ
		  |	Обороты.Склад КАК Склад,
		  |	Обороты.Регистратор КАК Регистратор,
		  |	Обороты.Номенклатура КАК Номенклатура,
		  |	Обороты.СерияНоменклатуры КАК Серия,
		  |	СУММА(Обороты.КоличествоПриход) КАК ПриходТовара,
		  |	СУММА(Обороты.КоличествоРасход) КАК РасходТовара
		  |ПОМЕСТИТЬ ВТ_Обороты
		  |ИЗ
		  |	РегистрНакопления.ТоварыНаСкладах.Обороты(
		  |			&НачалоПериода,
		  |			&КонецПериода,
		  |			Регистратор,
		  |			Склад В
		  |				(ВЫБРАТЬ
		  |					вт_Склады.Склад
		  |				ИЗ
		  |					вт_Склады)
		  |			И Номенклатура В 
		  |				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		  |					ВТ_Остатки.Номенклатура
		  |			ИЗ
		  |					ВТ_Остатки)) КАК Обороты
		  |ГДЕ
       	  |	НЕ Обороты.Номенклатура.Услуга
		  |	И НЕ Обороты.Номенклатура.ПометкаУдаления
		  |
		  |СГРУППИРОВАТЬ ПО
		  |	Обороты.Склад,
		  |	Обороты.Регистратор,
		  |	Обороты.Номенклатура,
		  |	Обороты.СерияНоменклатуры
		  |;
		  |
		  |////////////////////////////////////////////////////////////////////////////////
		  |УНИЧТОЖИТЬ ВТ_Остатки
		  |;
		  |
		  |////////////////////////////////////////////////////////////////////////////////
		  |ВЫБРАТЬ
		  |	Склады.СкладEME КАК СкладEME,
		  | Склады.ЗонаEME КАК ЗонаEME,     
		  | Склады.СтоковыйСтатус КАК СтоковыйСтатус,		  
		  |	Склады.КодОрганизацииEME КАК КодОрганизацииEME,
		  |	ВТ_Обороты.Регистратор КАК Регистратор,
		  |	ВТ_Обороты.Регистратор.Дата КАК РегистраторДата,
		  |	ВТ_Обороты.Регистратор.Номер КАК РегистраторНомер,
		  |	ВТ_Обороты.Номенклатура КАК Номенклатура,
		  |	ВТ_Обороты.Номенклатура.Код КАК НоменклатураКод,
		  |	ВТ_Обороты.Номенклатура.ЕдиницаХраненияОстатков КАК НоменклатураЕдиницаИзмерения,
		  |	ВТ_Обороты.Номенклатура.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору.Код КАК НоменклатураЕдиницаИзмеренияКод,
		  |	ВТ_Обороты.Серия КАК Серия,
		  |	ВТ_Обороты.ПриходТовара КАК ПриходТовара,
		  |	ВТ_Обороты.РасходТовара КАК РасходТовара,
		  |	ВТ_Обороты.Номенклатура.ВестиУчетПоСериям КАК ИспользоватьСерии,
		  | ЕСТЬNULL(СправочникСерииНоменклатуры.Наименование, """") КАК СерияНаименование,
		  | ЕСТЬNULL(СправочникСерииНоменклатуры.СрокГодности, ДАТАВРЕМЯ(1, 1, 1)) КАК СерияГоденДо,
		  | ДАТАВРЕМЯ(1, 1, 1) КАК СерияДатаПроизводства
		  |ИЗ
		  |	ВТ_Обороты КАК ВТ_Обороты
		  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Склады КАК Склады
		  |     	ПО (ВТ_Обороты.Склад = Склады.Склад)
		  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
		  |     	ПО (СправочникНоменклатура.Ссылка = ВТ_Обороты.Номенклатура)		  		
		  |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК СправочникВидыНоменклатуры
		  |     ПО СправочникВидыНоменклатуры.Ссылка = СправочникНоменклатура.ВидНоменклатуры		  
		  |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СправочникСерииНоменклатуры
		  |     ПО СправочникСерииНоменклатуры.Ссылка = ВТ_Обороты.Серия
		  |;
		  |
		  |////////////////////////////////////////////////////////////////////////////////
		  |УНИЧТОЖИТЬ ВТ_Склады
		  |;
		  |
		  |////////////////////////////////////////////////////////////////////////////////
		  |УНИЧТОЖИТЬ ВТ_Обороты";
	
	НачалоПериода =	НачалоДня(ДатаВыгрузки);
	КонецПериода =	КонецДня(ДатаВыгрузки);
	Запрос.УстановитьПараметр("НачалоПериода",	НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",	КонецПериода);
	
	РезультатЗапроса	= Запрос.ВыполнитьПакет();
	ТаблицаСкладов		= РезультатЗапроса[1].Выгрузить();
	ТаблицаОстатков		= РезультатЗапроса[3].Выгрузить();
	ТаблицаДвижений		= РезультатЗапроса[6].Выгрузить();
	
	СозданЗаголовок = Ложь;
	
	//	Использование серий в интеграции
	ИспользоватьСерии = Константы.EmeWmsИспользоватьСерии.Получить();	

	//	#AMP Попов 10.12.2024 Вне зависимости от режима экспорта уникальных сообщений старые REMAINS удаляем всегда
	ERPData.IsSkipDeleteOldMessages = Ложь;

	EmeWmsERPEngine.BeginExport(ERPData, "erp", "wms", "remains");
	Попытка
		ИдСклада 		= 1;
		ИдОстатков		= 1;
		ИдДвижений		= 1;  
		КодСкладаНачальный = Неопределено;
		Для каждого СтрокаСкладов из ТаблицаСкладов Цикл
			КодСклада = СтрокаСкладов.СкладEME;
			КодЗоны = СтрокаСкладов.ЗонаEME;           
			
			Если КодСкладаНачальный <> КодСклада Тогда  
				Если СозданЗаголовок Тогда
					ERPData.header.total_operations = ИдДвижений - 1;			
					ERPData.header.total_registers = ИдОстатков - 1;
					ИдОстатков		= 1;
					ИдДвижений		= 1;  
				КонецЕсли;
				EmeWmsERPEngine.AppendHeaderLine(ERPData);
				ERPData.header.id =			СокрЛП(КодСклада) + "." + Формат(ДатаВыгрузки, "ДФ=гггг-ММ-дд");
				ERPData.header.whs_code =	СокрЛП(КодСклада);
				ERPData.header.formed_at =	Формат(КонецПериода, "ДФ=ггггММддЧЧммсс");
				СозданЗаголовок = Истина;
				КодСкладаНачальный = КодСклада;
			КонецЕсли; 
			
			//	Таблица остатков
			EmeWmsERPEngine.SelectChild(ERPData, "registers");
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("СкладEME", СтрокаСкладов.СкладEME);
			ПараметрыОтбора.Вставить("ЗонаEME", СтрокаСкладов.ЗонаEME);
			СтрокиОстатков	= ТаблицаОстатков.НайтиСтроки(ПараметрыОтбора);
			Для каждого СтрокаОстатков Из СтрокиОстатков Цикл
				EmeWmsERPEngine.AppendChildLine(ERPData); 
				
				ERPData.registers.id 			= СтрЗаменить(Строка(ИдОстатков), Символы.НПП, "");
				ERPData.registers.goods_id		= СтрокаОстатков.Номенклатура.УникальныйИдентификатор();
				ERPData.registers.goods_code	= СокрЛП(СтрокаОстатков.НоменклатураКод);
				ERPData.registers.remains_qty	= СтрЗаменить(Строка(СтрокаОстатков.ВНаличии), Символы.НПП, "");
				ERPData.registers.mu_code 		= ПолучитьКодОсновнойЕдиницы(СтрокаОстатков);
				ERPData.registers.pack_id 		= СтрокаОстатков.НоменклатураЕдиницаИзмерения.УникальныйИдентификатор();
				ERPData.registers.pack_code		= СокрЛП(СтрокаОстатков.НоменклатураЕдиницаИзмеренияКод);
				ERPData.registers.zone_code		= КодЗоны;  
				ERPData.registers.stock_status	= СтрокаОстатков.СтоковыйСтатус;				
				ERPData.registers.vendor_code	= СтрокаОстатков.КодОрганизацииEME;
				
				// Остатки по сериям могут быть, но серии по факту уже не используются
				Если СтрокаОстатков.ИспользоватьСерии И ИспользоватьСерии Тогда
					Если ЗначениеЗаполнено(СтрокаОстатков.Серия) Тогда
						ERPData.registers.lot_no = СтрокаОстатков.СерияНаименование;      
						ERPData.registers.bbd	 = СтрокаОстатков.СерияГоденДо;  
						ERPData.registers.prd	 = СтрокаОстатков.СерияДатаПроизводства;
					Иначе
						ERPData.registers.lot_no = "-";
					КонецЕсли;
				КонецЕсли;        
				
				ИдОстатков	= ИдОстатков + 1;
				
				Если НЕ EmeWmsЭкспортНоменклатуры.Экспортирован(СтрокаОстатков.Номенклатура) Тогда
					EmeWmsЭкспортНоменклатуры.РазрешитьЭкспортСГруппами(СтрокаОстатков.Номенклатура);
				КонецЕсли;
			КонецЦикла;

			// Таблица движений
			EmeWmsERPEngine.SelectChild(ERPData, "operations");
			СтрокиДвижений	= ТаблицаДвижений.НайтиСтроки(ПараметрыОтбора);
			Для каждого СтрокаДвижения Из СтрокиДвижений Цикл				
				EmeWmsERPEngine.AppendChildLine(ERPData);    
				
				ТипЗнчРегистратор = ТипЗнч(СтрокаДвижения.Регистратор);
				
				ERPData.operations.id 			= СтрЗаменить(Строка(ИдДвижений), Символы.НПП, "");
				ERPData.operations.executed_at	= Формат(СтрокаДвижения.РегистраторДата, "ДФ=ггггММддЧЧммсс");
				ERPData.operations.goods_id		= СтрокаДвижения.Номенклатура.УникальныйИдентификатор();
				ERPData.operations.goods_code	= СокрЛП(СтрокаДвижения.НоменклатураКод);
				ERPData.operations.receipt_qty	= СтрЗаменить(Строка(СтрокаДвижения.ПриходТовара), Символы.НПП, "");
				ERPData.operations.offwrite_qty	= СтрЗаменить(Строка(СтрокаДвижения.РасходТовара), Символы.НПП, "");
				ERPData.operations.mu_code		= ПолучитьКодОсновнойЕдиницы(СтрокаДвижения);
				ERPData.operations.pack_code	= СокрЛП(СтрокаДвижения.НоменклатураЕдиницаИзмеренияКод);
				ERPData.operations.doc_reg_no	= СокрЛП(СтрокаДвижения.РегистраторНомер);
				ERPData.operations.doc_type		= ПолучитьТипДокументаПоEME(ТипЗнчРегистратор, СтрокаДвижения.ПриходТовара);
				ERPData.operations.stock_status	= СтрокаДвижения.СтоковыйСтатус;				
				ERPData.operations.vendor_code	= СтрокаДвижения.КодОрганизацииEME;
				
				// Остатки по сериям могут быть, но серии по факту уже не используются
				Если СтрокаДвижения.ИспользоватьСерии И ИспользоватьСерии Тогда
					Если ЗначениеЗаполнено(СтрокаДвижения.Серия) Тогда 
						ERPData.operations.lot_no = СтрокаДвижения.СерияНаименование;      
						ERPData.operations.bbd	  = СтрокаДвижения.СерияГоденДо;  
						ERPData.operations.prd	  = СтрокаДвижения.СерияДатаПроизводства;
					Иначе
						ERPData.operations.lot_no = "-";
					КонецЕсли;						
				КонецЕсли;   
					
				Если ТипЗнчРегистратор = Тип("ДокументСсылка.РасходныйОрдерНаТовары") Тогда
					СтрокиДокумента				= СтрокаДвижения.Регистратор.ОтгружаемыеТовары.НайтиСтроки(Новый Структура("Номенклатура", СтрокаДвижения.Номенклатура));
				Иначе
					СтрокиДокумента				= СтрокаДвижения.Регистратор.Товары.НайтиСтроки(Новый Структура("Номенклатура", СтрокаДвижения.Номенклатура));
				КонецЕсли;
				Если СтрокиДокумента.Количество() > 0 Тогда
					// ERPData.operations.doc_line_no	= СтрЗаменить(Формат(СтрокиДокумента[0].НомерСтроки, "ЧДЦ=0"), Символы.НПП, "");
					ERPData.operations.doc_line_no	= Формат(Число(СтрокиДокумента[0].НомерСтроки), "ЧЦ=6;ЧГ=6;ЧВН=1");
				КонецЕсли;	
				
				НомерEME = ПолучитьНомерEMEДокумента(СтрокаДвижения.Регистратор, ТипЗнчРегистратор);
				НомерДок1с = ПолучитьНомер1сДокумента(СтрокаДвижения.Регистратор, ТипЗнчРегистратор, СтрокаДвижения.РегистраторНомер, СтрокаДвижения.РегистраторДата);  
				
				//Сообщить("" + СтрокаДвижения.Регистратор + " НомерEME " + НомерEME); 				
				// KSJ 31.03.2021 пока сделал так, что если документа нет в регистре импорта то он попадает в отправку но с флагом is_skip
				ERPData.operations.ext_doc_id 	= СтрокаДвижения.Регистратор.УникальныйИдентификатор();
				ERPData.operations.ext_reg_no 	= НомерДок1с;
				ERPData.operations.erp_doc_type = ПолучитьТипДокументаПо1C(СтрокаДвижения.Регистратор, ТипЗнчРегистратор);

				Если НомерEME = Неопределено Тогда
					ERPData.operations.is_skip 	= 1;	
				Иначе
					ERPData.operations.doc_reg_no =	НомерEME;
					ERPData.operations.is_skip 	= 0;	
				КонецЕсли;
				ERPData.operations.zone_code	= КодЗоны;
				
				ИдДвижений	= ИдДвижений + 1;
				
				Если НЕ EmeWmsЭкспортНоменклатуры.Экспортирован(СтрокаДвижения.Номенклатура) Тогда
					EmeWmsЭкспортНоменклатуры.РазрешитьЭкспортСгруппами(СтрокаДвижения.Номенклатура);
				КонецЕсли;		
			КонецЦикла;	                               
			ИдСклада = ИдСклада + 1;
		КонецЦикла;		
		
		Если СозданЗаголовок Тогда
			ERPData.header.total_operations = ИдДвижений - 1;			
			ERPData.header.total_registers = ИдОстатков - 1;
		КонецЕсли;

		EmeWmsERPEngine.CommitExport(ERPData);
		
		Сообщить("Остатки проэкспортированы");
		
	Исключение
		EmeWmsERPEngine.RollbackExport(ERPData);
		ВызватьИсключение(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

// Выгрузка остатков и движений по складам WMS - на конец предыдущих суток
Процедура ЭкспортОстатков() Экспорт
	ЭкспортОстатковНаДатуВSQL(НачалоДня(ТекущаяДата()) - 1);
КонецПроцедуры

// Выгрузка остатков и движений по складам WMS на дату
Процедура ЭкспортОстатковНаДатуВSQL(ДатаВыгрузки) Экспорт
	ERPData = Новый Структура;
	EmeWmsERPEngine.Create(ERPData);

	// #IBS 01.03.2024 Получить текст файла из регистра настроек
	ERPData.ERPEngine = EmeWmsУтилиты.ПолучитьСодержимоеФайлаНастроек();
	Если ERPData.ERPEngine = Неопределено Или ERPData.ERPEngine = "" Тогда
		Возврат;
	КонецЕсли;
	
	Ошибка = EmeWmsERPEngine.Connect(ERPData);
	Если Ошибка <> "" Тогда
		Сообщить(Ошибка);
		ЗаписьЖурналаРегистрации("Интеграция 1C-EME. Экспорт", УровеньЖурналаРегистрации.Ошибка,,,"Подключение к SQL базе данных: " + Ошибка);
		Возврат;
	КонецЕсли;
	
	ЭкспортироватьВсеОстатки(ERPData, ДатаВыгрузки);
	
	EmeWmsERPEngine.Disconnect(ERPData);
КонецПроцедуры

// Выгрузка остатков и движений по складам WMS на дату в XML
Функция ЭкспортОстатковНаДатуВXML(ДатаВыгрузки) Экспорт
	
	XMLWriter = Новый XMLWriter();
	
	ERPData = Новый Структура;
	EmeWmsERPEngine.Create(ERPData);
	
	//	Если файл ERPEngine.xml находится не в C:\inetpub\ERPWebInterface\Settings\	укажите путь до него
	ERPData.Config = EmeWmsУтилиты.ПутьДоERPEngine();
	
	Ошибка = EmeWmsERPEngine.ReadConfig(ERPData);
	Если Ошибка <> "" Тогда
		Сообщить(Ошибка);
		ЗаписьЖурналаРегистрации("Интеграция 1C-EME. Экспорт", УровеньЖурналаРегистрации.Ошибка,,,"Подключение к SQL базе данных: " + Ошибка);
		Возврат "";
	КонецЕсли;
	
	ЭкспортироватьВсеОстатки(ERPData, ДатаВыгрузки);
	EmeWmsERPEngine.UploadToXML(ERPData, XMLWriter);
	
	Возврат XMLWriter.Закрыть();
	
КонецФункции

#КонецОбласти

#Область ЛокальныеСлужебныеПроцедурыИФункции

// Возвращает код основной единицы измерения
Функция ПолучитьКодОсновнойЕдиницы(СтрокаТаблицыЗначений)

	Если СтрокаТаблицыЗначений.НоменклатураЕдиницаИзмеренияКод <> "" Тогда
		возврат СтрокаТаблицыЗначений.НоменклатураЕдиницаИзмеренияКод;
	Иначе
		МеждународноеСокращение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТаблицыЗначений.НоменклатураЕдиницаИзмерения,
		 																								"МеждународноеСокращение");
		Если МеждународноеСокращение="шт" Тогда
			возврат "796";
		ИначеЕсли МеждународноеСокращение="кг" Тогда
			возврат "166";
		ИначеЕсли МеждународноеСокращение="г" Тогда
			возврат "163";
		ИначеЕсли МеждународноеСокращение="паллет" Тогда
			возврат "001";
		ИначеЕсли МеждународноеСокращение="упак" Тогда
			возврат "778";
		ИначеЕсли МеждународноеСокращение="м" Тогда
			возврат "006";
		ИначеЕсли МеждународноеСокращение="л" Тогда
			возврат "112";
		ИначеЕсли МеждународноеСокращение="набор" Тогда
			возврат "704";
		ИначеЕсли МеждународноеСокращение="пог.м" Тогда
			возврат "018";
		ИначеЕсли МеждународноеСокращение="компл" Тогда
			возврат "839";
		Иначе
			возврат "796";
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

// Возвращает тип документа по EME по ссылке
Функция ПолучитьТипДокументаПоEME(ТипЗнчДокумента, КоличествоПрихода)  
	
	Если ТипЗнчДокумента = Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда
		Возврат "Оприходование";
	КонецЕсли;                  

	Если ТипЗнчДокумента = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Возврат "Автоматическое списание по уходу";
	КонецЕсли;
	                                               
	Если ТипЗнчДокумента = Тип("ДокументСсылка.СписаниеТоваров") Тогда
		Возврат "Списание";
	КонецЕсли;                  
	
	Если ТипЗнчДокумента = Тип("ДокументСсылка.ОприходованиеТоваров") Тогда
		Возврат "Оприходование";
	КонецЕсли;                  

	Если ТипЗнчДокумента = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		Если КоличествоПрихода > 0.0 Тогда
			Возврат "Приход";
		Иначе
			Возврат "Списание";
		КонецЕсли;
	КонецЕсли;                  

	Если ТипЗнчДокумента = Тип("ДокументСсылка.ИнвентаризацияТоваровНаСкладе") Тогда
		Если КоличествоПрихода > 0.0 Тогда
			Возврат "Инвентаризация - оприходование";
		Иначе
			Возврат "Инвентаризация - списание";
		КонецЕсли;
	КонецЕсли;                  
	
	Возврат неопределено;                                     
КонецФункции

// Возвращает тип документа по сообщениям ASN и ORDERS
Функция ПолучитьТипДокументаПо1C(ДокументСсылка, ТипЗнчДокумента) 

	Если ТипЗнчДокумента = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Возврат Метаданные.Документы.РеализацияТоваровУслуг.Имя;
	КонецЕсли;

	Если ТипЗнчДокумента = Тип("ДокументСсылка.ОприходованиеТоваров") Тогда
		// Делается на основании пересчета
		Если ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "ИнвентаризацияТоваровНаСкладе")) Тогда 
			Возврат Метаданные.Документы.ИнвентаризацияТоваровНаСкладе.Имя;
		Иначе
			Возврат Метаданные.Документы.ОприходованиеТоваров.Имя;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнчДокумента = Тип("ДокументСсылка.СписаниеТоваров") Тогда
		// Делается на основании пересчета
		Если ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "ИнвентаризацияТоваровНаСкладе")) Тогда
			Возврат Метаданные.Документы.ИнвентаризацияТоваровНаСкладе.Имя;
		Иначе
			Возврат Метаданные.Документы.СписаниеТоваров.Имя;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнчДокумента = Тип("ДокументСсылка.ИнвентаризацияТоваровНаСкладе") Тогда
		Возврат Метаданные.Документы.ИнвентаризацияТоваровНаСкладе.Имя;
	КонецЕсли;
	
	Если ТипЗнчДокумента = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") Тогда
		Возврат Метаданные.Документы.ВозвратТоваровОтПокупателя.Имя;
	КонецЕсли;
	
	Если ТипЗнчДокумента = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		Возврат Метаданные.Документы.ПеремещениеТоваров.Имя;
	КонецЕсли;                  
	
	Если ТипЗнчДокумента = Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда
		Возврат Метаданные.Документы.ПриходныйОрдерНаТовары.Имя;
	КонецЕсли;                  
	
	Возврат Неопределено;                                     
КонецФункции

// В ордерной схеме: выгружаются непосредственно приходные и расходные ордера на товары
Функция ПолучитьНомер1СДокумента(ДокументСсылка, ТипЗнчДокумента, ДокументНомер, ДокументДата)
	
	Возврат СокрЛП(ДокументНомер)+"/"+Формат(Год(ДокументДата),"ЧГ=4");
КонецФункции

// Возвращает номер EME по ссылке на документ не ордерная схема
Функция ПолучитьНомерEMEДокумента(ДокументСсылка, ТипЗнчДокумента)
	
	Если ТипЗнчДокумента = Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда
		Возврат НомерEMEДокументаПриходныйОрдерНаТовары(ДокументСсылка);
	КонецЕсли;
	
	Если ТипЗнчДокумента = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Возврат НомерEMEДокументаРеализацияТоваровУслуг(ДокументСсылка);
	КонецЕсли;
	
	Если ТипЗнчДокумента = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		Возврат НомерEMEДокументаПеремещениеТоваров(ДокументСсылка);
	КонецЕсли;                  
	
	Если ТипЗнчДокумента = Тип("ДокументСсылка.ОприходованиеТоваров") Тогда
		Возврат НомерEMEДокументаОприходованиеТоваров(ДокументСсылка);
	КонецЕсли;                  
	
	Если ТипЗнчДокумента = Тип("ДокументСсылка.СписаниеТоваров") Тогда
		Возврат НомерEMEДокументаСписаниеТоваров(ДокументСсылка);
	КонецЕсли;                  
	
	// При некоторых настройках проводки по складам создает сам документ пересчета
	Если ТипЗнчДокумента = Тип("ДокументСсылка.ИнвентаризацияТоваровНаСкладе") Тогда
		Возврат НомерEMEДокументаИнвентаризацияТоваров(ДокументСсылка);
	КонецЕсли;                  
	
	Возврат неопределено;
КонецФункции

// Возвращает номер EME по ссылке на документ
Функция НомерEMEДокументаПриходныйОрдерНаТовары(ДокументСсылка)
	Перем НаборЗаписей;
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеПриходныхОрдеровНаТовары.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(ДокументСсылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Возврат СокрЛП(Запись.ID);
	КонецЦикла;
	
	возврат Неопределено;  
КонецФункции

// Возвращает номер EME по ссылке на документ
Функция НомерEMEДокументаИнвентаризацияТоваров(ДокументСсылка)
	Перем НаборЗаписей;
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеИнвентаризацийТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(ДокументСсылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Возврат СокрЛП(Запись.ID);
	КонецЦикла;
	
	возврат Неопределено;  
КонецФункции

// Возвращает номер EME по ссылке на документ
Функция НомерEMEДокументаРеализацияТоваровУслуг(ДокументСсылка)
	Перем НаборЗаписей;
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеРеализацийТоваровУслуг.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(ДокументСсылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Возврат СокрЛП(Запись.ID);
	КонецЦикла;
	
	возврат Неопределено; 
КонецФункции

// Возвращает номер EME по ссылке на документ
Функция НомерEMEДокументаОприходованиеТоваров(ДокументСсылка)
	Перем НаборЗаписей;
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеОприходованийТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(ДокументСсылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Возврат СокрЛП(Запись.ID);
	КонецЦикла;
	
	возврат Неопределено;  
КонецФункции

// Возвращает номер EME по ссылке на документ (по разным регистрам перемещения)
Функция НомерEMEДокументаПеремещениеТоваров(ДокументСсылка)
	Перем НаборЗаписей;
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеПеремещенийТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(ДокументСсылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Возврат СокрЛП(Запись.ID);
	КонецЦикла; 
	
	// Если это другое перемещение.
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеПеремещенийТоваровКакОтгрузка.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(ДокументСсылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Возврат СокрЛП(Запись.ID);
	КонецЦикла; 
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеПеремещенийТоваровКакПриход.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(ДокументСсылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Возврат СокрЛП(Запись.ID);
	КонецЦикла; 
	
	возврат Неопределено;  
КонецФункции

// Возвращает номер EME по ссылке на документ
Функция НомерEMEДокументаСписаниеТоваров(ДокументСсылка)
	Перем НаборЗаписей;
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеСписанийТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(ДокументСсылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Возврат СокрЛП(Запись.ID);
	КонецЦикла;
	
	возврат Неопределено;  
КонецФункции

#КонецОбласти

