
// #Область СлужебныеПеременныеИМетодыФормы

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		Результат = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		Результат = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

// #КонецОбласти

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастроитьТаблицуТоваров();
	
	ЗаполнитьСпискиВыбора();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьЭлементыФормы();
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВидПродукцииПриИзменении(Элемент)
	
	Если МодульКлиента().ВидПродукцииПоддерживаетВетКонтроль(ВидПродукции) Тогда
		ПодлежитВетеринарномуКонтролю = "1";
	Иначе
		ПодлежитВетеринарномуКонтролю = "";
	КонецЕсли;
	
	Если ВидПродукции <> МодульКлиента().Перечисление_ВидыПродукции().Пиво Тогда
		ЭтоКег = "";
	КонецЕсли;
	
	НастроитьТаблицуТоваров();
	
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтоКегПриИзменении(Элемент)
	
	НастроитьТаблицуТоваров();
	
КонецПроцедуры

&НаКлиенте
Процедура ТабДокПриАктивизацииОбласти(Элемент)
	
	ИмяОбласти = Элемент.ТекущаяОбласть.Имя;
	
	Если Лев(ИмяОбласти, 3) = "R1C" Тогда
		Элементы.ТабДок.Редактирование = Ложь;
	Иначе
		Элементы.ТабДок.Редактирование = Истина;
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьТовары(Команда)
	
	Если Не МодульКлиента().ПроверитьУстановленнуюВерсиюМодуля() Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	МассивGTIN = ВсеGTINИзТаблицы();
	Если Не ЗначениеЗаполнено(МассивGTIN) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = НСтр("ru = 'Загрузка товаров из таблицы:'");
	МодульКлиента().СообщитьПользователюЛок(ТекстСообщения, УникальныйИдентификатор);
	
	Результат = ЗагрузитьТоварыИзТаблицы(МассивGTIN);
	МодульКлиента().СообщитьРезультатЗагрузкиТоваров(Результат, УникальныйИдентификатор);
	
	Оповестить("КонтурМаркировка_Товар_Изменен");
	
	Функциональности = МодульКлиента().Перечисление_ФункциональностьМодуля();
	МодульКлиента().СтекМетрик_ДобавитьФункциональность(Функциональности.ЗагрузкаТоваровИзТаблицы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИЗаполнитьИзНациональногоКаталога(Команда)
	
	Если Не МодульКлиента().ПроверитьУстановленнуюВерсиюМодуля() Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	МассивGTIN = ВсеGTINИзТаблицы();
	Если Не ЗначениеЗаполнено(МассивGTIN) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = НСтр("ru = 'Загрузка товаров из таблицы:'");
	МодульКлиента().СообщитьПользователюЛок(ТекстСообщения, УникальныйИдентификатор);
	
	ОбновлятьТовары = Ложь;
	Результат = ЗагрузитьТоварыИзТаблицы(МассивGTIN, ОбновлятьТовары);
	МодульКлиента().СообщитьРезультатЗагрузкиТоваров(Результат, УникальныйИдентификатор);
	
	ТекстСообщения = НСтр("ru = 'Заполнение из национального каталога:'");
	МодульКлиента().СообщитьПользователюЛок(ТекстСообщения, УникальныйИдентификатор);
	МодульКлиента().ОбновитьТоварыИзНациональногоКаталога(МассивGTIN, УникальныйИдентификатор);
	
	Функциональности = МодульКлиента().Перечисление_ФункциональностьМодуля();
	Функциональность = Функциональности.ЗагрузкаТоваровИзТаблицыИНацКаталога;
	МодульКлиента().СтекМетрик_ДобавитьФункциональность(Функциональность);
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НастроитьЭлементыФормы()
	
	Элементы.ПодлежитВетеринарномуКонтролю.Видимость = МодульКлиента().ВидПродукцииПоддерживаетВетКонтроль(ВидПродукции);
	Элементы.ТипСрокаГодности.Видимость = МодульКлиента().ВидПродукцииТребуетУказатьТипСрокаГодности(ВидПродукции);
	Элементы.ЭтоКег.Видимость = ВидПродукцииПоставляетсяВКегах();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбора()
	
	СписокВыбора = Элементы.ВидПродукции.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().ВсеВидыПродукции();
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
	СписокВыбора = Элементы.ТипСрокаГодности.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().Перечисление_ТипыСроковГодности();
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьТаблицуТоваров()
	
	ТаблицаТоваров.Очистить();
	
	Макет = МодульОбъекта().ПолучитьМакет("ШаблонЗагрузкиТовара");
	ТаблицаТоваров.Вывести(Макет.ПолучитьОбласть("ОбщиеПоля"));
	
	Если ВидПродукции = Перечисления.КонтурМаркировка_ВидыПродукции.Пиво И ЭтоКег = "1" Тогда
		ТаблицаТоваров.Присоединить(Макет.ПолучитьОбласть("НоминальныйОбъем"));
	КонецЕсли;
	
	ТаблицаТоваров.ФиксацияСверху = 1;
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьТоварыИзТаблицы(МассивGTIN, ОбновлятьТовары = Истина)
	
	СозданоТоваров = 0;
	ОбновленоТоваров = 0;
	
	ТоварыВБазе = НайтиТовары(МассивGTIN);
	ОписанияТоваровИзТаблицы = ОписанияТоваровИзТаблицы(МассивGTIN);
	
	Для каждого GTIN Из МассивGTIN Цикл
		
		Товар = ТоварыВБазе[GTIN];
		ОписаниеТовараИзТаблицы = ОписанияТоваровИзТаблицы[GTIN];
		ЭтоНовыйТовар = Не ЗначениеЗаполнено(Товар);
		ТоварОбновлен = Ложь;
		
		Если ЭтоНовыйТовар Тогда
			ОписаниеТовара = ОписаниеТовараИзТаблицы;
		Иначе
			ОписаниеТовара = МодульОбъекта().Товар_Прочитать(Товар);
			ЗаполнитьТоварОписаниемИзТаблицы(ОписаниеТовара, ОписаниеТовараИзТаблицы, ТоварОбновлен);
		КонецЕсли;
		
		ЗаполнитьТоварРеквизитамиШапки(ОписаниеТовара, ТоварОбновлен);
		
		Если ЭтоНовыйТовар Тогда
			СозданоТоваров = СозданоТоваров + 1;
		ИначеЕсли ТоварОбновлен Тогда
			ОбновленоТоваров = ОбновленоТоваров + 1;
		Иначе
			Продолжить;
		КонецЕсли;
		
		МодульОбъекта().Товар_Записать(ОписаниеТовара);
		
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("СозданоТоваров", СозданоТоваров);
	Результат.Вставить("ОбновленоТоваров", ОбновленоТоваров);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТоварРеквизитамиШапки(ОписаниеТовара, ТоварОбновлен)
	
	Если ЗначениеЗаполнено(ВидПродукции)
		И ОписаниеТовара.ВидПродукции <> ВидПродукции Тогда
		ОписаниеТовара.ВидПродукции = ВидПродукции;
		ТоварОбновлен = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Производитель)
		И ОписаниеТовара.Производитель <> Производитель Тогда
		ОписаниеТовара.Производитель = Производитель;
		ТоварОбновлен = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВладелецКарточкиТовара)
		И ОписаниеТовара.ВладелецКарточкиТовара <> ВладелецКарточкиТовара Тогда
		ОписаниеТовара.ВладелецКарточкиТовара = ВладелецКарточкиТовара;
		ТоварОбновлен = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипСрокаГодности)
		И ОписаниеТовара.ТипСрокаГодности <> ТипСрокаГодности Тогда
		ОписаниеТовара.ТипСрокаГодности = ТипСрокаГодности;
		ТоварОбновлен = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПодлежитВетеринарномуКонтролю)
		И ОписаниеТовара.ПодлежитВетеринарномуКонтролю <> БулевоИзСтроки(ПодлежитВетеринарномуКонтролю) Тогда
		ОписаниеТовара.ПодлежитВетеринарномуКонтролю = БулевоИзСтроки(ПодлежитВетеринарномуКонтролю);
		ТоварОбновлен = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтоКег)
		И ОписаниеТовара.ДопРеквизиты.ЭтоКег <> БулевоИзСтроки(ЭтоКег) Тогда
		ОписаниеТовара.ДопРеквизиты.ЭтоКег = БулевоИзСтроки(ЭтоКег);
		ТоварОбновлен = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипКодаМаркировки)
		И ОписаниеТовара.ТипКодаМаркировки <> ТипКодаМаркировки Тогда
		ОписаниеТовара.ТипКодаМаркировки = ТипКодаМаркировки;
		ТоварОбновлен = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТоварОписаниемИзТаблицы(ОписаниеТовара, ОписаниеТовараИзТаблицы, ТоварОбновлен)
	
	Если ЗначениеЗаполнено(ОписаниеТовараИзТаблицы.Наименование)
		И ОписаниеТовара.Наименование <> ОписаниеТовараИзТаблицы.Наименование Тогда
		ОписаниеТовара.Наименование = ОписаниеТовараИзТаблицы.Наименование;
		ТоварОбновлен = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОписаниеТовараИзТаблицы.Артикул)
		И ОписаниеТовара.Артикул <> ОписаниеТовараИзТаблицы.Артикул Тогда
		ОписаниеТовара.Артикул = ОписаниеТовараИзТаблицы.Артикул;
		ТоварОбновлен = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОписаниеТовараИзТаблицы.КодТНВЭД)
		И ОписаниеТовара.КодТНВЭД <> ОписаниеТовараИзТаблицы.КодТНВЭД Тогда
		ОписаниеТовара.КодТНВЭД = ОписаниеТовараИзТаблицы.КодТНВЭД;
		ТоварОбновлен = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОписаниеТовараИзТаблицы.ДопРеквизиты.НоминальныйОбъем)
		И ОписаниеТовара.ДопРеквизиты.НоминальныйОбъем <> ОписаниеТовараИзТаблицы.ДопРеквизиты.НоминальныйОбъем Тогда
		ОписаниеТовара.ДопРеквизиты.НоминальныйОбъем = ОписаниеТовараИзТаблицы.ДопРеквизиты.НоминальныйОбъем;
		ТоварОбновлен = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОписанияТоваровИзТаблицы(МассивGTIN)
	
	КолонкаШтрихкод = 1;
	КолонкаНаименование = 2;
	КолонкаАртикул = 3;
	КолонкаКодТНВЭД = 4;
	КолонкаНоминальныйОбъем = 5;
	
	Результат = Новый Соответствие;
	
	Для Сч = 2 По ТаблицаТоваров.ВысотаТаблицы Цикл
		
		Штрихкод = ТекстЯчейки(ТаблицаТоваров, Сч, КолонкаШтрихкод);
		Если Не ЗначениеЗаполнено(Штрихкод) Тогда
			Продолжить;
		КонецЕсли;
		
		GTIN = МодульОбъекта().GTINизШтрихкодаEAN(Штрихкод);
		Если МассивGTIN.Найти(GTIN) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ОписаниеТовара = МодульОбъекта().Новый_Товар();
		ОписаниеТовара.GTIN = GTIN;
		ОписаниеТовара.Наименование = ТекстЯчейки(ТаблицаТоваров, Сч, КолонкаНаименование);
		ОписаниеТовара.Артикул = ТекстЯчейки(ТаблицаТоваров, Сч, КолонкаАртикул);
		ОписаниеТовара.КодТНВЭД = ТекстЯчейки(ТаблицаТоваров, Сч, КолонкаКодТНВЭД);
		
		Если ВидПродукции = Перечисления.КонтурМаркировка_ВидыПродукции.Пиво Тогда
			ЧислоСтрокой = ТекстЯчейки(ТаблицаТоваров, Сч, КолонкаНоминальныйОбъем);
			ОписаниеТовара.ДопРеквизиты.НоминальныйОбъем = МодульОбъекта().ЧислоИзСтроки(ЧислоСтрокой);
		КонецЕсли;
		
		Результат.Вставить(GTIN, ОписаниеТовара);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ВсеGTINИзТаблицы()
	
	КолонкаШтрихкод = 1;
	КолонкаНаименование = 2;
	КолонкаАртикул = 3;
	КолонкаКодТНВЭД = 4;
	КолонкаНоминальныйОбъем = 5;
	
	Результат = Новый Массив;
	
	Для Сч = 2 По ТаблицаТоваров.ВысотаТаблицы Цикл
		
		Штрихкод = ТекстЯчейки(ТаблицаТоваров, Сч, КолонкаШтрихкод);
		Если Не ЗначениеЗаполнено(Штрихкод) Тогда
			Продолжить;
		КонецЕсли;
		
		GTIN = МодульОбъекта().GTINизШтрихкодаEAN(Штрихкод);
		Если Не ПроверитьGTIN(GTIN) Тогда
			Продолжить;
		КонецЕсли;
		
		Результат.Добавить(GTIN);
		
	КонецЦикла;
	
	МодульОбъекта().СвернутьМассив_Марк(Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПроверитьGTIN(GTIN)
	
	Результат = МодульОбъекта().ПроверитьКорректностьGTIN(GTIN);
	
	Если Не Результат Тогда
		ШаблонОшибки = НСтр("ru = 'Некорректный GTIN: %1'");
		ТекстОшибки = МодульОбъекта().ПараметрыВСтроку(ШаблонОшибки, GTIN);
		МодульОбъекта().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция НайтиТовары(МассивGTIN)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Т.GTIN КАК GTIN,
	|	Т.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурМаркировка_Товары КАК Т
	|ГДЕ
	|	Т.GTIN В(&МассивGTIN)");
	Запрос.УстановитьПараметр("МассивGTIN", МассивGTIN);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.GTIN, Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ТекстЯчейки(Область, Строка, Колонка)
	
	Результат = СокрЛП(Область.ПолучитьОбласть(Строка, Колонка).ТекущаяОбласть.Текст);
	
	Возврат Результат;
	
КонецФункции

Функция БулевоИзСтроки(Строка)
	
	Возврат Булево(Число(Строка));
	
КонецФункции

&НаКлиенте
Функция ВидПродукцииПоставляетсяВКегах() Экспорт
	
	Если ВидПродукции = МодульКлиента().Перечисление_ВидыПродукции().Пиво Тогда
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти
