// Copyright (C) 2012-2024 Engineer Mareev Enterprises
// Модуль для УТ 11.4 

#Область ЭкспортныеСлужебныеПроцедурыИФункции

// Функция возвращает выборку с группами номенклатурами контрагента
Функция ПолучитьГруппыНоменклатурКонтрагента(ПартнерСсылка) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НоменклатураКонтрагентов.Номенклатура.Родитель КАК ГруппаНоменклатуры
		|ИЗ
		|	Справочник.НоменклатураПоставщиков КАК НоменклатураКонтрагентов
		|ГДЕ
		|	НоменклатураКонтрагентов.Владелец = &Владелец
		|	И НоменклатураКонтрагентов.Номенклатура.Родитель <> НЕОПРЕДЕЛЕНО			
		|	И НЕ НоменклатураКонтрагентов.ПометкаУдаления
		|	И НЕ НоменклатураКонтрагентов.Номенклатура.ПометкаУдаления
		|	И НЕ НоменклатураКонтрагентов.Номенклатура.Родитель.ПометкаУдаления";

	Запрос.УстановитьПараметр("Владелец", ПартнерСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка; 
	
КонецФункции

#КонецОбласти

#Область РаботаСМодулямиОсновнойКонфигурации

#Область ЗаполнениеПересчетТЧТовары

//	Заполнение ТЧ документа ценами и пересчет сумм
Функция ЗаполнитьЦеныПоВидуЦен(ДокументОбъект) Экспорт  
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСумму", "Количество");
	
	КолонкиПоЗначению = Новый Структура("Упаковка", Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
	
	ПараметрыЗаполнения = Новый Структура;	
	ПараметрыЗаполнения.Вставить("Дата", 		ДокументОбъект.Дата);
	ПараметрыЗаполнения.Вставить("Организация", ДокументОбъект.Организация);
	ПараметрыЗаполнения.Вставить("Валюта", 		ДокументОбъект.Валюта);
	ПараметрыЗаполнения.Вставить("КолонкиПоЗначению", КолонкиПоЗначению);
	
	ТабличнаяЧастьТовары = ДокументОбъект.Товары;
	
	ТипОбъектаМетаданные = ТипЗнч(ДокументОбъект.Ссылка);
	Если ТипОбъектаМетаданные = Тип("ДокументСсылка.ПорчаТоваров")
		ИЛИ ТипОбъектаМетаданные = Тип("ДокументСсылка.ПересортицаТоваров") Тогда
		
		СтруктураДействий  = Неопределено;
		ДругиеИменаКолонок = Новый Структура("НоменклатураОприходование, ХарактеристикаОприходование", "Номенклатура", "Характеристика");
	 	ПараметрыЗаполнения.Вставить("ДругиеИменаКолонок", ДругиеИменаКолонок);
		
	ИначеЕсли ТипОбъектаМетаданные = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента") Тогда
		
		ПараметрыЗаполнения.Вставить("ВидЦены", ДокументОбъект.Соглашение.ВидЦен);
		ТабличнаяЧастьТовары = ДокументОбъект.ВозвращаемыеТовары;
		
	ИначеЕсли ТипОбъектаМетаданные <> Тип("ДокументСсылка.ВозвратТоваровОтКлиента") Тогда
		
		ПараметрыЗаполнения.Вставить("ВидЦены", ДокументОбъект.ВидЦены);
		
	КонецЕсли;
	
	ОМ = ОбщегоНазначения.ОбщийМодуль("ЗакупкиСервер");
	Возврат ОМ.ЗаполнитьЦены(
			ТабличнаяЧастьТовары, // Табличная часть
			 , // Выделенные строки (заполнять во всех строках)
			ПараметрыЗаполнения,
			СтруктураДействий);     
		
КонецФункции

#КонецОбласти

#Область ПараметрыЗаполненияПересчета

// Возвращает структуру, содержащую параметры для заполнения ставки НДС
Функция ПараметрыЗаполненияСтавкиНДС(Объект = Неопределено, ПоДатеОтгрузки = Ложь, ВернутьМногооборотнуюТару = Ложь) Экспорт

	Возврат Новый Структура("НалогообложениеНДС, Дата", Объект.НалогообложениеНДС, Объект.Дата);	
	
КонецФункции

// Возвращает структуру, содержащую поля значений, используемых для заполнения цен в строках табличной части документа.
Функция ПараметрыЗаполненияЦеныВСтрокеТЧ(Объект, ВидЦеныВШапке = Ложь) Экспорт
		
	Возврат ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныВСтрокеТЧ(Объект, ВидЦеныВШапке);
	
КонецФункции

#КонецОбласти

#КонецОбласти