
// Описание переменных

&НаКлиенте
Перем КэшМодуляКлиента;

// Методы получения модулей

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		Результат = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		Результат = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Организация", Организация);
	
	Если Параметры.Свойство("РежимВыбора") Тогда
		Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	КонецЕсли;
	
	Если Параметры.Свойство("Ссылка") Тогда
		Элементы.Список.ТекущаяСтрока = Параметры.Ссылка;
	КонецЕсли;
	
	УстановитьОтборПоОрганизацииЛокальный();
	
	Если Параметры.Свойство("ВидПродукции") Тогда
		УстановитьОтборПоВидуПродукции(Параметры.ВидПродукции);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурМаркировка_Площадка_Изменен" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

// Обработчики событий списка формы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.РежимВыбора Тогда
		ОповеститьОВыборе(ВыбраннаяСтрока);
	Иначе
		МодульКлиента().ОткрытьФормуПлощадки(ВыбраннаяСтрока, ЭтаФорма);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МодульКлиента().ОткрытьФормуПлощадки(ТекущиеДанные.Ссылка, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если Копирование Тогда
		МодульКлиента().ОткрытьФормуПлощадки(ТекущиеДанные.Ссылка, ЭтаФорма, Копирование);
	Иначе
		МодульКлиента().ОткрытьФормуПлощадки(Неопределено, ЭтаФорма, Копирование);
	КонецЕсли;
	
КонецПроцедуры


// Команды формы

&НаКлиенте
Процедура Синхронизировать(Команда)
	
	МодульКлиента().СинхронизироватьПлощадки(ЭтаФорма);
	
	Оповестить("КонтурМаркировка_Площадка_Изменен");
	
	ПровестиОпросПользователя();
	
КонецПроцедуры


// Служебные методы

&НаСервере
Процедура УстановитьОтборПоОрганизацииЛокальный()
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Организация;
	ЭлементОтбора.Использование = Истина;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоВидуПродукции(ВидПродукции)
	
	Если Не ЗначениеЗаполнено(ВидПродукции) Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка.ВидыПродукции.ВидПродукции");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = ВидПродукции;
	ЭлементОтбора.Использование = Истина;
	
КонецПроцедуры


// Опросы пользователей

&НаКлиенте
Процедура ПровестиОпросПользователя()
	
	КлючиСценариев = МодульКлиента().Перечисление_КлючиСценариевДляОпросов();
	ОписаниеОпроса = МодульКлиента().ОпросПользователяПоСценарию(КлючиСценариев.Площадки);
	
	Если Не ЗначениеЗаполнено(ОписаниеОпроса) Тогда
		Возврат;
	КонецЕсли;
	
	МодульКлиента().ОткрытьФормуОпросаПользователя(ОписаниеОпроса, ЭтаФорма);
	
КонецПроцедуры

