//	Copyright (C) 2012-2025 Engineer Mareev Enterprises
//	Модуль для УТ 10.3 Экспортирует сообщения asn из документа Перемещение товаров
//	Экспортирует ASN c характеристиками или сериями товара. 

//	$Перемещение товаров как приход (неордерная схема)
//  Экспорт сообщений ASN:
//	 - В 1С оператор (руч.) оформляет документ "Перемещение товаров", который при проведении (авт.) помечается к Экспорту.
//	 - 1С (авт.) экспортирует сообщение ASN.

#Область ПрограммныйИнтерфейс

//	Функция ПолучитьИмяСообщения возвращает имя сообщения DESPATCH
Функция ПолучитьИмяСообщения() Экспорт
	Возврат "asn";
КонецФункции

//	Функция ПолучитьМетаданные возвращает метаданные сообщения
Функция ПолучитьМетаданные() Экспорт
	Возврат Метаданные.Документы.ПеремещениеТоваров;
КонецФункции

//	Процедура экспортирует одно перемещение товаров, как приход на склад-получатель
Процедура Экспортировать(ERPData, Документ) Экспорт
	
	АктуализироватьУИДыСтрок(Документ.Ссылка);
	
	//	Заголовок заказа
	EmeWmsERPEngine.AppendHeaderLine(ERPData);
	
	ERPData.header.asn_id       = Документ.УникальныйИдентификатор();

	Если Константы.EmeWmsСоздаватьУникальныеСообщения.Получить() Тогда
		ERPData.header.id	  	= Новый УникальныйИдентификатор;
	Иначе
		ERPData.header.id	  	= ERPData.header.asn_id;		
	КонецЕсли;

	ERPData.header.asn_reg_no	  =	СокрЛП(Документ.Номер)+"/"+Формат(Год(Документ.Дата),"ЧГ=4");
	ERPData.header.asn_date	  	  =	Документ.Дата;
	ERPData.header.erp_doc_type	  = ПолучитьМетаданные().Имя;
	ДокументОснование = Документ.ДокументОснование;
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		ERPData.header.ref_reg_no  	  =	ДокументОснование.Номер;
	КонецЕсли;

	ERPData.header.supplier_id  	= Документ.Организация.УникальныйИдентификатор();
	// #IBS 24.01.2024 у организаций пустой код
	ERPData.header.supplier_code  	= Документ.Организация.ИНН;
	ERPData.header.supplier_name  	= Документ.Организация.Наименование;   
		
	ERPData.header.whs_to_code 	  =	EmeWmsУтилиты.ПолучитьКодСкладаEMEПоСсылке(Документ.СкладПолучатель);  // Код склада EME
	ERPData.header.vendor_to_code =	EmeWmsУтилиты.ПолучитьКодОрганизацииEMEПоСсылке(Документ.Организация);
	ERPData.header.comment        =	Лев(Документ.Комментарий, 128);
																				  
	//	Использование серий в интеграции
	ИспользоватьСерииНастройка = Константы.EmeWmsИспользоватьСерии.Получить();	

	//	Строки заказа
	EmeWmsERPEngine.SelectChild(ERPData, "lines");
	Для Каждого СтрокаТовара Из Документ.Товары Цикл 

		Если Не ЗначениеЗаполнено(СтрокаТовара.Номенклатура) ИЛИ СтрокаТовара.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;   

		Товар = СтрокаТовара.Номенклатура;
		РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Товар, "БазоваяЕдиницаИзмерения, Код, 
																			|ВестиУчетПоСериям, ВестиУчетПоХарактеристикам");
		
		Если Не ЗначениеЗаполнено(РеквизитыНоменклатуры.БазоваяЕдиницаИзмерения) Тогда
			Продолжить;
		КонецЕсли;   
		
		EmeWmsERPEngine.AppendChildLine(ERPData);
		
		ERPData.lines.id			= СтрокаТовара.EmeWmsУИДСтроки;
		ERPData.lines.asn_line_no	= СтрокаТовара.НомерСтроки;
		ERPData.lines.goods_id		= СтрокаТовара.Номенклатура.УникальныйИдентификатор();
		ERPData.lines.goods_code	= СокрЛП(РеквизитыНоменклатуры.Код);
		ERPData.lines.quantity		= EmeWmsУтилиты.ПересчетВДругуюЕдиницу(СтрокаТовара.Количество, 
															 			   СтрокаТовара.ЕдиницаИзмерения,
															 			   РеквизитыНоменклатуры.БазоваяЕдиницаИзмерения);
																		   
		ERPData.lines.mu_code		= РеквизитыНоменклатуры.БазоваяЕдиницаИзмерения.Код;
		
		Если Не ИспользоватьСерииНастройка Тогда
			РеквизитыНоменклатуры.ВестиУчетПоСериям = Ложь;
		КонецЕсли;

		// Выгружаем серии или характеристики товара
		Если РеквизитыНоменклатуры.ВестиУчетПоСериям Тогда // Серии
			// Здесь в сериях номер не заполняется, только наименование, содержащее номер и дату документа в виде текста.
			РеквизитыСерии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТовара.СерияНоменклатуры, "Наименование,СрокГодности");

			Если ЗначениеЗаполнено(СтрокаТовара.СерияНоменклатуры) Тогда   
				ERPData.lines.lot_no = РеквизитыСерии.Наименование;      
				ERPData.lines.bbd	 = РеквизитыСерии.СрокГодности;  
			КонецЕсли;
		Иначе // Характеристики
			Если РеквизитыНоменклатуры.ВестиУчетПоХарактеристикам Тогда

				Если ЗначениеЗаполнено(СтрокаТовара.ХарактеристикаНоменклатуры) Тогда
					ERPData.lines.lot_no = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовара.ХарактеристикаНоменклатуры, "Наименование");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ EmeWmsЭкспортНоменклатуры.Экспортирован(Товар) Тогда
			EmeWmsЭкспортНоменклатуры.РазрешитьЭкспортСГруппами(Товар);
		КонецЕсли;                                                                       
		// EmeWmsЭкспортНоменклатуры.ПометитьКЭкспортуБезусловно(СтрокаТовара.Номенклатура);
	КонецЦикла;	  
	
КонецПроцедуры   

#КонецОбласти

#Область ЭкспортныеСлужебныеПроцедурыИФункции

//	Функция РазрешенКЭкспорту возвращает Истина, если перемещение товаров разрешено к экспорту.
Функция РазрешенКЭкспорту(ПеремещениеТоваров) Экспорт
	
	ДатаЗапускаИнтеграции = Константы.EmeWmsДатаЗапускаИнтеграции.Получить();
	Если ЗначениеЗаполнено(ДатаЗапускаИнтеграции)
			И ПеремещениеТоваров.Дата < ДатаЗапускаИнтеграции Тогда
		ОтменитьЭкспорт(ПеремещениеТоваров);
		Возврат Ложь;
	КонецЕсли;	

	Если ПеремещениеТоваров.ПометкаУдаления Тогда
		ОтменитьЭкспорт(ПеремещениеТоваров);
		Возврат Ложь;
	КонецЕсли;

	Если НЕ ПеремещениеТоваров.Проведен Тогда
		ОтменитьЭкспорт(ПеремещениеТоваров);
		Возврат Ложь;
	КонецЕсли;
	
	// Экспорт когда склада-отправитель из EME.WMS, а склад получатель - нет. 
	КодСкладаПолучателя = EmeWmsУтилиты.ПолучитьКодСкладаEMEПоСсылке(ПеремещениеТоваров.СкладПолучатель, ПеремещениеТоваров.Организация);
	КодСкладаОтправителя = EmeWmsУтилиты.ПолучитьКодСкладаEMEПоСсылке(ПеремещениеТоваров.СкладОтправитель,  ПеремещениеТоваров.Организация);
	Если НЕ (КодСкладаПолучателя <> неопределено И КодСкладаОтправителя = неопределено) Тогда 
		// Если оба склада из WMS, отменить экспорт. Перемещения Transfer в этой интеграции не используются
		Если НЕ (КодСкладаПолучателя <> неопределено И КодСкладаОтправителя <> неопределено) Тогда 
			ОтменитьЭкспорт(ПеремещениеТоваров);
		КонецЕсли;    

		Возврат Ложь;
	КонецЕсли;    

	Если ПеремещениеИмпортировано(ПеремещениеТоваров) Тогда   	
		ОтменитьЭкспорт(ПеремещениеТоваров);
		Возврат Ложь;
	КонецЕсли;                            
		
	Возврат Истина;
	
КонецФункции

//	Процедура ОтменитьЭкспорт отменяет экспорт документа РТУ.
Процедура ОтменитьЭкспорт(Документ) Экспорт
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуПеремещенийТоваровКакПриход.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПеремещениеТоваров.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Ложь;
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
КонецПроцедуры

//	Процедура ПодтвердитьЭкспорт подтверждает экспорт перемещения товаров.
Процедура ПодтвердитьЭкспорт(ПеремещениеТоваровСсылка) Экспорт

	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуПеремещенийТоваровКакПриход.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПеремещениеТоваров.Установить(ПеремещениеТоваровСсылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Ложь;
		Запись.ДатаЭкспорта = ТекущаяДата();
		НаборЗаписей.Записать();
	КонецЦикла;	

КонецПроцедуры

//	Процедура ПометитьКЭкспорту помечает перемещение товаров к экспорту.
Процедура ПометитьКЭкспорту(ПеремещениеТоваров) Экспорт

	Если Не РазрешенКЭкспорту(ПеремещениеТоваров) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуПеремещенийТоваровКакПриход.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПеремещениеТоваров.Установить(ПеремещениеТоваров.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Истина;
		Запись.ДатаЭкспорта = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsПометкиКЭкспортуПеремещенийТоваровКакПриход.СоздатьМенеджерЗаписи();
	НоваяЗапись.ПеремещениеТоваров = ПеремещениеТоваров.Ссылка;
	НоваяЗапись.КЭкспорту = Истина;
	НоваяЗапись.ДатаЭкспорта = ТекущаяДата();
    НоваяЗапись.Записать(); 
		 
КонецПроцедуры

//	Процедура ПометитьКЭкспорту помечает перемещение товаров на событии при записи перемещения товаров.
Процедура ПометитьКЭкспортуПриЗаписиПеремещенийТоваровКакОтгрузка(Источник, Отказ) Экспорт
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//	Помечать, если включен режим пометок к экспорту
	Если Константы.EmeWmsПометкаВключена.Получить() Тогда
		ПометитьКЭкспорту(Источник);
	КонецЕсли;		 
КонецПроцедуры  

//	Функция ПолучитьВыборкуСсылок возвращает выборку ссылок для экспорта
Функция ПолучитьВыборкуСсылок() Экспорт
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	EmeWmsПометкиКЭкспортуПеремещенийТоваров.ПеремещениеТоваров КАК Ссылка
		|ИЗ
		|	РегистрСведений.EmeWmsПометкиКЭкспортуПеремещенийТоваровКакПриход КАК EmeWmsПометкиКЭкспортуПеремещенийТоваров
		|ГДЕ
		|	EmeWmsПометкиКЭкспортуПеремещенийТоваров.КЭкспорту";
		
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции  

//	Функция ПомеченКЭкспорту возвращает Истина, если перемещение товаров помечено к экспорту.
Функция ПомеченКЭкспорту(ПеремещениеТоваров) Экспорт
	
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуПеремещенийТоваровКакПриход.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПеремещениеТоваров.Установить(ПеремещениеТоваров.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Возврат Запись.КЭкспорту;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#Область ЛокальныеСлужебныеПроцедурыИФункции     

//	Создать новые УИДы строк ТЧ товары документа и исправить дубли, если возникли (при копировании)
Процедура АктуализироватьУИДыСтрок(ДокументСсылка)
	//	Проверим наличие строк к заполнению реквизита EmeWmsУИДСтроки, прежде чем получать Объект
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИСТИНА КАК ИзменятьEmeWmsУИДСтроки
		|ИЗ
		|	Документ.ПеремещениеТоваров.Товары КАК ТЧТовары
		|ГДЕ
		|	ТЧТовары.Ссылка = &Ссылка
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(ТЧТовары.EmeWmsУИДСтроки) 
		|	<> КОЛИЧЕСТВО(РАЗЛИЧНЫЕ 
		|		ВЫБОР
		|			КОГДА ТЧТовары.EmeWmsУИДСтроки > """"
		|				ТОГДА ТЧТовары.EmeWmsУИДСтроки
		|			ИНАЧЕ NULL
		|		КОНЕЦ)";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	// Для исключения дублей УИД в строках ТЧ
	КлючиСтрок 					= Новый Соответствие;
	БылиСозданыИдентификаторы 	= Ложь;

	Документ = ДокументСсылка.ПолучитьОбъект();
	Для Каждого СтрокаТовара Из Документ.Товары Цикл 
		// Генерация специальных UID строк документа при выгрузке
		Если НЕ ЗначениеЗаполнено(СтрокаТовара.EmeWmsУИДСтроки) ИЛИ КлючиСтрок.Получить(СтрокаТовара.EmeWmsУИДСтроки) <> Неопределено Тогда
			СтрокаТовара.EmeWmsУИДСтроки 	= Новый УникальныйИдентификатор();
			БылиСозданыИдентификаторы 		= Истина;
		КонецЕсли;
		КлючиСтрок.Вставить(СтрокаТовара.EmeWmsУИДСтроки, 0);
	КонецЦикла;	
	
	Если БылиСозданыИдентификаторы Тогда
		// При записи не перепроводить, не регистрировать по подписке к Эксопрту
		Документ.ОбменДанными.Загрузка = Истина;
		Документ.Записать();
	КонецЕсли; 
	
КонецПроцедуры

//	Проверить, было импортировано перемещение, или нет
Функция ПеремещениеИмпортировано(Документ)
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеПеремещенийТоваровКакПриход.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Возврат Истина;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции

#КонецОбласти




