
// #Область СлужебныеПеременныеИМетодыФормы

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		Результат = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		Результат = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

// #КонецОбласти // СлужебныеПеременныеИМетодыФормы

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Ссылка = Параметры.Ссылка;
	
	МодульОбъекта().ДокументУчета_ИзвлечьКодыИзАрхива(Ссылка);
	
	ЗаполнитьКонтекстФормы();
	НастроитьЭлементыФормы();
	УстановитьЗаголовки();
	ЗаполнитьСпискиВыбораЭлементовФормы();
	НастроитьКартинкиКомандФормы();
	НастроитьВидимостьКомандФормы();
	НастроитьВидимостьЭлементовФормы(Истина);
	НастроитьСписокКодыМаркировки();
	ПроверитьТоварыМаркировки();
	УстановитьУсловноеОФормление();
	ОбновитьРезультатПроверкиКодов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьПодсказку();
	УстановитьОтборПоказатьСписанныеКодыМаркировки();
	ПроверитьВыполнениеОбменаССервисом();
	ОбновитьСтатусОбновленияСтатусовКодовПриОткрытии();
	ОбновитьСтатусПроверкиКодовПриОткрытии();
	
	ПодключитьОбработчикОжидания("ПослеОткрытия", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОткрытия() Экспорт
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("КоличествоКодов", КоличествоКодов);
	ДопПараметры.Вставить("КоличествоАгрегатов", КоличествоАгрегатов);
	ДопПараметры.Вставить("КоличествоОпераций", КоличествоОпераций);
	ДопПараметры.Вставить("КоличествоТоваровДокумента", КоличествоТоваровДокумента);
	Действие = МодульКлиента().Перечисление_ДействияМетрики().Замер_ОткрытиеФормыДокументаУчета;
	МодульКлиента().ЗавершитьЗамерПроизводительности(Действие, ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	МодульКлиента().СохранитьИзмененияНаФорме("ЗаписатьИЗакрыть", ЭтаФорма, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурМаркировка_Операция_Изменен" Тогда
		ЗаполнитьКонтекстФормы();
		ПроверитьТоварыМаркировки();
		НастроитьВидимостьЭлементовФормы();
	КонецЕсли;
		
	Если ИмяСобытия = "КонтурМаркировка_КодыВДокументах_Изменен" И Параметр = Ссылка Тогда
		УдалитьРезультатыПроверкиКодов();
		ПосчитатьКоличествоСтрокТаблицФормы();
		ОбновитьСпискиКодовИАгрегатов();
	КонецЕсли;
	
	Если ИмяСобытия = "КонтурМаркировка_Операция_КоличествоЗСНИзменено" И Параметр = Ссылка Тогда
		ОбновитьСписокКодовМаркировки();
	КонецЕсли;
	
	Если ИмяСобытия = "КонтурМаркировка_ПринудительноЗакрытьМодуль" Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
	Если ИмяСобытия = "КонтурМаркировка_ИзмененРежимТехническогоСпециалиста" Тогда
		НастроитьВидимостьПодменюТехническогоСпециалиста(Параметр);
	КонецЕсли;
	
	Если ИмяСобытия = "КонтурМаркировка_СменитьВладельца" И Источник = ВладелецФормы Тогда
		ВладелецФормы = Параметр;
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти // ОбработчикиСобытийФормы

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ТоварыМаркировки_Добавить(Команда)
	
	ПараметрыФормы = Новый Структура;
	МодульКлиента().ОткрытьФормуОбработки("Форма_Товары_Список", ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыМаркировки_НайтиПоРеквизитам(Команда)
	
	СтрокаДокумента = Элементы.ТоварыДокумента.ТекущиеДанные;
	Если СтрокаДокумента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПодобратьТоварыМаркировки(СтрокаДокумента.КлючСтрокиДокумента) Тогда
		Элементы.ТоварыМаркировки.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КодыМаркировки_УказатьСтрокуДокумента(Команда)
	
	ТекущиеДанные = Элементы.КодыМаркировки.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
	"КодыМаркировки_ПослеВыбораСтрокиДокумента", ЭтаФорма);
	
	МодульКлиента().ПоказатьДиалогВыбораИзСписка(ОписаниеОбработчика
	, СписокСтрокДокумента()
	, Элементы.КодыМаркировкиСтрокаДокумента
	, ЭтаФорма
	, ТекущиеДанные.КлючСтрокиДокумента);
	
КонецПроцедуры

&НаСервере
Процедура КодыМаркировки_УстановитьКлючСтрокиДокументаНаСервере(НовыйКлючСтрокиДокумента)
	
	ТаблицаКодов = МодульОбъекта().Новый_ТаблицаКодов();
	Для каждого Стр Из Элементы.КодыМаркировки.ВыделенныеСтроки Цикл
		ТаблицаКодов.Добавить().КлючКода = Стр.КлючКода;
	КонецЦикла;
	ТаблицаКодов.ЗаполнитьЗначения(НовыйКлючСтрокиДокумента, "КлючСтрокиДокумента");
	
	МодульОбъекта().КодыДокументов_Записать(ТаблицаКодов, Ссылка, Ложь, Истина);
	
	ОбновитьСписокКодовМаркировки();
	
КонецПроцедуры

&НаКлиенте
Процедура Агрегаты_УказатьСтрокуДокумента(Команда)
	
	ТекДанные = Элементы.Агрегаты.ТекущиеДанные;
	Если ТекДанные = Неопределено
		Или Не ТекДанные.УровеньАгрегата Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
	"Агрегаты_ПослеВыбораСтрокиДокумента", ЭтаФорма);
	
	МодульКлиента().ПоказатьДиалогВыбораИзСписка(ОписаниеОбработчика
	, СписокСтрокДокумента()
	, Элементы.АгрегатыСтрокаДокумента
	, ЭтаФорма
	, ТекДанные.КлючСтрокиДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура Агрегаты_УказатьНоменклатуру1С(Команда)
	
	ТекДанные = Элементы.Агрегаты.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("Агрегаты_ПослеВыбораКлючаНоменклатуры1С", ЭтаФорма);
	
	МодульКлиента().ОткрытьФормуВыбораКлючаНоменклатуры1С(ОписаниеОбработчика, ТекДанные.КлючНоменклатуры1С, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Агрегаты_Обновить(Команда)
	
	ОбновитьСписокАгрегатов();
	ПосчитатьКоличествоСтрокТаблицФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура Агрегаты_СортироватьПоВозрастанию(Команда)
	
	Если Не ЗначениеЗаполнено(Агрегаты.ПолучитьЭлементы()) Тогда
		Возврат;
	КонецЕсли;
	
	Элемент = Элементы.Агрегаты.ТекущийЭлемент;
	Если Элемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКолонки = СтрЗаменить(Элемент.Имя, "Агрегаты", "");
	
	Агрегаты_Сортировать(ИмяКолонки, "Возр");
	
КонецПроцедуры

&НаКлиенте
Процедура Агрегаты_СортироватьПоУбыванию(Команда)
	
	Если Не ЗначениеЗаполнено(Агрегаты.ПолучитьЭлементы()) Тогда
		Возврат;
	КонецЕсли;
	
	Элемент = Элементы.Агрегаты.ТекущийЭлемент;
	Если Элемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКолонки = СтрЗаменить(Элемент.Имя, "Агрегаты", "");
	
	Агрегаты_Сортировать(ИмяКолонки, "Убыв");
	
КонецПроцедуры

&НаКлиенте
Процедура Товары_НеПодлежитМаркировке(Команда)
	
	СтрокаДокумента = Элементы.ТоварыДокумента.ТекущиеДанные;
	Если СтрокаДокумента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НеПодлежитМаркировке = Не СтрокаДокумента.НеПодлежитМаркировке;
	Элементы.Кнопка_ТоварНеПодлежитМаркировке.Пометка = НеПодлежитМаркировке;
	
	Для каждого ИдентификаторСтроки Из Элементы.ТоварыДокумента.ВыделенныеСтроки Цикл
		Стр = ТоварыДокумента.НайтиПоИдентификатору(ИдентификаторСтроки);
		Стр.НеПодлежитМаркировке = НеПодлежитМаркировке;
		МодульКлиента().УстановитьПризнакНоменклатурыНеПодлежитМаркировке(Стр.Номенклатура, НеПодлежитМаркировке);
	КонецЦикла;
	
	ОбновитьТекстОстатка();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументУчета_Перезаполнить(Команда)
	
	ДокументУчета_ПерезаполнитьНаСервере();
	
	УстановитьПодсказку();
	
	Оповестить("КонтурМаркировка_ДокументУчета_Перезаполнен", Документ1С);
	
	Элементы.КодыМаркировки.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ДокументУчета_ПерезаполнитьНаСервере()
	
	МодульОбъекта().ДокументУчета_Перезаполнить(Ссылка, Документ1С);
	
	ЗаполнитьКонтекстФормы();
	ОбновитьСписокАгрегатов();
	ПроверитьТоварыМаркировки();
	
	НастроитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	Записать();
	ПровестиОпросПользователяИЗакрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументУчета_ЗавершитьРаботу(Команда)
	
	Если Не ПроверитьВозможностьЗавершитьРаботу() Тогда
		ТоварыДокумента_СообщитьОбОшибках();
		Возврат;
	КонецЕсли;
	
	Статусы.ОсновнойСтатус = МодульКлиента().Перечисление_СтатусыДокументовУчета().Завершен;
	
	ЗаписатьИЗакрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументУчета_ЗавершитьРаботуПропустить(Команда)
	
	Статусы.ОсновнойСтатус = МодульКлиента().Перечисление_СтатусыДокументовУчета().Пропущен;
	Статусы.ТребуемоеДействие = МодульКлиента().Перечисление_ТребуемыеДействияДокументовУчета().РаботаЗавершена;
	
	ЗаписатьИЗакрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументУчета_ВозобновитьРаботу(Команда)
	
	СтатусыДокументовУчета = МодульКлиента().Перечисление_СтатусыДокументовУчета();
	
	Если Статусы.ОсновнойСтатус = СтатусыДокументовУчета.Пропущен Тогда
		Статусы.ОсновнойСтатус = СтатусыДокументовУчета.Новый;
	ИначеЕсли Статусы.ОсновнойСтатус = СтатусыДокументовУчета.Завершен Тогда
		Статусы.ОсновнойСтатус = СтатусыДокументовУчета.ВРаботе;
	Иначе
		ВызватьИсключение НСтр("ru = 'Невозможно возобновить работу документа со статусом: '") + Статусы.ОсновнойСтатус;
	КонецЕсли;
	
	Записать();
	
	НастроитьВидимостьКомандФормы();
	НастроитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументУчета_НачатьРаботу(Команда)
	
	Если Не ПроверитьЗаполнениеПолей() Тогда
		Возврат;
	КонецЕсли;
	
	Статусы.ОсновнойСтатус = МодульКлиента().Перечисление_СтатусыДокументовУчета().ВРаботе;
	
	Записать();
	
	НастроитьВидимостьКомандФормы();
	НастроитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументУчета_Удалить(Команда)
	
	Если ЕстьКодыВДокументе() Или ЗначениеЗаполнено(СписокОпераций) Тогда
		ТекстВопроса = НСтр("ru = 'Документ, операции и коды товаров будут удалены, продолжить?'");
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ДокументУчета_УдалитьПослеСогласия", ЭтаФорма);
		МодульКлиента().ПоказатьДиалогВопроса(ОписаниеОбработчика, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ДокументУчета_УдалитьПослеСогласия(КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументУчета_УдалитьПослеСогласия(Ответ, ДопПараметры = Неопределено) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	МодульКлиента().ДокументУчета_Удалить(Ссылка);
	
	Ссылка = Неопределено;
	Модифицированность = Ложь;
	
	Оповестить("КонтурМаркировка_ДокументУчета_Удален", Документ1С);
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура НаполнитьКодамиНаТСДНачатьРаботу(Команда)
	
	Если ЕстьКодыВДокументе() Или ЗначениеЗаполнено(ТоварыМаркировки) Тогда
		ТекстВопроса = НСтр("ru = 'Сопоставленные товары маркировки будут очищены, продолжить?'");
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
		"НаполнитьКодамиНаТСДНачатьРаботуПослеСогласия", ЭтаФорма);
		МодульКлиента().ПоказатьДиалогВопроса(ОписаниеОбработчика, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		НаполнитьКодамиНаТСДНачатьРаботуПослеСогласия(КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Задачи_Обновить(Команда)
	
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбменССервисом(Команда)
	
	Если Модифицированность Тогда
		ТекстВопроса = НСтр("ru = 'Необходимо сохранить изменения, продолжить?'");
		Обработчик = МодульКлиента().ОписаниеОбработчикаОповещения("ВыполнитьОбменПослеСогласияСохранения", ЭтаФорма);
		МодульКлиента().ПоказатьДиалогВопроса(Обработчик, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗапуститьОбменССервисом();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбменПослеСогласияСохранения(Ответ, ДопПараметры = Неопределено) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Записать();
	
	ЗапуститьОбменССервисом();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьОбменССервисом()
	
	Если Не МодульКлиента().ПроверитьУстановленнуюВерсиюМодуля() Тогда
		Возврат;
	КонецЕсли;
	
	МодульКлиента().ЗапуститьОбменПоОрганизации(ЭтаФорма, Организация, Ссылка);
	
	ОбновитьСтатусОбменаССервисом();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВыполнениеОбменаССервисом()
	
	Если МодульКлиента().ОбменССервисомВыполняется(Ссылка) Тогда
		МодульКлиента().НастроитьКнопкуОбменаССервисом(Элементы.Кнопка_ВыполнитьОбмен, Истина);
		ПодключитьОбработчикОжидания("ОбновитьСтатусОбменаССервисом", 5, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусОбменаССервисом() Экспорт
	
	ОбменССервисомВыполняется = МодульКлиента().ОбменССервисомВыполняется(Ссылка);
	
	МодульКлиента().НастроитьКнопкуОбменаССервисом(Элементы.Кнопка_ВыполнитьОбмен, ОбменССервисомВыполняется);
	
	Если ОбменССервисомВыполняется Тогда
		ПодключитьОбработчикОжидания("ОбновитьСтатусОбменаССервисом", 5, Истина);
	Иначе
		ЗаполнитьКонтекстФормы();
		ОбновитьСписокАгрегатов();
		ПроверитьТоварыМаркировки();
		НастроитьКартинкиКомандФормы();
		НастроитьВидимостьЭлементовФормы();
		МодульКлиента().ОбработатьОшибкиОбменаССервисом(ЭтаФорма, Организация, Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_Напечатать(Команда)
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ПечатьКодов;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,,, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_ОбновитьСтатусы(Команда)
	
	Если Не МодульКлиента().ВыполнитьАвторизацию(Организация, ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	ЗапуститьОбновлениеСтатусовКодов();
	
	ОбновитьСтатусОбновленияСтатусовКодов();
	
КонецПроцедуры

&НаСервере
Процедура ЗапуститьОбновлениеСтатусовКодов()
	
	МодульОбъекта().ЗапуститьОбновлениеСтатусовКодовДокумента(Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусОбновленияСтатусовКодовПриОткрытии()
	
	Если МодульКлиента().ОбновлениеСтатусовКодовДокументаВыполняется(Ссылка) Тогда
		ИнтервалОжидания = 5;
		ПодключитьОбработчикОжидания("ОбновитьСтатусОбновленияСтатусовКодов", ИнтервалОжидания, Истина);
		НастроитьКнопкуОбновленияСтатусовКодов(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусОбновленияСтатусовКодов() Экспорт
	
	ОбновлениеСтатусовВыполняется = МодульКлиента().ОбновлениеСтатусовКодовДокументаВыполняется(Ссылка);
	
	НастроитьКнопкуОбновленияСтатусовКодов(ОбновлениеСтатусовВыполняется);
	
	Если ОбновлениеСтатусовВыполняется Тогда
		ИнтервалОжидания = 5;
		ПодключитьОбработчикОжидания("ОбновитьСтатусОбновленияСтатусовКодов", ИнтервалОжидания, Истина);
	Иначе
		ОбновитьСпискиКодовИАгрегатов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаполнитьКодамиИзДокументаОснования(Команда)
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	НаполнитьКодамиИзДокументаОснованияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура НаполнитьКодамиИзДокументаОснованияНаСервере()
	
	Если ЗначениеЗаполнено(ВидКорректировки) Тогда
		МодульОбъекта().ДокументУчета_ЗаполнитьКодамИзОснования(Ссылка);
	Иначе
		МодульОбъекта().ДокументУчета_ПодобратьКодыИзОснования(Ссылка);
	КонецЕсли;
	
	УдалитьРезультатыПроверкиКодов();
	ПосчитатьКоличествоСтрокТаблицФормы();
	ОбновитьСпискиКодовИАгрегатов();
	
КонецПроцедуры

&НаКлиенте
Процедура НаполнитьКодамиИзИсправляемогоДокумента(Команда)
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	НаполнитьКодамиИзИсправляемогоДокументаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура НаполнитьКодамиИзИсправляемогоДокументаНаСервере()
	
	ЗаписатьНаСервере();
	
	МодульОбъекта().ДокументУчета_ЗаполнитьКодамиИзИсправляемогоДокумента(Ссылка);
	
	УдалитьРезультатыПроверкиКодов();
	ПосчитатьКоличествоСтрокТаблицФормы();
	ОбновитьСпискиКодовИАгрегатов();
	
КонецПроцедуры

&НаКлиенте
Процедура НаполнитьАгрегамиИзДокументаОснования(Команда)
	
	НаполнитьАгрегамиИзДокументаОснованияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура НаполнитьАгрегамиИзДокументаОснованияНаСервере()
	
	МодульОбъекта().ДокументУчета_ПодобратьАгрегатыИзОснования(Ссылка);
	
	УдалитьРезультатыПроверкиКодов();
	ПосчитатьКоличествоСтрокТаблицФормы();
	ОбновитьСпискиКодовИАгрегатов();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_ПодобратьИзПула(Команда)
	
	ПодобратьНовыеКодыИзЗаказовНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПодобратьНовыеКодыИзЗаказовНаСервере()
	
	МодульОбъекта().ДокументУчета_ПодобратьНовыеКодыИзЗаказов(Ссылка);
	
	УдалитьРезультатыПроверкиКодов();
	ПосчитатьКоличествоСтрокТаблицФормы();
	ОбновитьСписокКодовМаркировки();
	
КонецПроцедуры

&НаКлиенте
Процедура НаполнитьКодамиНаТСД(Команда)
	
	Записать();
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ПодборКодовНаТСД;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,,, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_Заказать(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ЗаказКодов;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,, Организация, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_ВыполнитьВводВОборот(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ВводВОборот;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,, Организация, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_Агрегировать(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().АгрегацияКодов;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,, Организация, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_ЗарегистрироватьКИТУ(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().РегистрацияАгрегатов;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,, Организация, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_Разагрегировать(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().РасформированиеАгрегатов;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,, Организация, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_Перемаркировать(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().Перемаркировка;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,, Организация, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Агрегаты_ЗаполнитьТоварыИзГИСМТ(Команда)
	
	Если Не МодульКлиента().ВыполнитьАвторизацию(Организация, ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТоварыАгрегатовИзГИСМТ();
	
КонецПроцедуры

&НаКлиенте
Процедура Агрегаты_ЗаполнитьВложенныеКодыИзГИСМТ(Команда)
	
	Если Не МодульКлиента().ВыполнитьАвторизацию(Организация, ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьВложенныеКодыАгрегатовИзГИСМТ();
	
КонецПроцедуры

&НаКлиенте
Процедура НаполнитьКодамиИзВходящегоУПД(Команда)
	
	ЗагрузитьКодыИзВходящегоУПД();
	
КонецПроцедуры

&НаКлиенте
Процедура НаполнитьКодамиИзВнешнегоИсточника(Команда)
	
	ЗагрузитьКодыИзВнешнегоИсточника();
	
КонецПроцедуры

&НаКлиенте
Процедура НаполнитьКодамиИзВнешнегоИсточникаНачатьРаботу(Команда)
	
	ЗагрузитьКодыИзВнешнегоИсточника(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура НаполнитьКодамиИзДругогоДокумента(Команда)
	
	ЗагрузитьКодыИзДругогоДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура НаполнитьКодамиИзДругогоДокументаНачатьРаботу(Команда)
	
	ЗагрузитьКодыИзДругогоДокумента(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьКодыВФайлCSV(Команда)
	
	ФорматыФайловСКодами = МодульКлиента().Перечисление_ФорматыФайловСКодами();
	СохранитьКодыВФайл(ФорматыФайловСКодами.csv);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьКодыВФайлXLS(Команда)
	
	ФорматыФайловСКодами = МодульКлиента().Перечисление_ФорматыФайловСКодами();
	СохранитьКодыВФайл(ФорматыФайловСКодами.xlsx);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьКодыВФайл(ФорматФайла)
	
	ТипыФайловСКодами = МодульКлиента().Перечисление_ТипыФайловСКодами();
	
	ПараметрыСохранения = МодульКлиента().Новый_ПараметрыСохраненияФайлаСКодами();
	
	ПараметрыСохранения.Ссылка = Ссылка;
	ПараметрыСохранения.ФорматФайла = ФорматФайла;
	ПараметрыСохранения.ТипФайлаСКодами = ТипыФайловСКодами.ФайлКодовДокументаУчета;
	
	МодульКлиента().СохранитьКодыВФайл(ПараметрыСохранения);
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_НаполнитьАгрегатыНаТСД(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().НаполнениеАгрегатовНаТСД;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,, Организация, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_НаполнитьНаборыНаТСД(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().НаполнениеНаборовНаТСД;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,, Организация, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_ЗарегистрироватьНаборы(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().РегистрацияНаборов;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,, Организация, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_СоздатьОтчетОНанесении(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ОтчетОНанесении;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,, Организация, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_НаполнитьОтчетОНанесенииНаТСД(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ОтчетОНанесенииНаТСД;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,, Организация, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_НаполнитьОтчетОВыбытииНаТСД(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ОтчетОВыбытииНаТСД;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,, Организация, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_ПоказатьСписанные(Команда)
	
	Элемент = Элементы.Кнопка_ПоказатьСписанныеКоды;
	
	Элемент.Пометка = Не Элемент.Пометка;
	
	УстановитьОтборПоказатьСписанныеКодыМаркировки();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_АгрегироватьКИГУ(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().НаполнениеКИГУ;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,, Организация, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_ЗарегистрироватьКИГУ(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().РегистрацияКИГУ;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,, Организация, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_ВернутьВОборот(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ВозвратВОборот;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,, Организация, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_НаполнитьВозвратВОборотНаТСД(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ВозвратВОборотНаТСД;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,, Организация, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_СформироватьАТК(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ФормированиеАТК;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,, Организация, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_РасформироватьАТК(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().РасформированиеАТК;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,, Организация, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_КорректироватьСведения(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().КорректировкаСведенийОКодах;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,,, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_УведомитьОСостоянииКодов(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().УведомлениеОСостоянииКодов;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,,, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаСервере
Процедура Документ_НачатьРаботу()
	
	СтатусыДокументовУчета = МодульОбъекта().Перечисление_СтатусыДокументовУчета();
	
	Если Статусы.ОсновнойСтатус = СтатусыДокументовУчета.Новый Тогда
		Статусы.ОсновнойСтатус = СтатусыДокументовУчета.ВРаботе;
		ЗаписатьНаСервере();
	КонецЕсли;
	
	НастроитьВидимостьКомандФормы();
	НастроитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументУчета_Записать(Команда)
	
	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументУчета_СообщитьОбОтгрузке(Команда)
	
	Записать();
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().СообщениеОбОтгрузке;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,,, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_ВывестиИзОборота(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ВыводИзОборота;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,, Организация, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_СоздатьОтчетОВыбытии(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ОтчетОВыбытии;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,, Организация, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура НаполнитьКодамиИзФайлов(Команда)
	
	ЗагрузитьКодыИзФайлов();
	
КонецПроцедуры

&НаКлиенте
Процедура НаполнитьКодамиИзФайловНачатьРаботу(Команда)
	
	ЗагрузитьКодыИзФайлов(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеДокументы_Открыть(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДокументУчета", Ссылка);
	
	МодульКлиента().ОткрытьФормуОбработки("Форма_СвязанныеДокументы", ЭтаФорма, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоВиртуальномуСкладу(Команда)
	
	Контекст = КонтекстОтчетаПоВиртуальномуСкладу();
	
	Если Не ЗначениеЗаполнено(Контекст) Тогда
		Возврат;
	КонецЕсли;
	
	МодульКлиента().ОткрытьФормуОтчетаПоВиртуальномуСкладу(ЭтаФорма, Контекст);
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_ДобавитьЗСН(Команда)
	
	Обработчик = МодульКлиента().ОписаниеОбработчикаОповещения("ОбновитьКоличествоЗСН", ЭтаФорма);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДокументУчета", Ссылка);
	ПараметрыФормы.Вставить("ТолькоПросмотр", ТолькоПросмотр);
	
	МодульКлиента().ОткрытьРедакторЗаводскихСерийныхНомеров(ЭтаФорма, ПараметрыФормы, Обработчик);
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_РасформироватьНаборы(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().РасформированиеНаборов;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,, Организация, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_Распределить(Команда)
	
	МодульКлиента().ДокументУчета_РаспределитьКодыМаркировки(Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура НаполнитьКодамиИзТабличногоДокумента(Команда)
	
	ОткрытьФормуЗагрузкиКодов();
	
КонецПроцедуры

&НаКлиенте
Процедура НаполнитьКодамиСПомощьюСканера(Команда)
	
	РежимСканера = Истина;
	
	ОткрытьФормуЗагрузкиКодов(РежимСканера);
	
КонецПроцедуры

&НаКлиенте
Процедура Шапка_ДополнительнаяКнопкаНажатие(Команда)
	
	РазмещенияКнопок = МодульКлиента().Перечисление_РазмещениеДополнительныхКнопок();
	
	ПараметрыНажатия = МодульКлиента().Новый_ПараметрыНажатияДопКнопки();
	ПараметрыНажатия.Размещение = РазмещенияКнопок.ДокументУчетаШапка;
	ПараметрыНажатия.ВызывающаяФорма = ЭтаФорма;
	ПараметрыНажатия.ДопСведения.ДокументУчета = Ссылка;
	ПараметрыНажатия.ДопСведения.Документ1С = Документ1С;
	
	МодульКлиента().ПриНажатииДополнительнойКнопки(ПараметрыНажатия, Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура КодыМаркировки_ДополнительнаяКнопкаНажатие(Команда)
	
	РазмещенияКнопок = МодульКлиента().Перечисление_РазмещениеДополнительныхКнопок();
	
	ПараметрыНажатия = МодульКлиента().Новый_ПараметрыНажатияДопКнопки();
	ПараметрыНажатия.Размещение = РазмещенияКнопок.ДокументУчетаСписокКодов;
	ПараметрыНажатия.ВызывающаяФорма = ЭтаФорма;
	ПараметрыНажатия.ДопСведения.ДокументУчета = Ссылка;
	ПараметрыНажатия.ДопСведения.Документ1С = Документ1С;
	
	МодульКлиента().ПриНажатииДополнительнойКнопки(ПараметрыНажатия, Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьКодыСПомощьюТабличногоДокумента(Команда)
	
	ОткрытьФормуЗагрузкиКодов(, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьКодыСПомощьюСканера(Команда)
	
	ОткрытьФормуЗагрузкиКодов(Истина, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуАдминистратора(Команда)
	
	МодульКлиента().ОткрытьФормуАдминистратораМаркировки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактораДокументаУчета(Команда)
	
	МодульКлиента().ОткрытьФормуРедактораДокументаУчета(Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактораОперации(Команда)
	
	Операция = Неопределено;
	
	Если Элементы.ГруппаЗакладки.ТекущаяСтраница = Элементы.Закладка_Операции Тогда
		ТекущиеДанные = Элементы.СписокОпераций.ТекущиеДанные;
	КонецЕсли;
	
	Если ТекущиеДанные <> Неопределено Тогда
		Операция = ТекущиеДанные.ОперацияСсылка;
	КонецЕсли;
	
	МодульКлиента().ОткрытьФормуРедактораОперации(Операция);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедакторКода(Команда)
	
	КлючКода = Неопределено;
	
	Если Элементы.ГруппаЗакладки.ТекущаяСтраница = Элементы.Закладка_КодыМаркировки Тогда
		ТекущиеДанные = Элементы.КодыМаркировки.ТекущиеДанные;
	ИначеЕсли Элементы.ГруппаЗакладки.ТекущаяСтраница = Элементы.Закладка_Агрегаты Тогда
		ТекущиеДанные = Элементы.Агрегаты.ТекущиеДанные;
	Иначе
		ТекущиеДанные = Неопределено;
	КонецЕсли;
	
	Если ТекущиеДанные <> Неопределено Тогда
		КлючКода = ТекущиеДанные.КлючКода;
	КонецЕсли;
	
	МодульКлиента().ОткрытьФормуРедактораКодаМаркировки(КлючКода);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКодыДокумента(Команда)
	
	Если Не МодульКлиента().ВыполнитьАвторизацию(Организация, ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗапуститьПроверкуКодов() Тогда
		ОбновитьСтатусПроверкиКодов();
	Иначе
		ТекстПредупреждения = НСтр("ru = 'Проверка может быть выполнена только для кодов единиц товаров и комплектов'");
		МодульКлиента().ПоказатьДиалогПредупреждения(ТекстПредупреждения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗапуститьПроверкуКодов()
	
	Если Не МодульОбъекта().ДокументУчета_ЕстьКодыДляПроверкиРД(Ссылка) Тогда
		МодульОбъекта().ДокументУчета_УдалитьРезультатыПроверкиКодов(Ссылка);
		Возврат Ложь;
	КонецЕсли;
	
	МодульОбъекта().ЗапуститьПроверкуКодовДокумента(Ссылка);
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьСтатусПроверкиКодовПриОткрытии()
	
	Если МодульКлиента().ПроверкаКодовДокументаВыполняется(Ссылка) Тогда
		ИнтервалОжидания = 5;
		ПодключитьОбработчикОжидания("ОбновитьСтатусПроверкиКодов", ИнтервалОжидания, Истина);
		НастроитьКнопкуПроверкиКодов(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусПроверкиКодов() Экспорт
	
	ПроверкаКодовВыполняется = МодульКлиента().ПроверкаКодовДокументаВыполняется(Ссылка);
	
	НастроитьКнопкуПроверкиКодов(ПроверкаКодовВыполняется);
	
	Если ПроверкаКодовВыполняется Тогда
		ИнтервалОжидания = 5;
		ПодключитьОбработчикОжидания("ОбновитьСтатусПроверкиКодов", ИнтервалОжидания, Истина);
	Иначе
		ОбновитьРезультатПроверкиКодов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОтчетОбОшибкахРД(Команда)
	
	ОтчетОбОшибкахРД = ОтчетОбОшибкахРазрешительнойДокументации();
	
	Если ОтчетОбОшибкахРД = Неопределено Тогда
		ТекстПредупреждения = НСтр("ru = 'Не найдено результатов проверки.'");
		МодульКлиента().ПоказатьДиалогПредупреждения(ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	ОтчетОбОшибкахРД.ОтображатьСетку = Ложь;
	ОтчетОбОшибкахРД.ОтображатьЗаголовки = Ложь;
	ОтчетОбОшибкахРД.ТолькоПросмотр = Истина;
	ОтчетОбОшибкахРД.Показать("Коды с ошибками разрешительной документации (Контур.Маркировка)");
	
КонецПроцедуры

&НаСервере
Функция ОтчетОбОшибкахРазрешительнойДокументации()
	
	ТипыФайлов = МодульОбъекта().Перечисление_ТипыФайлов();
	ФайлРезультата = МодульОбъекта().Файл_Найти(Ссылка, ТипыФайлов.РезультатПроверкиРД);
	
	Если ЗначениеЗаполнено(ФайлРезультата) Тогда
		ОписаниеФайла = МодульОбъекта().Файл_Прочитать(ФайлРезультата);
		КодыСОшибками = ОписаниеФайла.ДанныеФайла;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ФайлРезультата) Или Не ЗначениеЗаполнено(КодыСОшибками) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый ТабличныйДокумент;
	
	Макет = МодульОбъекта().ПолучитьМакет("ОтчетОбОшибкахРазрешительнойДокументации");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.ПредставлениеДокумента = Ссылка;
	Результат.Вывести(ОбластьШапка);
	
	ОбластьСтрокаКода = Макет.ПолучитьОбласть("СтрокаКода");
	Для Каждого КодМаркировки Из КодыСОшибками Цикл
		ОбластьСтрокаКода.Параметры.КодМаркировки = КодМаркировки;
		Результат.Вывести(ОбластьСтрокаКода);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти // ОбработчикиКомандФормы

// #Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТоварыДокумента.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле = Элементы.ТоварыКоличествоЗСН Тогда
		СтандартнаяОбработка = Ложь;
		Если ТекущиеДанные.ТребуетсяЗСН Тогда
			ОткрытьРедакторЗаводскихСерийныхНомеров(ТекущиеДанные);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если Поле = Элементы.ТоварыНоменклатура Тогда
		СсылкаНаОбъект = ТекущиеДанные.Номенклатура;
	ИначеЕсли Поле = Элементы.ТоварыХарактеристика Тогда
		СсылкаНаОбъект = ТекущиеДанные.Характеристика;
	ИначеЕсли Поле = Элементы.ТоварыУпаковка Тогда
		СсылкаНаОбъект = ТекущиеДанные.Упаковка;
	ИначеЕсли Поле = Элементы.ТоварыСерия Тогда
		СсылкаНаОбъект = ТекущиеДанные.Серия;
	Иначе
		Возврат;
	КонецЕсли;
	
	МодульКлиента().ОткрытьФормуОбъектаИС(СсылкаНаОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	
	СтрокаДокумента = Элементы.ТоварыДокумента.ТекущиеДанные;
	Если СтрокаДокумента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КлючСтрокиДокумента = СтрокаДокумента.КлючСтрокиДокумента;
	НеПодлежитМаркировке = СтрокаДокумента.НеПодлежитМаркировке;
	
	Элементы.Кнопка_ТоварНеПодлежитМаркировке.Пометка = НеПодлежитМаркировке;
	
	Если СтрокаДокумента.НеПодлежитМаркировке Тогда
		ПараметрыОтбора = Новый ФиксированнаяСтруктура("КлючСтрокиДокумента", МодульКлиента().ПустойУникальныйИдентификатор());
	Иначе
		ПараметрыОтбора = Новый ФиксированнаяСтруктура("КлючСтрокиДокумента", КлючСтрокиДокумента);
	КонецЕсли;
	Элементы.ТоварыМаркировки.ОтборСтрок = ПараметрыОтбора;
	
	ОбновитьТекстСообщенияОбОшибке();
	ОбновитьТекстОстатка();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	Стр = Элементы.ТоварыДокумента.ТекущиеДанные;
	Если Стр.КоличествоУпаковок = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Стр.РучнойВводКоличества = Истина;
	УстановитьНовоеКоличествоТоваровМаркировки(Стр);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПравилоОтраженияВЭДОПриИзменении(Элемент)
	
	ПроверитьТоварыМаркировки();
	ОбновитьТекстСообщенияОбОшибке();
	УстановитьПодсказку();
	Модифицированность = Истина;
	
	СтрДок = Элементы.ТоварыДокумента.ТекущиеДанные;
	Если Не СтрДок = Неопределено Тогда
		КлючСтрокиДокумента = СтрДок.КлючСтрокиДокумента;
		ЗаполнитьДоступностьПартионногоУчета(КлючСтрокиДокумента);
	КонецЕсли;
	
	НастроитьВидимостьКомандФормы();
	НастроитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыМаркировкиКоличествоПриИзменении(Элемент)
	
	СтрТов = Элементы.ТоварыМаркировки.ТекущиеДанные;
	Если СтрТов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрДок = Элементы.ТоварыДокумента.ТекущиеДанные;
	Если СтрДок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрТов.КлючСтрокиДокумента = СтрДок.КлючСтрокиДокумента;
	СтрДок.КоличествоПодобрано = КоличествоУпаковокТоваровМаркировки(СтрДок.КлючСтрокиДокумента, ЭтаФорма);
	
	ОбновитьТекстОстатка();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыМаркировкиПослеУдаления(Элемент)
	
	Стр = Элементы.ТоварыДокумента.ТекущиеДанные;
	Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Стр.КоличествоПодобрано = КоличествоУпаковокТоваровМаркировки(Стр.КлючСтрокиДокумента, ЭтаФорма);
	
	ОчиститьСоообщениеОбОшибкеВСтроке(Стр);
	ОбновитьТекстСообщенияОбОшибке();
	ЗаполнитьТребуетсяЗСН(Стр.КлючСтрокиДокумента);
	ЗаполнитьДоступностьПартионногоУчета(Стр.КлючСтрокиДокумента);
	ОбновитьТекстОстатка();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыМаркировкиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	СтрТов = Элементы.ТоварыМаркировки.ТекущиеДанные;
	Если СтрТов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрДок = Элементы.ТоварыДокумента.ТекущиеДанные;
	Если СтрДок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрТов.КлючСтрокиДокумента = СтрДок.КлючСтрокиДокумента;
	
	ОчиститьСоообщениеОбОшибкеВСтроке(СтрДок);
	ОбновитьТекстСообщенияОбОшибке();
	ЗаполнитьТребуетсяЗСН(СтрДок.КлючСтрокиДокумента);
	ЗаполнитьДоступностьПартионногоУчета(СтрДок.КлючСтрокиДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыМаркировкиТоварОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТоварСсылка = Элементы.ТоварыМаркировки.ТекущиеДанные.Товар;
	
	Если ЗначениеЗаполнено(ТоварСсылка) Тогда
		МодульКлиента().ОткрытьФормуТовара(ТоварСсылка, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыМаркировкиТоварНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ТекущийЭлемент");
	МодульКлиента().ОткрытьФормуОбработки("Форма_Товары_Список", Элемент, ПараметрыФормы);
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыМаркировкиТоварПриИзменении(Элемент)
	
	Элементы.ТоварыМаркировки.ТекущиеДанные.ДобавленВручную = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыМаркировкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элементы.ГруппаТоваровМаркировки.ТолькоПросмотр Тогда
		
		Если Поле = Элементы.ТоварыМаркировкиТовар Тогда
			Товар = Элемент.ТекущиеДанные.Товар;
			Если ЗначениеЗаполнено(Товар) Тогда
				МодульКлиента().ОткрытьФормуТовара(Товар, ЭтаФорма);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КодыМаркировкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КодыМаркировкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если Поле = Элементы.КодыМаркировкиКодМаркировки Тогда
		
		Если ЗначениеЗаполнено(ТекущиеДанные.КлючКода) Тогда
			МодульКлиента().ОткрытьФормуКодаМаркировки(ТекущиеДанные.КлючКода, Организация, ЭтаФорма);
		КонецЕсли;
		
	ИначеЕсли Поле = Элементы.КодыМаркировкиСтрокаДокумента Тогда
		
		Если ТолькоПросмотр Тогда
			Возврат;
		КонецЕсли;
		
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
		"КодыМаркировки_ПослеВыбораСтрокиДокумента", ЭтаФорма);
		
		МодульКлиента().ПоказатьДиалогВыбораИзСписка(ОписаниеОбработчика
		, СписокСтрокДокумента()
		, Элемент
		, ЭтаФорма
		, ТекущиеДанные.КлючСтрокиДокумента);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КодыМаркировкиПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	Если Не ЗначениеЗаполнено(Элементы.КодыМаркировки.ВыделенныеСтроки) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru = 'Выбранные коды будут удалены из документа, продолжить?'");
	Кнопки = РежимДиалогаВопрос.ДаНет;
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("Коды_УдалитьИзДокументаПослеСогласия", ЭтаФорма);
	МодульКлиента().ПоказатьДиалогВопроса(ОписаниеОбработчика, ТекстВопроса, Кнопки);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОперацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекСтрока = Элементы.СписокОпераций.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТипОперации = ТекСтрока.ТипОперации;
	ОперацияСсылка = ТекСтрока.ОперацияСсылка;
	
	Если НЕ ЗначениеЗаполнено(ОперацияСсылка) Тогда
		ОперацияСсылка = МодульКлиента().Операция_Создать(ТипОперации, Ссылка);
		ОбновитьСписокОпераций();
	КонецЕсли;
	
	МодульКлиента().ОткрытьФормуОперации(ОперацияСсылка, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	НастроитьКартинкиКомандФормы();
	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОткрытие(Элемент, СтандартнаяОбработка)
	
	МодульКлиента().ОткрытьФормуОрганизации(Организация, ЭтаФорма);
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	МодульКлиента().ОткрытьФормуОбработки("Форма_Организации_Список", Элемент, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СкладОткрытие(Элемент, СтандартнаяОбработка)
	
	МодульКлиента().ОткрытьФормуСклада(Склад, ЭтаФорма);
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СкладНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	МодульКлиента().ОткрытьФормуОбработки("Форма_Склады_Список", Элемент, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура АгрегатыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура АгрегатыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элемент.ТекущиеДанные;
	
	Если Поле = Элементы.АгрегатыКодМаркировки Тогда
		СтандартнаяОбработка = Ложь;
		Если ЗначениеЗаполнено(ТекДанные.КлючКода) Тогда
			МодульКлиента().ОткрытьФормуКодаМаркировки(ТекДанные.КлючКода, Организация, ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
		
	Если Поле = Элементы.АгрегатыСтрокаДокумента Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если ТолькоПросмотр Тогда
			Возврат;
		КонецЕсли;
		
		Если Не ТекДанные.УровеньАгрегата Тогда
			Возврат;
		КонецЕсли;
		
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("Агрегаты_ПослеВыбораСтрокиДокумента", ЭтаФорма);
		
		МодульКлиента().ПоказатьДиалогВыбораИзСписка(ОписаниеОбработчика
		, СписокСтрокДокумента()
		, Элемент
		, ЭтаФорма
		, ТекДанные.КлючСтрокиДокумента);
		
	КонецЕсли;
		
	Если Поле = Элементы.АгрегатыКлючНоменклатуры1С Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если ТолькоПросмотр Тогда
			Возврат;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТекДанные.Товар) Тогда
			Возврат;
		КонецЕсли;
		
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("Агрегаты_ПослеВыбораКлючаНоменклатуры1С", ЭтаФорма);
		
		МодульКлиента().ОткрытьФормуВыбораКлючаНоменклатуры1С(ОписаниеОбработчика, ТекДанные.КлючНоменклатуры1С, ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АгрегатыПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	Если Не ЗначениеЗаполнено(Элементы.Агрегаты.ВыделенныеСтроки) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru = 'Выбранные агрегаты будут удалены из документа, продолжить?'");
	Кнопки = РежимДиалогаВопрос.ДаНет;
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("Агрегаты_УдалитьИзДокументаПослеСогласия", ЭтаФорма);
	МодульКлиента().ПоказатьДиалогВопроса(ОписаниеОбработчика, ТекстВопроса, Кнопки);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаЗакладкиПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.Закладка_Агрегаты И Не СписокАгрегатовЗаполнен Тогда
		ИнтервалОжидания = 0.1;
		ПодключитьОбработчикОжидания("ОбновитьСписокАгрегатовПослеОткрытияВкладки", ИнтервалОжидания, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидКорректировкиПриИзменении(Элемент)
	
	УстановитьЗаголовкиСтраницФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсправляемыйДокументУчетаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(ИсправляемыйДокумент) Тогда
		ИсправляемыйДокументУчета = МодульКлиента().ДокументУчета_НайтиИлиСоздать(ИсправляемыйДокумент, ЭтаФорма);
		Если ЗначениеЗаполнено(ИсправляемыйДокументУчета) Тогда
			МодульКлиента().ОткрытьФормуДокументаУчета(ИсправляемыйДокументУчета, ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти // ОбработчикиСобытийЭлементовФормы

// #Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЕстьТоварСОтражениемВЭДООСУ()
	
	ПравилаОтражения = МодульОбъекта().Перечисление_ПравилаОтраженияВЭДО();
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ОтражениеВЭДО", ПравилаОтражения.ОСУ);
	
	Возврат ЗначениеЗаполнено(ТоварыДокумента.НайтиСтроки(ПараметрыОтбора));
	
КонецФункции

&НаКлиенте
Функция ВсеТоварыПодобраны()
	
	Результат = Истина;
	
	Для Каждого Стр Из ТоварыДокумента Цикл
		Если Стр.НеПодлежитМаркировке Тогда
			Продолжить;
		КонецЕсли;
		Если Стр.КоличествоУпаковок <> Стр.КоличествоПодобрано Тогда
			Результат = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОбновитьСписокОпераций()
	
	ИнтерактивныеОперации = МодульОбъекта().ТипыИнтерактивныхОпераций();
	СтатусыОпераций = МодульОбъекта().Перечисление_СтатусыОпераций();
	
	ТаблицаОпераций = МодульОбъекта().ДокументУчета_СписокОпераций(Ссылка, ИнтерактивныеОперации);
	СписокОпераций.Загрузить(ТаблицаОпераций);
	
	Для Каждого Стр Из СписокОпераций Цикл
		
		Если Стр.Статус = СтатусыОпераций.Новый Тогда
			Стр.ТребуемоеДействие = "Начать работу";
			Стр.Активная = Истина;
			Стр.НомерКартинки = 0;
		ИначеЕсли Стр.Статус = СтатусыОпераций.ОперацияЗавершена
			Или Стр.Статус = СтатусыОпераций.ОперацияОтменена
			Или Стр.Статус = СтатусыОпераций.ПринятЧастично Тогда
			Стр.ТребуемоеДействие = "Работа завершена";
			Стр.Активная = Ложь;
			Стр.НомерКартинки = 4;
		ИначеЕсли Стр.Статус = СтатусыОпераций.ОшибкаЗаполнения
			Или Стр.Статус = СтатусыОпераций.ОшибкаОбработки
			Или Стр.Статус = СтатусыОпераций.ОшибкаОтменыОперации Тогда
			Стр.ТребуемоеДействие = "Исправить ошибки";
			Стр.Активная = Истина;
			Стр.НомерКартинки = 2;
		ИначеЕсли Стр.Статус = СтатусыОпераций.НеУдалосьРаспознатьКоды Тогда
			Стр.ТребуемоеДействие = "Редактировать список кодов";
			Стр.Активная = Истина;
			Стр.НомерКартинки = 3;
		Иначе
			Стр.ТребуемоеДействие = "Обрабатывается";
			Стр.Активная = Ложь;
			Стр.НомерКартинки = 3;
		КонецЕсли;
		
	КонецЦикла;
	
	ПосчитатьКоличествоСтрокТаблицФормы();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовки()
	
	УстановитьЗаголовокФормы();
	УстановитьЗаголовкиСтраницФормы();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокФормы()
	
	Заголовок = МодульОбъекта().ПараметрыВСтроку(НСтр("ru = 'Маркировка: %1'"), Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовкиСтраницФормы()
	
	Если МодульОбъекта().ДокументУчета_ЕстьРольКорректировкаОтгрузки(Ссылка) Тогда
		ВидыКорректировки = МодульОбъекта().Перечисление_ВидыКорректировкиДокумента();
		Если ВидКорректировки = ВидыКорректировки.Возврат Тогда
			Элементы.Закладка_Товары.Заголовок = НСтр("ru = 'Товары (возвращаемые)'");
			Элементы.Закладка_КодыМаркировки.Заголовок = НСтр("ru = 'Коды маркировки (возвращаемые)'");
			Элементы.Закладка_Агрегаты.Заголовок = НСтр("ru = 'Транспортные упаковки (возвращаемые)'");
		Иначе
			Элементы.Закладка_Товары.Заголовок = НСтр("ru = 'Товары (после корректировки)'");
			Элементы.Закладка_КодыМаркировки.Заголовок = НСтр("ru = 'Коды маркировки (после корректировки)'");
			Элементы.Закладка_Агрегаты.Заголовок = НСтр("ru = 'Транспортные упаковки (после корректировки)'");
		КонецЕсли;
	Иначе
		Элементы.Закладка_Товары.Заголовок = НСтр("ru = 'Товары'");
		Элементы.Закладка_КодыМаркировки.Заголовок = НСтр("ru = 'Коды маркировки'");
		Элементы.Закладка_Агрегаты.Заголовок = НСтр("ru = 'Транспортные упаковки'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы()
	
	ТипыОбъектов = МодульОбъекта().ТипыОбъектовИС();
	МодульОбъекта().УстановитьОграничениеПоТипу(Элементы.Контрагент1С, ТипыОбъектов.Контрагент);
	МодульОбъекта().УстановитьОграничениеПоТипу(Элементы.ИсправляемыйДокумент, МодульОбъекта().ОписаниеТипа_ЛюбойДокумент());
	
	ПоказатьКнопкиПоискаДля82();
	СформироватьДополнительныеКнопки();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтекстФормы()
	
	ЗаполнитьРеквизитыПоДокументуУчета();
	ЗаполнитьТребуетсяЗСН();
	ЗаполнитьДоступностьПартионногоУчета();
	ЗаполнитьКоличествоКодов();
	ЗаполнитьКоличествоЗаводскихСерийныхНомеров();
	ОбновитьСписокОпераций();
	ПосчитатьКоличествоСтрокТаблицФормы();
	
	ВыполняетсяОбновлениеДанных = МодульОбъекта().ОбъектВПроцессеОбновления(Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыПоДокументуУчета()
	
	ОписаниеДокумента = МодульОбъекта().ДокументУчета_ПрочитатьДокумент(Ссылка);
	ВсегоСтрокДокумента = ОписаниеДокумента.ТоварыДокумента.Количество();
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ОписаниеДокумента, , "ТоварыДокумента, ТоварыМаркировки");
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ОписаниеДокумента.ДопРеквизиты);
	
	ТоварыМаркировки.Очистить();
	Для Каждого Стр Из ОписаниеДокумента.ТоварыМаркировки Цикл
		НоваяСтрока = ТоварыМаркировки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
	КонецЦикла;
	
	КэшНоменклатуры = Новый Соответствие;
	НомерСтроки = 0;
	
	ТоварыДокумента.Очистить();
	Для Каждого Стр Из ОписаниеДокумента.ТоварыДокумента Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		НоваяСтрока = ТоварыДокумента.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
		
		НоваяСтрока.НомерСтроки = НомерСтроки;
		НоваяСтрока.КоличествоПодобрано = КоличествоУпаковокТоваровМаркировки(Стр.КлючСтрокиДокумента, ЭтаФорма);
		
		НоваяСтрока.ПредставлениеСтроки = МодульОбъекта().ПредставлениеСтрокиСНомером(НомерСтроки
		, МодульОбъекта().ПредставлениеНоменклатуры1С(Стр, КэшНоменклатуры)
		, ВсегоСтрокДокумента);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКоличествоКодов()
	
	СтатусыКодов = МодульОбъекта().Перечисление_СтатусыКодов();
	СтатусыКодовДокумента = МодульОбъекта().КодыДокументов_КоличествоКодовПоСтатусам(Ссылка);
	
	Для Каждого Стр Из ТоварыДокумента Цикл
		
		КодовВсего = 0;
		КодовСписано = 0;
		
		Для Каждого СтрСтатуса Из СтатусыКодовДокумента Цикл
			Если СтрСтатуса.КлючСтрокиДокумента = Стр.КлючСтрокиДокумента Тогда
				КодовВсего = КодовВсего + СтрСтатуса.Количество;
				Если СтрСтатуса.СтатусКодов = СтатусыКодов.Списан Тогда
					КодовСписано = КодовСписано+СтрСтатуса.Количество;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Стр.КоличествоКодовСписано = КодовСписано;
		Стр.КоличествоКодов = КодовВсего - КодовСписано;
		
	КонецЦикла;
	
	ЕстьСписанные = ЗначениеЗаполнено(СтатусыКодовДокумента.Найти(СтатусыКодов.Списан, "СтатусКодов"));
	УстановитьВидимостьКнопкиПоказатьСписанные(ЕстьСписанные);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКоличествоЗаводскихСерийныхНомеров()
	
	Если Не ТоварыДокумента_ТребуютсяЗаводскиеСерийныеНомера(ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрДок Из ТоварыДокумента Цикл
		СтрДок.КоличествоЗСН = 0;
	КонецЦикла;
	
	Отбор = Новый Структура("КлючСтрокиДокумента");
	Для каждого СтрЗСН Из МодульОбъекта().КодыДокументов_КоличествоЗаводскихСерийныхНомеров(Ссылка) Цикл
		Отбор.КлючСтрокиДокумента = СтрЗСН.КлючСтрокиДокумента;
		Для каждого СтрТовара Из ТоварыДокумента.НайтиСтроки(Отбор) Цикл
			СтрТовара.КоличествоЗСН = СтрЗСН.КоличествоЗСН;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТребуетсяЗСН(КлючСтрокиДокумента = Неопределено)
	
	КэшТоваров = Новый Соответствие;
	
	Для Каждого СтрДок Из ТоварыДокумента Цикл
		
		Если ЗначениеЗаполнено(КлючСтрокиДокумента)
			И СтрДок.КлючСтрокиДокумента <> КлючСтрокиДокумента Тогда
			Продолжить;
		КонецЕсли;
		
		ТребуетсяЗСН = Ложь;
		Отбор = Новый Структура("КлючСтрокиДокумента", СтрДок.КлючСтрокиДокумента);
		Для Каждого СтрТов Из ТоварыМаркировки.НайтиСтроки(Отбор) Цикл
			Если ЗначениеЗаполнено(СтрТов.Товар) Тогда
				ОписаниеТовара = МодульОбъекта().Товар_Прочитать(СтрТов.Товар, КэшТоваров);
				ТребуетсяЗСН = ОписаниеТовара.ДопРеквизиты.ИспользоватьЗаводскойСН;
				Если ТребуетсяЗСН Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		СтрДок.ТребуетсяЗСН = ТребуетсяЗСН;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДоступностьПартионногоУчета(КлючСтрокиДокумента = Неопределено)
	
	ПравилаОтражения = Перечисления.КонтурМаркировка_ПравилаОтраженияВЭДО;
	ТипыКодовМаркировки = Перечисления.КонтурМаркировка_ТипыКодовМаркировки;
	ИспользоватьПартионныйУчет = МодульОбъекта().НастройкиМодуля().ИспользоватьПартионныйУчет;
	
	СтрокиТоваров = ТоварыМаркировки;
	Если ЗначениеЗаполнено(КлючСтрокиДокумента) Тогда
		СтрокиТоваров = ТоварыМаркировки.НайтиСтроки(Новый Структура("КлючСтрокиДокумента", КлючСтрокиДокумента));
	КонецЕсли;
	
	Для Каждого СтрТов Из СтрокиТоваров Цикл
		
		СтрДок = СтрокаДокументаПоКлючуСтроки(СтрТов.КлючСтрокиДокумента);
		Если СтрДок.ОтражениеВЭДО <> ПравилаОтражения.ОСУ Тогда
			СтрТов.ДоступенПартионныйУчет = Ложь;
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрТов.Товар) Тогда
			СтрТов.ДоступенПартионныйУчет = Ложь;
			Продолжить;
		КонецЕсли;
		
		СтрТов.ДоступенПартионныйУчет = ИспользоватьПартионныйУчет
		И СтрТов.Товар.ТипКодаМаркировки = ТипыКодовМаркировки.ЕдиницаТовара
		И МодульОбъекта().ВидПродукцииПоддерживаетПартионныйУчет(СтрТов.Товар.ВидПродукции);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПодобратьТоварыМаркировки(КлючСтрокиДокумента)
	
	СтрДок = СтрокаДокументаПоКлючуСтроки(КлючСтрокиДокумента);
	
	МассивТоваров = МодульОбъекта().Товары_НайтиПоШтрихкодуИлиАртикулуНоменклатуры1С(СтрДок.КлючНоменклатуры1С, Организация);
	Если Не ЗначениеЗаполнено(МассивТоваров) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Отбор = Новый Структура("КлючСтрокиДокумента", КлючСтрокиДокумента);
	Для Каждого Стр Из ТоварыМаркировки.НайтиСтроки(Отбор) Цикл
		ТоварыМаркировки.Удалить(Стр);
	КонецЦикла;
	
	СопоставленОдинТовар = (МассивТоваров.Количество() = 1);
	
	Для Каждого Товар Из МассивТоваров Цикл
		
		НоваяСтрока = ТоварыМаркировки.Добавить();
		НоваяСтрока.Товар = Товар;
		НоваяСтрока.КлючСтрокиДокумента = СтрДок.КлючСтрокиДокумента;
		
		Если СопоставленОдинТовар Тогда
			НоваяСтрока.КоличествоУпаковок = СтрДок.КоличествоУпаковок;
			СтрДок.КоличествоПодобрано = СтрДок.КоличествоУпаковок;
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаполнитьТребуетсяЗСН(КлючСтрокиДокумента);
	ЗаполнитьДоступностьПартионногоУчета(КлючСтрокиДокумента);
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура Агрегаты_ПослеВыбораКлючаНоменклатуры1С(РезультатВыбора, ДопПараметры = Неопределено) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ИдентификаторСтроки Из Элементы.Агрегаты.ВыделенныеСтроки Цикл
		Стр = Агрегаты.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если ЗначениеЗаполнено(Стр.Товар) Тогда
			Стр.КлючНоменклатуры1С = РезультатВыбора;
		КонецЕсли;
		Если Стр.УровеньАгрегата Тогда
			Для Каждого СтрТовара Из Стр.ПолучитьЭлементы() Цикл
				СтрТовара.КлючНоменклатуры1С = РезультатВыбора;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Агрегаты_ОбновитьТоварыАгрегатов();
	
КонецПроцедуры

&НаСервере
Процедура Агрегаты_ОбновитьТоварыАгрегатов()
	
	ТоварыАгрегатов = МодульОбъекта().Новый_ТоварыАгрегатов();
	
	Для каждого ИдентификаторСтроки Из Элементы.Агрегаты.ВыделенныеСтроки Цикл
		
		Стр = Агрегаты.НайтиПоИдентификатору(ИдентификаторСтроки);
		
		Если Стр.УровеньАгрегата Тогда
			СтрАгрегата = Стр;
		Иначе
			СтрАгрегата = Стр.ПолучитьРодителя();
		КонецЕсли;
		
		Для Каждого СтрТовара Из СтрАгрегата.ПолучитьЭлементы() Цикл
			ЗаполнитьЗначенияСвойств(ТоварыАгрегатов.Добавить(), СтрТовара);
		КонецЦикла;
		
	КонецЦикла;
	
	МодульОбъекта().ТаблицаЗначений_СвернутьПоВсемКолонкам(ТоварыАгрегатов, "Количество, КоличествоУпаковок");
	
	МодульОбъекта().ТоварыАгрегатов_Записать(ТоварыАгрегатов);
	
КонецПроцедуры

&НаКлиенте
Процедура Агрегаты_ПослеВыбораСтрокиДокумента(РезультатВыбора, ДопПараметры = Неопределено) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НовыйКлючСтрокиДокумента = РезультатВыбора.Значение;
	НоваяСтрокаДокумента = РезультатВыбора.Представление;
	
	Если Не ЗначениеЗаполнено(НовыйКлючСтрокиДокумента) Тогда
		НоваяСтрокаДокумента = "";
	КонецЕсли;
	
	Для каждого ИдентификаторСтроки Из Элементы.Агрегаты.ВыделенныеСтроки Цикл
		Стр = Агрегаты.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если Стр.УровеньАгрегата Тогда
			Стр.КлючСтрокиДокумента = НовыйКлючСтрокиДокумента;
			Стр.СтрокаДокумента = НоваяСтрокаДокумента;
		КонецЕсли;
	КонецЦикла;
	
	Агрегаты_УстановитьКлючСтрокиДокументаНаСервере(НовыйКлючСтрокиДокумента);
	
КонецПроцедуры

&НаСервере
Процедура Агрегаты_УстановитьКлючСтрокиДокументаНаСервере(НовыйКлючСтрокиДокумента)
	
	ТаблицаКодов = МодульОбъекта().Новый_ТаблицаКодов();
	Для каждого ИдентификаторСтроки Из Элементы.Агрегаты.ВыделенныеСтроки Цикл
		Стр = Агрегаты.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если Стр.УровеньАгрегата Тогда
			ТаблицаКодов.Добавить().КлючКода = Стр.КлючКода;
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаКодов.ЗаполнитьЗначения(НовыйКлючСтрокиДокумента, "КлючСтрокиДокумента");
	
	МодульОбъекта().КодыДокументов_Записать(ТаблицаКодов, Ссылка, Ложь, Истина);
	
	ЗаполнитьКоличествоКодов();
	
КонецПроцедуры

&НаКлиенте
Процедура КодыМаркировки_ПослеВыбораСтрокиДокумента(РезультатВыбора, ДопПараметры = Неопределено) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КодыМаркировки_УстановитьКлючСтрокиДокументаНаСервере(РезультатВыбора.Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРедакторЗаводскихСерийныхНомеров(СтрДок)
	
	Если Модифицированность Тогда
		ТекстВопроса = НСтр("ru = 'Необходимо сохранить изменения, продолжить?'");
		Обработчик = МодульКлиента().ОписаниеОбработчикаОповещения("ОткрытьРедакторЗаводскихСерийныхНомеровПослеСогласияСохранения", ЭтаФорма, СтрДок);
		МодульКлиента().ПоказатьДиалогВопроса(Обработчик, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура("КлючСтрокиДокумента", СтрДок.КлючСтрокиДокумента);
	СтрокиТоваров = ТоварыМаркировки.НайтиСтроки(ПараметрыОтбора);
	
	Если Не ЗначениеЗаполнено(СтрокиТоваров) Тогда
		ТекстСообщения = НСтр("ru = 'Необходимо указать GTIN'");
		МодульКлиента().СообщитьПользователюЛок(ТекстСообщения, УникальныйИдентификатор);
		Возврат;
	КонецЕсли;
	
	Обработчик = МодульКлиента().ОписаниеОбработчикаОповещения("ОбновитьКоличествоЗСН", ЭтаФорма, СтрДок);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДокументУчета", Ссылка);
	ПараметрыФормы.Вставить("КлючСтрокиДокумента", СтрДок.КлючСтрокиДокумента);
	ПараметрыФормы.Вставить("КлючНоменклатуры1С", СтрДок.КлючНоменклатуры1С);
	ПараметрыФормы.Вставить("ТолькоПросмотр", ТолькоПросмотр);
	
	Если СтрокиТоваров.Количество() = 1 Тогда
		ПараметрыФормы.Вставить("Товар", СтрокиТоваров[0].Товар);
	КонецЕсли;
	
	МодульКлиента().ОткрытьРедакторЗаводскихСерийныхНомеров(ЭтаФорма, ПараметрыФормы, Обработчик);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРедакторЗаводскихСерийныхНомеровПослеСогласияСохранения(Ответ, СтрДок) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Записать();
	
	ОткрытьРедакторЗаводскихСерийныхНомеров(СтрДок);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКоличествоЗСН(Успешно, СтрокаТоваров) Экспорт
	
	Если Успешно = Истина Тогда
		ЗаполнитьКоличествоЗаводскихСерийныхНомеров();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаполнитьКодамиНаТСДНачатьРаботуПослеСогласия(Ответ, ДопПараметры = Неопределено) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ТребуемыеДействия = МодульКлиента().Перечисление_ТребуемыеДействияДокументовУчета();
	СтатусыДокументовУчета = МодульКлиента().Перечисление_СтатусыДокументовУчета();
	
	Если Статусы.ОсновнойСтатус = СтатусыДокументовУчета.Новый Тогда
		Статусы.ОсновнойСтатус = СтатусыДокументовУчета.ВРаботе;
	КонецЕсли;
	
	ТоварыМаркировки.Очистить();
	
	СброситьКодыДокументаИСохранить();
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ПодборТоваровИКодовНаТСД;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,,, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьКнопкиПоискаДля82()
	
	Если Не МодульОбъекта().ВерсияРежимаСовместимостиНиже("8.3") Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.КодыМаркировкиКнопкиПоискаДля82.Видимость = Истина;
	Элементы.АгрегатыКнопкиПоискаДля82.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьКомандФормы()
	
	НастройкаДокумента = МодульОбъекта().НастройкиДокументовУчета_НайтиПоТипуДокумента(ТипДокумента);
	ОписаниеНастройки = МодульОбъекта().НастройкиДокументаУчета_Прочитать(НастройкаДокумента);
	
	Для каждого Эл Из СоответствиеЭлементовИКомандДокументов() Цикл
		Элементы[Эл.Ключ].Видимость = Не МодульОбъекта().МассивСодержитЗначение(ОписаниеНастройки.ОтключенныеКоманды, Эл.Значение);
	КонецЦикла;
	
	РолиДокументов = МодульОбъекта().Перечисление_РолиДокументовУчета();
	ЕстьРольОтгрузка = ДокументуДоступнаРоль(РолиДокументов.Отгрузка);
	ЕстьРольКорректировка = ДокументуДоступнаРоль(РолиДокументов.КорректировкаОтгрузки);
	ЕстьРольПроизводство = ДокументуДоступнаРоль(РолиДокументов.Производство);
	
	Если ЕстьРольОтгрузка Или ЕстьРольКорректировка Тогда
		Элементы.Кнопка_ОтчетПоВиртуальномуСкладу.Видимость = ЕстьТоварСОтражениемВЭДООСУ();
		Элементы.Кнопка_СообщитьОбОтгрузке.Видимость = Истина;
		Элементы.Кнопка_ПроверитьКоды.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьКартинкиКомандФормы()
	
	ОписаниеТарифа = МодульОбъекта().Тариф(Организация);
	
	Для Каждого Элемент Из СоответствиеКомандИТиповОперацийДляПодписок() Цикл
		
		Команда = Элемент.Ключ;
		ТипОперации = Элемент.Значение;
		
		Если ТипОперации = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если МодульОбъекта().СозданиеОперацииОграниченоТарифом(ТипОперации, ОписаниеТарифа) Тогда
			Команда.Картинка = Элементы.КартинкаЗамок.Картинка;
		Иначе
			Команда.Картинка = Элементы.КартинкаПустая.Картинка;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СоответствиеКомандИТиповОперацийДляПодписок()
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(Команды.Коды_Заказать,                      ТипыОпераций.ЗаказКодов);
	
	Результат.Вставить(Команды.Коды_СоздатьОтчетОНанесении,        ТипыОпераций.ОтчетОНанесении);
	Результат.Вставить(Команды.Коды_НаполнитьОтчетОНанесенииНаТСД, ТипыОпераций.ОтчетОНанесенииНаТСД);
	
	Результат.Вставить(Команды.Коды_ВыполнитьВводВОборот,          ТипыОпераций.ВводВОборот);
	Результат.Вставить(Команды.Коды_ВывестиИзОборота,              ТипыОпераций.ВыводИзОборота);
	
	Результат.Вставить(Команды.Коды_ВернутьВОборот,                ТипыОпераций.ВозвратВОборот);
	Результат.Вставить(Команды.Коды_НаполнитьВозвратВОборотНаТСД,  ТипыОпераций.ВозвратВОборотНаТСД);
	
	Результат.Вставить(Команды.Коды_НаполнитьНаборыНаТСД,          ТипыОпераций.НаполнениеНаборовНаТСД);
	Результат.Вставить(Команды.Коды_ЗарегистрироватьНаборы,        ТипыОпераций.РегистрацияНаборов);
	Результат.Вставить(Команды.Коды_РасформироватьНаборы,          ТипыОпераций.РасформированиеНаборов);
	
	Результат.Вставить(Команды.Коды_Агрегировать,                  ТипыОпераций.АгрегацияКодов);
	Результат.Вставить(Команды.Коды_ЗарегистрироватьКИТУ,          ТипыОпераций.РегистрацияАгрегатов);
	Результат.Вставить(Команды.Коды_Разагрегировать,               ТипыОпераций.РасформированиеАгрегатов);
	Результат.Вставить(Команды.Коды_НаполнитьАгрегатыНаТСД,        ТипыОпераций.НаполнениеАгрегатовНаТСД);
	
	Результат.Вставить(Команды.Коды_АгрегироватьКИГУ,              ТипыОпераций.НаполнениеКИГУ);
	Результат.Вставить(Команды.Коды_ЗарегистрироватьКИГУ,          ТипыОпераций.РегистрацияКИГУ);
	
	Результат.Вставить(Команды.Коды_СформироватьАТК,               ТипыОпераций.ФормированиеАТК);
	Результат.Вставить(Команды.Коды_РасформироватьАТК,             ТипыОпераций.РасформированиеАТК);
	
	Результат.Вставить(Команды.Коды_СоздатьОтчетОВыбытии,          ТипыОпераций.ОтчетОВыбытии);
	Результат.Вставить(Команды.Коды_НаполнитьОтчетОВыбытииНаТСД,   ТипыОпераций.ОтчетОВыбытииНаТСД);
	
	Результат = Новый ФиксированноеСоответствие(Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСпискиВыбораЭлементовФормы()
	
	ЗаполнитьСписокВыбораПравилаОтраженияВЭДО();
	ЗаполнитьСписокВыбораВидКорректировки();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораПравилаОтраженияВЭДО()
	
	СписокВыбора = Элементы.ТоварыОтражениеВЭДО.СписокВыбора;
	ПравилаОтраженияВЭДО = Перечисления.КонтурМаркировка_ПравилаОтраженияВЭДО;
	
	ЗначенияСписка = Новый Массив;
	ЗначенияСписка.Добавить(ПравилаОтраженияВЭДО.ОСУ);
	ЗначенияСписка.Добавить(ПравилаОтраженияВЭДО.ПУ);
	ЗначенияСписка.Добавить(ПравилаОтраженияВЭДО.НеОтражать);
	
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораВидКорректировки()
	
	СписокВыбора = Элементы.ВидКорректировки.СписокВыбора;
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, МодульОбъекта().Перечисление_ВидыКорректировкиДокумента());
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УстановитьОформлениеАгрегаты();
	УстановитьОформлениеТоварыДокумента();
	УстановитьОформлениеТоварыМаркировки();
	УстановитьОформлениеОперацииТребуемоеДействие();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеТоварыДокумента()
	
	ТаблицаФормы = Элементы.ТоварыДокумента;
	
	УсловноеОформление_ТоварыДокумента_ТоварНеПодлежитМаркировке(ТаблицаФормы);
	МодульОбъекта().УсловноеОформление_Товары_ТребуетсяЗСН(УсловноеОформление, ТаблицаФормы);
	МодульОбъекта().УсловноеОформление_Товары_НеТребуетсяЗСН(УсловноеОформление, ТаблицаФормы);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеТоварыМаркировки()
	
	ТаблицаФормы = Элементы.ТоварыМаркировки;
	
	УсловноеОформление_ТоварыМаркировки_НеДоступенПартионныйУчет(ТаблицаФормы);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеАгрегаты()
	
	ТаблицаФормы = Элементы.Агрегаты;
	
	УсловноеОформление_Агрегаты_ТолькоПросмотр_СтрокаДокумента(ТаблицаФормы);
	УсловноеОформление_Агрегаты_ПустыеПоляНаУровнеТовара(ТаблицаФормы);
	УсловноеОформление_Агрегаты_АвтоРаспределение(ТаблицаФормы);
	
КонецПроцедуры

&НаСервере
Процедура УсловноеОформление_ТоварыДокумента_ТоварНеПодлежитМаркировке(ТаблицаФормы)
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя);
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".НеПодлежитМаркировке");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(240, 240, 240));
	
КонецПроцедуры

&НаСервере
Процедура УсловноеОформление_ТоварыМаркировки_НеДоступенПартионныйУчет(ТаблицаФормы)
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТоварыМаркировкиНомерПартии");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".ДоступенПартионныйУчет");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Ложь;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не требуется>'"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.ТусклоСерый);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

&НаСервере
Процедура УсловноеОформление_Агрегаты_ТолькоПросмотр_СтрокаДокумента(ТаблицаФормы)
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ЭлементУО.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("АгрегатыСтрокаДокумента");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".УровеньАгрегата");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Ложь;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

&НаСервере
Процедура УсловноеОформление_Агрегаты_ПустыеПоляНаУровнеТовара(ТаблицаФормы)
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ЭлементУО.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("АгрегатыКодМаркировки");
	ЭлементУО.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("АгрегатыСтатусКода");
	ЭлементУО.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("АгрегатыВладелец");
	ЭлементУО.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("АгрегатыНапечатан");
	ЭлементУО.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("АгрегатыСтрокаДокумента");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".УровеньАгрегата");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Ложь;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "");
	
КонецПроцедуры

&НаСервере
Процедура УсловноеОформление_Агрегаты_АвтоРаспределение(ТаблицаФормы)
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ЭлементУО.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("АгрегатыСтрокаДокумента");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".УровеньАгрегата");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".СтрокаДокумента");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "<Авто>");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеОперацииТребуемоеДействие()
	
	ТаблицаФормы = Элементы.СписокОпераций;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЗадачиТребуемоеДействие");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".Активная");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Ложь;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.ТусклоСерый);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьКнопкуОбновленияСтатусовКодов(ОбновлениеСтатусовВыполняется)
	
	Если ОбновлениеСтатусовВыполняется Тогда
		ЗаголовокКнопки = НСтр("ru = 'Обновляются статусы кодов...'");
		ДоступностьКнопки = Ложь;
	Иначе
		ЗаголовокКнопки = НСтр("ru = 'Обновить статусы кодов'");
		ДоступностьКнопки = Истина;
	КонецЕсли;
	
	Элементы.Кнопка_ОбновитьСтатусыКодов.Заголовок = ЗаголовокКнопки;
	Элементы.Кнопка_ОбновитьСтатусыКодов1.Заголовок = ЗаголовокКнопки;
	
	Элементы.Кнопка_ОбновитьСтатусыКодов.Доступность = ДоступностьКнопки;
	Элементы.Кнопка_ОбновитьСтатусыКодов1.Доступность = ДоступностьКнопки;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьКнопкуПроверкиКодов(ПроверкаКодовВыполняется)
	
	Кнопка = Элементы.Кнопка_ПроверитьКоды;
	
	Если ПроверкаКодовВыполняется Тогда
		ЗаголовокКнопки = НСтр("ru = 'Выполняется проверка кодов...'");
		ДоступностьКнопки = Ложь;
	Иначе
		ЗаголовокКнопки = НСтр("ru = 'Проверить коды'");
		ДоступностьКнопки = Истина;
	КонецЕсли;
	
	Кнопка.Заголовок = ЗаголовокКнопки;
	Кнопка.Доступность = ДоступностьКнопки;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьСписокКодыМаркировки()
	
	КодыМаркировки.ТекстЗапроса = ТекстЗапросаКодыМаркировки();
	
	КодыМаркировки.Параметры.УстановитьЗначениеПараметра("ПустаяДата", '00010101');
	КодыМаркировки.Параметры.УстановитьЗначениеПараметра("ДокументУчета", Ссылка);
	КодыМаркировки.Параметры.УстановитьЗначениеПараметра("ПоказатьСписанные", Элементы.Кнопка_ПоказатьСписанныеКоды.Пометка);
	КодыМаркировки.Параметры.УстановитьЗначениеПараметра("ПустойКонтрагент", Справочники.КонтурМаркировка_Контрагенты.ПустаяСсылка());
	КодыМаркировки.Параметры.УстановитьЗначениеПараметра("СтатусКода_Списан", МодульОбъекта().Перечисление_СтатусыКодов().Списан);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСпискиКодовИАгрегатов()
	
	ОбновитьСписокКодовМаркировки();
	ОбновитьСписокАгрегатов();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокКодовМаркировки()
	
	ЗаполнитьКоличествоКодов();
	ЗаполнитьКоличествоЗаводскихСерийныхНомеров();
	
	Элементы.КодыМаркировки.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокАгрегатовПослеОткрытияВкладки() Экспорт
	
	ОбновитьСписокАгрегатов();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокАгрегатов()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТоварыДокумента.ПредставлениеСтроки КАК СтрокаДокумента,
	|	КодыМаркировки.КодМаркировки КАК КодМаркировки,
	|	ЕСТЬNULL(ТоварыАгрегатов.Товар, ИнформацияОКодах.Товар) КАК Товар,
	|	ЕСТЬNULL(ТоварыАгрегатов.КлючНоменклатуры1С, ИнформацияОКодах.КлючНоменклатуры1С) КАК КлючНоменклатуры1С,
	|	ЕСТЬNULL(ТоварыАгрегатов.КоличествоУпаковок, 0) КАК КоличествоУпаковок,
	|	КодыДокументов.КлючКода КАК КлючКода,
	|	КодыДокументов.КлючСтрокиДокумента КАК КлючСтрокиДокумента,
	|	СтатусыКодов.Владелец КАК Владелец,
	|	СтатусыКодов.Статус КАК СтатусКода,
	|	ВЫБОР
	|		КОГДА ИнформацияОКодах.ДатаПечати > &ПустаяДата
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Напечатан,
	|	ЛОЖЬ КАК УровеньАгрегата,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТоварыДокумента.КлючСтрокиДокумента, &ПустойКлюч) = &ПустойКлюч
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьСтрокаДокумента
	|ИЗ
	|	РегистрСведений.КонтурМаркировка_КодыДокументов КАК КодыДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтурМаркировка_ДокументыУчета.ТоварыДокумента КАК ТоварыДокумента
	|		ПО КодыДокументов.КлючСтрокиДокумента = ТоварыДокумента.КлючСтрокиДокумента
	|			И (ТоварыДокумента.Ссылка = &ДокументУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_ТоварыАгрегатов КАК ТоварыАгрегатов
	|		ПО КодыДокументов.КлючКода = ТоварыАгрегатов.КлючКода
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_КодыМаркировки КАК КодыМаркировки
	|		ПО КодыДокументов.КлючКода = КодыМаркировки.КлючКода
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_СвязиКлючейКодов КАК СвязиКлючейКодов
	|		ПО КодыДокументов.КлючКода = СвязиКлючейКодов.КлючКода
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_ИнформацияОКодах КАК ИнформацияОКодах
	|		ПО (СвязиКлючейКодов.КлючИнформацииОКоде = ИнформацияОКодах.КлючИнформацииОКоде)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_СтатусыКодовГИСМТ КАК СтатусыКодов
	|		ПО (СвязиКлючейКодов.КлючСтатусаКода = СтатусыКодов.КлючСтатусаКода)
	|ГДЕ
	|	КодыДокументов.ДокументУчета = &ДокументУчета
	|	И ИнформацияОКодах.ОбщийТипУпаковки = &ТранспортнаяУпаковка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЕстьСтрокаДокумента УБЫВ,
	|	СтрокаДокумента,
	|	КодМаркировки
	|ИТОГИ
	|	МАКСИМУМ(ЕстьСтрокаДокумента),
	|	МАКСИМУМ(СтрокаДокумента),
	|	МАКСИМУМ(КодМаркировки),
	|	СУММА(КоличествоУпаковок),
	|	МАКСИМУМ(КлючСтрокиДокумента),
	|	МАКСИМУМ(Владелец),
	|	МАКСИМУМ(СтатусКода),
	|	МАКСИМУМ(Напечатан)
	|ПО
	|	КлючКода");
	
	Запрос.УстановитьПараметр("ДокументУчета", Ссылка);
	Запрос.УстановитьПараметр("ПустаяДата", МодульОбъекта().ПустаяДата());
	Запрос.УстановитьПараметр("ПустойКлюч", МодульОбъекта().ПустойУникальныйИдентификатор());
	Запрос.УстановитьПараметр("ТранспортнаяУпаковка", Перечисления.КонтурМаркировка_ОбщиеТипыУпаковок.ТранспортнаяУпаковка);
	
	АгрегатыСТоварами = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	Для Каждого СтрАгрегата Из АгрегатыСТоварами.Строки Цикл
		СтрАгрегата.УровеньАгрегата = Истина;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(АгрегатыСТоварами, "Агрегаты");
	
	ПосчитатьКоличествоСтрокТаблицФормы();
	
	СписокАгрегатовЗаполнен = Истина;
	
КонецПроцедуры

&НаСервере
Функция СоответствиеЭлементовИКомандДокументов()
	
	НаборКоманд = МодульОбъекта().Перечисление_КомандыДокумента();
	
	Результат = Новый Соответствие;
	Результат.Вставить("Кнопка_ЗаказатьКоды",         НаборКоманд.ЗаказКодов);
	Результат.Вставить("Кнопка_ПодобратьКодыИзПула",  НаборКоманд.ПодборСвободныхОстатков);
	Результат.Вставить("Кнопка_НаполнитьКодамиНаТСД", НаборКоманд.НаполнитьНаТСД);
	
	Результат.Вставить("Кнопка_НаполнитьКодамиНаТСДНачатьРаботу",               НаборКоманд.НаполнитьНаТСДНачатьРаботу);
	Результат.Вставить("Кнопка_НаполнитьКодамиИзВнешнегоИсточникаНачатьРаботу", НаборКоманд.НаполнитьКодамиИзВнешнегоИсточникаНачатьРаботу);
	Результат.Вставить("Кнопка_НаполнитьКодамиИзДругогоДокументаНачатьРаботу",  НаборКоманд.НаполнитьКодамиИзДругогоДокументаНачатьРаботу);
	Результат.Вставить("Кнопка_НаполнитьКодамиИзФайловНачатьРаботу",            НаборКоманд.НаполнитьКодамиИзФайловНачатьРаботу);
	
	Результат.Вставить("Кнопка_НаполнитьКодамиИзВнешнегоИсточника",    НаборКоманд.НаполнитьКодамиИзВнешнегоИсточника);
	Результат.Вставить("Кнопка_НаполнитьКодамиИзДругогоДокумента",     НаборКоманд.НаполнитьКодамиИзДругогоДокумента);
	Результат.Вставить("Кнопка_НаполнитьКодамиИзДокументаОснования",   НаборКоманд.НаполнитьКодамиИзОснования);
	Результат.Вставить("Кнопка_НаполнитьКодамиИзВходящегоУПД",         НаборКоманд.НаполнитьКодамиИзВходящегоУПД);
	Результат.Вставить("Кнопка_НаполнитьКодамиИзФайлов",               НаборКоманд.НаполнитьКодамиИзФайлов);
	Результат.Вставить("Кнопка_НаполнитьКодамиИзТабличногоДокумента",  НаборКоманд.НаполнитьКодамиИзТабличногоДокумента);
	Результат.Вставить("Кнопка_НаполнитьАгрегамиИзДокументаОснования", НаборКоманд.НаполнитьАгрегатамиИзОснования);
	
	Результат.Вставить("Кнопка_НапечататьЭтикетки",            НаборКоманд.ПечатьКодов);
	Результат.Вставить("Кнопка_НапечататьЭтикетки1",           НаборКоманд.ПечатьКодов);
	Результат.Вставить("Кнопка_СоздатьОтчетОНанесении",        НаборКоманд.ОтчетОНанесении);
	Результат.Вставить("Кнопка_СоздатьОтчетОНанесении1",       НаборКоманд.ОтчетОНанесении);
	Результат.Вставить("Кнопка_НаполнитьОтчетОНанесенииНаТСД", НаборКоманд.ОтчетОНанесенииНаТСД);
	Результат.Вставить("Кнопка_НаполнитьОтчетОНанесенииНаТСД1", НаборКоманд.ОтчетОНанесенииНаТСД);
	Результат.Вставить("Кнопка_ВвестиВОборот",                 НаборКоманд.ВводВоборот);
	Результат.Вставить("Кнопка_ВвестиВОборот1",                НаборКоманд.ВводВоборот);
	Результат.Вставить("Кнопка_ВывестиИзОборота",              НаборКоманд.ВыводИзОборота);
	Результат.Вставить("Кнопка_ВывестиИзОборота1",             НаборКоманд.ВыводИзОборота);
	Результат.Вставить("Кнопка_ВернутьВОборот",                НаборКоманд.ВозвратВОборот);
	Результат.Вставить("Кнопка_ВернутьВОборот1",               НаборКоманд.ВозвратВОборот);
	Результат.Вставить("Кнопка_НаполнитьВозвратВОборотНаТСД",  НаборКоманд.ВозвратВОборотНаТСД);
	Результат.Вставить("Кнопка_НаполнитьВозвратВОборотНаТСД1", НаборКоманд.ВозвратВОборотНаТСД);
	Результат.Вставить("Кнопка_СоздатьОтчетОВыбытии",          НаборКоманд.ОтчетОВыбытии);
	Результат.Вставить("Кнопка_СоздатьОтчетОВыбытии1",         НаборКоманд.ОтчетОВыбытии);
	Результат.Вставить("Кнопка_КорректироватьСведения",        НаборКоманд.КорректировкаСведений);
	Результат.Вставить("Кнопка_УведомитьОСостоянииКодов",      НаборКоманд.УведомлениеОСостоянииКодов);
	Результат.Вставить("Кнопка_НаполнитьОтчетОВыбытииНаТСД",   НаборКоманд.ОтчетОВыбытииНаТСД);
	Результат.Вставить("Кнопка_НаполнитьОтчетОВыбытииНаТСД1",  НаборКоманд.ОтчетОВыбытииНаТСД);
	Результат.Вставить("Кнопка_АгрегироватьКоды",              НаборКоманд.АгрегацияКоды);
	Результат.Вставить("Кнопка_АгрегироватьКоды1",             НаборКоманд.АгрегацияКоды);
	Результат.Вставить("Кнопка_ЗарегистрироватьКИТУ",          НаборКоманд.ЗарегистрироватьКИТУ);
	Результат.Вставить("Кнопка_ЗарегистрироватьКИТУ1",         НаборКоманд.ЗарегистрироватьКИТУ);
	Результат.Вставить("Кнопка_РасформироватьКИТУ",            НаборКоманд.РасформироватьКИТУ);
	Результат.Вставить("Кнопка_РасформироватьКИТУ1",           НаборКоманд.РасформироватьКИТУ);
	Результат.Вставить("Кнопка_НаполнитьАгрегатыНаТСД",        НаборКоманд.НаполнитьАгрегатыНаТСД);
	Результат.Вставить("Кнопка_НаполнитьАгрегатыНаТСД1",       НаборКоманд.НаполнитьАгрегатыНаТСД);
	Результат.Вставить("Кнопка_СохранитьКодыВФайлCSV",         НаборКоманд.СохранитьКодыВФайлCSV);
	Результат.Вставить("Кнопка_СохранитьКодыВФайлCSV1",         НаборКоманд.СохранитьКодыВФайлCSV);
	Результат.Вставить("Кнопка_СохранитьКодыВФайлXLS",         НаборКоманд.СохранитьКодыВФайлXLS);
	Результат.Вставить("Кнопка_СохранитьКодыВФайлXLS1",         НаборКоманд.СохранитьКодыВФайлXLS);
	Результат.Вставить("Кнопка_НаполнитьНаборыНаТСД",          НаборКоманд.НаполнитьНаборыНаТСД);
	Результат.Вставить("Кнопка_ЗарегистрироватьНаборы",        НаборКоманд.ЗарегистрироватьНаборы);
	Результат.Вставить("Кнопка_АгрегироватьКИГУ",              НаборКоманд.АгрегироватьКИГУ);
	Результат.Вставить("Кнопка_ЗарегистрироватьКИГУ",          НаборКоманд.ЗарегистрироватьКИГУ);
	Результат.Вставить("Кнопка_СформироватьАТК",               НаборКоманд.СформироватьАТК);
	Результат.Вставить("Кнопка_РасформироватьАТК",             НаборКоманд.РасформироватьАТК);
	Результат.Вставить("Кнопка_РасформироватьНаборы",          НаборКоманд.РасформироватьНаборы);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура УстановитьОтборПоказатьСписанныеКодыМаркировки()
	
	КодыМаркировки.Параметры.УстановитьЗначениеПараметра("ПоказатьСписанные"
	, Элементы.Кнопка_ПоказатьСписанныеКоды.Пометка);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьЭлементовФормы(ПриСозданииНаСервере = Ложь)
	
	Если ПриСозданииНаСервере Тогда
		
		Если МодульОбъекта().ДокументУчета_ЕстьРолиДляСведенийОМаркировке(Ссылка) Тогда
			Элементы.ТоварыОтражениеВЭДО.Видимость = Истина;
		КонецЕсли;
		
		Если МодульОбъекта().ДокументУчета_ЕстьРольКорректировкаОтгрузки(Ссылка) Тогда
			Элементы.ГруппаКорректировка.Видимость = Истина;
			Элементы.Кнопка_НаполнитьКодамиИзИсправляемогоДокумента.Видимость = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	СтатусыДокументовУчета = МодульОбъекта().Перечисление_СтатусыДокументовУчета();
	
	Элементы.ТоварыНоменклатура.Ширина = 10;
	
	Элементы.Документ1С.Видимость = ЗначениеЗаполнено(Документ1С);
	
	ТребуютсяЗСН = ТоварыДокумента_ТребуютсяЗаводскиеСерийныеНомера(ЭтаФорма);
	ДоступенПартионныйУчет = ТоварыМаркировки_ДоступенПартионныйУчет(ЭтаФорма);
	
	УстановитьТолькоПросмотр(Ложь);
	
	Если Статусы.ОсновнойСтатус = СтатусыДокументовУчета.Новый Тогда
		
		Элементы.Кнопка_НачатьРаботу.КнопкаПоУмолчанию		= Истина;
		Элементы.Кнопка_НачатьРаботу.Видимость				= Истина;
		
		Элементы.Кнопка_Перезаполнить.Видимость				= ЗначениеЗаполнено(Документ1С);
		Элементы.Кнопка_НеПодлежитМаркировке.Видимость		= Истина;
		Элементы.Кнопка_ЗавершитьРаботу.Видимость			= Ложь;
		Элементы.Кнопка_Записать.Видимость					= Истина;
		Элементы.Кнопка_ВозобновитьРаботу.Видимость			= Ложь;
		
		Элементы.ГруппаТоваровМаркировки.ТолькоПросмотр = Ложь;
		Элементы.ТоварыМаркировкиГруппаКнопок.Доступность = Истина;
		
		Элементы.Закладка_Операции.Видимость = Ложь;
		
		Элементы.Меню_ПодобратьКодыНачатьРаботу.Видимость = Истина;
		Элементы.Меню_ПодобратьКоды.Видимость = Ложь;
		Элементы.Меню_УдалитьКоды.Видимость = Ложь;
		Элементы.Кнопка_ВыполнитьОбмен.Видимость = Ложь;
		Элементы.Кнопка_ОбновитьЗадачи.Видимость = Ложь;
		Элементы.Закладка_КодыМаркировки.Видимость = Ложь;
		Элементы.Закладка_Агрегаты.Видимость = Ложь;
		Элементы.Кнопка_СообщитьОбОтгрузке.Видимость = Ложь;
		Элементы.ТоварыКоличествоКодов.Видимость = Ложь;
		Элементы.ТоварыКоличествоУпаковок.ТолькоПросмотр = Ложь;
		Элементы.ТоварыКоличествоЗСН.Видимость = Ложь;
		Элементы.КодыМаркировкиЗаводскойСерийныйНомер.Видимость = Ложь;
		Элементы.КодыМаркировкиНомерПартии.Видимость = ДоступенПартионныйУчет;
		Элементы.Кнопка_ДобавитьЗСН.Видимость = Ложь;
		Элементы.ТоварыМаркировкиНомерПартии.Видимость = Ложь;
		Элементы.Кнопка_ПроверитьКоды.Видимость = Ложь;
		
	ИначеЕсли Статусы.ОсновнойСтатус = СтатусыДокументовУчета.Пропущен Тогда
		
		Элементы.Кнопка_НачатьРаботу.Видимость				= Ложь;
		Элементы.Кнопка_Перезаполнить.Видимость				= Ложь;
		Элементы.Кнопка_НеПодлежитМаркировке.Видимость = Ложь;
		Элементы.Кнопка_ЗавершитьРаботу.Видимость			= Ложь;
		Элементы.Кнопка_Записать.Видимость					= Ложь;
		Элементы.Кнопка_ВозобновитьРаботу.Видимость			= Истина;
		
		Элементы.ГруппаТоваровМаркировки.ТолькоПросмотр = Истина;
		Элементы.ТоварыМаркировкиГруппаКнопок.Доступность = Ложь;
		
		Элементы.Закладка_Операции.Видимость = Ложь;
		
		Элементы.Меню_ПодобратьКодыНачатьРаботу.Видимость = Ложь;
		Элементы.Меню_ПодобратьКоды.Видимость = Ложь;
		Элементы.Меню_УдалитьКоды.Видимость = Ложь;
		Элементы.Кнопка_ВыполнитьОбмен.Видимость = Ложь;
		Элементы.Кнопка_ОбновитьЗадачи.Видимость = Ложь;
		Элементы.Закладка_КодыМаркировки.Видимость = Ложь;
		Элементы.Закладка_Агрегаты.Видимость = Ложь;
		Элементы.Кнопка_СообщитьОбОтгрузке.Видимость = Ложь;
		Элементы.ТоварыКоличествоКодов.Видимость = Ложь;
		Элементы.ТоварыКоличествоУпаковок.ТолькоПросмотр = Ложь;
		Элементы.ТоварыКоличествоЗСН.Видимость = Ложь;
		Элементы.КодыМаркировкиЗаводскойСерийныйНомер.Видимость = Ложь;
		Элементы.Кнопка_ДобавитьЗСН.Видимость = Ложь;
		Элементы.ТоварыМаркировкиНомерПартии.Видимость = Ложь;
		Элементы.Кнопка_ПроверитьКоды.Видимость = Ложь;
		
	ИначеЕсли Статусы.ОсновнойСтатус = СтатусыДокументовУчета.ВРаботе Тогда
		
		Элементы.Кнопка_НачатьРаботу.Видимость				= Ложь;
		Элементы.Кнопка_Перезаполнить.Видимость				= ЗначениеЗаполнено(Документ1С);
		Элементы.Кнопка_НеПодлежитМаркировке.Видимость = Ложь;
		Элементы.Кнопка_ЗавершитьРаботу.Видимость			= Истина;
		Элементы.Кнопка_Записать.Видимость					= Истина;
		Элементы.Кнопка_ВозобновитьРаботу.Видимость			= Ложь;
		
		Элементы.Кнопка_ЗавершитьРаботу.КнопкаПоУмолчанию = Истина;
		
		Элементы.КодыМаркировки.ТолькоПросмотр = Ложь;
		
		Элементы.ГруппаТоваровМаркировки.ТолькоПросмотр = Ложь;
		Элементы.ТоварыМаркировкиГруппаКнопок.Доступность = Истина;
		
		Элементы.Закладка_Операции.Видимость = Истина;
		
		Элементы.Меню_ПодобратьКодыНачатьРаботу.Видимость = Ложь;
		Элементы.Меню_ПодобратьКоды.Видимость = Истина;
		Элементы.Меню_УдалитьКоды.Видимость = Истина;
		Элементы.Кнопка_ВыполнитьОбмен.Видимость = Истина;
		Элементы.Кнопка_ОбновитьЗадачи.Видимость = Истина;
		Элементы.Закладка_КодыМаркировки.Видимость = Истина;
		Элементы.Закладка_Агрегаты.Видимость = Истина;
		Элементы.ТоварыКоличествоКодов.Видимость = Истина;
		Элементы.ТоварыКоличествоУпаковок.ТолькоПросмотр = Истина;
		Элементы.Меню_ОперацииСКодами.Видимость = Истина;
		Элементы.Меню_ОперацииСАгрегатами.Видимость = Истина;
		Элементы.КодыМаркировкиЗаводскойСерийныйНомер.Видимость = ТребуютсяЗСН;
		Элементы.ТоварыКоличествоЗСН.Видимость = ТребуютсяЗСН;
		Элементы.Кнопка_ДобавитьЗСН.Видимость = ТребуютсяЗСН;
		Элементы.ТоварыМаркировкиНомерПартии.Видимость = ДоступенПартионныйУчет;
		Элементы.КодыМаркировкиНомерПартии.Видимость = ДоступенПартионныйУчет;
		
	ИначеЕсли Статусы.ОсновнойСтатус = СтатусыДокументовУчета.Завершен Тогда
		
		УстановитьТолькоПросмотр(Истина);
		
		Элементы.Кнопка_НачатьРаботу.Видимость = Ложь;
		Элементы.Кнопка_Перезаполнить.Видимость = Ложь;
		Элементы.Кнопка_НеПодлежитМаркировке.Видимость = Ложь;
		Элементы.Кнопка_ЗавершитьРаботу.Видимость = Ложь;
		Элементы.Кнопка_Записать.Видимость = Ложь;
		Элементы.Кнопка_ВозобновитьРаботу.Видимость = Истина;
		
		Элементы.КодыМаркировки.ТолькоПросмотр = Истина;
		
		Элементы.ГруппаТоваровМаркировки.ТолькоПросмотр = Истина;
		Элементы.ТоварыМаркировкиГруппаКнопок.Доступность = Ложь;
		Элементы.ТоварыКоличествоЗСН.Видимость = ТребуютсяЗСН;
		Элементы.КодыМаркировкиЗаводскойСерийныйНомер.Видимость = ТребуютсяЗСН;
		Элементы.ТоварыМаркировкиНомерПартии.Видимость = ДоступенПартионныйУчет;
		Элементы.КодыМаркировкиНомерПартии.Видимость = ДоступенПартионныйУчет;
		
		Элементы.Меню_ПодобратьКодыНачатьРаботу.Видимость = Ложь;
		Элементы.Меню_ПодобратьКоды.Видимость = Ложь;
		Элементы.Меню_УдалитьКоды.Видимость = Ложь;
		Элементы.Кнопка_ВыполнитьОбмен.Видимость = Ложь;
		Элементы.Кнопка_ОбновитьЗадачи.Видимость = Ложь;
		Элементы.Меню_ОперацииСКодами.Видимость = Ложь;
		Элементы.Меню_ОперацииСАгрегатами.Видимость = Ложь;
		Элементы.Кнопка_ДобавитьЗСН.Видимость = Ложь;
		
		Элементы.Кнопка_СообщитьОбОтгрузке.Видимость = Ложь;
		Элементы.Кнопка_ПроверитьКоды.Видимость = Ложь;
		
	Иначе
		ВызватьИсключение НСтр("ru = 'Документ учета имеет неизвестный статус: '") + Статусы.ОсновнойСтатус;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТоварыДокумента) Тогда
		УстановитьВидимостьКолонкиТоваров("Характеристика");
		УстановитьВидимостьКолонкиТоваров("Упаковка");
		УстановитьВидимостьКолонкиТоваров("Серия");
		УстановитьВидимостьКолонкиТоваров("Цена");
		УстановитьВидимостьКолонкиТоваров("КоличествоКодовСписано");
	КонецЕсли;
	
	Если ВыполняетсяОбновлениеДанных Тогда
		УстановитьТолькоПросмотр(Истина);
	КонецЕсли;
	
	РежимТехническогоСпециалиста = МодульОбъекта().ВключенРежимТехническогоСпециалиста();
	НастроитьВидимостьПодменюТехническогоСпециалиста(РежимТехническогоСпециалиста);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКолонкиТоваров(ИмяКолонки)
	
	ЕстьЗначения = Ложь;
	
	Для Каждого Стр ИЗ ТоварыДокумента Цикл
		Если ЗначениеЗаполнено(Стр[ИмяКолонки]) Тогда
			ЕстьЗначения = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Элементы["Товары"+ИмяКолонки].Видимость = ЕстьЗначения;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТолькоПросмотр(Значение)
	
	ЭтаФорма.ТолькоПросмотр = Значение;
	Элементы.Закладка_Агрегаты.ТолькоПросмотр = Значение;
	Элементы.Закладка_КодыМаркировки.ТолькоПросмотр = Значение;
	Элементы.Закладка_Дополнительно.ТолькоПросмотр = Значение;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьПодменюТехническогоСпециалиста(РежимТехническогоСпециалиста)
	
	Элементы.Группа_ФункцииТехническогоСпециалиста.Видимость = РежимТехническогоСпециалиста;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКнопкиПоказатьСписанные(Значение)
	
	Элементы.Кнопка_ПоказатьСписанныеКоды.Видимость = Значение;
	
КонецПроцедуры

&НаКлиенте
Функция СписокСтрокДокумента()
	
	Результат = Новый СписокЗначений;
	
	Результат.Добавить(Неопределено, "<Очистить>");
	
	Для Каждого Стр Из ТоварыДокумента Цикл
		Если Стр.НеПодлежитМаркировке = Ложь Тогда
			Результат.Добавить(Стр.КлючСтрокиДокумента, Стр.ПредставлениеСтроки);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЕстьКодыВДокументе()
	
	Возврат МодульОбъекта().КодыДокументов_ЕстьКоды(Ссылка);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция КоличествоУпаковокТоваровМаркировки(КлючСтрокиДокумента, Форма)
	
	МассивСтрок = Форма.ТоварыМаркировки.НайтиСтроки(Новый Структура("КлючСтрокиДокумента", КлючСтрокиДокумента));
	
	Результат = 0;
	Для Каждого Стр Из МассивСтрок Цикл
		Результат = Результат + Стр.КоличествоУпаковок;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция СтрокаДокументаПоКлючуСтроки(КлючСтрокиДокумента)
	
	МассивСтрок = ТоварыДокумента.НайтиСтроки(Новый Структура("КлючСтрокиДокумента", КлючСтрокиДокумента));
	
	Если Не ЗначениеЗаполнено(МассивСтрок) Тогда
		ТекстОшибки = НСтр("ru = 'Не удалось найти строку документа по ключу: '") + КлючСтрокиДокумента;
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Возврат МассивСтрок[0];
	
КонецФункции

&НаКлиенте
Процедура ОбновитьТекстОстатка()
	
	ТекСтрока = Элементы.ТоварыДокумента.ТекущиеДанные;
	
	Если НЕ ТекСтрока = Неопределено Тогда
		
		Если ТекСтрока.НеПодлежитМаркировке Тогда
			
			ТекстОстатокПодбора = "Номенклатура не подлежит маркировке";
			//Элементы.ТекстОстатокПодбора.ЦветТекста = Новый Цвет(51,51,51);
			//Элементы.ТекстОстатокПодбора.ЦветФона = Новый Цвет(240,240,240);
			
			Элементы.ТоварыМаркировки.ТолькоПросмотр = Истина;
			Элементы.Кнопка_НайтиТоварПоРеквизитам.Доступность = Ложь;
			
		Иначе
			
			Остаток = ТекСтрока.КоличествоУпаковок - ТекСтрока.КоличествоПодобрано;
			Если Остаток > 0 Тогда
				ТекстОстатокПодбора = "Осталось подобрать: "+Остаток;
				//Элементы.ТекстОстатокПодбора.ЦветТекста = Новый Цвет(83,106,194);
				//Элементы.ТекстОстатокПодбора.ЦветФона = Новый Цвет(255,255,255);
			ИначеЕсли Остаток < 0 Тогда
				ТекстОстатокПодбора = "Уберите лишний товар: "+(-1*Остаток);
				//Элементы.ТекстОстатокПодбора.ЦветТекста = Новый Цвет(255,0,0);
				//Элементы.ТекстОстатокПодбора.ЦветФона = Новый Цвет(255,240,240);
			Иначе
				ТекстОстатокПодбора = "Товары подобраны";
				//Элементы.ТекстОстатокПодбора.ЦветТекста = Новый Цвет(47,80,80);
				//Элементы.ТекстОстатокПодбора.ЦветФона = Новый Цвет(240,255,240);
			КонецЕсли;
			
			Элементы.ТоварыМаркировки.ТолькоПросмотр = Ложь;
			Элементы.Кнопка_НайтиТоварПоРеквизитам.Доступность = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТекстСообщенияОбОшибке()
	
	ТекущиеДанные = Элементы.ТоварыДокумента.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		ТекстСообщениеОбОшибке = "";
	Иначе
		ТекстСообщениеОбОшибке = ТекущиеДанные.СообщениеобОшибке;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьСоообщениеОбОшибкеВСтроке(СтрокаДокумента)
	
	СтрокаДокумента.СообщениеОбОшибке = "";
	СтрокаДокумента.ИндексКартинки = -1;
	
КонецПроцедуры

&НаКлиенте
Процедура Записать()
	
	Если Не МодульКлиента().ПроверитьУстановленнуюВерсиюМодуля() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьЗаполнениеРеквизитов() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьНаСервере();
	
	Оповестить("КонтурМаркировка_ДокументУчета_Изменен", Ссылка);
	
	ОповеститьОбИзменении(Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьКодыДокументаИСохранить()
	
	ДокументУчета_СброситьКодыИСохранитьНаСервере();
	
	Модифицированность = Ложь;
	
	Оповестить("КонтурМаркировка_ДокументУчета_Изменен", Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ДокументУчета_СброситьКодыИСохранитьНаСервере()
	
	МодульОбъекта().КодыДокументов_Записать(МодульОбъекта().Новый_ТаблицаКодов(), Ссылка);
	
	ЗаписатьНаСервере();
	
	НастроитьВидимостьКомандФормы();
	НастроитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Функция ДокументУчета_СодержитАнтисептикиОСУ(КлючСтрокиДокумента = Неопределено)
	
	Результат = Ложь;
	ПравилаОтраженияВЭДО = МодульОбъекта().Перечисление_ПравилаОтраженияВЭДО();
	
	Отбор = Новый Структура("ОтражениеВЭДО, КлючСтрокиДокумента", ПравилаОтраженияВЭДО.ОСУ, "");
	
	Для Каждого СтрДок Из ТоварыМаркировки Цикл
		
		Если Не МодульОбъекта().ЭтоТоварАнтисептикиГруппаПлатности1(СтрДок.Товар) Тогда
			Продолжить;
		КонецЕсли;
		
		Отбор.КлючСтрокиДокумента = СтрДок.КлючСтрокиДокумента;
		ТоварыСтроки = ТоварыДокумента.НайтиСтроки(Отбор);
		
		Если ЗначениеЗаполнено(ТоварыСтроки) Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПроверитьЗаполнениеПолей(Знач ОписаниеДокумента = Неопределено)
	
	Если ОписаниеДокумента = Неопределено Тогда
		ОписаниеДокумента = ОписаниеДокументаПоДаннымФормы();
	КонецЕсли;
	
	ОшибкиЗаполнения = МодульОбъекта().ДокументУчета_ПроверитьЗаполнениеПолей(ОписаниеДокумента);
	МодульОбъекта().СообщитьОбОшибкахЗаполнения(ЭтаФорма, ОшибкиЗаполнения);
	
	Возврат Не ЗначениеЗаполнено(ОшибкиЗаполнения);
	
КонецФункции

&НаКлиенте
Процедура СообщитьОбОшибкахЗаполнения(ОшибкиЗаполнения)
	
	Для Каждого ОписаниеОшибки Из ОшибкиЗаполнения Цикл
		Если ЗначениеЗаполнено(ОписаниеОшибки.ИмяТаблицы) Тогда
			ТаблицаФормы = Элементы[ОписаниеОшибки.ИмяТаблицы];
			ИндексСтроки = ОписаниеОшибки.НомерСтроки - 1;
			МодульКлиента().СообщитьОбОшибкеВСтрокеТабЧасти(ОписаниеОшибки.ТекстОшибки
			, УникальныйИдентификатор, ТаблицаФормы, ОписаниеОшибки.ИмяПоля, ИндексСтроки);
		Иначе
			МодульКлиента().СообщитьПользователюЛок(ОписаниеОшибки.ТекстОшибки, УникальныйИдентификатор, ОписаниеОшибки.ИмяПоля);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	ОписаниеДокумента = ОписаниеДокументаПоДаннымФормы();
	
	НачатьТранзакцию(МодульОбъекта().РежимУправленияБлокировкой());
	
	Попытка
		
		СохранитьСвязиНоменклатуры();
		СохранитьКоэффициентыПересчета();
		
		МодульОбъекта().ДокументУчета_Записать(ОписаниеДокумента);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		Ошибка = ИнформацияОбОшибке();
		ВызватьИсключение;
	КонецПопытки;
	
	ЗаполнитьКонтекстФормы();
	
	ПроверитьТоварыМаркировки();
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Функция ОписаниеДокументаПоДаннымФормы()
	
	Результат = МодульОбъекта().Новый_ДокументУчета();
	
	ЗаполнитьЗначенияСвойств(Результат, ЭтаФорма, , "ТоварыДокумента, ТоварыМаркировки");
	ЗаполнитьЗначенияСвойств(Результат.ДопРеквизиты, ЭтаФорма);
	
	Для Каждого Стр Из ТоварыДокумента Цикл
		ЗаполнитьЗначенияСвойств(Результат.ТоварыДокумента.Добавить(), Стр);
	КонецЦикла;
	
	Для Каждого Стр Из ТоварыМаркировки Цикл
		СтрокиДок = ТоварыДокумента.НайтиСтроки(Новый Структура("КлючСтрокиДокумента", Стр.КлючСтрокиДокумента));
		Если ЗначениеЗаполнено(СтрокиДок) И СтрокиДок[0].НеПодлежитМаркировке = Ложь Тогда
			ЗаполнитьЗначенияСвойств(Результат.ТоварыМаркировки.Добавить(), Стр);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПроверитьВозможностьЗавершитьРаботу()
	
	ЕстьОшибки = Ложь;
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	ОперацииПечати = МодульОбъекта().ДокументУчета_СписокОпераций(Ссылка, ТипыОпераций.ПечатьКодов);
	Если ЗначениеЗаполнено(ОперацииПечати) Тогда
		Ошибка = МодульОбъекта().Новый_ОшибкаЗаполнения("СписокОпераций");
		Ошибка.ТекстОшибки = НСтр("ru = 'Необходимо завершить операции печати'");
		МодульОбъекта().СообщитьОбОшибкахЗаполнения(ЭтаФорма, Ошибка);
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	ОписаниеДокумента = ОписаниеДокументаПоДаннымФормы();
	
	Если Не ПроверитьЗаполнениеПолей(ОписаниеДокумента) Тогда
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если Не ПроверитьТоварыМаркировки(ОписаниеДокумента) Тогда
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если МодульОбъекта().ДокументУчета_ЕстьРольКорректировкаОтгрузки(ОписаниеДокумента)
		И Не МодульОбъекта().ДокументУчета_ПроверитьСопоставлениеКодов(Ссылка) Тогда
		Ошибка = МодульОбъекта().Новый_ОшибкаЗаполнения("КодыМаркировки");
		Ошибка.ТекстОшибки = НСтр("ru = 'Не все коды сопоставлены со строками документа. Выполните сопоставление и затем завершите работу с документом'");
		МодульОбъекта().СообщитьОбОшибкахЗаполнения(ЭтаФорма, Ошибка);
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Возврат Не ЕстьОшибки;
	
КонецФункции

&НаСервере
Функция ПроверитьТоварыМаркировки(Знач ОписаниеДокумента = Неопределено)
	
	Если ОписаниеДокумента = Неопределено Тогда
		ОписаниеДокумента = ОписаниеДокументаПоДаннымФормы();
	КонецЕсли;
	
	ЕстьОшибки = Ложь;
	
	ОшибкиGTIN = МодульОбъекта().ДокументУчета_ПроверитьТоварыМаркировки(ОписаниеДокумента);
	Для Каждого СтрокаДокумента Из ТоварыДокумента Цикл
		
		ОписаниеОшибки = МодульОбъекта().МассивСтруктур_Найти(ОшибкиGTIN, СтрокаДокумента.НомерСтроки, "НомерСтроки");
		
		Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			СтрокаДокумента.СообщениеОбОшибке = ОписаниеОшибки.ТекстОшибки;
			СтрокаДокумента.ИндексКартинки = 2;
			ЕстьОшибки = Истина;
		Иначе
			ОчиститьСоообщениеОбОшибкеВСтроке(СтрокаДокумента);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьОшибки Тогда
		МодульОбъекта().Метрика_Функциональность_ОшибкиПроверкиGTINВДокументеУчета(Организация);
	КонецЕсли;
	
	Возврат Не ЕстьОшибки;
	
КонецФункции

&НаСервере
Процедура СохранитьСвязиНоменклатуры()
	
	Для Каждого Стр Из ТоварыМаркировки Цикл
		
		Если Не Стр.ДобавленВручную Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Стр.Товар)
			Или Не ЗначениеЗаполнено(Стр.КоличествоУпаковок) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокиДокумента = ТоварыДокумента.НайтиСтроки(Новый Структура("КлючСтрокиДокумента", Стр.КлючСтрокиДокумента));
		Если Не ЗначениеЗаполнено(СтрокиДокумента) Тогда
			Возврат;
		КонецЕсли;
		
		СтрДок = СтрокиДокумента[0];
		Если СтрДок.НеПодлежитМаркировке Тогда
			Продолжить;
		КонецЕсли;
		
		МодульОбъекта().СвязьНоменклатуры_Добавить(Стр.Товар
		, СтрДок.КлючНоменклатуры1С);
		
		Стр.ДобавленВручную = Ложь;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьКоэффициентыПересчета()
	
	Для Каждого Стр Из ТоварыДокумента Цикл
		
		Если Не Стр.РучнойВводКоличества
			Или Стр.НеПодлежитМаркировке Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Стр.КоличествоУпаковок)
			Или Не ЗначениеЗаполнено(Стр.Количество) Тогда
			Продолжить;
		КонецЕсли;
		
		Числитель = Стр.КоличествоУпаковок;
		Знаменатель = Стр.Количество;
		КлючНоменклатуры1С = Стр.КлючНоменклатуры1С;
		
		МодульОбъекта().КоэффициентПересчета_Записать(КлючНоменклатуры1С, Числитель, Знаменатель);
		МодульОбъекта().Метрика_Функциональность_ЗаписьКоэффициентаПересчетаВДокументе();
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПосчитатьКоличествоСтрокТаблицФормы()
	
	КоличествоОпераций = СписокОпераций.Количество();
	КоличествоТоваровДокумента = ТоварыДокумента.Количество();
	КоличествоКодов = МодульОбъекта().КодыДокументов_ОбщееКоличествоТоварныхКодов(Ссылка);
	КоличествоАгрегатов = МодульОбъекта().КодыДокументов_ОбщееКоличествоТранспортныхУпаковок(Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКодыИзВходящегоУПД()
	
	Если Не МодульКлиента().ВыполнитьАвторизацию(Организация, ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Отбор", Новый Структура);
	ПараметрыФормы.Отбор.Вставить("Организация", Организация);
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
	"ЗагрузитьКодыИзВходящегоУПДПослеВыбораУПД", ЭтаФорма);
	
	МодульКлиента().ОткрытьФормуВыбораВходящегоУПД(ОписаниеОбработчика, ЭтаФорма, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКодыИзВходящегоУПДПослеВыбораУПД(РезультатВыбора, ДопПараметры = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(РезультатВыбора) Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьКодыИзВходящегоУПДНаСервере(РезультатВыбора);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКодыИзВходящегоУПДНаСервере(РезультатВыбора)
	
	КодыДобавлены = МодульОбъекта().КодыДокументов_ДобавитьИзВходящегоУПД(РезультатВыбора.Объект, Ссылка);
	
	Если Не КодыДобавлены Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьРезультатыПроверкиКодов();
	ПосчитатьКоличествоСтрокТаблицФормы();
	ОбновитьСпискиКодовИАгрегатов();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКодыИзВнешнегоИсточника(НачатьРаботу = Ложь)
	
	Если Не МодульКлиента().ВыполнитьАвторизацию(Организация, ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	КодыДобавлены = ЗагрузитьКодыИзВнешнегоИсточникаНаСервере();
	
	Если Не КодыДобавлены Тогда
		Возврат;
	КонецЕсли;
	
	Если НачатьРаботу Тогда
		Документ_НачатьРаботу();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьКодыИзВнешнегоИсточникаНаСервере()
	
	КодыДобавлены = МодульОбъекта().КодыДокументов_ДобавитьИзВнешнегоИсточника(Ссылка);
	
	Если КодыДобавлены Тогда
		УдалитьРезультатыПроверкиКодов();
		ПосчитатьКоличествоСтрокТаблицФормы();
		ОбновитьСпискиКодовИАгрегатов();
	КонецЕсли;
	
	Возврат КодыДобавлены;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьКодыИзДругогоДокумента(НачатьРаботу = Ложь)
	
	Если Не МодульКлиента().ВыполнитьАвторизацию(Организация, ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("НачатьРаботу", НачатьРаботу);
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
	"ЗагрузитьКодыИзДругогоДокументаПослеВыбораВида", ЭтаФорма, ДопПараметры);
	
	ВидыДокументов = МодульКлиента().ВидыДокументовДляПодбораКодов(Ссылка);
	МодульКлиента().ОткрытьФормуВыбораВидаДокумента(ОписаниеОбработчика, ВидыДокументов, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКодыИзДругогоДокументаПослеВыбораВида(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
	"ЗагрузитьКодыИзДругогоДокументаПослеВыбораДокумента", ЭтаФорма, ДопПараметры);
	
	МодульКлиента().ОткрытьФормуВыбораОбъектаИС(РезультатВыбора.Значение, ЭтаФорма, ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКодыИзДругогоДокументаПослеВыбораДокумента(РезультатВыбора, ДопПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(РезультатВыбора) Тогда
		Возврат;
	КонецЕсли;
	
	КодыДобавлены = ЗагрузитьКодыИзДругогоДокументаНаСервере(РезультатВыбора);
	
	Если Не КодыДобавлены Тогда
		Возврат;
	КонецЕсли;
	
	Если ДопПараметры.НачатьРаботу Тогда
		Документ_НачатьРаботу();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьКодыИзДругогоДокументаНаСервере(ДругойДокумент1C)
	
	КодыДобавлены = МодульОбъекта().КодыДокументов_ПодобратьИзДругогоДокумента(Ссылка, ДругойДокумент1C);
	
	Если КодыДобавлены Тогда
		УдалитьРезультатыПроверкиКодов();
		ПосчитатьКоличествоСтрокТаблицФормы();
		ОбновитьСпискиКодовИАгрегатов();
	КонецЕсли;
	
	Возврат КодыДобавлены;
	
КонецФункции

&НаКлиенте
Процедура УстановитьНовоеКоличествоТоваровМаркировки(СтрокаДокумента)
	
	КлючСтрокиДокумента = СтрокаДокумента.КлючСтрокиДокумента;
	
	ПодходящиеСтроки = ТоварыМаркировки.НайтиСтроки(Новый Структура("КлючСтрокиДокумента", КлючСтрокиДокумента));
	Если ПодходящиеСтроки.Количество() <> 1 Тогда
		Возврат;
	КонецЕсли;
	
	Стр = ПодходящиеСтроки[0];
	Стр.КоличествоУпаковок = СтрокаДокумента.КоличествоУпаковок;
	СтрокаДокумента.КоличествоПодобрано = КоличествоУпаковокТоваровМаркировки(КлючСтрокиДокумента, ЭтаФорма);
	
	ОбновитьТекстОстатка();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКодыИзФайлов(НачатьРаботу = Ложь)
	
	Если Не МодульКлиента().ВыполнитьАвторизацию(Организация, ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВыбораФайлов = МодульКлиента().Новый_ПараметрыДиалогаВыбораФайла();
	ПараметрыВыбораФайлов.Заголовок = НСтр("ru = 'Выберите файл(ы) для загрузки кодов маркировки в документ учета'");
	ДополнитьПараметрыВыбораПередЗагрузкойКодовИзФайлов(ПараметрыВыбораФайлов);
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("НачатьРаботу", НачатьРаботу);
	ДопПараметры.Вставить("ПараметрыДиалогаВыбора", ПараметрыВыбораФайлов);
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
	"ЗагрузитьКодыИзФайловПослеВыбораФайлов", ЭтаФорма, ДопПараметры);
	
	МодульКлиента().ПоказатьДиалогВыбораФайла(ОписаниеОбработчика, ПараметрыВыбораФайлов);
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьПараметрыВыбораПередЗагрузкойКодовИзФайлов(ПараметрыВыбораФайлов)
	
	МодульОбъекта().ДокументУчета_ПередЗагрузкойКодовИзФайлов(ПараметрыВыбораФайлов, Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКодыИзФайловПослеВыбораФайлов(ВыбранныеФайлы, ДопПараметры) Экспорт 
	
	Если Не ЗначениеЗаполнено(ВыбранныеФайлы) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыДиалога = ДопПараметры.ПараметрыДиалогаВыбора;
	ОписанияФайлов = МодульКлиента().ОписанияФайлов(ВыбранныеФайлы);
	КодыЗагружены = ЗагрузитьКодыИзФайловНаСервере(ОписанияФайлов, ПараметрыДиалога);
	
	Если Не КодыЗагружены Тогда
		Возврат;
	КонецЕсли;
	
	Если ДопПараметры.НачатьРаботу Тогда
		Документ_НачатьРаботу();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьКодыИзФайловНаСервере(ОписанияФайлов, ПараметрыВыбораФайлов)
	
	КодыЗагружены = МодульОбъекта().КодыДокументов_ЗагрузитьИзФайлов(Ссылка, ОписанияФайлов, ПараметрыВыбораФайлов);
	
	Если КодыЗагружены Тогда
		УдалитьРезультатыПроверкиКодов();
		ПосчитатьКоличествоСтрокТаблицФормы();
		ОбновитьСпискиКодовИАгрегатов();
	КонецЕсли;
	
	Возврат КодыЗагружены;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуЗагрузкиКодов(РежимСканера = Ложь, ДляУдаления = Ложь)
	
	Если Не МодульКлиента().ВыполнитьАвторизацию(Организация, ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДляУдаления Тогда
		Обработчик = МодульКлиента().ОписаниеОбработчикаОповещения("УдалитьКодыСПомощьюТабличногоДокументаПослеУказанияКодов", ЭтаФорма);
	Иначе
		Обработчик = МодульКлиента().ОписаниеОбработчикаОповещения("НаполнитьКодамиИзТабличногоДокументаПослеУказанияКодов", ЭтаФорма);
	КонецЕсли;
	
	МодульКлиента().ОткрытьФормуЗагрузкиКодов(ЭтаФорма, Обработчик, РежимСканера, ДляУдаления);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьКодыСПомощьюТабличногоДокументаПослеУказанияКодов(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаКодов = ПолучитьИзВременногоХранилища(Результат.АдресТаблицыКодов);
	МодульОбъекта().ТаблицаКодов_ЗаполнитьКлючиКодов(ТаблицаКодов);
	КлючиКодов = ТаблицаКодов.ВыгрузитьКолонку("КлючКода");
	
	МодульОбъекта().КодыДокументов_УдалитьКоды(Ссылка, КлючиКодов);
	
	УдалитьРезультатыПроверкиКодов();
	ПосчитатьКоличествоСтрокТаблицФормы();
	ОбновитьСпискиКодовИАгрегатов();
	
КонецПроцедуры

&НаКлиенте
Процедура НаполнитьКодамиИзТабличногоДокументаПослеУказанияКодов(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	КодыДобавлены = НаполнитьКодамиИзТабличногоДокументаНаСервере(Результат);
	Если Не КодыДобавлены Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Документ", Ссылка);
		
		МодульКлиента().ОткрытьФормуОбработкиМодально("Форма_РедакторКодов", ЭтаФорма, ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НаполнитьКодамиИзТабличногоДокументаНаСервере(Результат) Экспорт
	
	КодыДобавлены = МодульОбъекта().КодыДокументов_ДобавитьИзТабличногоДокумента_Сканера(Ссылка, Результат);
	
	Если КодыДобавлены Тогда
		УдалитьРезультатыПроверкиКодов();
		ПосчитатьКоличествоСтрокТаблицФормы();
		ОбновитьСпискиКодовИАгрегатов();
	КонецЕсли;
	
	Возврат КодыДобавлены;
	
КонецФункции

&НаКлиенте
Процедура ТоварыДокумента_СообщитьОбОшибках()
	
	Для Каждого Стр Из ТоварыДокумента Цикл
		Если ЗначениеЗаполнено(Стр.СообщениеОбОшибке) Тогда
			МодульКлиента().СообщитьОбОшибкеВСтрокеТабЧасти(Стр.СообщениеОбОшибке, УникальныйИдентификатор
			, Элементы.ТоварыДокумента, "Номенклатура", ТоварыДокумента.Индекс(Стр));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПодсказку()
	
	ПодсказкаВыполняетсяОбновленияДанных = ПодсказкаВыполняетсяОбновлениеДанных();
	
	ТекстПодсказки = "";
	Разделитель = "";
	
	Если ЗначениеЗаполнено(ПодсказкаВыполняетсяОбновленияДанных) Тогда
		ТекстПодсказки = ТекстПодсказки + Разделитель + ПодсказкаВыполняетсяОбновленияДанных;
		Разделитель = Символы.ПС;
	КонецЕсли;
	
	ПодсказкаОСУАнтисептики = ПодсказкаОСУАнтисептики1ГруппыПлатности();
	Если ЗначениеЗаполнено(ПодсказкаОСУАнтисептики) Тогда
		ТекстПодсказки = ТекстПодсказки + Разделитель + ПодсказкаОСУАнтисептики;
	КонецЕсли;
	
	Элементы.ТекстПодсказки.Заголовок = ТекстПодсказки;
	Элементы.ГруппаПодсказки.Видимость = ЗначениеЗаполнено(ТекстПодсказки);
	
КонецПроцедуры

&НаКлиенте
Функция ПодсказкаВыполняетсяОбновлениеДанных()
	
	Результат = "";
	
	Если ВыполняетсяОбновлениеДанных Тогда
		Результат = НСтр("ru = 'Работа с объектом заблокирована. Выполняется обновление данных.'");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПодсказкаОСУАнтисептики1ГруппыПлатности()
	
	Результат = "";
	
	Если ДокументУчета_СодержитАнтисептикиОСУ() Тогда
		Результат = 
		НСтр("ru='Для антисептиков передача кодов в УПД в объемно-сортовом учете допускается только для товаров, введенных в оборот до 1.09.2025.'");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТоварыДокумента_ТребуютсяЗаводскиеСерийныеНомера(Форма)
	
	Отбор = Новый Структура("ТребуетсяЗСН", Истина);
	Возврат ЗначениеЗаполнено(Форма.ТоварыДокумента.НайтиСтроки(Отбор));
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТоварыМаркировки_ДоступенПартионныйУчет(Форма)
	
	Отбор = Новый Структура("ДоступенПартионныйУчет", Истина);
	Возврат ЗначениеЗаполнено(Форма.ТоварыМаркировки.НайтиСтроки(Отбор));
	
КонецФункции

&НаСервере
Функция ТекстЗапросаКодыМаркировки()
	
	Возврат
	
	"ВЫБРАТЬ
	|	КодыДокументов.КлючСтрокиДокумента КАК КлючСтрокиДокумента,
	|	КодыДокументов.КлючКода КАК КлючКода,
	|	КодыМаркировки.КодМаркировки КАК КодМаркировки,
	|	КодыМаркировки.ЗаводскойСерийныйНомер КАК ЗаводскойСерийныйНомер,
	|	ИнформацияОКодах.Товар КАК Товар,
	|	ИнформацияОКодах.КлючНоменклатуры1С КАК КлючНоменклатуры1С,
	|	ИнформацияОКодах.ОбщийТипУпаковки КАК ОбщийТипУпаковки,
	|	ЕСТЬNULL(ТоварыДокумента.ПредставлениеСтроки, """") КАК СтрокаДокумента,
	|	ЕСТЬNULL(СтатусыКодов.Статус, """") КАК СтатусКода,
	|	ЕСТЬNULL(СтатусыКодов.Владелец, &ПустойКонтрагент) КАК Владелец,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ИнформацияОКодах.ДатаПечати, &ПустаяДата) > &ПустаяДата
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Напечатан,
	|	ЕСТЬNULL(ИнформацияОКодах.НомерПартии, """") КАК НомерПартии
	|ИЗ
	|	РегистрСведений.КонтурМаркировка_КодыДокументов КАК КодыДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_КодыМаркировки КАК КодыМаркировки
	|		ПО КодыДокументов.КлючКода = КодыМаркировки.КлючКода
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_СвязиКлючейКодов КАК СвязиКлючейКодов
	|		ПО КодыДокументов.КлючКода = СвязиКлючейКодов.КлючКода
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_СтатусыКодовГИСМТ КАК СтатусыКодов
	|		ПО (СвязиКлючейКодов.КлючСтатусаКода = СтатусыКодов.КлючСтатусаКода)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_ИнформацияОКодах КАК ИнформацияОКодах
	|		ПО (СвязиКлючейКодов.КлючИнформацииОКоде = ИнформацияОКодах.КлючИнформацииОКоде)}
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтурМаркировка_ДокументыУчета.ТоварыДокумента КАК ТоварыДокумента
	|		ПО КодыДокументов.КлючСтрокиДокумента = ТоварыДокумента.КлючСтрокиДокумента
	|			И (ТоварыДокумента.Ссылка = &ДокументУчета)
	|ГДЕ
	|	КодыДокументов.ДокументУчета = &ДокументУчета
	|	И ИнформацияОКодах.ОбщийТипУпаковки <> ЗНАЧЕНИЕ(Перечисление.КонтурМаркировка_ОбщиеТипыУпаковок.ТранспортнаяУпаковка)
	|	И (&ПоказатьСписанные
	|			ИЛИ ЕСТЬNULL(СтатусыКодов.Статус, """") <> &СтатусКода_Списан)";
	
КонецФункции

&НаКлиенте
Функция ПроверитьЗаполнениеРеквизитов()
	
	ЕстьОшибки = Ложь;
	
	ПроверитьФорматНомераПартии(ЕстьОшибки);
	
	Возврат Не ЕстьОшибки;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьФорматНомераПартии(ЕстьОшибки)
	
	// Допустимые символы
	Буквы = МодульКлиента().ВсеБуквыКириллицы() + МодульКлиента().ВсеБуквыЛатиницы();
	Цифры = МодульКлиента().ВсеЦифры();
	СпецСимволы = " .,-/";
	ДопустимыеСимволы = Буквы + Цифры + СпецСимволы;
	ДопустимаяДлинаНомера = 49;
	
	ТекстОшибкиПревышениеДлины = НСтр("ru = 'Длина номера партии не должна превышать %1 символов'");
	ТекстОшибкиПревышениеДлины = МодульКлиента().ПараметрыВСтроку(ТекстОшибкиПревышениеДлины, ДопустимаяДлинаНомера);
	
	ТекстОшибкиНедопустимыеСимволы = НСтр("ru = 'Номер партии содержит недопустимые символы'");
	
	Для каждого СтрТов Из ТоварыМаркировки Цикл
		Если Не СтрТов.ДоступенПартионныйУчет Тогда
			Продолжить;
		КонецЕсли;
		Если СтрДлина(СтрТов.НомерПартии) > ДопустимаяДлинаНомера Тогда
			МодульКлиента().СообщитьОбОшибкеВСтрокеТабЧасти(ТекстОшибкиПревышениеДлины, УникальныйИдентификатор
			, Элементы.ТоварыМаркировки, "НомерПартии", ТоварыМаркировки.Индекс(СтрТов));
			ЕстьОшибки = Истина;
		КонецЕсли;
		Если Не МодульКлиента().СтрокаСодержитТолькоДопустимыеСимволы(СтрТов.НомерПартии, ДопустимыеСимволы) Тогда
			МодульКлиента().СообщитьОбОшибкеВСтрокеТабЧасти(ТекстОшибкиНедопустимыеСимволы, УникальныйИдентификатор
			, Элементы.ТоварыМаркировки, "НомерПартии", ТоварыМаркировки.Индекс(СтрТов));
			ЕстьОшибки = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТоварыАгрегатовИзГИСМТ()
	
	ТаблицаКодов = МодульОбъекта().КодыДокументов_ТранспортныеУпаковки(Ссылка);
	
	МодульОбъекта().ТоварыАгрегатов_ЗаполнитьИзГИСМТ(ТаблицаКодов, Организация);
	
	ОбновитьСписокАгрегатов();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВложенныеКодыАгрегатовИзГИСМТ()
	
	ТаблицаКодов = МодульОбъекта().КодыДокументов_ТранспортныеУпаковки(Ссылка);
	
	МодульОбъекта().ТаблицаКодов_ЗаполнитьВложенныеКодыИзГИСМТ(ТаблицаКодов, Организация);
	
	ОбновитьСписокАгрегатов();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДополнительныеКнопки()
	
	РазмещенияКнопок = МодульОбъекта().Перечисление_РазмещениеДополнительныхКнопок();
	
	// Шапка
	Действие = "Шапка_ДополнительнаяКнопкаНажатие";
	ГруппаКнопок = Элементы.ШапкаДопКнопки;
	НастройкиКнопок = МодульОбъекта().НастройкиДополнительныхКнопок(РазмещенияКнопок.ДокументУчетаШапка, ТипДокумента);
	МодульОбъекта().ДобавитьНаФормуДополнительныеКнопки(ЭтаФорма, НастройкиКнопок, ГруппаКнопок, Действие);
	
	// Коды маркировки
	Действие = "КодыМаркировки_ДополнительнаяКнопкаНажатие";
	ГруппаКнопок = Элементы.СписокКодовДопКнопки;
	НастройкиКнопок = МодульОбъекта().НастройкиДополнительныхКнопок(РазмещенияКнопок.ДокументУчетаСписокКодов, ТипДокумента);
	МодульОбъекта().ДобавитьНаФормуДополнительныеКнопки(ЭтаФорма, НастройкиКнопок, ГруппаКнопок, Действие);
	
КонецПроцедуры

&НаСервере
Функция КонтекстОтчетаПоВиртуальномуСкладу()
	
	Если ТоварыМаркировки.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = МодульОбъекта().Новый_ОтчетПоВиртуальномуСкладу_Контекст();
	
	Результат.Организация = Организация;
	Результат.ФормаИнициатор = "Форма_ДокументУчета";
	Для Каждого Строка Из ТоварыМаркировки Цикл
		Результат.СписокТоваров.Добавить(Строка.Товар);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПровестиОпросПользователяИЗакрыть()
	
	КлючиСценариев = МодульКлиента().Перечисление_КлючиСценариевДляОпросов();
	ОписаниеОпроса = МодульКлиента().ОпросПользователяПоСценарию(КлючиСценариев.ДокументУчета);
	
	Если ЗначениеЗаполнено(ОписаниеОпроса) Тогда
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПослеОпросаПользователя", ЭтаФорма);
		МодульКлиента().ОткрытьФормуОпросаПользователя(ОписаниеОпроса, ЭтаФорма, ОписаниеОбработчика);
		Возврат;
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОпросаПользователя(РезультатВыбора, ДопПараметры = Неопределено) Экспорт
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура Агрегаты_Сортировать(ИмяКолонки, Направление)
	
	КолонкаСортировки = ИмяКолонки + " " + Направление;
	СортироватьПодчиненные = (ИмяКолонки = "Товар" Или ИмяКолонки = "КлючНоменклатуры1С");
	
	ДеревоАгрегатов = РеквизитФормыВЗначение("Агрегаты");
	ДеревоАгрегатов.Строки.Сортировать(КолонкаСортировки, СортироватьПодчиненные, Новый СравнениеЗначений);
	ЗначениеВРеквизитФормы(ДеревоАгрегатов, "Агрегаты");
	
КонецПроцедуры

&НаКлиенте
Процедура Агрегаты_УдалитьИзДокументаПослеСогласия(Ответ, ДопПараметры = Неопределено) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Агрегаты_УдалитьИзДокументаПослеСогласияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура Агрегаты_УдалитьИзДокументаПослеСогласияНаСервере() Экспорт
	
	КлючиКодов = Новый Массив;
	Для каждого ИдентификаторСтроки Из Элементы.Агрегаты.ВыделенныеСтроки Цикл
		Стр = Агрегаты.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если Стр.УровеньАгрегата Тогда
			КлючиКодов.Добавить(Стр.КлючКода);
		КонецЕсли;
	КонецЦикла;
	
	МодульОбъекта().КодыДокументов_УдалитьКоды(Ссылка, КлючиКодов);
	
	ОбновитьСписокАгрегатов();
	ПосчитатьКоличествоСтрокТаблицФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_УдалитьИзДокументаПослеСогласия(Ответ, ДопПараметры = Неопределено) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Коды_УдалитьИзДокументаПослеСогласияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура Коды_УдалитьИзДокументаПослеСогласияНаСервере()
	
	КлючиКодов = Новый Массив;
	Для каждого Стр Из Элементы.КодыМаркировки.ВыделенныеСтроки Цикл
		КлючиКодов.Добавить(Стр.КлючКода);
	КонецЦикла;
	
	МодульОбъекта().КодыДокументов_УдалитьКоды(Ссылка, КлючиКодов);
	
	УдалитьРезультатыПроверкиКодов();
	ОбновитьСписокКодовМаркировки();
	ПосчитатьКоличествоСтрокТаблицФормы();
	
КонецПроцедуры

&НаСервере
Функция ДокументуДоступнаРоль(РольДокумента)
	
	Возврат МодульОбъекта().ДокументУчета_ТипуДокументаДоступнаРоль(ТипДокумента, РольДокумента);
	
КонецФункции

&НаСервере
Процедура ОбновитьРезультатПроверкиКодов() Экспорт
	
	СтатусыРезультата = МодульОбъекта().Перечисление_СтатусыРезультатаПроверкиКодовДокумента();
	ТекущийСтатус = МодульОбъекта().ДокументУчета_СтатусРезультатаПроверкиКодов(Ссылка);
	
	ПоказатьРезультат = Истина;
	Если ТекущийСтатус = СтатусыРезультата.Успешно Тогда
		Элементы.ТекстРезультатПроверкиКодов.Заголовок = НСтр("ru = 'Все коды имеют действующий РД'");
		Элементы.ТекстРезультатПроверкиКодов.ЦветТекста = WebЦвета.Зеленый;
		Элементы.Кнопка_ПоказатьОтчетОбОшибкахРД.Видимость = Ложь;
	ИначеЕсли ТекущийСтатус = СтатусыРезультата.Предупреждение Тогда 
		Элементы.ТекстРезультатПроверкиКодов.Заголовок = НСтр("ru = 'Есть ошибки кодов:'");
		Элементы.ТекстРезультатПроверкиКодов.ЦветТекста = WebЦвета.Красный;
		Элементы.Кнопка_ПоказатьОтчетОбОшибкахРД.Видимость = Истина;
	Иначе
		ПоказатьРезультат = Ложь;
	КонецЕсли;
	
	Элементы.ГруппаРезультатПроверкиКодов.Видимость = ПоказатьРезультат;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьРезультатыПроверкиКодов()
	
	МодульОбъекта().ДокументУчета_УдалитьРезультатыПроверкиКодов(Ссылка);
	
	ОбновитьРезультатПроверкиКодов();
	
КонецПроцедуры

// #КонецОбласти // СлужебныеПроцедурыИФункции

