
// #Область СлужебныеПеременныеМетоды

&НаКлиенте
Перем Кэш;

&НаКлиенте
Функция ВерсияОбработки() Экспорт
	
	Возврат "3.5.3";
	
КонецФункции

&НаКлиенте
Функция ВерсияПлагина() Экспорт
	
	Возврат "1.5.3.361";
	
КонецФункции

&НаКлиенте
Функция ВерсияКомпонентыШтрихкодов() Экспорт
	
	Возврат "10.0.6.3";
	
КонецФункции

// #КонецОбласти // СлужебныеПеременныеМетоды

// #Область ПрограмныйИнтерфейс

// Проверяет что плагин загружен и отвечает
//
&НаКлиенте
Функция ПроверитьПлагин() Экспорт
	
	Плагин = ОбъектКонтурПлагина();
	Команда = Команда_ПроверкаПлагина();
	Ответ = ВыполнитьКоманду(Команда, Плагин);
	
	Результат = (Ответ["pong"] = "true");
	
	Возврат Результат;
	
КонецФункции

// Устанавливает и подключает плагин в асинхронном режиме если нужно
//
&НаКлиенте
Процедура ПодключитьПлагин() Экспорт
	
	Попытка
		Плагин = СоздатьОбъектКонтурПлагина();
	Исключение
		Плагин = Неопределено;
	КонецПопытки;
	
	Если Плагин <> Неопределено Тогда
		Возврат; // Плагин уже подключен
	КонецЕсли;
	
	ПутьКМакету = ПутьКМакетуКонтурПлагина();
	ИмяКомпоненты = ИмяКомпонентыКонтурПлагина();
	КомпонентаПодключена = ПодключитьКомпоненту(ПутьКМакету, ИмяКомпоненты);
	
	Если Не КомпонентаПодключена Тогда
		НачатьУстановкуКомпоненты(ПутьКМакету);
	КонецЕсли;
	
КонецПроцедуры

// Выполняет поиск установленных на компьютере сертификатов
//
// Параметры:
//  ПараметрыПоиска - Структура - см. ПараметрыПоискаСертификатов()
//
// Возвращаемое значение:
//  Массив из Структура - см. Новый_ОписаниеСертификата()
//
&НаКлиенте
Функция СписокСертификатов(ПараметрыПоиска = Неопределено) Экспорт
	
	Плагин = ОбъектКонтурПлагина();
	Команда = Команда_ПолучитьСписокСертификатов(ПараметрыПоиска);
	Ответ = ВыполнитьКоманду(Команда, Плагин);
	Результат = РазобратьОтвет_СписокСертификатов(Ответ);
	
	Возврат Результат;
	
КонецФункции

// Получает файл установленного сертификата
//
// Параметры:
//  ОтпечатокСертификата - Строка - отпечаток сертификата;
//
// Возвращаемое значение:
//  ДвоичныеДанные
//
&НаКлиенте
Функция ФайлСертификата(ОтпечатокСертификата) Экспорт
	
	Плагин = ОбъектКонтурПлагина();
	Команда = Команда_ФайлСертификата(ОтпечатокСертификата);
	Ответ = ВыполнитьКоманду(Команда, Плагин);
	ОписаниеСертификата = Новый_ОписаниеСертификата(Ответ);
	Результат = ОписаниеСертификата.ДвоичныеДанные;
	
	Возврат Результат;
	
КонецФункции

// Получает свойства сертификата
//
// Параметры:
//  ОтпечатокСертификата - Строка - отпечаток сертификата;
//
// Возвращаемое значение:
//  Структура - см. Новый_ОписаниеСертификата()
//
&НаКлиенте
Функция ОписаниеСертификата(ОтпечатокСертификата) Экспорт
	
	Плагин = ОбъектКонтурПлагина();
	Команда = Команда_ДанныеСертификата(ОтпечатокСертификата);
	Ответ = ВыполнитьКоманду(Команда, Плагин);
	Результат = Новый_ОписаниеСертификата(Ответ);
	
	Возврат Результат;
	
КонецФункции

// Проверяет на компьютере наличие закрытого ключа сертификата
//
// Параметры:
//  ОтпечатокСертификата - Строка - отпечаток сертификата;
//
// Возвращаемое значение:
//  Булево - Истина, если закрытый ключ есть
//
&НаКлиенте
Функция ЕстьЗакрытыйКлючСертификата(ОтпечатокСертификата) Экспорт
	
	Плагин = ОбъектКонтурПлагина();
	Команда = Команда_ЕстьЗакрытыйКлючСертификата(ОтпечатокСертификата);
	Ответ = ВыполнитьКоманду(Команда, Плагин);
	СписокСертификатов = РазобратьОтвет_СписокСертификатов(Ответ);
	Результат = ЗначениеЗаполнено(СписокСертификатов);
	
	Возврат Результат;
	
КонецФункции

// Подписывает данные указанным сертификатом
//
// Параметры:
//  Данные - Массив - ДвоичныеДанные файлов или строки в формате base64, которые нужно подписать;
//  ОтпечатокСертификата - Строка - отпечаток сертификата, которым нужно подписать;
//  ПрисоединитьПодпись - Булево - Истина, если контент и подпись должны быть в одном файле;
//
// Возвращаемое значение:
//  Массив из ДвоичныеДанные - подписи, в том же порядке что и массив файлов
//  Массив из Строка - подписи, в том же порядке что и массив файлов (base64)
//
&НаКлиенте
Функция ПодписатьДанные(Данные, ОтпечатокСертификата, ПрисоединитьПодпись = Ложь) Экспорт
	
	РазмерПорции = 20;
	ПорцияДанных = Новый Массив;
	ВсегоДанных = Данные.Количество();
	Результат = Новый Массив;
	Плагин = ОбъектКонтурПлагина();
	
	Для Сч = 1 По ВсегоДанных Цикл
		
		ПорцияДанных.Добавить(Данные[Сч - 1]);
		
		Если Сч % РазмерПорции = 0 Или Сч = ВсегоДанных Тогда
			Команда = Команда_ПодписатьДанные(ПорцияДанных, ОтпечатокСертификата, ПрисоединитьПодпись);
			Ответ = ВыполнитьКоманду(Команда, Плагин);
			Подписи = РазобратьКоллекциюОтветов(Ответ, "signatures");
			ДополнитьМассив(Результат, Подписи);
			ПорцияДанных.Очистить();
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Выполняет расшифровку контента
//
// Параметры:
//  Контент - ДвоичныеДанные, Строка - контент, который нужно расшифровать
//
// Возвращаемое значение:
//  ДвоичныеДанные - расшифрованный контент
//  Строка - расшифрованный контент в формате base64
//
&НаКлиенте
Функция РасшифроватьКонтент(Контент) Экспорт
	
	Плагин = ОбъектКонтурПлагина();
	Команда = Команда_РасшифроватьКонтент(Контент);
	Ответ = ВыполнитьКоманду(Команда, Плагин);
	Результат = РазобратьОтвет(Ответ);
	
	Возврат Результат;
	
КонецФункции

// Расчитывает хеш-сумму строки
//
// Параметры:
//  Строка - Строка - строка, по которой надо посчитать хеш-сумму
//  ТипХешФункции - Строка - см. Перечисление_ТипыХешФункций();
//
// Возвращаемое значение:
//  Строка - хеш-сумма в base64;
//
&НаКлиенте
Функция ХешСуммаСтроки(Строка, ТипХешФункции) Экспорт
	
	Плагин = ОбъектКонтурПлагина();
	Команда = Команда_ХешСуммаСтроки(Строка, ТипХешФункции);
	Ответ = ВыполнитьКоманду(Команда, Плагин);
	Результат = РазобратьОтвет(Ответ);
	
	Возврат Результат;
	
КонецФункции

// Расчитывает хеш-суммы строк
//
// Параметры:
//  Строки - Массив - строки, по которым нужно посчитать хеш-сумму;
//  ТипХешФункции - Строка - см. Перечисление_ТипыХешФункций();
//
// Возвращаемое значение:
//  Массив из Строка - хеш-суммы в base64, в том же порядке что и массив строк
//
&НаКлиенте
Функция ХешСуммыСтрок(Строки, ТипХешФункции) Экспорт
	
	Плагин = ОбъектКонтурПлагина();
	ВсегоСтрок = Строки.Количество();
	Результат = Новый Массив;
	МассивЗадач = Новый Массив;
	ПорцияСтрок = Новый Массив;
	МаксимумЗадач = 15; // Предохранитель перегрузки
	РазмерПорции = 15; // Органичитель расхода памяти
	
	Для Сч = 1 По ВсегоСтрок Цикл
		
		ПорцияСтрок.Добавить(Строки[Сч - 1]);
		
		Если Сч % РазмерПорции = 0 Или Сч = ВсегоСтрок Тогда
			
			Команда = Команда_ХешСуммыСтрок(ПорцияСтрок, ТипХешФункции);
			МассивЗадач.Добавить(НачатьАсинхроннуюЗадачу(Команда, Плагин));
			ПорцияСтрок.Очистить();
			
			Если МассивЗадач.Количество() = МаксимумЗадач
				Или АсинхроннаяЗадачаВыполнена(МассивЗадач[0], Плагин) Тогда
				Ответ = РезультатАсинхроннойЗадачи(МассивЗадач[0], Плагин);
				ДополнитьМассив(Результат, РазобратьКоллекциюОтветов(Ответ, "hashes"));
				МассивЗадач.Удалить(0);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого ИдентификаторЗадачи Из МассивЗадач Цикл
		Ответ = РезультатАсинхроннойЗадачи(ИдентификаторЗадачи, Плагин);
		ДополнитьМассив(Результат, РазобратьКоллекциюОтветов(Ответ, "hashes"));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Ищет в строке совпадения по шаблону с регулярными выражениями
//
// Параметры:
//  Строка - Строка - строка, в которой нужно найти совпадения;
//  Шаблон - Строка - шаблон с регулярными выражениями;
// 
// Возвращаемое значение:
//  Массив - содержит строки найденных совпадений
//
&НаКлиенте
Функция НайтиСовпаденияПоШаблону(Строка, Шаблон) Экспорт
	
	Плагин = ОбъектКонтурПлагина();
	Команда = Команда_НайтиСовпаденияПоШаблону(Строка, Шаблон);
	Ответ = ВыполнитьКоманду(Команда, Плагин);
	Результат = РазобратьКоллекциюОтветов(Ответ, "matches", "value");
	
	Возврат Результат;
	
КонецФункции

// Формирует картинки штрихкодов
//
// Параметры:
//  Штрихкоды - Массив - содержит значения штрихкодов;
//  ПараметрыКартинки - Структура - см. ПараметрыКартинкиШтрихкода();
//  ТолькоЧерезПлагин - Булево - (необязательный) Истина, если использовать компоненту 1С нельзя;
// 
// Возвращаемое значение:
//  Массив - содержит двоичные данные картинок штрихкодов,
//      в том же порядке что и входящий массив штрихкодов
//
&НаКлиенте
Функция КартинкиШтрихкодов(Штрихкоды, ПараметрыКартинки, ТолькоЧерезПлагин = Ложь) Экспорт
	
	ПроверитьКорректностьУглаПоворотаШтрихкодов(ПараметрыКартинки);
	
	// Пока QR не поддерживается в КонтурПлагине
	Если ПараметрыКартинки.ТипШтрихкода = ПредопределенноеЗначение("Перечисление.КонтурМаркировка_ТипыШтрихкодов.QR") Тогда
		Возврат КартинкиШтрихкодовЧерезКомпоненту(Штрихкоды, ПараметрыКартинки);
	КонецЕсли;
	
	// Пока GS1-DataBar Expanded Stacked не поддерживается в КонтурПлагине
	Если ПараметрыКартинки.ТипШтрихкода = ПредопределенноеЗначение("Перечисление.КонтурМаркировка_ТипыШтрихкодов.GS1_DataBarExpandedStacked") Тогда
		Возврат КартинкиШтрихкодовЧерезКомпоненту(Штрихкоды, ПараметрыКартинки);
	КонецЕсли;
	
	Если Не ТолькоЧерезПлагин
		И Не ПечататьШтрихкодовЧерезПлагинДоступна() Тогда
		Возврат КартинкиШтрихкодовЧерезКомпоненту(Штрихкоды, ПараметрыКартинки);
	КонецЕсли;
	
	Плагин = ОбъектКонтурПлагина();
	ВсегоШтрихкодов = Штрихкоды.Количество();
	Результат = Новый Массив;
	МассивЗадач = Новый Массив;
	ПорцияШтрихкодов = Новый Массив;
	МаксимумЗадач = 25; // Предохранитель перегрузки
	РазмерПорции = 4; // Органичитель расхода памяти
	
	Для Сч = 1 По ВсегоШтрихкодов Цикл
		
		ПорцияШтрихкодов.Добавить(Штрихкоды[Сч - 1]);
		
		Если Сч % РазмерПорции = 0 Или Сч = ВсегоШтрихкодов Тогда
			
			Команда = Команда_КартинкиШтрихкодов(ПараметрыКартинки, ПорцияШтрихкодов);
			МассивЗадач.Добавить(НачатьАсинхроннуюЗадачу(Команда, Плагин));
			ПорцияШтрихкодов.Очистить();
			
			Если МассивЗадач.Количество() = МаксимумЗадач
				Или АсинхроннаяЗадачаВыполнена(МассивЗадач[0], Плагин) Тогда
				Ответ = РезультатАсинхроннойЗадачи(МассивЗадач[0], Плагин);
				ДополнитьМассив(Результат, РазобратьКоллекциюОтветов(Ответ, "barcodes"));
				МассивЗадач.Удалить(0);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого ИдентификаторЗадачи Из МассивЗадач Цикл
		Ответ = РезультатАсинхроннойЗадачи(ИдентификаторЗадачи, Плагин);
		ДополнитьМассив(Результат, РазобратьКоллекциюОтветов(Ответ, "barcodes"));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Проверяет что через Конутр.Плагин для 1С можно сформировать картинки штрихкодов
// 
// Возвращаемое значение:
//  Булево - Истина, если картинки штрихкодов сформировать получиться
//
&НаКлиенте
Функция ПечататьШтрихкодовЧерезПлагинДоступна() Экспорт
	
	КлючКэш = "ПечататьШтрихкодовЧерезПлагинДоступна";
	Результат = Кэш_Прочитать(КлючКэш);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	DataMatrix = ПредопределенноеЗначение("Перечисление.КонтурМаркировка_ТипыШтрихкодов.GS1_DataMatrix");
	ПараметрыКартинки = ПараметрыКартинкиШтрихкода(DataMatrix);
	ПараметрыКартинки.Ширина = 100;
	ПараметрыКартинки.Высота = 100;
	
	МассивШтрихкодов = ЗначениеВМассиве("0104602443313288215UwoL&");
	Команда = Команда_КартинкиШтрихкодов(ПараметрыКартинки, МассивШтрихкодов);
	
	Попытка
		Плагин = ОбъектКонтурПлагина();
		Ответ = ВыполнитьКоманду(Команда, Плагин);
		МассивКартинок = РазобратьКоллекциюОтветов(Ответ, "barcodes");
		Результат = ЗначениеЗаполнено(МассивКартинок[0]);
	Исключение
		Ошибка = ИнформацияОбОшибке();
		Результат = Ложь;
	КонецПопытки;
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

// Параметры поиска сертификатов на компьютере
//
// Возвращаемое значение:
//  Структура:
//   Отпечаток             - Строка - (необязательный) отпечаток сертификата;
//   СерийныйНомер         - Строка - (необязательный) серийный номер сертификата;
//   ЕстьЗакрытыйКлюч      - Булево - (необязательный) проверять наличие закрытого ключа;
//   ТолькоПервый          - Булево - (необязательный) возвращать первый найденный сертификат;
//   РасположениеХранилища - Строка - (необязательный) см. Перечисление_РасположениеХранилищСертификатов();
//   ТипХранилища          - Строка - (необязательный) см. Перечисление_ТипыХранилищСертификатов();
&НаКлиенте
Функция ПараметрыПоискаСертификатов() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("Отпечаток");
	Результат.Вставить("СерийныйНомер");
	Результат.Вставить("ЕстьЗакрытыйКлюч");
	Результат.Вставить("ТолькоПервый", Ложь);
	
	Результат.Вставить("ТипХранилища", Перечисление_ТипыХранилищСертификатов().ПерсональныеСертификаты);
	Результат.Вставить("РасположениеХранилища", Перечисление_РасположениеХранилищСертификатов().ТекущийПользователь);
	
	Возврат Результат;
	
КонецФункции

// Контракт описания параметров для печати штрихкодов
//
// Параметры:
//  ТипШтрихкода - Перечисления.КонтурМаркировка_ТипыШтрихкодов - тип штрихкодов
// 
// Возвращаемое значение:
//  Структура - содержит свойства:
//   * ТипШтрихкода      - Перечисления.КонтурМаркировка_ТипыШтрихкодов - тип штрихкодов;
//   * ФорматИзображения - Строка - см. Перечисление_ФорматыИзображений();
//   * Ширина            - Число  - ширина картинки в пикселях;
//   * Высота            - Число  - высота картинки в пикселях;
//   * ПодогнатьРазмер   - Булево - Истина, если нужно подгонять размер до ближайшего с точными пропорциями;
//   * УголПоворота      - Число  - угол поворота картинки в градусах,
//                         допустимые значения: 0, 90, 180, 270;
//   * ДобавитьОтступ    - Булево - Истина, если нужно добавить отступ вокруг штрихкода;
//
&НаКлиенте
Функция ПараметрыКартинкиШтрихкода(ТипШтрихкода) Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ТипШтрихкода", ТипШтрихкода);
	Результат.Вставить("Ширина", 0);
	Результат.Вставить("Высота", 0);
	Результат.Вставить("ПодогнатьРазмер", Ложь);
	Результат.Вставить("УголПоворота", 0);
	//Результат.Вставить("РазмерШрифта", 0);
	Результат.Вставить("ДобавитьОтступ", Ложь);
	//Результат.Вставить("ОтображатьТекст", Ложь);
	//Результат.Вставить("Шрифт");
	
	Результат.Вставить("ФорматИзображения", Перечисление_ФорматыИзображений().PNG);
	
	Возврат Результат;
	
КонецФункции

// Типы хранилищ сертификатов на компьютере
//
// Возвращаемое значение:
//  Структура - см. тело метода
//
&НаКлиенте
Функция Перечисление_ТипыХранилищСертификатов() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("КорневыеСертификаты", "Корневые сертификаты");
	Результат.Вставить("ПерсональныеСертификаты", "Персональные сертификаты");
	Результат.Вставить("СертификатыПолучателей", "Сертификаты получателей");
	Результат.Вставить("СертификатыУдостоверяющихЦентров", "Сертификаты удостоверяющих центров");
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

// Варианты расположения хранилищ сертификатов на компьютере
//
// Возвращаемое значение:
//  Структура - см. тело метода
//
&НаКлиенте
Функция Перечисление_РасположениеХранилищСертификатов() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ЛокальныйКомпьютер", "Локальный компьютер");
	Результат.Вставить("ТекущийПользователь", "Текущий пользователь");
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

// Форматы изображения, в которых плагин может сформировать штрихкод
//
// Возвращаемое значение:
//  Структура - см. тело метода
//
&НаКлиенте
Функция Перечисление_ФорматыИзображений() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("BMP", "BMP");
	Результат.Вставить("PNG", "PNG");
	Результат.Вставить("TIFF", "TIFF");
	Результат.Вставить("JPEG", "JPEG");
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

// Варианты типов хеш-функции.
// Определяет способ вычисления хеш-суммы
//
// Возвращаемое значение:
//  Структура - см. тело метода
//
&НаКлиенте
Функция Перечисление_ТипыХешФункций() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("MD5", "MD5");
	Результат.Вставить("SHA1", "SHA1");
	Результат.Вставить("SHA256", "SHA256");
	Результат.Вставить("SHA384", "SHA384");
	Результат.Вставить("SHA512", "SHA512");
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

// #КонецОбласти // ПрограмныйИнтерфейс

// #Область КомандыДляПлагина

// #Область ГотовыеКоманды

&НаКлиенте
Функция Команда_ПроверкаПлагина()
	
	Результат = Новый_command("test.ping");
	Результат.Вставить("data", Истина);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Команда_ПолучитьСписокСертификатов(ПараметрыПоиска)
	
	filter = Новый_cert_filter(ПараметрыПоиска);
	properties = Новый_certificateProperties();
	
	Результат = Команда_cert_search(filter, properties);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Команда_ФайлСертификата(ОтпечатокСертификата)
	
	cert = Новый_certificate(ОтпечатокСертификата);
	properties = Новый Структура("content", Новый_content("base64"));
	
	Результат = Команда_cert_parse(cert, properties);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Команда_ДанныеСертификата(ОтпечатокСертификата)
	
	cert = Новый_certificate(ОтпечатокСертификата);
	properties = Новый_certificateProperties();
	
	Результат = Команда_cert_parse(cert, properties);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Команда_ЕстьЗакрытыйКлючСертификата(ОтпечатокСертификата)
	
	ПараметрыПоиска = ПараметрыПоискаСертификатов();
	ПараметрыПоиска.ТолькоПервый = Истина;
	ПараметрыПоиска.ЕстьЗакрытыйКлюч = Истина;
	ПараметрыПоиска.Отпечаток = ОтпечатокСертификата;
	
	filter = Новый_cert_filter(ПараметрыПоиска);
	properties = Новый Структура("hash", Истина);
	
	Результат = Команда_cert_search(filter, properties);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Команда_ПодписатьДанные(Данные, ОтпечатокСертификата, ПрисоединитьПодпись)
	
	source = Новый_MultiContent("base64", Данные);
	sink = Новый_content("base64");
	cert = Новый_certificate(ОтпечатокСертификата);
	
	РезультатДвоичныеДанные = ТипЗнч(Данные[0]) = Тип("ДвоичныеДанные");
	
	Результат = Команда_crypto_batch_sign(source, sink, cert, ПрисоединитьПодпись, РезультатДвоичныеДанные);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Команда_РасшифроватьКонтент(Контент)
	
	source = Новый_content("base64", Контент);
	sink = Новый_content("base64");
	
	РезультатДвоичныеДанные = ТипЗнч(Контент) = Тип("ДвоичныеДанные");
	
	Результат = Команда_crypto_decrypt(source, sink, РезультатДвоичныеДанные);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Команда_ХешСуммаСтроки(Строка, ТипХешФункции)
	
	data = Новый_content("string", Строка);
	sink = Новый_content("base64");
	
	Результат = Команда_crypto_hash(data, sink, ТипХешФункции);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Команда_ХешСуммыСтрок(МассивСтрок, ТипХешФункции)
	
	source = Новый_MultiContent("string", МассивСтрок);
	sink = Новый_content("base64");
	
	Результат = Команда_crypto_batch_hash(source, ТипХешФункции);
	Результат.sinks.Добавить(sink);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Команда_НайтиСовпаденияПоШаблону(Строка, Шаблон)
	
	Результат = Команда_stringSearch(Строка, Шаблон);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Команда_КартинкиШтрихкодов(ПараметрыКартинки, Штрихкоды)
	
	source = Новый_MultiContent("string", Штрихкоды);
	
	Результат = Команда_barcode_batch_write(source);
	
	Результат.barcode = ТипШтрихкодаВТерминахПлагина(ПараметрыКартинки.ТипШтрихкода);
	Результат.rotate = ПараметрыКартинки.УголПоворота;
	
	Если ПараметрыКартинки.УголПоворота = 0
		Или ПараметрыКартинки.УголПоворота = 180 Тогда
		Результат.width = ПараметрыКартинки.Ширина;
		Результат.height = ПараметрыКартинки.Высота;
	Иначе
		Результат.width = ПараметрыКартинки.Высота;
		Результат.height = ПараметрыКартинки.Ширина;
	КонецЕсли;
	
	Результат.quiet_zone = ПараметрыКартинки.ДобавитьОтступ;
	Результат.fit = ПараметрыКартинки.ПодогнатьРазмер;
	
	//Если ПараметрыКартинки.ОтображатьТекст Тогда
	//	font = Новый_font();
	//	font.name = ПараметрыКартинки.Шрифт;
	//	font.size = ПараметрыКартинки.РазмерШрифта;
	//	Результат.Вставить("font", font);
	//КонецЕсли;
	
	imgContent = Новый_imgContent(ПараметрыКартинки.ФорматИзображения);
	Результат.render_to.Добавить(imgContent);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Новый_ОписаниеСертификата(certificate_info)
	
	Результат = Новый Структура;
	
	hash			 = certificate_info["hash"];
	serialNumber	 = certificate_info["serialNumber"];
	issuer			 = certificate_info["issuer"];
	subject			 = certificate_info["subject"];
	content			 = certificate_info["content"];
	validFrom		 = certificate_info["validFrom"];
	validTo			 = certificate_info["validTo"];
	hasPrivateKey	 = certificate_info["hasPrivateKey"];
	extensions		 = certificate_info["extensions"];
	keyAlgorithm	 = certificate_info["keyAlgorithm"];
	
	Результат.Вставить("ДатаНачала");
	Результат.Вставить("ДатаОкончания");
	Результат.Вставить("ДвоичныеДанные");
	Результат.Вставить("ЕстьЗакрытыйКлюч");
	Результат.Вставить("Отпечаток", hash["data"]);
	
	Если issuer <> Неопределено Тогда
		
		Издатель = Новый Соответствие;
		Издатель.Вставить("CN", issuer["CN"]);
		
		Результат.Вставить("Издатель", Издатель);
		
	КонецЕсли;
	
	Если subject <> Неопределено Тогда
		
		Субъект = Новый Соответствие;
		Субъект.Вставить("_1_2_840_113549_1_9_2", subject["_1_2_840_113549_1_9_2"]);
		Субъект.Вставить("CN", subject["CN"]);
		Субъект.Вставить("G", subject["G"]);
		Субъект.Вставить("O", subject["O"]);
		Субъект.Вставить("SN", subject["SN"]);
		Субъект.Вставить("T", subject["T"]);
		Субъект.Вставить("ИНН", subject["ИНН"]);
		Субъект.Вставить("ИННЮЛ", subject["ИННЮЛ"]);
		Субъект.Вставить("ОГРН", subject["ОГРН"]);
		Субъект.Вставить("ОГРНИП", subject["ОГРНИП"]);
		
		Результат.Вставить("Субъект", Субъект);
		
	КонецЕсли;
	
	Если validFrom <> Неопределено Тогда
		Результат.ДатаНачала = ДатаИзСтрокиXML(validFrom);
	КонецЕсли;
	
	Если validTo <> Неопределено Тогда
		Результат.ДатаОкончания = ДатаИзСтрокиXML(validTo);
	КонецЕсли;
	
	Если hasPrivateKey <> Неопределено Тогда
		Результат.ЕстьЗакрытыйКлюч = БулевоИзСтрокиJSON(hasPrivateKey);
	КонецЕсли;
	
	Если content <> Неопределено Тогда
		Результат.ДвоичныеДанные = Base64Значение(content["data"]);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти // КомандыМодуля

// #Область КомандыВТерминахПлагина

&НаКлиенте
Функция Команда_cert_search(filter, properties = Неопределено)
	
	Результат = Новый_command("cert.search");
	Результат.Вставить("filter", filter);
	
	Если ЗначениеЗаполнено(properties) Тогда
		Результат.Вставить("properties", properties);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Команда_cert_parse(cert, properties)
	
	Результат = Новый_command("cert.parse");
	
	Результат.Вставить("cert", cert);
	
	Если ЗначениеЗаполнено(properties) Тогда
		Результат.Вставить("properties", properties);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Команда_crypto_batch_sign(source, sink, cert, attached, РезультатДвоичныеДанные)
	
	Результат = Новый_command("crypto.batch.sign", РезультатДвоичныеДанные);
	Результат.Вставить("source", source);
	Результат.Вставить("sinks", ЗначениеВМассиве(sink));
	Результат.Вставить("certs", ЗначениеВМассиве(cert));
	Результат.Вставить("attached", attached);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Команда_crypto_decrypt(source, sink, РезультатДвоичныеДанные)
	
	Результат = Новый_command("crypto.decrypt", РезультатДвоичныеДанные);
	Результат.Вставить("source", source);
	Результат.Вставить("sink", sink);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Команда_crypto_hash(data, sink, hash_type)
	
	Результат = Новый_command("crypto.hash");
	Результат.Вставить("data", data);
	Результат.Вставить("sink", sink);
	Результат.Вставить("hash_type", hash_type);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Команда_crypto_batch_hash(source, hash_type)
	
	Результат = Новый_command("crypto.batch.hash");
	Результат.Вставить("source", source);
	Результат.Вставить("sinks", Новый Массив);
	Результат.Вставить("hash_type", hash_type);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Команда_barcode_batch_write(source)
	
	Результат = Новый_command("barcode.batch.write", Истина);
	Результат.Вставить("barcode"	, "");
	Результат.Вставить("width"		, 0);
	Результат.Вставить("height"		, 0);
	Результат.Вставить("rotate"		, 0);
	Результат.Вставить("quiet_zone"	, Ложь);
	Результат.Вставить("fit"		, Ложь);
	Результат.Вставить("render_to"	, Новый Массив);
	Результат.Вставить("source"		, source);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Команда_stringSearch(string, regex)
	
	Результат = Новый_command("string.search");
	Результат.Вставить("string", string);
	Результат.Вставить("regex", regex);
	Результат.Вставить("submatches", Ложь);
	Результат.Вставить("details", Ложь);
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти // КомандыПлагина

// #КонецОбласти // Команды

// #Область РазборОтветовОтПлагина

&НаКлиенте
Функция РазобратьОтвет(Ответ)
	
	Результат = Ответ["data"];
	
	Если ЗначениеЗаполнено(Результат)
		И НужноВернутьДвоичныеДанные(Ответ) Тогда
		Результат = Base64Значение(Результат);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция РазобратьКоллекциюОтветов(Ответ, ИмяКоллекции, ПолеЗначения = "data")
	
	Результат = Новый Массив;
	Коллекция = Ответ[ИмяКоллекции];
	ВернутьДвоичныеДанные = НужноВернутьДвоичныеДанные(Ответ);
	
	Если ЗначениеЗаполнено(Коллекция) Тогда
		
		Для каждого Элемент Из ЗначениеВМассиве(Коллекция) Цикл
			
			Значение = Элемент[ПолеЗначения];
			
			Если ВернутьДвоичныеДанные И ЗначениеЗаполнено(Значение) Тогда
				Значение = Base64Значение(Значение);
			КонецЕсли;
			
			Результат.Добавить(Значение);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция РазобратьОтвет_СписокСертификатов(Ответ)
	
	certs = Ответ["certs"];
	Если Не ЗначениеЗаполнено(certs) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Результат = Новый Массив;
	Для Каждого Элемент Из ЗначениеВМассиве(certs) Цикл
		Результат.Добавить(Новый_ОписаниеСертификата(Элемент));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти // РазборОтветовПлагина

// #Область Контракты

&НаКлиенте
Функция Новый_command(type, РезультатДвоичныеДанные = Ложь)
	
	custom_data = Новый Структура;
	custom_data.Вставить("command_type", type);
	
	Если РезультатДвоичныеДанные Тогда
		custom_data.Вставить("ResultBinaryData", Истина);
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("type", type);
	Результат.Вставить("custom_data", custom_data);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Новый_content(ТипКонтента, Данные = Неопределено)
	
	Результат = Новый Структура;
	Результат.Вставить("type", ТипКонтента);
	
	Если ЗначениеЗаполнено(Данные) Тогда
		Если ТипЗнч(Данные) = Тип("ДвоичныеДанные") Тогда
			Результат.Вставить("data", Base64Строка(Данные));
		Иначе
			Результат.Вставить("data", Данные);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Новый_MultiContent(ТипКонтента, МассивЗначений)
	
	contents = Новый Массив;
	Для каждого Значение Из МассивЗначений Цикл
		Если ТипЗнч(Значение) = Тип("ДвоичныеДанные") Тогда
			contents.Добавить(Новый Структура("data", Base64Строка(Значение)));
		Иначе
			contents.Добавить(Новый Структура("data", Значение));
		КонецЕсли;
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("type", ТипКонтента);
	Результат.Вставить("contents", contents);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Новый_cert_filter(ПараметрыПоиска)
	
	Результат = Новый Структура;
	
	Если ПараметрыПоиска.Отпечаток <> Неопределено Тогда
		Результат.Вставить("hash", Новый_content("hex", ПараметрыПоиска.Отпечаток));
	КонецЕсли;
	
	Если ПараметрыПоиска.СерийныйНомер <> Неопределено Тогда
		Результат.Вставить("serialNumber", Новый_content("hex", ПараметрыПоиска.СерийныйНомер));
	КонецЕсли;
	
	Если ПараметрыПоиска.ЕстьЗакрытыйКлюч <> Неопределено Тогда
		Результат.Вставить("hasPrivateKey", ПараметрыПоиска.ЕстьЗакрытыйКлюч);
	КонецЕсли;
	
	Если ПараметрыПоиска.ТолькоПервый <> Неопределено Тогда
		Результат.Вставить("firstOnly", ПараметрыПоиска.ТолькоПервый);
	КонецЕсли;
	
	Результат.Вставить("store", Новый_cert_store(ПараметрыПоиска));
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Новый_cert_store(ПараметрыФильтра)
	
	Результат = Новый Структура;
	
	Если ТипЗнч(ПараметрыФильтра) = Тип("Структура") Тогда
		
		Если ПараметрыФильтра.Свойство("ТипХранилища") Тогда
			Результат.Вставить("storeName", Новый_cert_storeName(ПараметрыФильтра.ТипХранилища));
		КонецЕсли;
		
		Если ПараметрыФильтра.Свойство("РасположениеХранилища") Тогда
			Результат.Вставить("storeLocation", Новый_cert_storeLocation(ПараметрыФильтра.РасположениеХранилища));
		КонецЕсли;
		
	КонецЕсли;
	
	Результат.Вставить("storeType", "cryptoApi");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Новый_cert_storeName(ТипХранилища)
	
	ТипыХранилищ = Перечисление_ТипыХранилищСертификатов();
	
	Если ТипХранилища = ТипыХранилищ.КорневыеСертификаты Тогда
		Результат = "Root";
	ИначеЕсли ТипХранилища = ТипыХранилищ.ПерсональныеСертификаты Тогда
		Результат = "My";
	ИначеЕсли ТипХранилища = ТипыХранилищ.СертификатыПолучателей Тогда
		Результат = "AddressBook";
	ИначеЕсли ТипХранилища = ТипыХранилищ.СертификатыУдостоверяющихЦентров Тогда
		Результат = "CA";
	Иначе
		ВызватьИсключение ПараметрыВСтроку(НСтр(
		"ru = 'Неизвестный тип хранилища сертификатов: %1'"), ТипХранилища);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Новый_cert_storeLocation(РасположениеХранилища)
	
	РасположениеХранилищ = Перечисление_РасположениеХранилищСертификатов();
	
	Если РасположениеХранилища = РасположениеХранилищ.ЛокальныйКомпьютер Тогда
		Результат = "machine";
	ИначеЕсли РасположениеХранилища = РасположениеХранилищ.ТекущийПользователь Тогда
		Результат = "user";
	Иначе
		ВызватьИсключение ПараметрыВСтроку(НСтр(
		"ru = 'Неизвестное расположение хранилища сертификатов: %1'"), РасположениеХранилища);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Новый_certificate(Сертификат)
	
	Результат = Новый Структура;
	
	СертификатТип = ТипЗнч(Сертификат);
	
	Если СертификатТип = Тип("Строка") Тогда // Отпечаток сертификата
		
		ТипыХранилищ = Перечисление_ТипыХранилищСертификатов();
		РасположениеХранилищ = Перечисление_РасположениеХранилищСертификатов();
		
		Результат.Вставить("hash", Новый_content("hex", Сертификат));
		Результат.Вставить("storeName", Новый_cert_storeName(ТипыХранилищ.ПерсональныеСертификаты));
		Результат.Вставить("storeLocation", Новый_cert_storeLocation(РасположениеХранилищ.ТекущийПользователь));
		
	ИначеЕсли СертификатТип = Тип("ДвоичныеДанные") Тогда // Файл сертификата
		
		Результат.Вставить("content", Новый_content("base64", Сертификат));
		
	ИначеЕсли СертификатТип = Тип("Структура") Тогда // Параметры поиска сертификата
		
		Если Не Сертификат.Свойство("Отпечаток") Тогда
			ВызватьИсключение НСтр("ru = 'Не указан отпечаток сертификата, который нужно найти'");
		КонецЕсли;
		
		Результат.Вставить("hash", Новый_content("hex", Сертификат.Отпечаток));
		
		Если Сертификат.Свойство("ТипХранилища") Тогда
			Результат.Вставить("storeName", Новый_cert_storeName(Сертификат.ТипХранилища));
		КонецЕсли;
		Если Сертификат.Свойство("РасположениеХранилища") Тогда
			Результат.Вставить("storeLocation", Новый_cert_storeLocation(Сертификат.РасположениеХранилища));
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Новый_certificateProperties()
	
	Результат = Новый Структура;
	Результат.Вставить("hash", Истина);
	Результат.Вставить("serialNumber", Истина);
	Результат.Вставить("issuer", Истина);
	Результат.Вставить("subject", Истина);
	Результат.Вставить("validFrom", Истина);
	Результат.Вставить("validTo", Истина);
	Результат.Вставить("hasPrivateKey", Истина);
	Результат.Вставить("extensions", Истина);
	Результат.Вставить("keyAlgorithm", Истина);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Новый_imgContent(ФорматИзображения)
	
	Результат = Новый_content("base64");
	Результат.Вставить("format", ФорматИзображения);
	
	options = Новый Структура;
	options.Вставить("color_depth", 1);
	
	Форматы = Перечисление_ФорматыИзображений();
	Если ФорматИзображения = Форматы.PNG Тогда
		options.Вставить("png_compression_level", 9);
	КонецЕсли;
	
	Результат.Вставить("options", options);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Новый_font()
	
	Результат = Новый Структура;
	Результат.Вставить("name", "Tahoma");
	Результат.Вставить("size", 12);
	//Результат.Вставить("family", Перечисление_СемействаШрифтовШтрихкода().default);
	//Результат.Вставить("weight", Перечисление_НасыщенностиШрифтаШтрихкода().normal);
	//Результат.Вставить("style", Перечисление_НачертанияШрифтаШтрихкода().normal);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ТипШтрихкодаВТерминахПлагина(ТипШтрихкода)
	
	DataMatrix = ПредопределенноеЗначение("Перечисление.КонтурМаркировка_ТипыШтрихкодов.GS1_DataMatrix");
	Code128 = ПредопределенноеЗначение("Перечисление.КонтурМаркировка_ТипыШтрихкодов.Code128");
	GS1_128 = ПредопределенноеЗначение("Перечисление.КонтурМаркировка_ТипыШтрихкодов.GS1_128");
	EAN13 = ПредопределенноеЗначение("Перечисление.КонтурМаркировка_ТипыШтрихкодов.EAN13");
	SSCC = ПредопределенноеЗначение("Перечисление.КонтурМаркировка_ТипыШтрихкодов.SSCC");
	
	Если ТипШтрихкода = DataMatrix Тогда
		Результат = "GS1_DataMatrix";
	ИначеЕсли ТипШтрихкода = GS1_128 Или ТипШтрихкода = SSCC Тогда
		Результат = "GS1_Code128";
	ИначеЕсли ТипШтрихкода = Code128 Тогда
		Результат = "Code128";
	ИначеЕсли ТипШтрихкода = EAN13 Тогда
		Результат = "EAN13";
	Иначе
		ТекстОшибки = НСтр("ru = 'Не удалось определить тип штрихкода в терминах плагина: %1'");
		ТекстОшибки = ПараметрыВСтроку(ТекстОшибки, ТипШтрихкода);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Перечисление_СемействаШрифтовШтрихкода()
	
	Результат = Новый Структура;
	Результат.Вставить("default", "default");
	Результат.Вставить("serif", "serif");
	Результат.Вставить("sans_serif", "sans_serif");
	Результат.Вставить("monospace", "monospace");
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

&НаКлиенте
Функция Перечисление_НачертанияШрифтаШтрихкода()
	
	Результат = Новый Структура;
	Результат.Вставить("normal", "normal");
	Результат.Вставить("italic", "italic");
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

&НаКлиенте
Функция Перечисление_НасыщенностиШрифтаШтрихкода()
	
	Результат = Новый Структура;
	Результат.Вставить("normal", "normal");
	Результат.Вставить("bold", "bold");
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

// #КонецОбласти // Контракты

// #Область Плагин

&НаКлиенте
Функция ОбъектКонтурПлагина()
	
	Попытка
		Результат = СоздатьОбъектКонтурПлагина();
	Исключение
		Результат = Неопределено;
	КонецПопытки;
	
	Если Результат = Неопределено Тогда
		ПодключитьКомпонентуКонтурПлагина();
		Результат = СоздатьОбъектКонтурПлагина();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СоздатьОбъектКонтурПлагина()
	
	Результат = Новый("AddIn." + ИмяКомпонентыКонтурПлагина() + ".Kontur.1C.Plugin.SA");
	
	Результат.Type = "json";
	
	ПроверитьВерсиюКонтурПлагина(Результат);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПодключитьКомпонентуКонтурПлагина()
	
	КомпонентаПодключена = ПодключитьКомпонентуИзМакета(ИмяКомпонентыКонтурПлагина(), ПутьКМакетуКонтурПлагина());
	
	Если Не КомпонентаПодключена Тогда
		ВызватьИсключение НСтр(
		"ru = 'Не удалось подключить внешнюю компоненту Контур.Плагина'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ИмяКомпонентыКонтурПлагина()
	
	Возврат "KonturPluginMark" + "_" + СтрЗаменить(ВерсияПлагина(), ".", "_");
	
КонецФункции

&НаКлиенте
Функция ПутьКМакетуКонтурПлагина()
	
	Возврат ПутьКМакетамОбработки() + "KonturPlugin_zip";
	
КонецФункции

&НаКлиенте
Процедура ПроверитьВерсиюКонтурПлагина(ОбъектПлагина)
	
	ТребуемаяВерсия = ВерсияПлагина();
	ТекущаяВерсия = ОбъектПлагина.Version;
	
	Если СравнитьВерсии(ТекущаяВерсия, ТребуемаяВерсия) <> 0 Тогда
		ТекстОшибки = ПараметрыВСтроку(НСтр(
		"ru = 'Некорректная версия подключенного Контур.Плагина
		|Требуемая версия: %1
		|Текущая версия: %2'")
		, ТребуемаяВерсия
		, ТекущаяВерсия);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти // Плагин

// #Область ВнешняяКомпонентаПечатиШтрихкодов

&НаКлиенте
Функция ОбъектКомпонентыШтрихкодов()
	
	Попытка
		Результат = СоздатьОбъектКомпонентыШтрихкодов();
	Исключение
		Результат = Неопределено;
	КонецПопытки;
	
	Если Результат = Неопределено Тогда
		ПодключитьКомпонентуШтрихкодов();
		Результат = СоздатьОбъектКомпонентыШтрихкодов();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СоздатьОбъектКомпонентыШтрихкодов()
	
	Результат = Новый("AddIn." + ИмяКомпонентыШтрихкодов() + ".Barcode");
	
	Если Результат = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Не удалось создать объект внешней компоненты печати штрихкодов'");
	КонецЕсли;
		
	Если Не Результат.ГрафикаУстановлена Тогда
		ВызватьИсключение НСтр("ru = 'Не установлена графика для печати штрихкодов через внешнюю компоненту'");
	КонецЕсли;
	
	УстановитьПоУмолчаниюНастройкиКомпонентыШтрихкодов(Результат);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПодключитьКомпонентуШтрихкодов()
	
	КомпонентаПодключена = ПодключитьКомпонентуИзМакета(ИмяКомпонентыШтрихкодов(), ПутьКМакетуКомпонентыШтрихкодов());
	
	Если Не КомпонентаПодключена Тогда
		ВызватьИсключение НСтр(
		"ru = 'Не удалось подключить внешнюю компоненту Контур.Плагина'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ИмяКомпонентыШтрихкодов()
	
	Возврат "KonturMarkBarcode";
	
КонецФункции

&НаКлиенте
Функция ПутьКМакетуКомпонентыШтрихкодов()
	
	Возврат ПутьКМакетамОбработки() + "Barcode_zip";
	
КонецФункции

&НаКлиенте
Функция ТипШтрихкодаВТерминахКомпонентыШтрихкодов(ТипШтрихкода)
	
	Если ТипШтрихкода = ПредопределенноеЗначение("Перечисление.КонтурМаркировка_ТипыШтрихкодов.EAN13") Тогда
		Результат = 1;
	ИначеЕсли ТипШтрихкода = ПредопределенноеЗначение("Перечисление.КонтурМаркировка_ТипыШтрихкодов.SSCC") Тогда
		Результат = 4;
	ИначеЕсли ТипШтрихкода = ПредопределенноеЗначение("Перечисление.КонтурМаркировка_ТипыШтрихкодов.GS1_DataMatrix") Тогда
		Результат = 24;
	ИначеЕсли ТипШтрихкода = ПредопределенноеЗначение("Перечисление.КонтурМаркировка_ТипыШтрихкодов.QR") Тогда
		Результат = 16;
	ИначеЕсли ТипШтрихкода = ПредопределенноеЗначение("Перечисление.КонтурМаркировка_ТипыШтрихкодов.GS1_DataBarExpandedStacked") Тогда
		Результат = 17;
	Иначе
		ВызватьИсключение ПараметрыВСтроку(НСтр(
		"ru = 'Не удалось определить тип штрихкода в терминах внешней компоненты: %1'"), ТипШтрихкода);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура УстановитьПоУмолчаниюНастройкиКомпонентыШтрихкодов(Компонента)
	
	ШрифтПоУмолчанию = "Tahoma";
	
	Если Компонента.НайтиШрифт(ШрифтПоУмолчанию) Тогда
		Компонента.Шрифт = ШрифтПоУмолчанию;
	Иначе
		Для Сч = 1 По Компонента.КоличествоШрифтов Цикл
			ПервыйШрифт = Компонента.ШрифтПоИндексу(Сч - 1);
			Если ПервыйШрифт <> Неопределено Тогда
				Компонента.Шрифт = ПервыйШрифт;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Компонента.РазмерШрифта = 12;
	
КонецПроцедуры

// #КонецОбласти // ВнешняяКомпонентаПечатиШтрихкодов

// #Область ПарсерJSON

// #Область ПрограмныйИнтерфейс

// Считывает данные из строки json
//
// Параметры:
//  Строка                 - Строка - строка json, которую нужно прочитать;
//  ПрочитатьВСоответствие - Булево - Истина, если json нужно прочитать в соответствие;
// 
// Возвращаемое значение:
//  Массив       - если текст json начинается с массива;
//  Структура    - если текст json начинается с пары ключ-значение;
//  Соответствие - если текст json начинается с пары ключ-значение и ПрочитатьВСоответствие = Истина;
//
&НаКлиенте
Функция ЗначениеИзСтрокиJSON(Строка, ПрочитатьВСоответствие = Ложь) Экспорт
	
	Если ЭтоВебКлиент() Или ВерсияПлатформыНиже("8.3.6") Тогда
		Результат = ПарсерJSONДля82_Прочитать(Строка, ПрочитатьВСоответствие);
	Иначе
		Результат = ПарсерJSON_Прочитать(Строка, ПрочитатьВСоответствие);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Записывает значение в строку json
//
// Параметры:
//  Значение - Произвольный - значение, которое надо записать в json
// 
// Возвращаемое значение:
//  Строка - строка в формате json
//
&НаКлиенте
Функция ЗначениеВСтрокуJSON(Значение) Экспорт
	
	Если ЭтоВебКлиент() Или ВерсияПлатформыНиже("8.3.6") Тогда
		Результат = ПарсерJSONДля82_Записать(Значение);
	Иначе
		Результат = ПарсерJSON_Записать(Значение);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти

// #Область Парсер83

&НаКлиенте
Функция ПарсерJSON_Прочитать(Строка, ПрочитатьВСоответствие = Ложь)
	
	Результат = Неопределено;
	
	#Если Не ВебКлиент Тогда
	
	Чтение = Новый("ЧтениеJSON");
	Чтение.УстановитьСтроку(Строка);
	
	Попытка
		Результат = Вычислить("ПрочитатьJSON(Чтение, ПрочитатьВСоответствие)");
		ЧерезВременныйФайл = Ложь;
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ЧерезВременныйФайл = Истина;
	КонецПопытки;
	
	Чтение.Закрыть();
	
	Если ЧерезВременныйФайл Тогда
		
		ИмяВремФайла = ПолучитьИмяВременногоФайла();
		ТД = Новый ТекстовыйДокумент;
		ТД.УстановитьТекст(Строка);
		ТД.Записать(ИмяВремФайла);
		ТД = Неопределено;
		Чтение = Новый("ЧтениеJSON");
		Чтение.ОткрытьФайл(ИмяВремФайла);
		
		Попытка
			Результат = Вычислить("ПрочитатьJSON(Чтение, ПрочитатьВСоответствие)");
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
		КонецПопытки;
		
		Чтение.Закрыть();
		
		УдалитьФайлы(ИмяВремФайла);
		
	КонецЕсли;
	
	#КонецЕсли
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПарсерJSON_Записать(Значение)
	
	ПараметрыКонструктора = Новый Массив;
	ПараметрыКонструктора.Добавить(Вычислить("ПереносСтрокJSON.Нет"));
	ПараметрыЗаписи = Новый("ПараметрыЗаписиJSON", ПараметрыКонструктора);
	
	Запись = Новый("ЗаписьJSON");
	Запись.УстановитьСтроку(ПараметрыЗаписи);
	
	Выполнить("ЗаписатьJSON(Запись, Значение)");
	
	Результат = Запись.Закрыть();
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти

// #Область Парсер82

// #Область Чтение

&НаКлиенте
Функция ПарсерJSONДля82_Прочитать(Строка, ПрочитатьВСоответствие = Ложь) Экспорт
	
	ПараметрыЧтения = ПараметрыЧтенияJSON(Строка, ПрочитатьВСоответствие);
	Результат = ПрочитатьСтрокуJSON(ПараметрыЧтения);
	
	Возврат Результат;
	
КонецФункции

// Формирует параметры для чтения json через парсер для 8.2
//
// Параметры:
//  Строка - Строка - строка json, которую надо прочитать;
//  ПрочитатьВСоответствие - Булево - Истина, если нужно прочитать объекты json в соответствие;
// 
// Возвращаемое значение:
//  Структура - содержит поля:
//   * Элемент - Строка - значение текущего элемента json;
//   * Позиция - Число - индекс текущего элемента в массиве;
//   * МассивЭлеменов - Массив - массив элементов строки json;
//   * ВсегоЭлементов - Число - количество элементов в массиве;
//   * ПрочитатьВСоответствие - Булео - см. входящий параметр;
//
&НаКлиенте
Функция ПараметрыЧтенияJSON(Строка, ПрочитатьВСоответствие)
	
	СтрокаЭлементов = ЗаменитьЭкранированныеСимволыJSON(Строка);
	СтрокаЭлементов = РазбитьСтрокуПоСлужебнымСимволамJSON(СтрокаЭлементов);
	МассивЭлеменов = РазделитьСтрокуJSON(СтрокаЭлементов);
	
	ВосстановитьТекстыJSON(МассивЭлеменов);
	
	Результат = Новый Структура;
	Результат.Вставить("Элемент", "");
	Результат.Вставить("Позиция", -1);
	Результат.Вставить("МассивЭлеменов", МассивЭлеменов);
	Результат.Вставить("РазмерМассива", МассивЭлеменов.ВГраница());
	Результат.Вставить("ПрочитатьВСоответствие", ПрочитатьВСоответствие);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПрочитатьСтрокуJSON(ПараметрыЧтения)
	
	Результат = "";
	НачалоОбъекта = "{";
	НачалоМассива = "[";
	
	Пока СледующийЭлементJSON(ПараметрыЧтения) Цикл
		
		Если ПустаяСтрока(ПараметрыЧтения.Элемент)
			Или ЭтоРазделительJSON(ПараметрыЧтения.Элемент) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПараметрыЧтения.Элемент = НачалоОбъекта Тогда
			Результат = ПрочитатьОбъектИзСтрокиJSON(ПараметрыЧтения);
		ИначеЕсли ПараметрыЧтения.Элемент = НачалоМассива Тогда
			Результат = ПрочитатьМассивИзСтрокиJSON(ПараметрыЧтения);
		Иначе
			Результат = ПрочитатьЗначениеИзСтрокиJSON(ПараметрыЧтения);
		КонецЕсли;
		
		Прервать;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПрочитатьОбъектИзСтрокиJSON(ПараметрыЧтения)
	
	Если ПараметрыЧтения.ПрочитатьВСоответствие Тогда
		Результат = Новый Соответствие;
	Иначе
		Результат = Новый Структура;
	КонецЕсли;
	
	КонецОбъекта = "}";
	
	Пока СледующийЭлементJSON(ПараметрыЧтения) Цикл
		
		Если ПустаяСтрока(ПараметрыЧтения.Элемент)
			Или ЭтоРазделительJSON(ПараметрыЧтения.Элемент) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПараметрыЧтения.Элемент = КонецОбъекта Тогда
			Прервать;
		Иначе
			Ключ = ПрочитатьЗначениеИзСтрокиJSON(ПараметрыЧтения);
			Значение = ПрочитатьСтрокуJSON(ПараметрыЧтения);
			Результат.Вставить(Ключ, Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПрочитатьМассивИзСтрокиJSON(ПараметрыЧтения)
	
	Результат = Новый Массив;
	КонецМассива = "]";
	
	Пока СледующийЭлементJSON(ПараметрыЧтения) Цикл
		
		Если ПустаяСтрока(ПараметрыЧтения.Элемент)
			Или ЭтоРазделительJSON(ПараметрыЧтения.Элемент) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПараметрыЧтения.Элемент = КонецМассива Тогда
			Прервать;
		Иначе
			ПараметрыЧтения.Позиция = ПараметрыЧтения.Позиция - 1;
			Значение = ПрочитатьСтрокуJSON(ПараметрыЧтения);
			Результат.Добавить(Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПрочитатьЗначениеИзСтрокиJSON(ПараметрыЧтения)
	
	Элемент = СокрЛП(ПараметрыЧтения.Элемент);
	
	Кавычки = Кавычки();
	ЕстьКавычкиСлева = (Лев(Элемент, 1) = Кавычки);
	ЕстьКавычкиСправа = (Прав(Элемент, 1) = Кавычки) И СтрДлина(Элемент) > 1;
	ЭтоТекст = ЕстьКавычкиСлева И ЕстьКавычкиСправа;
	
	Если ЭтоТекст Тогда
		
		Результат = СокрЛП(СтрЗаменить(Элемент, """", ""));
		Результат = ВосстановитьЭкранированныеСимволыJSON(Результат);
		Результат = ВосстановитьНедопустимыеСимволыJSON(Результат);
		
	Иначе
		
		Попытка
			Результат = БулевоИзСтрокиJSON(Элемент);
		Исключение
			Попытка
				Результат = Число(Элемент);
			Исключение
				Результат = ВосстановитьЭкранированныеСимволыJSON(Элемент);
				Результат = ВосстановитьНедопустимыеСимволыJSON(Результат);
			КонецПопытки;
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти // Чтение

// #Область Запись

&НаКлиенте
Функция ПарсерJSONДля82_Записать(Значение)
	
	Результат = ЗаписатьЗначениеВСтрокуJSON(Значение);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ЗаписатьОбъектВСтрокуJSON(Значение);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ЗаписатьМассивВСтрокуJSON(Значение);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ЭкранироватьСимволыJSON(Значение);
	Результат = ЗаменитьНедопустимыеСимволыJSON(Результат);
	Результат = СтрокаВКавычках(Результат);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЗаписатьОбъектВСтрокуJSON(Значение)
	
	Если Не ЭтоСтруктура(Значение)
		И Не ЭтоСоответствие(Значение) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = "{";
	Разделитель = "";
	Для Каждого Элемент Из Значение Цикл
		ВложенноеЗначение = ПарсерJSONДля82_Записать(Элемент.Значение);
		Результат = Результат + Разделитель + СтрокаВКавычках(Элемент.Ключ) + ":" + ВложенноеЗначение;
		Разделитель = ",";
	КонецЦикла;
	Результат = Результат + "}";
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЗаписатьМассивВСтрокуJSON(Значение)
	
	Если Не ЭтоМассив(Значение) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = "[";
	Разделитель = "";
	Для Каждого Элемент Из Значение Цикл
		ВложенноеЗначение = ПарсерJSONДля82_Записать(Элемент);
		Результат = Результат + Разделитель + ВложенноеЗначение;
		Разделитель = ",";
	КонецЦикла;
	Результат = Результат + "]";
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЗаписатьЗначениеВСтрокуJSON(Значение)
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ТипЗначения = Тип("Булево") Тогда
		
		Результат = БулевоXML(Значение);
		
	ИначеЕсли ТипЗначения = Тип("Число") Тогда
		
		Результат = ЧислоXML(Значение);
		
	ИначеЕсли ТипЗначения = Тип("Дата") Тогда
		
		Результат = СтрокаВКавычках(ЛокальнаяДатаXML(Значение));
		
	ИначеЕсли ТипЗначения = Тип("ДвоичныеДанные") Тогда
		
		Результат = СтрокаВКавычках(Base64ИзДвоичныхДанных(Значение));
		
	ИначеЕсли Значение = Неопределено Тогда
		
		Результат = "null";
		
	Иначе
		
		Результат = Неопределено;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти // Запись

// #КонецОбласти // Парсер82

// #Область СлужебныеПроцедурыИФункцииJSON

&НаКлиенте
Функция БулевоXML(Значение)
	
	Результат = Формат(Значение, "БЛ=false; БИ=true");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЧислоXML(Значение)
	
	Результат = Формат(Значение, "ЧРД=.; ЧН=0; ЧГ=0");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЛокальнаяДатаXML(Значение)
	
	Результат = Формат(Значение, "ДФ=yyyy-MM-ddTHH:mm:ss");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВосстановитьТекстыJSON(МассивЭлеменов)
	
	Кавычки = Кавычки();
	
	Для Сч = -МассивЭлеменов.ВГраница() По 0 Цикл
		
		Индекс = -Сч;
		Элемент = СокрЛП(МассивЭлеменов[Индекс]);
		
		ЕстьКавычкиСлева = (Лев(Элемент, 1) = Кавычки) И СтрДлина(Элемент) > 1;
		ЕстьКавычкиСправа = (Прав(Элемент, 1) = Кавычки);
		
		Если ЕстьКавычкиСлева И ЕстьКавычкиСправа Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЕстьКавычкиСлева И Не ЕстьКавычкиСправа Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЕстьКавычкиСлева И ЕстьКавычкиСправа Тогда
			ПредИндекс = Индекс - 1;
			МассивЭлеменов[ПредИндекс] = МассивЭлеменов[ПредИндекс] + Элемент;
			МассивЭлеменов.Удалить(Индекс);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Увеличивает номер текущей позиции в параметрах чтения json
// и записывает значение элемента расположенного в этой позиции в поле Элемент
//
// Параметры:
//  ПараметрыЧтения - Структура - см. ПараметрыЧтенияJSON();
// 
// Возвращаемое значение:
//  Булево - Истина, если следующий элемент получить удалось;
//
&НаКлиенте
Функция СледующийЭлементJSON(ПараметрыЧтения)
	
	Если ПараметрыЧтения.Позиция < ПараметрыЧтения.РазмерМассива Тогда
		ПараметрыЧтения.Позиция = ПараметрыЧтения.Позиция + 1;
		ПараметрыЧтения.Элемент = ПараметрыЧтения.МассивЭлеменов[ПараметрыЧтения.Позиция];
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция РазделитьСтрокуJSON(Строка)
	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Тогда
		
		Стр = Символы.ПС + Строка + Символы.ПС;
		Стр = СтрЗаменить(Стр, """", """""");
		Стр = СтрЗаменить(Стр, Символы.ПС, """}," + Символы.ПС + "{""S"",""");
		
		Стр = "{""#"",51e7a0d2-530b-11d4-b98a-008048da3034,
		|{" + Формат(СтрЧислоСтрок(Стр) + 1, "ЧГ=0") + ",
		|"
		+ "{""S"","""
		+ Стр
		+ """}
		|}
		|}";
		
		Результат = ЗначениеИзСтрокиВнутр(Стр);
		Результат.Удалить(0);
		Результат.Удалить(Результат.ВГраница());
		
	#Иначе
		
		ВключатьПустые = Истина;
		Разделитель = Символы.ПС;
		Результат = РазделитьСтроку(Строка, Разделитель, ВключатьПустые);
		
	#КонецЕсли
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция РазбитьСтрокуПоСлужебнымСимволамJSON(Знач Строка)
	
	СлужебныеСимволы = "{}[]:,";
	Для Сч = 1 По СтрДлина(СлужебныеСимволы) Цикл
		ТекСимвол = Сред(СлужебныеСимволы, Сч, 1);
		Строка = СтрЗаменить(Строка, ТекСимвол, Символы.ПС + ТекСимвол + Символы.ПС);
	КонецЦикла;
	
	Возврат Строка;
	
КонецФункции

&НаКлиенте
Функция ЭкранироватьСимволыJSON(Знач Строка)
	
	Строка = СтрЗаменить(Строка, "\", "\\");
	Строка = СтрЗаменить(Строка, """", "\""");
	
	Возврат Строка;
	
КонецФункции

&НаКлиенте
Функция ЗаменитьЭкранированныеСимволыJSON(Знач Строка)
	
	Строка = СтрЗаменить(Строка, "\\", "<&sl>");
	Строка = СтрЗаменить(Строка, "\""", "<&qt>");
	
	Возврат Строка;
	
КонецФункции

&НаКлиенте
Функция ВосстановитьЭкранированныеСимволыJSON(Знач Строка)
	
	Строка = СтрЗаменить(Строка, "<&sl>", "\");
	Строка = СтрЗаменить(Строка, "<&qt>", Кавычки());
	
	Возврат Строка;
	
КонецФункции

&НаКлиенте
Функция ЗаменитьНедопустимыеСимволыJSON(Знач Строка)
	
	СимволBackspace = Символ(8);
	СимволРазделителяGS = Символ(29);
	
	Строка = СтрЗаменить(Строка, Символы.ПФ, "\f");
	Строка = СтрЗаменить(Строка, Символы.ПС, "\n");
	Строка = СтрЗаменить(Строка, Символы.ВК, "\r");
	Строка = СтрЗаменить(Строка, Символы.ВТаб, "\t");
	Строка = СтрЗаменить(Строка, СимволBackspace, "\b");
	Строка = СтрЗаменить(Строка, СимволРазделителяGS, "\u001D");
	
	Возврат Строка;
	
КонецФункции

&НаКлиенте
Функция ВосстановитьНедопустимыеСимволыJSON(Знач Строка)
	
	СимволBackspace = Символ(8);
	СимволРазделителяGS = Символ(29);
	
	Строка = СтрЗаменить(Строка, "\f", Символы.ПФ);
	Строка = СтрЗаменить(Строка, "\n", Символы.ПС);
	Строка = СтрЗаменить(Строка, "\r", Символы.ВК);
	Строка = СтрЗаменить(Строка, "\t", Символы.ВТаб);
	Строка = СтрЗаменить(Строка, "\b", СимволBackspace);
	Строка = СтрЗаменить(Строка, "\u001d", СимволРазделителяGS);
	Строка = СтрЗаменить(Строка, "\u001D", СимволРазделителяGS);
	
	Возврат Строка;
	
КонецФункции

&НаКлиенте
Функция ЭтоРазделительJSON(Строка)
	
	Результат = Строка = "," Или Строка = ":";
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция БулевоИзСтрокиJSON(Строка)
	
	Если НРег(Строка) = "true" Тогда
		Результат = Истина;
	ИначеЕсли НРег(Строка) = "false" Тогда
		Результат = Ложь;
	Иначе
		ВызватьИсключение ПараметрыВСтроку(
		НСтр("ru = 'Не удалось преобразовать json строку в булево: %1'"), Строка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти // СлужебныеПроцедурыИФункции

// #КонецОбласти // ПарсерJSON

// #Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПодключитьКомпонентуИзМакета(ИмяКомпоненты, ПутьКМакету)
	
	КомпонентаПодключена = ПодключитьКомпоненту(ПутьКМакету, ИмяКомпоненты);
	
	#Если Не Сервер Тогда
		Если Не КомпонентаПодключена Тогда
			УстановитьВнешнююКомпоненту(ПутьКМакету);
			КомпонентаПодключена = ПодключитьКомпоненту(ПутьКМакету, ИмяКомпоненты);
		КонецЕсли;
	#КонецЕсли
	
	Возврат КомпонентаПодключена;
	
КонецФункции

&НаКлиенте
Функция ВыполнитьКоманду(Команда, Плагин)
	
	СтрокаЗапроса = ЗначениеВСтрокуJSON(Команда);
	СтрокаОтвета = Плагин.Send(СтрокаЗапроса);
	Результат = ЗначениеИзСтрокиJSON(СтрокаОтвета, Истина);
	
	ПроверитьОтвет(Результат, СтрокаОтвета);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция НачатьАсинхроннуюЗадачу(Команда, Плагин)
	
	ИдентификаторЗадачи = Строка(Новый УникальныйИдентификатор);
	Запрос = ЗначениеВСтрокуJSON(Команда);
	Ответ = Плагин.Send_Async(ИдентификаторЗадачи, Запрос);
	
	Возврат ИдентификаторЗадачи;
	
КонецФункции

&НаКлиенте
Функция РезультатАсинхроннойЗадачи(ИдентификаторЗадачи, Плагин)
	
	Ответ = Плагин.GetResult(ИдентификаторЗадачи);
	Плагин.DeleteResult(ИдентификаторЗадачи);
	
	Результат = ЗначениеИзСтрокиJSON(Ответ, Истина);
	
	ПроверитьОтвет(Результат, Ответ);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция АсинхроннаяЗадачаВыполнена(ИдентификаторЗадачи, Плагин)
	
	Возврат Плагин.HasResult(ИдентификаторЗадачи);
	
КонецФункции

&НаКлиенте
Процедура ПроверитьОтвет(Ответ, СтрокаОтвета)
	
	Если ЗначениеЗаполнено(Ответ["error"]) Тогда
		ТекстОшибки = ПараметрыВСтроку(НСтр(
		"ru = 'Ошибка Kontur.1C.Plugin
		|%1'"), СтрокаОтвета);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКорректностьУглаПоворотаШтрихкодов(ОписаниеШтрихкодов)
	
	КратностьУглаПоворота = 90;
	
	Если ОписаниеШтрихкодов.УголПоворота % КратностьУглаПоворота <> 0 Тогда
		
		ТекстОшибки = НСтр(
		"ru = 'Некорректный угол поворота картинки штрихкода: %1
		|Допустимые значения: 0, 90, 180, 270'");
		ТекстОшибки = ПараметрыВСтроку(ТекстОшибки, ОписаниеШтрихкодов.УголПоворота);
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
КонецПроцедуры

// Определяет, нужно ли вернуть результат двоичными данными
//
// Параметры:
//  Ответ - Соответствие - ответ от плагина, см. ВыполнитьКоманду()
// 
// Возвращаемое значение:
//  Булево - Истина, если в качестве результата нужно вернуть двоичные данные
//
&НаКлиенте
Функция НужноВернутьДвоичныеДанные(Ответ)
	
	Результат = (Ответ["custom_data"]["ResultBinaryData"] <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция КартинкиШтрихкодовЧерезКомпоненту(МассивШтрихкодов, ПараметрыКартинки)
	
	ТипШтрихкода = ПараметрыКартинки.ТипШтрихкода;
	
	Компонента = ОбъектКомпонентыШтрихкодов();
	Компонента.Ширина = ПараметрыКартинки.Ширина;
	Компонента.Высота = ПараметрыКартинки.Высота;
	Компонента.УголПоворота = ПараметрыКартинки.УголПоворота;
	// Компонента.ОтображатьТекст = ПараметрыКартинки.ОтображатьТекст;
	Компонента.ОтображатьТекст = Ложь;
	
	//Если ПараметрыКартинки.ОтображатьТекст Тогда
	//	Компонента.Шрифт = ПараметрыКартинки.Шрифт;
	//	Компонента.РазмерШрифта = ПараметрыКартинки.РазмерШрифта;
	//КонецЕсли;
	
	Компонента.АвтоТип = Ложь;
	Компонента.ТипКода = ТипШтрихкодаВТерминахКомпонентыШтрихкодов(ПараметрыКартинки.ТипШтрихкода);
	
	Если ТипШтрихкода = ПредопределенноеЗначение("Перечисление.КонтурМаркировка_ТипыШтрихкодов.GS1_DataBarExpandedStacked") Тогда
		Компонента.GS1DatabarКоличествоСтрок = 1;
	КонецЕсли;
	
	Результат = Новый Массив;
	Для каждого Штрихкод Из МассивШтрихкодов Цикл
		Компонента.ЗначениеКода = Штрихкод;
		КартинкаШтрихкода = Компонента.ПолучитьШтрихкод();
		Результат.Добавить(КартинкаШтрихкода);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПутьКМакетамОбработки()
	
	Возврат "Обработка.КонтурМаркировка_Плагин.Макет.";
	
КонецФункции

// #КонецОбласти // СлужебныеПроцедурыИФункции

// #Область МетодыОбщегоНазначения

&НаКлиенте
Функция ЭтоВебКлиент()
	
	#Если ВебКлиент Тогда
		Результат = Истина;
	#Иначе
		Результат = Ложь;
	#КонецЕсли
	
	Возврат Результат;
	
КонецФункции

// Разделяет текст на части по указанному разделителю
//
// Параметры:
//  Строка - Строка - разделяемый текст;
//  Разделитель - Строка - (необязательный) значение разделителя;
//  ВключатьПустые - Булево - Истина, если пустые части нужно включить в результат;
// 
// Возвращаемое значение:
//  Массив - содержит части текста
//
&НаКлиенте
Функция РазделитьСтроку(Знач Строка, Разделитель = ",", ВключатьПустые = Ложь)
	
	Результат = Новый Массив;
	ДлинаРазделителя = СтрДлина(Разделитель);
	
	Пока Истина Цикл
		
		Поз = Найти(Строка, Разделитель);
		
		Если Поз = 0 Тогда
			ЧастьСтроки = СокрЛП(Строка);
			Строка = "";
		Иначе
			ЧастьСтроки = СокрЛП(Лев(Строка, Поз - 1));
			Строка = Сред(Строка, Поз + ДлинаРазделителя);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЧастьСтроки) Или ВключатьПустые Тогда
			Результат.Добавить(ЧастьСтроки);
		КонецЕсли;
		
		Если Поз = 0 Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Подставляет параметры в строку, максимальное число параметров - 5
//
// Параметры:
//  ШаблонСтроки - Строка - шаблон с маркерами подстановки: "%1..%N";
//  Параметр<n>  - Строка - параметры, которые нужно подставить;
//
// Возвращаемое значение:
//   Строка - строка шаблона с подставленными параметрами.
//
&НаКлиенте
Функция ПараметрыВСтроку(ШаблонСтроки, Параметр1
	, Параметр2 = Неопределено
	, Параметр3 = Неопределено
	, Параметр4 = Неопределено
	, Параметр5 = Неопределено)
	
	ЕстьПараметрыСПроцентом =
	Найти(Параметр1, "%") > 0
	Или Найти(Параметр2, "%") > 0
	Или Найти(Параметр3, "%") > 0
	Или Найти(Параметр4, "%") > 0
	Или Найти(Параметр5, "%") > 0;
	
	Если ЕстьПараметрыСПроцентом Тогда
		Возврат ПараметрыСПроцентомВСтроку(ШаблонСтроки
		, Параметр1, Параметр2, Параметр3, Параметр4, Параметр5);
	КонецЕсли;
	
	Результат = СтрЗаменить(ШаблонСтроки, "%1", Параметр1);
	Результат = СтрЗаменить(Результат	, "%2", Параметр2);
	Результат = СтрЗаменить(Результат	, "%3", Параметр3);
	Результат = СтрЗаменить(Результат	, "%4", Параметр4);
	Результат = СтрЗаменить(Результат	, "%5", Параметр5);
	
	Возврат Результат;
	
КонецФункции

// Вставляет параметры в строку, с учетом того что в параметрах
// могут использоваться подстановочные слова %1, %2, %3, %4, %5
//
&НаКлиенте
Функция ПараметрыСПроцентомВСтроку(Знач ШаблонСтроки
	, Параметр1 = Неопределено
	, Параметр2 = Неопределено
	, Параметр3 = Неопределено
	, Параметр4 = Неопределено
	, Параметр5 = Неопределено)
	
	Результат = "";
	
	Пока Истина Цикл
		
		Поз = Найти(ШаблонСтроки, "%");
		
		Если Поз = 0 Тогда
			Прервать;
		КонецЕсли;
		
		Результат = Результат + Лев(ШаблонСтроки, Поз - 1);
		
		НомерПараметра = Сред(ШаблонСтроки, Поз + 1, 1);
		
		Если НомерПараметра = "1" Тогда
			ЗначениеПараметра = Параметр1;
		ИначеЕсли НомерПараметра = "2" Тогда
			ЗначениеПараметра = Параметр2;
		ИначеЕсли НомерПараметра = "3" Тогда
			ЗначениеПараметра = Параметр3;
		ИначеЕсли НомерПараметра = "4" Тогда
			ЗначениеПараметра = Параметр4;
		ИначеЕсли НомерПараметра = "5" Тогда
			ЗначениеПараметра = Параметр5;
		Иначе
			ЗначениеПараметра = Неопределено;
		КонецЕсли;
		
		Если ЗначениеПараметра = Неопределено Тогда
			Результат = Результат + "%";
			ШаблонСтроки = Сред(ШаблонСтроки, Поз + 1);
		Иначе
			Результат = Результат + ЗначениеПараметра;
			ШаблонСтроки = Сред(ШаблонСтроки, Поз + 2);
		КонецЕсли;
		
	КонецЦикла;
	
	Результат = Результат + ШаблонСтроки;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Кавычки()
	
	Возврат """";
	
КонецФункции

// Оборачивает строку в кавычки
//
// Параметры:
//  Строка - Строка - строка
// 
// Возвращаемое значение:
//  Строка
//
&НаКлиенте
Функция СтрокаВКавычках(Строка)
	
	Возврат Кавычки() + Строка + Кавычки();
	
КонецФункции

// Получает строку в Base64 из двоичных данных,
// удаляя при этом символы переноса строк
// 
// Параметры:
//  ДвоичныеДанные - ДвоичныеДанные - Двоичные данные
// 
// Возвращаемое значение:
//  Строка - Строка в Base64
//
&НаКлиенте
Функция Base64ИзДвоичныхДанных(ДвоичныеДанные)
	
	Результат = Base64Строка(ДвоичныеДанные);
	Результат = СтрЗаменить(Результат, Символы.ПС, "");
	Результат = СтрЗаменить(Результат, Символы.ВК, "");
	
	Возврат Результат;
	
КонецФункции

// Определяет, является ли переданное значение структурой
// или фиксированной структурой
// 
// Параметры:
//  Значение - Произвольный - значение, которое нужно проверить
// 
// Возвращаемое значение:
//  Булево - Истина, если переданое значение является структрой или фиксированной структурой
//
&НаКлиенте
Функция ЭтоСтруктура(Значение)
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ТипЗначения = Тип("Структура")
		Или ТипЗначения = Тип("ФиксированнаяСтруктура") Тогда
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Определяет, является ли переданное значение соответствием
// или фиксированным соответствием
// 
// Параметры:
//  Значение - Произвольный - значение, которое нужно проверить
// 
// Возвращаемое значение:
//  Булево - Истина, если переданое значение является соответствием или фиксированным соответствием
//
&НаКлиенте
Функция ЭтоСоответствие(Значение)
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ТипЗначения = Тип("Соответствие")
		Или ТипЗначения = Тип("ФиксированноеСоответствие") Тогда
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Определяет, является ли переданное значение массивом
// или фиксированным массивом
// 
// Параметры:
//  Значение - Произвольный - значение, которое нужно проверить
// 
// Возвращаемое значение:
//  Булево - Истина, если переданое значение является структрой или фиксированной структурой
//
&НаКлиенте
Функция ЭтоМассив(Значение)
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ТипЗначения = Тип("Массив")
		Или ТипЗначения = Тип("ФиксированныйМассив") Тогда
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Добавляет значение в массив
//
// Параметры:
//  Значение - Произвольный - преобразуемое значение
//
// Возвращаемое значение:
//  Массив
//
&НаКлиенте
Функция ЗначениеВМассиве(Значение)
	
	Если ТипЗнч(Значение) = Тип("Массив") Тогда
		
		Результат = Значение;
		
	Иначе
		
		Результат = Новый Массив;
		Результат.Добавить(Значение);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Дополняет массив значениями из другого массива
//
// Параметры:
//  МассивПриемник - Массив - массив, в который необходимо добавить значения;
//  МассивИсточник - Массив - массив, из которого нужно взять значения;
//  ТолькоНовыеЗначения - Булево - (необязательный) Истина, если в приемник
//                   нужно добавить только те значения, которых там еще нет;
//
&НаКлиенте
Процедура ДополнитьМассив(МассивПриемник, МассивИсточник, ТолькоНовыеЗначения = Ложь)
	
	Если ТолькоНовыеЗначения Тогда
		
		ЗначенияПриемника = Новый Соответствие;
		
		Для Каждого Значение Из МассивПриемник Цикл
			ЗначенияПриемника.Вставить(Значение, Истина);
		КонецЦикла;
		
		Для Каждого Значение Из МассивИсточник Цикл
			
			Если ЗначенияПриемника[Значение] = Неопределено Тогда
				
				МассивПриемник.Добавить(Значение);
				
				ЗначенияПриемника.Вставить(Значение, Истина);
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Для Каждого Значение Из МассивИсточник Цикл
			МассивПриемник.Добавить(Значение);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Получает дату из строки по формату ISO 8601
//
// Параметры:
//  Строка - Строка - дата в формате ISO 8601
// 
// Возвращаемое значение:
//  Дата
//
&НаКлиенте
Функция ДатаИзСтрокиXML(Строка)
	
	Если Не ЗначениеЗаполнено(Строка) Тогда
		Возврат '00010101';
	КонецЕсли;
	
	#Если ВебКлиент Тогда
		Результат = ДатаИзСтрокиXMLНаСервере(Строка);
	#Иначе
		Результат = XMLЗначение(Тип("Дата"), Строка);
	#КонецЕсли
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДатаИзСтрокиXMLНаСервере(Строка)
	
	Возврат XMLЗначение(Тип("Дата"), Строка);
	
КонецФункции

// Сравнить две строки версий
//
// Параметры
//  СтрокаВерсии1 - Строка - номер версии в формате РР.{П|ПП}.ЗЗ.СС
//  СтрокаВерсии2 - Строка - второй сравниваемый номер версии
//
// Возвращаемое значение:
//   Число - больше 0, если СтрокаВерсии1 > СтрокаВерсии2; 0, если версии равны.
//
&НаКлиенте
Функция СравнитьВерсии(СтрокаВерсии1, СтрокаВерсии2)
	
	// Для составных номеров версий берем только первую часть.
	Строка1 = Сред(СтрокаВерсии1, 1, Найти(СтрокаВерсии1, "/") - 1);
	Строка2 = Сред(СтрокаВерсии2, 1, Найти(СтрокаВерсии2, "/") - 1);
	
	ОписаниеЧисла = Новый ОписаниеТипов("Число");
	
	Результат = 0;
	
	Пока ЗначениеЗаполнено(Строка1)
		Или ЗначениеЗаполнено(Строка2) Цикл
		
		Поз = Найти(Строка1, ".");
		Если Поз = 0 Тогда
			Подстрока1 = СокрЛП(Строка1);
			Строка1 = "";
		Иначе
			Подстрока1 = СокрЛП(Лев(Строка1, Поз - 1));
			Строка1 = Сред(Строка1, Поз + 1);
		КонецЕсли;
		
		Поз = Найти(Строка2, ".");
		Если Поз = 0 Тогда
			Подстрока2 = СокрЛП(Строка2);
			Строка2 = "";
		Иначе
			Подстрока2 = СокрЛП(Лев(Строка2, Поз - 1));
			Строка2 = Сред(Строка2, Поз + 1);
		КонецЕсли;
		
		НомерВерсии1 = ОписаниеЧисла.ПривестиЗначение(Подстрока1);
		НомерВерсии2 = ОписаниеЧисла.ПривестиЗначение(Подстрока2);
		
		Результат = НомерВерсии1 - НомерВерсии2;
		
		Если Результат <> 0 Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Сравнивает указанную версию с версией платформы
//
// Параметры:
//  Версия - Строка - версия, с которой нужно сравнить версию платформы;
// 
// Возвращаемое значение:
//  Булево - Истина, если версия платформы ниже указанной
//
&НаКлиенте
Функция ВерсияПлатформыНиже(Версия)
	
	КлючКэш = "ВерсияПлатформыНиже: " + Версия;
	Результат = Кэш_Прочитать(КлючКэш);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = (СравнитьВерсии(ВерсияПлатформы(), Версия) < 0);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ВерсияПлатформы()
	
	Возврат ИнформацияОСистеме().ВерсияПриложения;
	
КонецФункции

&НаКлиенте
Функция ИнформацияОСистеме()
	
	// BSLLS:UseSystemInformation-off
	Возврат Новый СистемнаяИнформация;
	// BSLLS:UseSystemInformation-on
	
КонецФункции

&НаКлиенте
Функция ПодключитьКомпоненту(ПутьКМакету, ИмяКомпоненты)
	
	ТипКомпоненты = ТипВнешнейКомпоненты.Native;
	
	Если ВерсияПлатформыНиже("8.3.21") Тогда
		Результат = ПодключитьВнешнююКомпоненту(ПутьКМакету, ИмяКомпоненты, ТипКомпоненты);
	Иначе
		Результат = Вычислить("ПодключитьВнешнююКомпоненту(ПутьКМакету, ИмяКомпоненты, ТипКомпоненты,
		|ТипПодключенияВнешнейКомпоненты.НеИзолированно)");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура НачатьУстановкуКомпоненты(ПутьКМакету)
	
	#Если Не Сервер Тогда
		Если ВерсияПлатформыНиже("8.3.3") Тогда
			УстановитьВнешнююКомпоненту(ПутьКМакету);
		Иначе
			Выполнить("НачатьУстановкуВнешнейКомпоненты(, ПутьКМакету)");
		КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

// #КонецОбласти // МетодыОбщегоНазначения

// #Область ЛокальныйКэш

&НаКлиенте
Функция Кэш_Прочитать(ИмяЗначения)
	
	Если Кэш = Неопределено Тогда
		Кэш = Новый Соответствие;
	КонецЕсли;
	
	Возврат Кэш[ИмяЗначения];
	
КонецФункции

&НаКлиенте
Процедура Кэш_Поместить(ИмяЗначения, Значение)
	
	Если Кэш = Неопределено Тогда
		Кэш = Новый Соответствие;
	КонецЕсли;
	
	Кэш.Вставить(ИмяЗначения, Значение);
	
КонецПроцедуры

// #КонецОбласти // ЛокальныйКэш
