// #Область СлужебныеПеременныеИМетодыФормы

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		Результат = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		Результат = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

// #КонецОбласти

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьКонтекст_УстановитьВидимость();
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	
	Если КонтекстФормы.Свойство("НазначитьНаДругоеУстройство") Тогда
		КонтекстФормы.НазначитьНаДругоеУстройство = Истина;
	КонецЕсли;
	
	Если КонтекстФормы.Свойство("ВернутьНаДругоеУстройство") Тогда
		КонтекстФормы.ВернутьНаДругоеУстройство = Истина;
	КонецЕсли;
	
	ЗакрытьСКонтекстом();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАдресТелефонПоПоследнейДоставкеНаСервере(ИННКонтрагента)
	
	КонтактнаяИнформация = МодульОбъекта().ПодборКодовНаТСД_ПоследниеКонтактныеДанные(ИННКонтрагента);
	
	Если ЗначениеЗаполнено(КонтактнаяИнформация.АдресДоставки) Тогда
		АдресДоставки = КонтактнаяИнформация.АдресДоставки;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КонтактнаяИнформация.КонтактныйТелефон) Тогда
		КонтактныйТелефон = КонтактнаяИнформация.КонтактныйТелефон;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАдресТелефонПоПоследнейДоставке(Команда)
	
	ЗаполнитьАдресТелефонПоПоследнейДоставкеНаСервере(ЭтаФорма.ВладелецФормы.КонтрагентИНН);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьКонтекст_УстановитьВидимость()
	
	КонтекстФормы = Параметры.КонтекстФормы;
	
	РедактироватьАдрес   = Ложь;
	РедактироватьТелефон = Ложь;
	
	ТолькоПросмотрЭлементов = Ложь;
	
	Если КонтекстФормы.Свойство("ТолькоПросмотр") Тогда
		ТолькоПросмотрЭлементов = КонтекстФормы.ТолькоПросмотр;
	КонецЕсли;
	
	ЭтаФорма.ТолькоПросмотр = ТолькоПросмотрЭлементов;
	
	Если КонтекстФормы.Свойство("ЗаголовокРедактирования") Тогда
		ЭтаФорма.Заголовок = КонтекстФормы.ЗаголовокРедактирования;
	КонецЕсли;
	
	Если КонтекстФормы.Свойство("КонтрагентНаименование") Тогда
		Элементы.КонтрагентНаименование.Видимость = Истина;
		КонтрагентНаименование = КонтекстФормы.КонтрагентНаименование;
	КонецЕсли;
	
	Если КонтекстФормы.Свойство("КонтрагентИНН") Тогда
		Элементы.КонтрагентИНН.Видимость = Истина;
		Элементы.КонтрагентИНН.ТолькоПросмотр = ТолькоПросмотрЭлементов;
		КонтрагентИНН = КонтекстФормы.КонтрагентИНН;
	КонецЕсли;
	
	Если КонтекстФормы.Свойство("КонтрагентКПП") Тогда
		Элементы.КонтрагентКПП.Видимость = Истина;
		Элементы.КонтрагентКПП.ТолькоПросмотр = ТолькоПросмотрЭлементов;
		КонтрагентКПП = КонтекстФормы.КонтрагентКПП;
	КонецЕсли;
	
	Если КонтекстФормы.Свойство("МобильноеУстройство") Тогда
		Элементы.МобильноеУстройство.Видимость = Истина;
		Элементы.МобильноеУстройство.ТолькоПросмотр = ТолькоПросмотрЭлементов;
		МобильноеУстройство = КонтекстФормы.МобильноеУстройство;
	КонецЕсли;
	
	Если КонтекстФормы.Свойство("АдресДоставки") Тогда
		Элементы.АдресДоставки.Видимость = Истина;
		Элементы.АдресДоставки.ТолькоПросмотр = ТолькоПросмотрЭлементов;
		АдресДоставки = КонтекстФормы.АдресДоставки;
		РедактироватьАдрес = Истина;
	КонецЕсли;
	
	Если КонтекстФормы.Свойство("КонтактныйТелефон") Тогда
		Элементы.КонтактныйТелефон.Видимость = Истина;
		Элементы.КонтактныйТелефон.ТолькоПросмотр = ТолькоПросмотрЭлементов;
		КонтактныйТелефон = КонтекстФормы.КонтактныйТелефон;
		РедактироватьТелефон = Истина;
	КонецЕсли;
	
	Если РедактироватьАдрес Или РедактироватьТелефон Тогда
		Элементы.ЗаполнитьАдресТелефонПоПоследнейДоставке.Видимость = Не ТолькоПросмотрЭлементов;
	КонецЕсли;
	
	Если КонтекстФормы.Свойство("КомментарийВозвратаНаТСД") Тогда
		Элементы.КомментарийВозвратаНаТСД.Видимость = Истина;
		КомментарийВозвратаНаТСД = КонтекстФормы.КомментарийВозвратаНаТСД;
	КонецЕсли;
	
	Если КонтекстФормы.Свойство("НазначитьНаДругоеУстройство")
		Или КонтекстФормы.Свойство("ВернутьНаДругоеУстройство")Тогда
		Элементы.КнопкаЗавершитьРедактирование.Заголовок = НСтр("ru = 'Продолжить'");
	Иначе
		Элементы.КнопкаЗавершитьРедактирование.Заголовок = НСтр("ru = 'Ок'");
	КонецЕсли;
	
	Если КонтекстФормы.Свойство("Операция") Тогда
		Операция = КонтекстФормы.Операция;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСКонтекстом()
	
	ЗакрытиеСКонтекстом = Истина;
	
	ЗаполнитьЗначенияСвойств(КонтекстФормы, ЭтаФорма);
	
	Закрыть(КонтекстФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура МобильноеУстройствоОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(МобильноеУстройство) Тогда
		МодульКлиента().ОткрытьФормуМобильноеУстройство(МобильноеУстройство, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МобильноеУстройствоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ТолькоНазначенныеЗадания", Истина);
	ПараметрыФормы.Вставить("ТекущееУстройство", МобильноеУстройство);
	
	МодульКлиента().ОткрытьФормуОбработки("Форма_МобильныеУстройства_Список", Элемент, ПараметрыФормы);
	
КонецПроцедуры

// #КонецОбласти
