
#Если Сервер Или ТолстыйКлиентУправляемоеПриложение Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Признак "Клиент (управляемое приложение)" и инструкция препроцессора установлены
// для поддержки толстого клиента в управляемом приложении в режиме клиент-сервер
// Смотрите п.2 в статье ИТС https://its.1c.ru/db/v8std#content:680:hdoc

// #Область ПрограммныйИнтерфейс

// Безопасно читает свойство объекта, даже если объект не определен
//
// Параметры:
//  Объект - Произвольное - любой объект;
//  ИмяПоля - Строка - имя поля;
//  ЗначениеПоУмолчанию - Произвольный - (необязательный) возвращается,
//            если у объекта нет такого поля или значение Неопределено;
// 
// Возвращаемое значение:
//  Произвольное - значение поля
//
Функция СвойствоОбъекта(Объект, ИмяПоля, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Попытка
		
		Результат = Объект[ИмяПоля];
		
		Если Результат = Неопределено Тогда
			Результат = ЗначениеПоУмолчанию;
		КонецЕсли;
		
	Исключение
		Результат = ЗначениеПоУмолчанию;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// #Область СтроковыеФункции

// Разделяет строку на части по указанному разделителю
//
// Параметры:
//  Строка - Строка - разделяемый текст;
//  Разделитель - Строка - (необязательный) значение разделителя;
//  ВключатьПустые - Булево - Истина, если пустые части нужно включить в результат;
// 
// Возвращаемое значение:
//  Массив - содержит части текста
//
Функция РазделитьСтроку(Знач Строка, Разделитель = ",", ВключатьПустые = Ложь) Экспорт
	
	ДлинаРазделителя = СтрДлина(Разделитель);
	
	Если ДлинаРазделителя = 1
		И Не ВерсияПлатформыНиже("8.3.6")
		И Не ВерсияРежимаСовместимостиНиже("8.3.6") Тогда
		
		Результат = Вычислить("СтрРазделить(Строка, Разделитель, ВключатьПустые)");
		
		Для Сч = 0 По Результат.ВГРаница() Цикл
			Результат[Сч] = СокрЛП(Результат[Сч]);
		КонецЦикла;
		
		Возврат Результат;
		
	КонецЕсли;
	
	Результат = Новый Массив;
	
	Пока Истина Цикл
		
		Поз = Найти(Строка, Разделитель);
		
		Если Поз = 0 Тогда
			ЧастьСтроки = СокрЛП(Строка);
			Строка = "";
		Иначе
			ЧастьСтроки = СокрЛП(Лев(Строка, Поз - 1));
			Строка = Сред(Строка, Поз + ДлинаРазделителя);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЧастьСтроки) Или ВключатьПустые Тогда
			Результат.Добавить(ЧастьСтроки);
		КонецЕсли;
		
		Если Поз = 0 Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Соединяет части в одну строку с указанным разделителем
// По аналогии с методом платформы СтрСоединить
// 
// Параметры:
//  ЧастиСтроки - Массив - части строки;
//  Разделитель - Строка - (необязательный) разделитель строк;
//
// Возвращаемое значение:
//  Строка - строка состоящая из всех частей
//
Функция СоединитьСтроку(ЧастиСтроки, Разделитель = "") Экспорт
	
	Если Не ВерсияПлатформыНиже("8.3.6")
		И Не ВерсияРежимаСовместимостиНиже("8.3.6") Тогда
		Результат = Вычислить("СтрСоединить(ЧастиСтроки, Разделитель)");
		Возврат Результат;
	КонецЕсли;
	
	Результат = "";
	ТекРазделитель = "";
	
	Если ЗначениеЗаполнено(ЧастиСтроки) Тогда
		Для Каждого ЧастьСтроки Из ЧастиСтроки Цикл
			Если ЗначениеЗаполнено(ЧастьСтроки) Тогда
				Результат = Результат + ТекРазделитель + ЧастьСтроки;
				ТекРазделитель = Разделитель;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Подставляет в строку до 5 параметров
//
// Параметры:
//  ШаблонСтроки - Строка - шаблон с маркерами подстановки: "%1..%5";
//  Параметр1 - Строка - параметр №1;
//  Параметр2 - Строка - (необязательный) параметр №2;
//  Параметр3 - Строка - (необязательный) параметр №3;
//  Параметр4 - Строка - (необязательный) параметр №4;
//  Параметр5 - Строка - (необязательный) параметр №5;
//
// Возвращаемое значение:
//   Строка - строка шаблона с подставленными параметрами
//
Функция ПараметрыВСтроку(ШаблонСтроки, Параметр1
	, Параметр2 = Неопределено
	, Параметр3 = Неопределено
	, Параметр4 = Неопределено
	, Параметр5 = Неопределено) Экспорт
	
	ЕстьПараметрыСПроцентом =
	Найти(Параметр1, "%") > 0
	Или Найти(Параметр2, "%") > 0
	Или Найти(Параметр3, "%") > 0
	Или Найти(Параметр4, "%") > 0
	Или Найти(Параметр5, "%") > 0;
	
	Если ЕстьПараметрыСПроцентом Тогда
		Возврат ПараметрыСПроцентомВСтроку(ШаблонСтроки
		, Параметр1, Параметр2, Параметр3, Параметр4, Параметр5);
	КонецЕсли;
	
	Результат = СтрЗаменить(ШаблонСтроки, "%1", Параметр1);
	Результат = СтрЗаменить(Результат	, "%2", Параметр2);
	Результат = СтрЗаменить(Результат	, "%3", Параметр3);
	Результат = СтрЗаменить(Результат	, "%4", Параметр4);
	Результат = СтрЗаменить(Результат	, "%5", Параметр5);
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти // СтроковыеФункции

// #Область РаботаСВерсиями

// Сравнивает версии между собой, значения после дефиса или слэша не учитываются
//
// Параметры
//  Версия1 - Строка - номер версии в формате РР.{П|ПП}.ЗЗ.СС;
//  Версия2 - Строка - второй сравниваемый номер версии;
//
// Возвращаемое значение:
//  Число - возможные значения:
//   * больше 0 - если Версия1 > Версия2;
//   * меньше 0 - если Версия1 < Версия2;
//   * 0 - если версии равны;
//
Функция СравнитьВерсии(Версия1, Версия2) Экспорт
	
	Возврат ОбщегоНазначенияКонтурМаркировкаПовтИсп.СравнитьВерсии(Версия1, Версия2);
	
КонецФункции

// Возвращает версию используемой платформы
// 
// Возвращаемое значение:
//  Строка - версия приложения;
//
Функция ВерсияПлатформы() Экспорт
	
	Возврат ИнформацияОСистеме().ВерсияПриложения;
	
КонецФункции

// Возвращает версию режима совместимости,
// если его нет, то возвращает версию платформы
// 
// Возвращаемое значение:
//  Строка - версия режима совместимости
//
Функция ВерсияРежимаСовместимости() Экспорт
	
	Возврат ОбщегоНазначенияКонтурМаркировкаПовтИсп.ВерсияРежимаСовместимости();
	
КонецФункции

// Сравнивает указанную версию с версией платформы
//
// Параметры:
//  Версия - Строка - версия, с которой нужно сравнить версию платформы;
// 
// Возвращаемое значение:
//  Булево - Истина, если версия платформы ниже указанной
//
Функция ВерсияПлатформыНиже(Версия) Экспорт
	
	Возврат ОбщегоНазначенияКонтурМаркировкаПовтИсп.ВерсияПлатформыНиже(Версия);
	
КонецФункции

// Сравнивает указанную версию с версией режима совместимости
//
// Параметры:
//  Версия - Строка - версия, с которой нужно сравнить версию платформы;
// 
// Возвращаемое значение:
//  Булево - Истина, если версия платформы ниже указанной
//
Функция ВерсияРежимаСовместимостиНиже(Версия) Экспорт
	
	Возврат ОбщегоНазначенияКонтурМаркировкаПовтИсп.ВерсияРежимаСовместимостиНиже(Версия);
	
КонецФункции

// #КонецОбласти // РаботаСВерсиями

// #Область ФайловаяСистема

// Проверяет, что файл есть на диске
//
// Параметры:
//  ПутьКФайлу - Строка - путь к файлу;
// 
// Возвращаемое значение:
//  Булево - Истина, если файл существует;
//
Функция ФайлСуществует(ПутьКФайлу) Экспорт
	
	Если Не ЗначениеЗаполнено(ПутьКФайлу) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Файл = НовыйФайл(ПутьКФайлу);
	
	Возврат Файл.Существует();
	
КонецФункции

// Формирует путь на диске с разделителем, используемым в операционной системе
//
// Параметры:
//  Часть1 - Строка - часть пути №1;
//  Часть2 - Строка - часть пути №2;
//  Часть3 - Строка - (необязательный) часть пути №3;
//  Часть4 - Строка - (необязательный) часть пути №4;
// 
// Возвращаемое значение:
//  Строка - путь на диске
//
Функция ОбъединитьПути(Часть1, Часть2, Часть3 = "", Часть4 = "") Экспорт
	
	ЧастиПути = Новый Массив;
	ЧастиПути.Добавить(Часть1);
	ЧастиПути.Добавить(Часть2);
	ЧастиПути.Добавить(Часть3);
	ЧастиПути.Добавить(Часть4);
	
	Разделитель = РазделительПути();
	
	Результат = "";
	
	Для Каждого Элемент Из ЧастиПути Цикл
		
		Если Не ЗначениеЗаполнено(Элемент) Тогда
			Прервать;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Результат) Тогда
			Результат = Элемент;
			Продолжить;
		КонецЕсли;
		
		Если Прав(Результат, 1) <> Разделитель Тогда
			Результат = Результат + Разделитель;
		КонецЕсли;
		
		Результат = Результат + Элемент;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Удаляет часть пути к файлу на диске, начиная с конца
//
// Параметры:
//  ПутьКФайлу - Строка - путь к файлу на диске;
//  УдаляемаяЧасть - Строка - часть пути, которую нужно удалить;
// 
// Возвращаемое значение:
//  Строка - путь к файлу без удаленной части
//
Функция УдалитьЧастьПути(ПутьКФайлу, УдаляемаяЧасть) Экспорт
	
	Разделитель = РазделительПути();
	ЧастиПути = РазделитьСтроку(ПутьКФайлу, Разделитель, Истина);
	
	Для Сч = -ЧастиПути.ВГраница() По 0 Цикл
		Если НРег(ЧастиПути[-Сч]) = НРег(УдаляемаяЧасть) Тогда
			ЧастиПути.Удалить(-Сч);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СоединитьСтроку(ЧастиПути, Разделитель);
	
КонецФункции

// Определяет путь на диске к каталогу внешней обработки
//
// Параметры:
//  ОбъектОбработки - ВнешняяОбработка - внешняя обработка
// 
// Возвращаемое значение:
//  Строка - путь к каталогу внешней обработки
//
Функция КаталогОбработки(ОбъектОбработки) Экспорт
	
	ПутьКФайлу = ПутьКФайлуОбработки(ОбъектОбработки);
	Если Не ЗначениеЗаполнено(ПутьКФайлу)
		Или ЭтоАдресИзВременногоХранилища(ПутьКФайлу) Тогда
		Возврат "";
	КонецЕсли;
	
	Файл = НовыйФайл(ПутьКФайлу);
	
	Возврат Файл.Путь;
	
КонецФункции

// Безопасно читает путь к файлу внешней обработки
//
// Параметры:
//  ОбъектОбработки - ВнешняяОбработка - внешняя обработка
// 
// Возвращаемое значение:
//  Строка - путь к каталогу внешней обработки
//
Функция ПутьКФайлуОбработки(ОбъектОбработки) Экспорт
	
	Возврат СвойствоОбъекта(ОбъектОбработки, "ИспользуемоеИмяФайла", "");
	
КонецФункции

// Читает из файла дату последнего изменения
//
// Параметры:
//  ПутьКФайлу - Строка - путь к файлу на диске
// 
// Возвращаемое значение:
//  Дата - дата изменения файла
//
Функция ДатаИзмененияФайла(ПутьКФайлу) Экспорт
	
	Результат = '00010101';
	
	Если ФайлСуществует(ПутьКФайлу) Тогда
		Результат = НовыйФайл(ПутьКФайлу).ПолучитьВремяИзменения();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Определяет что путь к файлу ведет во временный каталог
//
// Параметры:
//  ПутьКФайлу - Строка - путь к файлу или каталогу
// 
// Возвращаемое значение:
//  Булево - Истина, если файл во временном каталоге
//
Функция ЭтоКаталогВременныхФайлов(ПутьКФайлу) Экспорт
	
	// BSLLS:FileSystemAccess-off
	Возврат (Найти(ПутьКФайлу, КаталогВременныхФайлов()) = 1);
	// BSLLS:FileSystemAccess-on
	
КонецФункции

// Определяет что строка является адресом из временного хранилища
//
// Параметры:
//  Строка - Строка - строка адреса
// 
// Возвращаемое значение:
//  Булево - Истина, если строка является адресом из временного хранилища
//
Функция ЭтоАдресИзВременногоХранилища(Знач Строка) Экспорт
	
	Если ТипЗнч(Строка) <> Тип("Строка") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НачалоАдреса = "e1cibtempstorage";
	Строка = СтрЗаменить(Строка, "/", "");
	Строка = СтрЗаменить(Строка, "\", "");
	
	Результат = (Найти(Строка, НачалоАдреса) = 1);
	
	Возврат Результат;
	
КонецФункции

// Удаляет файл в синхронном режиме,
// для совместимости со стартыми версиями платформы
//
// Параметры:
//  ПутьКФайлу - Строка - путь к файлу
//
Процедура УдалитьФайл(ПутьКФайлу) Экспорт
	
	// BSLLS:UsingSynchronousCalls-off
	// BSLLS:FileSystemAccess-off
	УдалитьФайлы(ПутьКФайлу);
	// BSLLS:FileSystemAccess-on
	// BSLLS:UsingSynchronousCalls-on
	
КонецПроцедуры

// #КонецОбласти // ФайловаяСистема

// #КонецОбласти // ПрограммныйИнтерфейс

// #Область СлужебныйПрограммныйИнтерфейс

// Формирует ссылку по уникальному идентификатору и полному имени объекта
//
// Параметры:
//  Идентификатор - УникальныйИдентификатор - уникальный идентификатор объекта;
//  ПолноеИмя - Строка - полное имя объекта метаданных, пример: "Справочник.Организации";
// 
// Возвращаемое значение:
//  СправочникСсылка, ДокументСсылка - ссылка на объект;
//
Функция СсылкаПоИдентификатору(Идентификатор, ПолноеИмя) Экспорт
	
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Менеджер = МенеджерОбъектаПоПолномуИмени(ПолноеИмя);
	Если Менеджер = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(Идентификатор) = Тип("ДвоичныеДанные") Тогда
		// Такое может быть в обработке представления в обычных формах
		УникальныйИдентификатор = УникальныйИдентификаторИзДвоичныхДанных(Идентификатор);
	Иначе
		УникальныйИдентификатор = Идентификатор;
	КонецЕсли;
	
	Возврат Менеджер.ПолучитьСсылку(УникальныйИдентификатор);
	
КонецФункции

// Создает новый уникальный идентификатор с меткой времени,
// используется для оптимизации вставки в кластерный индекс
// 
// Возвращаемое значение:
//  УникальныйИдентификатор
//
Функция НовыйУникальныйИдентификаторПервойВерсии() Экспорт
	
	Возврат Справочники.КонтурМаркировка_Файлы.ПолучитьСсылку().УникальныйИдентификатор();
	
КонецФункции

// Возвращает менеджер объекта по полному имени объекта метаданных
//
// Параметры:
//  ПолноеИмя - Строка - полное имя объекта метаданных, пример: "Справочник.Организации";
//
// Возвращаемое значение:
//  СправочникМенеджер, ДокументМенеджер, Перечисление, ПланВидовХарактеристик - менеджер объекта;
//
Функция МенеджерОбъектаПоПолномуИмени(ПолноеИмя) Экспорт
	
	Возврат ОбщегоНазначенияКонтурМаркировкаПовтИсп.МенеджерОбъектаПоПолномуИмени(ПолноеИмя);
	
КонецФункции

// Возвращает автоматический режим управления блокировкой данных,
// если в базе по умолчанию используется режим "Автоматический и управляемый".
// Чтобы исключить ошибки установки неправильного режима блокировки в транзакциях,
// где кроме объектов маркировки участвуют другие объекты системы с автоматическим режимом.
// 
// Возвращаемое значение:
//  РежимУправленияБлокировкойДанных.Автоматический - если по умолчанию используется "Автоматический и управляемый" режим блокировки;
//  Неопределено - если по умолчанию используется "Автоматический" или "Управляемый" режим блокировки;
//
Функция РежимУправленияБлокировкой() Экспорт
	
	Возврат ОбщегоНазначенияКонтурМаркировкаПовтИсп.РежимУправленияБлокировкой();
	
КонецФункции

// Определяет какой режим блокировок используется в базе
// 
// Возвращаемое значение:
//  Булево - Истина, если в базе используется управляемый режим блокировок
//
Функция ИспользуетсяУправляемыйРежимБлокировок() Экспорт
	
	Возврат ОбщегоНазначенияКонтурМаркировкаПовтИсп.ИспользуетсяУправляемыйРежимБлокировок();
	
КонецФункции

// Проверяет наличие объекта, реквизита шапки или реквизита таб. части в метаданных
//
// Параметры:
//  СтрокаМетаданных - Строка - строка метаданных
// 
// Возвращаемое значение:
//  Булево - Истина, если такие метаданные есть в конфигуарции
//
Функция ЕстьНеобходимыеМетаданные(СтрокаМетаданных) Экспорт
	
	Возврат ОбщегоНазначенияКонтурМаркировкаПовтИсп.ЕстьНеобходимыеМетаданные(СтрокаМетаданных);
	
КонецФункции

// Создает объект внешней обработки без предупреждения об опасных действиях
//
// Параметры:
//  ДанныеФайла - Строка, ДвоичныеДанные - путь к файлу или двоичные данные внешней обработки;
//
// Возвращаемое значение:
//  ВнешняяОбработка - объект внешней обработки
//
Функция СоздатьВнешнююОбработкуБезПредупреждений(ДанныеФайла) Экспорт
	
	Если Не ЗначениеЗаполнено(ДанныеФайла) Тогда
		ВызватьИсключение НСтр(
		"ru = 'Не удалось создать внешнюю обработку, не указаны данные файла'");
	КонецЕсли;
	
	Если ТипЗнч(ДанныеФайла) = Тип("Строка") Тогда
		Возврат ВнешниеОбработки_СоздатьИзФайла(ДанныеФайла);
	Иначе
		Возврат ВнешниеОбработки_СоздатьИзДвоичныхДанных(ДанныеФайла);
	КонецЕсли;
	
КонецФункции

// Подключает внешнюю обработку в метаданные сеанса без предупреждения об опасных действиях
//
// Параметры:
//  ДанныеОбработки - Строка, ДвоичныеДанные - адрес во временном хранилище или двоичные данные обработки;
//  ИмяОбработки   - Строка - (необязательный) имя обработки, с которым она будет подключена;
//
// Возвращаемое значение:
//  Строка - имя подключенной внешней обработки
//
Функция ПодключитьВнешнююОбработкуБезПредупреждений(ДанныеОбработки, ИмяОбработки = Неопределено) Экспорт
	
	БезопасныйРежим = Ложь;
	
	Если ТипЗнч(ДанныеОбработки) = Тип("ДвоичныеДанные") Тогда
		АдресОбработки = ПоместитьВоВременноеХранилище(ДанныеОбработки);
	Иначе
		АдресОбработки = ДанныеОбработки;
	КонецЕсли;
	
	Если ОбщегоНазначенияКонтурМаркировкаПовтИсп.ЕстьЗащитаОтОпасныхДействий() Тогда
		
		ЗащитаБезПредупреждений = ОбщегоНазначенияКонтурМаркировкаПовтИсп.ОписаниеЗащитыБезПредупреждений();
		
		Результат = ВнешниеОбработки.Подключить(АдресОбработки, ИмяОбработки, БезопасныйРежим, ЗащитаБезПредупреждений);
		
	Иначе
		
		Результат = ВнешниеОбработки.Подключить(АдресОбработки, ИмяОбработки, БезопасныйРежим);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Создает по имени заранее подключенную внешнюю обработку
//
// Параметры:
//  ИмяОбработки - Строка - имя, по которому обработка была подключена в метаданные сеанса
//
// Возвращаемое значение:
//  ВнешняяОбработка - объект созданной внешней обработки
//
Функция СоздатьВнешнююОбработкуПоИмени(ИмяОбработки) Экспорт
	
	БезопасныйРежим = Ложь;
	
	Результат = ВнешниеОбработки.Создать(ИмяОбработки, БезопасныйРежим);
	
	Возврат Результат;
	
КонецФункции

// Создает обработку из метаданных
//
// Параметры:
//  ИмяОбработки - Строка - имя обработки
//
// Возвращаемое значение:
//  ОбработкаОбъект - объект обработки
//
Функция СоздатьОбработкуИзКонфигурации(ИмяОбработки) Экспорт
	
	Результат = Обработки[ИмяОбработки].Создать();
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти // СлужебныйПрограммныйИнтерфейс

// #Область СлужебныеПроцедурыИФункции

// Преобразует двоичные данные уникального идентификатора в значение
//
// Параметры:
//  ДвоичныеДанные - ДвоичныеДанные - двоичные данные уникального идентификатора
// 
// Возвращаемое значение:
//  УникальныйИдентификатор - значение уникального идентификатора
//
Функция УникальныйИдентификаторИзДвоичныхДанных(ДвоичныеДанные)
	
	ОбратныйИД = СтрЗаменить(Строка(ДвоичныеДанные), " ", "");
	
	ПрямойИД = Сред(ОбратныйИД, 25, 8) + "-"
	+ Сред(ОбратныйИД, 21, 4) + "-"
	+ Сред(ОбратныйИД, 17, 4) + "-"
	+ Сред(ОбратныйИД, 1, 4) + "-"
	+ Сред(ОбратныйИД, 5, 12);
	
	Возврат Новый УникальныйИдентификатор(ПрямойИД);
	
КонецФункции

// Конструктор файла
//
// Параметры:
//  ПутьКФайлу - Строка - путь к файлу
// 
// Возвращаемое значение:
//  Файл - объект файла созданный на основании пути
//
Функция НовыйФайл(ПутьКФайлу)
	
	// BSLLS:FileSystemAccess-off
	Возврат Новый Файл(ПутьКФайлу);
	// BSLLS:FileSystemAccess-on
	
КонецФункции

// Вставляет параметры в строку, с учетом того, что в параметрах
// могут использоваться подстановочные слова %1, %2, %3, %4, %5
//
// Параметры:
//  ШаблонСтроки - Строка - шаблон с маркерами подстановки: "%1..%5";
//  Параметр1 - Строка - параметр №1;
//  Параметр2 - Строка - (необязательный) параметр №2;
//  Параметр3 - Строка - (необязательный) параметр №3;
//  Параметр4 - Строка - (необязательный) параметр №4;
//  Параметр5 - Строка - (необязательный) параметр №5;
//
// Возвращаемое значение:
//   Строка - строка шаблона с подставленными параметрами
//
Функция ПараметрыСПроцентомВСтроку(Знач ШаблонСтроки
	, Параметр1 = Неопределено
	, Параметр2 = Неопределено
	, Параметр3 = Неопределено
	, Параметр4 = Неопределено
	, Параметр5 = Неопределено)
	
	Результат = "";
	
	Пока Истина Цикл
		
		Поз = Найти(ШаблонСтроки, "%");
		
		Если Поз = 0 Тогда
			Прервать;
		КонецЕсли;
		
		Результат = Результат + Лев(ШаблонСтроки, Поз - 1);
		
		НомерПараметра = Сред(ШаблонСтроки, Поз + 1, 1);
		
		Если НомерПараметра = "1" Тогда
			ЗначениеПараметра = Параметр1;
		ИначеЕсли НомерПараметра = "2" Тогда
			ЗначениеПараметра = Параметр2;
		ИначеЕсли НомерПараметра = "3" Тогда
			ЗначениеПараметра = Параметр3;
		ИначеЕсли НомерПараметра = "4" Тогда
			ЗначениеПараметра = Параметр4;
		ИначеЕсли НомерПараметра = "5" Тогда
			ЗначениеПараметра = Параметр5;
		Иначе
			ЗначениеПараметра = Неопределено;
		КонецЕсли;
		
		Если ЗначениеПараметра = Неопределено Тогда
			Результат = Результат + "%";
			ШаблонСтроки = Сред(ШаблонСтроки, Поз + 1);
		Иначе
			Результат = Результат + ЗначениеПараметра;
			ШаблонСтроки = Сред(ШаблонСтроки, Поз + 2);
		КонецЕсли;
		
	КонецЦикла;
	
	Результат = Результат + ШаблонСтроки;
	
	Возврат Результат;
	
КонецФункции

// Возвращает разделитель пути, используемого в операционной системе
// 
// Возвращаемое значение:
//  Строка
//
Функция РазделительПути()
	
	Если Найти(ИнформацияОСистеме().ТипПлатформы, "Linux") > 0 Тогда
		Результат = "/";
	Иначе
		Результат = "\";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает системную информацию
// 
// Возвращаемое значение:
//  СистемнаяИнформация - информация о системе;
//
Функция ИнформацияОСистеме()
	
	// BSLLS:UseSystemInformation-off
	Возврат Новый СистемнаяИнформация;
	// BSLLS:UseSystemInformation-on
	
КонецФункции

// #Область ПодключениеВнешнейОбработки

// Создает внешнюю обработку из файла на диске
//
// Параметры:
//  ПутьКФайлу - Строка - путь к файлу обработки
//
// Возвращаемое значение:
//  ОбработкаОбъект - объект созданной внешней обработки
//
Функция ВнешниеОбработки_СоздатьИзФайла(ПутьКФайлу)
	
	БезопасныйРежим = Ложь;
	
	Если Не ВерсияПлатформыНиже("8.3.11")
		И ОбщегоНазначенияКонтурМаркировкаПовтИсп.ЕстьЗащитаОтОпасныхДействий() Тогда
		
		ЗащитаБезПредупреждений = ОбщегоНазначенияКонтурМаркировкаПовтИсп.ОписаниеЗащитыБезПредупреждений();
		
		Результат = ВнешниеОбработки.Создать(ПутьКФайлу, БезопасныйРежим, ЗащитаБезПредупреждений);
		
	ИначеЕсли Не ВерсияПлатформыНиже("8.3") Тогда
		
		Результат = ВнешниеОбработки.Создать(ПутьКФайлу, БезопасныйРежим);
		
	Иначе
		
		Результат = ВнешниеОбработки.Создать(ПутьКФайлу);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Создает внешнюю обработку из двоичных данных
//
// Параметры:
//  ДвоичныеДанные - ДвоичныеДанные - двоичные данные обработки
//
// Возвращаемое значение:
//  ОбработкаОбъект - объект созданной внешней обработки
//
Функция ВнешниеОбработки_СоздатьИзДвоичныхДанных(ДвоичныеДанные)
	
	Если ОбщегоНазначенияКонтурМаркировкаПовтИсп.ЭтоОбычноеПриложение() Тогда
		
		ИмяВремФайла = ПолучитьИмяВременногоФайла("epf");
		ДвоичныеДанные.Записать(ИмяВремФайла);
		Результат = ВнешниеОбработки_СоздатьИзФайла(ИмяВремФайла);
		
		УдалитьФайл(ИмяВремФайла);
		
	Иначе
		
		АдресОбработки = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
		ИмяОбработки = ПодключитьВнешнююОбработкуБезПредупреждений(АдресОбработки);
		Результат = СоздатьВнешнююОбработкуПоИмени(ИмяОбработки);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти // ПодключениеВнешнейОбработки

// #КонецОбласти // СлужебныеПроцедурыИФункции

#КонецЕсли
