
// #Область СлужебныеПеременныеИМетодыФормы

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		КэшМодуляКлиента = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		КэшМодуляКлиента = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	Возврат КэшМодуляКлиента;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

// #КонецОбласти

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьКонтекстФормы();
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КоллекцияЭлементовДерева=ДеревоСтруктуры.ПолучитьЭлементы();
	
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл
		
		ИдентификаторСтроки = Строка.ПолучитьИдентификатор();
		Элементы.ДеревоСтруктуры.Развернуть(ИдентификаторСтроки, Истина);
		
	КонецЦикла;
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДеревоСтруктурыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	НоваяСтрока = ДеревоСтруктуры.ПолучитьЭлементы().Добавить();
	Элемент.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	Элемент.ИзменитьСтроку();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСтруктурыЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДеревоСтруктуры.ТекущиеДанные;
	
	Элемент.ВыбиратьТип = (ТекущиеДанные.Значение = Неопределено);
	
	ВыбратьИзПредопределенныхЗначений(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСтруктурыПослеВыбораИзСписка(ВыбранноеЗначение, ТекущиеДанные) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Значение = ВыбранноеЗначение.Значение;
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)

	НоваяСтруктура = СтруктураИзДерева();
	
	ЭтаФорма.ОповеститьОВыборе(НоваяСтруктура);
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьКонтекстФормы()
	
	РазрешитьРедактирование = Параметры.РазрешитьРедактирование;
	
	Если Параметры.Свойство("Заголовок") Тогда
		Заголовок = Параметры.Заголовок;
	КонецЕсли;
	
	Если Параметры.Свойство("Структура") Тогда
		Дерево = РеквизитФормыВЗначение("ДеревоСтруктуры");
		Дерево.Строки.Очистить();
		ЗаполнитьДеревоЗначений(Дерево.Строки, Параметры.Структура);
		ЗначениеВРеквизитФормы(Дерево, "ДеревоСтруктуры");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы()
	
	Если РазрешитьРедактирование Тогда
		Элементы.ФормаЗавершитьРедактирование.Видимость = Истина;
	Иначе
		Элементы.ФормаЗавершитьРедактирование.Видимость = Ложь;
		Элементы.ДеревоСтруктурыЗначение.ТолькоПросмотр = Истина;
		Элементы.ДеревоСтруктурыИмя.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоЗначений(ТекДерево, ТекСтруктура)
	
	Для Каждого Эл Из ТекСтруктура Цикл
		
		Ключ = Эл.Ключ;
		Значение = Эл.Значение;
		
		НоваяСтрока = ТекДерево.Добавить();
		НоваяСтрока.Имя = Ключ;
		
		Если МодульОбъекта().ЭтоСтруктура(Значение)
			Или МодульОбъекта().ЭтоСоответствие(Значение) Тогда
			
			ЗаполнитьДеревоЗначений(НоваяСтрока.Строки, Значение);
			
		ИначеЕсли МодульОбъекта().ЭтоМассив(Значение) Тогда
			
			Для Индекс = 0 По Значение.ВГраница() Цикл
				
				Элемент = Значение[Индекс];
				НоваяДопСтрока = НоваяСтрока.Строки.Добавить();
				НоваяДопСтрока.Имя = Индекс;
				
				Если МодульОбъекта().ЭтоСтруктура(Элемент)
					Или МодульОбъекта().ЭтоСоответствие(Элемент) Тогда
					ЗаполнитьДеревоЗначений(НоваяДопСтрока.Строки,Элемент);
				Иначе
					НоваяДопСтрока.Значение = Элемент;
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			
			НоваяСтрока.Значение = Значение;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИзПредопределенныхЗначений(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.ДеревоСтруктуры.ТекущиеДанные;
	
	Если ТекущиеДанные.Имя = "ФорматИзображения" Тогда
		
		ФорматыИзображений = МодульКлиента().Перечисление_ФорматыИзображений();
		ПослеВыбора = МодульКлиента().ОписаниеОбработчикаОповещения("ДеревоСтруктурыПослеВыбораИзСписка", ЭтаФорма, ТекущиеДанные);
		МодульКлиента().ПоказатьДиалогВыбораИзСписка(ПослеВыбора, ФорматыИзображений, Элемент, ЭтаФорма, ТекущиеДанные.Значение);
		
	ИначеЕсли ТекущиеДанные.Имя = "УголПоворота" Тогда
		
		ДопустимыеУглы = Новый Массив;
		ДопустимыеУглы.Добавить(0);
		ДопустимыеУглы.Добавить(90);
		ДопустимыеУглы.Добавить(180);
		ДопустимыеУглы.Добавить(270);
		
		ПослеВыбора = МодульКлиента().ОписаниеОбработчикаОповещения("ДеревоСтруктурыПослеВыбораИзСписка", ЭтаФорма, ТекущиеДанные);
		МодульКлиента().ПоказатьДиалогВыбораИзСписка(ПослеВыбора, ДопустимыеУглы, Элемент, ЭтаФорма, ТекущиеДанные.Значение);
		
	Иначе
		СтандартнаяОбработка = Истина;
		Элемент.РедактированиеТекста = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СтруктураИзДерева()
	
	НоваяСтруктура = Новый Структура;
	
	Дерево = РеквизитФормыВЗначение("ДеревоСтруктуры");
	
	Для Каждого Эл Из Дерево.Строки Цикл
		НоваяСтруктура.Вставить(Эл.Имя, Эл.Значение);
	КонецЦикла;
	
	Возврат НоваяСтруктура;
	
КонецФункции

// #КонецОбласти
