// Copyright (C) 2012-2025 Engineer Mareev Enterprises
// Модуль для УТ10.3 Импорт receipt без asn с ордерной схемой 

// 	$Приход товаров без ASN
//	Оператор EME.WMS (руч.) создает документ прихода без ASN
//	После закрытия документа прихода EME.WMS (авт.) экспортирует сообщение RECEIPT.
//	1C (авт.) импортирует сообщение RECEIPT и создает документ Оприходование излишков товаров.
//	В случае прихода как возврата от клиента, создается документ Возврат товаров от клиента.
//	В комментарии документов заносится информация о документе WMS, на основании которого документ создан.
// 	Если в маппинге определен склад брака для товара в статусе В, для такого товара создается документ перемещения на склад брака.
//	Документы проводится.

#Область ПрограммныйИнтерфейс  

// Импорт прихода без ASN (сообщение receipt) в документы 1С
Процедура Импортировать(ERPData, Трассировка, ТемаСообщения) Экспорт
	// Принимать только сообщение для закрытого документа.
	Если ERPData.header.doc_status <> "Обработка завершена" Тогда
		Возврат;
	КонецЕсли;  
	
	// Принимать только закрывающий receipt
	Если ERPData.header.is_partly = 1 Тогда 
		Возврат;
	КонецЕсли;  
	
	// Это приход без ASN
	Если ЗначениеЗаполнено(ERPData.header.asn_id) Тогда 
		Возврат;
	КонецЕсли;
	
	// Идентификатор документа WMS для регистров контроля
	ИдЕМЕ = ERPData.header.receipt_id;
	// Номер документа WMS для комментариев
	НомерЕМЕ = ERPData.header.receipt_reg_no;
	
	ЭтоВозврат = ?(ERPData.header.is_return = 1, Истина, Ложь);
	Если ЭтоВозврат Тогда
		КонтрагентСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаКонтрагента(ERPData.header.supplier_id);
		Если КонтрагентСсылка.Пустая() Тогда
			EmeWmsERPEngine.ErrorHeader(ERPData, "CUSBAD");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	//	Соберем в карту количества товаров с сериями
	КодЗоны 		= Неопределено;
	КодЗоныБрака 	= Неопределено;
	КартаТоваров 	= Новый Соответствие;
	КартаБрака 		= Новый Соответствие;
	ПолучитьКоличестваТоваровСБраком(ERPData, КодЗоны, КодЗоныБрака, КартаТоваров, КартаБрака);
	
	// Получим склад по коду EME
	КодСклада 		= ERPData.header.whs_to_code;
	КодОрганизации 	= ERPData.header.vendor_to_code;
	СкладСсылка 	= EmeWmsУтилиты.ПолучитьСсылкуНаСкладПоКодуEME(КодСклада, КодЗоны, КодОрганизации, "N");
	Если СкладСсылка.Пустая() Тогда
		EmeWmsERPEngine.ErrorHeader(ERPData, "WTOBAD");
		Возврат;
	КонецЕсли;
	
	// Получим организацию по коду EME
	ОрганизацияСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаОрганизациюПоКодуEME(КодОрганизации);
	Если ОрганизацияСсылка.Пустая() Тогда
		EmeWmsERPEngine.ErrorHeader(ERPData, "VNDBAD");
		Возврат;
	КонецЕсли;
	
	//	Если были ошибки
	Если EmeWmsERPEngine.HasErrors(ERPData) Тогда
		Возврат;
	КонецЕсли;
	
	//*** Проверки сделали, пишем в базу данных 1C ***
	
	// Если приход по возврату от клиента (по инициативе WMS)
	Если ЭтоВозврат Тогда
		// Создается правильно только на основании реализации, реализацию ищем по ID
		РеализацияСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаРеализациюТоваровУслуг(ERPData.header.order_id);
		Если РеализацияСсылка.Пустая() Тогда
			EmeWmsERPEngine.WarningHeader(ERPData, "NOTPST", "В 1С Не создана Реализация, провести Возврат от клиента нельзя");
			Возврат;
		КонецЕсли;

		// Создадим документ Возврат товаров от клиента на основании Реализации товаров
		//ВозвратТоваровСсылка = СоздатьИзменитьДокументВозвратТоваровОтКлиента(КартаТоваров, РеализацияСсылка, СкладСсылка, ИдЕМЕ, НомерЕМЕ, ERPData);
		//СоздатьОтметкуОбИмпортеВозвратаТоваровОтКлиента(ВозвратТоваровСсылка, ИдЕМЕ);
	Иначе                              
		// На основании ордера созданим документ оприходования излишков товаров
		ОприходованиеСсылка = СоздатьИзменитьДокументОприходованияИзлишковТоваров(КартаТоваров, СкладСсылка, ОрганизацияСсылка, ИдЕМЕ, НомерЕМЕ, ERPData);
		
		// Если в маппинге определен склад брака для товара в статусе В, создадим перемещение на склад брака
		Если КартаБрака.Количество() > 0 Тогда
			СкладБрака = EmeWmsУтилиты.ПолучитьСсылкуНаСкладПоКодуEME(КодСклада, КодЗоны, КодОрганизации, "B");
			Если ЗначениеЗаполнено(СкладБрака) Тогда
				ПеремещениеСсылка = СоздатьИзменитьДокументПеремещенияНаСкладБрака(ERPData, ИдЕМЕ, НомерЕМЕ, ОприходованиеСсылка, КартаБрака, СкладБрака);
				Тема = "Создан документ перемещения на склад брака на основании прихода EME";
				Текст = "На основании " + ОприходованиеСсылка + Символы.ПС + " и документа прихода EME " + НомерЕМЕ + Символы.ПС + 
						" создан документ перемещения на склад брака " + ПеремещениеСсылка;
				EmeWmsУтилиты.ДобавитьНапоминаниеИнтеграции(Текст, ПеремещениеСсылка);
			КонецЕсли;
		КонецЕсли;
		
		Трассировка = Трассировка + ОприходованиеСсылка + Символы.ПС;
		ТемаСообщения = "Создан документ Приходный ордер на товары по приходу EME " + НомерЕМЕ;
	КонецЕсли;

	EmeWmsERPEngine.Success(ERPData);
КонецПроцедуры

// Функция ПолучитьИмяСообщения возвращает имя сообщения
Функция ПолучитьИмяСообщения() Экспорт
	Возврат "receipt";
КонецФункции

// Функция ПолучитьМетаданные возвращает метаданные сообщения
Функция ПолучитьМетаданные() Экспорт
	Возврат Метаданные.Документы.ОприходованиеТоваров;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция возвращает договор контрагента
Функция ПолучитьДоговорКонтрагента(Контрагент)
	Перем Запрос, Выборка, Результат;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "Выбрать
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	ДоговорыКонтрагентов.Статус КАК Статус
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Контрагент = &Контрагент";
	Запрос.УстановитьПараметр("Контрагент", Контрагент.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	Если Выборка.Следующий() Тогда
		Если Выборка.Статус = Перечисления.СтатусыДоговоровКонтрагентов.Действует Тогда
			Результат = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

// Собирает в карту товаров (с сериями) принятые по Receipt товары
// В карте товаров - всё принятое, в карте брака - только брак
Процедура ПолучитьКоличестваТоваровСБраком(ERPData, КодЗоны, КодЗоныБрака, КартаТоваров, КартаБрака)
	
	//	Использование серий в интеграции
	ИспользоватьСерии = Константы.EmeWmsИспользоватьСерии.Получить();	

	//КлючиТоваров 		= Новый Соответствие;
	СерийныеНомера 		= Новый Соответствие;
	
	// Заполнить карту серийных номеров товара (строка номеров по номеру строки)
	EmeWmsERPEngine.SelectChild(ERPData, "numbers");
	Пока EmeWmsERPEngine.NextChildLine(ERPData) Цикл   
		
		// Номер серии: WMS "-" = 1С "Неизвестная серия"	
		СерийныйНомер = ?(ERPData.numbers.serial_no <> "-", ERPData.numbers.serial_no, "Неизвестная серия");																

		КлючСтроки = ERPData.numbers.receipt_line_id;
		СтрокаНомеров = СерийныеНомера.Получить(КлючСтроки);
		СерийныеНомера.Вставить(КлючСтроки, ?(СтрокаНомеров = неопределено, СерийныйНомер, СтрокаНомеров + "," + СерийныйНомер));
	КонецЦикла;	

	// Весь товар в сообщении
	EmeWmsERPEngine.SelectChild(ERPData, "lines");
	Пока EmeWmsERPEngine.NextChildLine(ERPData) Цикл
		//	Проверим товар
		УИДТовара = ERPData.lines.goods_id;
		УИДЕдиницы = ERPData.lines.pack_id;
		Если УИДТовара = "" Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "GDSNUL");
			Продолжить
		КонецЕсли;
		
		ТоварСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаТовар(УИДТовара);
		Если ТоварСсылка.Пустая() Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "GDSBAD");
			Продолжить
		КонецЕсли;
		
		ЕдиницаИзмерения = EmeWmsУтилиты.ПолучитьСсылкуНаЕдиницуИзмерения(УИДЕдиницы);
		Если ЕдиницаИзмерения.Пустая() Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "PCKBAD");
			Продолжить
		КонецЕсли;
		
		РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТоварСсылка, "ВестиУчетПоСериям, ВестиУчетПоХарактеристикам"); 

		Если Не ИспользоватьСерии Тогда
			РеквизитыНоменклатуры.ВестиУчетПоСериям = Ложь;
		КонецЕсли;

		СерияНоменклатуры 		   	= Неопределено;
		ХарактеристикаНоменклатуры 	= Неопределено;
		
		Если РеквизитыНоменклатуры.ВестиУчетПоСериям Тогда   
			СерийныйНомер 	 = ERPData.lines.lot_no;
			ДатаГодности  	 = ERPData.lines.bbd;
			ДатаПроизводства = ERPData.lines.prd; 
			
			// Серии, если их нет при приходе без ASN - создавать.
			СерияНоменклатуры = EmeWmsУтилиты.ПолучитьСериюПоНаименованию(ERPData.lines.lot_no, ТоварСсылка, Истина);
		ИначеЕсли РеквизитыНоменклатуры.ВестиУчетПоХарактеристикам Тогда
			ХарактеристикаНоменклатуры = EmeWmsУтилиты.ПолучитьХарактеристикуПоНаименованию(ERPData.lines.lot_no, ТоварСсылка);
		КонецЕсли;
				
		КодЗоны 			= ERPData.lines.zone_to_code;
		КлючТовара 			= EmeWmsУтилиты.СоздатьКлючТовара(ТоварСсылка, СерияНоменклатуры, ХарактеристикаНоменклатуры);
		КоличествоВБазовой  = EmeWmsУтилиты.ПересчетВДругуюЕдиницу(ERPData.lines.receipt_qty, 
																   ЕдиницаИзмерения, 
																   EmeWmsУтилиты.ПолучитьБазовуюЕдиницуИзмерения(ТоварСсылка));
		
		КоличествоПоКарте 	= ?(КартаТоваров.Получить(КлючТовара) = Неопределено, 0.0, КартаТоваров.Получить(КлючТовара));		
		КартаТоваров.Вставить(КлючТовара, КоличествоПоКарте + КоличествоВБазовой);                                      
		
		// Добавим количество в карту брака
		Если EmeWmsСтатусы.ИспользоватьКакСтатус(ERPData.lines.stock_status) = "B" Тогда 
			КодЗоныБрака = ERPData.lines.zone_to_code;
			КоличествоПоКарте = ?(КартаБрака.Получить(КлючТовара) = Неопределено, 0.0, КартаБрака.Получить(КлючТовара));
			КартаБрака.Вставить(КлючТовара, КоличествоПоКарте + КоличествоВБазовой);
		КонецЕсли; 
		
		// Это для привязки серийных номеров к товару
		//КлючиТоваров.Вставить(ERPData.lines.id, ТоварСсылка); 		
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(КодЗоныБрака) ИЛИ КодЗоны = КодЗоныБрака Тогда
		КодЗоныБрака = "BRAK"; // По умолчанию, если в строках не заполнено
	КонецЕсли;
КонецПроцедуры

// Функция возвращает соглашение для контрагента
Функция ПолучитьСоглашениеКонтрагента(Контрагент)
	Перем Запрос, Выборка, Результат;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "Выбрать
	|	Соглашения.Ссылка КАК Ссылка,
	|	Соглашения.Статус КАК Статус
	|ИЗ
	|	Справочник.СоглашенияСКлиентами КАК Соглашения
	|ГДЕ
	|	Соглашения.Контрагент = &Контрагент";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Справочники.СоглашенияСКлиентами.ПустаяСсылка();
	Если Выборка.Следующий() Тогда
		Если Выборка.Статус = Перечисления.СтатусыСоглашенийСКлиентами.Действует Тогда
			Результат = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область ПоискСсылокНаОбъектыПоКодуEME

// Функция возвращает ссылку на документ Оприходования излишков товаров по ИД EME
Функция НайтиДокументОприходованияИзлишковТоваров(ИдЕМЕ)
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Оприходование.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрСведений.EmeWmsОтметкиОбИмпортеОприходованийТоваров КАК Оприходование
		|ГДЕ
		|	Оприходование.ID = &ИдЕМЕ";
	
	Запрос.УстановитьПараметр("ИдЕМЕ", ИдЕМЕ);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();

		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Документы.ОприходованиеТоваров.ПустаяСсылка();

КонецФункции

// Функция возвращает ссылку на Возврат товаров от клиента по ИД EME
Функция НайтиДокументВозвратТоваровОтКлиента(ИдЕМЕ)
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВозвратТоваров.Ссылка КАК Ссылка
		|ИЗ
		|	
		|РегистрСведений.EmeWmsОтметкиОбИмпортеВозвратовТоваровОтКлиента КАК ВозвратТоваров
		|ГДЕ
		|	ВозвратТоваров.ID = &ИдЕМЕ";
	
	Запрос.УстановитьПараметр("ИдЕМЕ", ИдЕМЕ);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Запрос.УстановитьПараметр("ИдЕМЕ", ИдЕМЕ);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();

		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Документы.ВозвратТоваровОтКлиента.ПустаяСсылка();

КонецФункции

// Функция возвращает ссылку на документ Перемещение товаров по ИД EME
Функция НайтиДокументПеремещенияТоваров(ИдЕМЕ)
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Перемещение.Ссылка КАК Ссылка
		|ИЗ
		|	
		|РегистрСведений.EmeWmsОтметкиОбИмпортеПеремещенийТоваров КАК Перемещение
		|ГДЕ
		|	Перемещение.ID = &ИдЕМЕ";
	
	Запрос.УстановитьПараметр("ИдЕМЕ", ИдЕМЕ);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();

		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Документы.ПеремещениеТоваров.ПустаяСсылка();

КонецФункции

#КонецОбласти

#Область СозданиеДокументов

// Создает новый или корректирует найденный по ID EME документ Возврата товаров от клиента (на основании реализации)
Функция СоздатьИзменитьДокументВозвратТоваровОтКлиента(КартаТоваров, РеализацияСсылка, СкладСсылка, ИдЕМЕ, НомерЕМЕ, ERPData)
	ВозвратТоваровСсылка = НайтиДокументВозвратТоваровОтКлиента(ИдЕМЕ);
	Если ВозвратТоваровСсылка.Пустая() Тогда
		ВозвратТоваров = Документы.ВозвратТоваровОтКлиента.СоздатьДокумент();
		ВозвратТоваров.Дата = ТекущаяДата();
		// #IBS 16.11.2023
		ВозвратТоваров.Склад = СкладСсылка;
		ВозвратТоваров.Заполнить(РеализацияСсылка);        
		ВозвратТоваров.Комментарий = "Создан автоматом на основании документа прихода EME: " +
			НомерЕМЕ + " (" + ИдЕМЕ + ")" + " (" + ERPData.header.comment + ")";
		ВозвратТоваров.Записать();
	Иначе
		ВозвратТоваров = ВозвратТоваровСсылка.ПолучитьОбъект();
		ВозвратТоваров.Склад = СкладСсылка;
		ВозвратТоваров.Комментарий = "Изменен на основании документа прихода EME: " +
			НомерЕМЕ + " (" + ИдЕМЕ + ")" + " (" + ERPData.header.comment + ")";
	КонецЕсли; 

	EmeWmsУтилиты.СкорректироватьТЧДокумента(ВозвратТоваров.Товары, КартаТоваров, Истина);      
	//ПересчитатьУпаковкиДокумента(ВозвратТоваров);
	EmeWmsДрайвер.ЗаполнитьСтатусыУказанияСерий(ВозвратТоваров, Документы.ВозвратТоваровОтКлиента); 
	EmeWmsДрайвер.ЗаполнитьЦеныПоВидуЦен(ВозвратТоваров); 
	
	ВозвратТоваров.Записать(РежимЗаписиДокумента.Запись);
	EmeWmsПроведениеДокументов.ПометитьДокументКПроведению(ВозвратТоваров.Ссылка);

	Возврат ВозвратТоваров.Ссылка;
КонецФункции

// Создает новый или корректирует найденный по ID EME документ Оприходования излищков товаров
Функция СоздатьИзменитьДокументОприходованияИзлишковТоваров(КартаТоваров, СкладСсылка, ОрганизацияСсылка, ИдЕМЕ, НомерЕМЕ, ERPData)
	
	ОприходованиеСсылка = НайтиДокументОприходованияИзлишковТоваров(ИдЕМЕ);
	Если ОприходованиеСсылка.Пустая() Тогда
		Оприходование 			      = Документы.ОприходованиеТоваров.СоздатьДокумент();
		Оприходование.Дата 		      = ТекущаяДата();
		Оприходование.Склад 	      = СкладСсылка;
		Оприходование.Организация     = ОрганизацияСсылка;
		Оприходование.Подразделение   = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СкладСсылка, "Подразделение");
		Оприходование.ОтражатьВУправленческомУчете = Истина;
		Оприходование.ОтражатьВБухгалтерскомУчете  = Истина;
		//Оприходование.КоррСчет   	  = ПланыСчетов.Хозрасчетный.ПрочиеДоходы;  
    	//Оприходование.Субконто1		  = Справочники.ПрочиеДоходыИРасходы.НайтиПоКоду("0360"); //Меркурий
		//Оприходование.КоррСчетНУ 	  = ПланыСчетов.Налоговый.ВнереализационныеДоходы;
		Оприходование.Комментарий     = "Создан на основании документа прихода EME: " +
			НомерЕМЕ + " (" + ИдЕМЕ + ")" + " (" + ERPData.header.comment + ")"; 		
		//Оприходование.СтатьяДоходов = ПланыВидовХарактеристик.СтатьиДоходов.НайтиПоНаименованию("Внереализационные доходы");
		//Оприходование.АналитикаДоходов = ОрганизацияСсылка;
	Иначе
		Оприходование = ОприходованиеСсылка.ПолучитьОбъект();
		Оприходование.Комментарий = "Документ скорректирован на основании документа прихода EME: " +
			НомерЕМЕ + " (" + ИдЕМЕ + ")" + " (" + ERPData.header.comment + ")";
	КонецЕсли;

	//	Корерктировка табличной части
	// EmeWmsУтилиты.СкорректироватьТабличнуюЧасть(Оприходование, КартаТоваров, Истина);
	EmeWmsУтилиты.СкорректироватьТЧДокумента(Оприходование.Товары, КартаТоваров, Истина);

	//	Валюта регламентированного учета
	мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	мВалютаУпрУчета    		= глЗначениеПеременной("ВалютаУправленческогоУчета");
	СтруктураКурса     		= МодульВалютногоУчета.ПолучитьКурсВалюты(мВалютаУпрУчета, Оприходование.Дата);
	мКурсУпрУчета      		= СтруктураКурса.Курс;
	мКратностьУпрУчета 		= СтруктураКурса.Кратность;
	мТекущийСтатусПартии 	= Перечисления.СтатусыПартийТоваров.Купленный;
	Качество 		   		= Справочники.Качество.Новый;
	СпособЗаполненияЦен 	= Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатуры;
	УчитыватьНДС 		    = Оприходование.ОтражатьВБухгалтерскомУчете;

	// 	Установим цены в документе по виду цены
	ТипЦен = Справочники.ТипыЦенНоменклатуры.НайтиПоНаименованию("Плановая цена"); 
	Оприходование.ТипЦен = ТипЦен; 
	ВалютаЦены			 = ТипЦен.ВалютаЦены;
	ЦенаВключаетНДС		 = ТипЦен.ЦенаВключаетНДС;
	
	// Если есть цена и тип цен, но нет валюты, тогда в качестве валюты документа возьмем валюту регламентированного учета.
	ВалютаДокумента    = мВалютаРегламентированногоУчета;
	КурсДокумента      = 1;
	КратностьДокумента = 1;

	//	Рассчитываем реквизиты табличной части.
	Для каждого СтрокаТовара из Оприходование.Товары Цикл
		СтрокаТовара.Качество = Качество;

		Цена = Ценообразование.ПолучитьЦенуНоменклатуры(СтрокаТовара.Номенклатура, СтрокаТовара.ХарактеристикаНоменклатуры,
										ТипЦен, Оприходование.Дата, СтрокаТовара.ЕдиницаИзмерения,
										ВалютаДокумента, КурсДокумента, КратностьДокумента, , Неопределено, Неопределено);

		//	Пересчитаем цену в валюту документа.
		Цена = Ценообразование.ПересчитатьЦенуПриИзмененииВалюты(Цена, ВалютаЦены, мВалютаУпрУчета, мКурсУпрУчета, мКратностьУпрУчета, Оприходование.Дата);

		//	В документе цена со всеми налогами
		СуммаВключаетНДС = Истина;

		//	Получим ставки из справочника.
		СтавкаНДС = УчетНДС.ПолучитьСтавкуНДС(СтрокаТовара.Номенклатура.СтавкаНДС);

		СтрокаТовара.Цена = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(Цена,
		                                                 СпособЗаполненияЦен,
		                                                 ЦенаВключаетНДС,
		                                                 УчитыватьНДС,
		                                                 СуммаВключаетНДС,
		                                                 СтавкаНДС);

		// 	Отладка: Установим цена = 1 руб., при нулевой цене документ не проводится
		Если СтрокаТовара.Цена = 0 Тогда			
			СтрокаТовара.Цена = 1;			
		КонецЕсли;   
		
		//	Рассчитываем реквизиты табличной части.
		ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуМестТабЧасти(СтрокаТовара, Оприходование, Ложь);
		СтрокаТовара.Коэффициент = СтрокаТовара.ЕдиницаИзмерения.Коэффициент;
		
		ОбработкаТабличныхЧастей.ЗаполнитьПроцентРозничнойНаценкиТабЧасти(СтрокаТовара, Оприходование);
		ОбработкаТабличныхЧастей.РассчитатьРозничнуюЦенуТабЧасти(СтрокаТовара, Оприходование, мВалютаРегламентированногоУчета);
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТовара, Оприходование);
		
		СтрокаТовара.СуммаРегл    = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТовара.Сумма, мВалютаУпрУчета, 
													 мВалютаРегламентированногоУчета, мКурсУпрУчета, 1, мКратностьУпрУчета, 1);
								
		Если НЕ ЗначениеЗаполнено(СтрокаТовара.Качество) Тогда
			ОбработкаТабличныхЧастей.ЗаполнитьКачествоНоменклатурыТабЧасти(СтрокаТовара, Оприходование);
		КонецЕсли;
	КонецЦикла;	
	
	Оприходование.Записать(РежимЗаписиДокумента.Запись);
	
	СоздатьОтметкуОбИмпортеОприходованияИзлишковТоваров(Оприходование.Ссылка, ИдЕМЕ);
	EmeWmsПроведениеДокументов.ПометитьДокументКПроведению(Оприходование.Ссылка);         
	
	Возврат Оприходование.Ссылка;
КонецФункции

// Функция создает документ перемещения на склад брака по карте товаров брака, возвращает ссылку на документ перемещения
Функция СоздатьИзменитьДокументПеремещенияНаСкладБрака(ERPData, ИдЕМЕ, НомерЕМЕ, Распоряжение, КартаБрака, СкладБрака)
	Перем Документ, ТаблицаРазличий;
	
	ДокументСсылка = НайтиДокументПеремещенияТоваров(ИдЕМЕ);
	Если ДокументСсылка.Пустая() Тогда
		Документ = Документы.ПеремещениеТоваров.СоздатьДокумент();
		Документ.Заполнить(Распоряжение);
		Документ.Дата = ТекущаяДата();
		Документ.Организация = Распоряжение.Организация;
		Документ.СкладОтправитель = Распоряжение.Склад;
		Документ.СкладПолучатель =  СкладБрака;
		Документ.ОтражатьВБухгалтерскомУчете = Истина;
		Документ.ОтражатьВУправленческомУчете = Истина;
		Документ.ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.ТоварыПродукция;
		
		Документ.Комментарий = "Создан на основании документа прихода EME: " +
			НомерЕМЕ + " (" + ИдЕМЕ + ")" + " (" + ERPData.header.comment + ")";
	Иначе
		Документ = ДокументСсылка.ПолучитьОбъект();
		Документ.Комментарий = "Изменен на основании документа прихода EME: " +
			НомерЕМЕ + " (" + ИдЕМЕ + ")" + " (" + ERPData.header.comment + ")";
	КонецЕсли;
		
	EmeWmsУтилиты.СкорректироватьТЧДокумента(Документ.Товары, КартаБрака, Истина);		
	ПересчитатьУпаковкиДокумента(Документ);
	// EmeWmsДрайвер.ЗаполнитьСтатусыУказанияСерий(Документ, Документы.ПеремещениеТоваров);

	Документ.Записать(РежимЗаписиДокумента.Запись);
	СоздатьОтметкуОбИмпортеПеремещенияТоваров(Документ, ИдЕМЕ);
	// #IBS 04.04.2023 Новый механизм проведения
	EmeWmsПроведениеДокументов.ПометитьДокументКПроведению(Документ.Ссылка, 1);
	
	Возврат Документ.Ссылка;
КонецФункции

// Пересчитывает количества упаковок товара в ТЧ Товары
Процедура ПересчитатьУпаковкиДокумента(Документ)
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоУпаковок");
	Для Каждого СтрокаТовара Из Документ.Товары Цикл
		СтрокаТовара.Коэффициент = СтрокаТовара.ЕдиницаИзмерения.Коэффициент;
		ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТовара, Документ);
	КонецЦикла;
КонецПроцедуры    

#КонецОбласти

#Область СозданиеОтметокОбИмпорте

// Создает в регистре отметку об импорте документа Оприходования излишков с ID прихода EME
Процедура СоздатьОтметкуОбИмпортеОприходованияИзлишковТоваров(Документ, ИдЕМЕ)
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеОприходованийТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.ДатаИмпорта = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsОтметкиОбИмпортеОприходованийТоваров.СоздатьМенеджерЗаписи();
	НоваяЗапись.ID 			= ИдЕМЕ;
	НоваяЗапись.Ссылка 		= Документ.Ссылка;
	НоваяЗапись.ДатаИмпорта = ТекущаяДата();
    НоваяЗапись.Записать(); 
КонецПроцедуры

// Создает в регистре отметку об импорте Возврата товаров от клиента с ID прихода EME
Процедура СоздатьОтметкуОбИмпортеВозвратаТоваровОтКлиента(Документ, ИдЕМЕ)
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеВозвратовТоваровОтКлиента.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.ДатаИмпорта = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsОтметкиОбИмпортеВозвратовТоваровОтКлиента.СоздатьМенеджерЗаписи();
	НоваяЗапись.ID = ИдЕМЕ;
	НоваяЗапись.Ссылка = Документ.Ссылка;
	НоваяЗапись.ДатаИмпорта = ТекущаяДата();
    НоваяЗапись.Записать(); 
КонецПроцедуры

// Создает в регистре отметку об импорте Перемещения товаров с ID прихода EME
Процедура СоздатьОтметкуОбИмпортеПеремещенияТоваров(Документ, ИдЕМЕ)
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеПеремещенийТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.ДатаИмпорта = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsОтметкиОбИмпортеПеремещенийТоваров.СоздатьМенеджерЗаписи();
	НоваяЗапись.ID = ИдЕМЕ;
	НоваяЗапись.Ссылка = Документ.Ссылка;
	НоваяЗапись.ДатаИмпорта = ТекущаяДата();
    НоваяЗапись.Записать(); 
КонецПроцедуры

#КонецОбласти


