// Copyright (C) 2012-2025 Engineer Mareev Enterprises
// Модуль для УТ 10.3 

// 	$Задание на доставку
//	Импорт сообщений SHIPMENTS:
//	 - EME.WMS (авт.) создает документ Перевозка на основании сообщения SHIPMENTS.
//	 - После оформления и закрытия документа Перевозка EME.WMS (авт.) экспортирует сообщение SHIPMENTS.
//	 - 1C (авт.) импортирует сообщение SHIPMENTS.
//	 - 1С (авт.) При несовпадении данных документа 1С по отгруженным заказам (реализациям) с фактическими, создается оповещение пользователю.
//	 - 1С (авт.) Статус документа Задание на перевозку меняется на Выполнено полностью или Выполнено частично.
//	 - 1C (авт.) В комментарий заносится информация о документе WMS, на основании которого документ принят.
//	 - 1C (авт.) Документ Задание на доставку ЛА помечаеется к проведению.

//	Функция ПолучитьИмяСообщения возвращает имя сообщения
Функция ПолучитьИмяСообщения() Экспорт
	Возврат "shipments";
КонецФункции

//	Функция ПолучитьМетаданные возвращает метаданные сообщения
Функция ПолучитьМетаданные() Экспорт
	Возврат Метаданные.Документы.ЗаданиеНаДоставку_ЛА;
КонецФункции

// #IBS 03.04.2025 Импорт сообщения shipments в документ Задание на доставку ЛА
Процедура Импортировать(ERPData, Трассировка, ТемаСообщения) Экспорт
	
	// Идентификатор документа WMS для регистров контроля
	ИдЕМЕ = ERPData.header.shipment_id;
	// Номер документа WMS для комментариев
	НомерЕМЕ = ERPData.header.shipment_no;
	
	//	Найдем исходный документ Заявка на перевозку
	ЗаданиеНаДоставкуСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаЗаданиеНаДоставку(ИдЕМЕ);
	Если ЗаданиеНаДоставкуСсылка.Пустая() Тогда
		EmeWmsERPEngine.ErrorHeader(ERPData, "ASNBAD");
	КонецЕсли;              

	ЗаданиеНаДоставку = ЗаданиеНаДоставкуСсылка.ПолучитьОбъект();            
	
	// Проверки на существование заказов
	
	СчетчикЗаказов = 0;
	ОтгруженныеЗаказы = новый ТаблицаЗначений;
	ОтгруженныеЗаказы.Колонки.Добавить("Ссылка");

	EmeWmsERPEngine.SelectChild(ERPData, "orders");
	Пока EmeWmsERPEngine.NextChildLine(ERPData) Цикл
		ЗаказСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаРеализациюТоваровУслуг(ERPData.orders.id);
		
		Если ЗаказСсылка.Пустая() Тогда
			EmeWmsERPEngine.ErrorHeader(ERPData, "ORDBAD");
			продолжить;
		КонецЕсли;
		
		СчетчикЗаказов = СчетчикЗаказов + 1;
		СтрокаЗаказа = ОтгруженныеЗаказы.Добавить();
		СтрокаЗаказа.Ссылка = ЗаказСсылка;
	КонецЦикла;

	Если СчетчикЗаказов = 0 Тогда
		EmeWmsERPEngine.ErrorHeader(ERPData, "ORDNUL");
	КонецЕсли;
	
	Если EmeWmsERPEngine.HasErrors(ERPData) Тогда
		Возврат
	КонецЕсли;

	ИсходныеЗаказы = ПолучитьИсходныеЗаказыКлиента(ЗаданиеНаДоставку);
	ТаблицаРазличий = ПолучитьТаблицуСравненийСпискаЗаказов(ИсходныеЗаказы, ОтгруженныеЗаказы);	
	Если ТаблицаРазличий.Количество() > 0 Тогда
		ТекстРасхождений = ПолучитьТекстРасхожденийСпискаЗаказов(ЗаданиеНаДоставку, ТаблицаРазличий);	
		Тема = "Расхождение данных по заказам в 1С и EME.WMS";

		EmeWmsУтилиты.ДобавитьНапоминаниеИнтеграции(ТекстРасхождений, ЗаданиеНаДоставку.Ссылка);

		ЗаданиеНаДоставку.Выполнение 	= Перечисления.СтатусыВыполненияЗаданияНаДоставку_ЛА.ВыполненоЧастично;
		ЗаданиеНаДоставку.Комментарий  	= ЗаданиеНаДоставку.Комментарий + " (Документ отгружен частично по данным перевозки EME:" + НомерЕМЕ + ")";
	Иначе
		ЗаданиеНаДоставку.Выполнение 	= Перечисления.СтатусыВыполненияЗаданияНаДоставку_ЛА.ВыполненоПолностью;
		ЗаданиеНаДоставку.Комментарий  	= ЗаданиеНаДоставку.Комментарий + " (Документ отружен полностью по данным перевозки EME:" + НомерЕМЕ + ")";
	КонецЕсли;

	// Скорректируем таблицу отгруженных реализаций (заказов)
	//СкорректироватьТаблицуЗаказов(ЗаданиеНаДоставку, ОтгруженныеЗаказы);
	
	ЗаданиеНаДоставку.EmeWmsСтатус = "Отгружен";
	
	ЗаданиеНаДоставку.Записать(РежимЗаписиДокумента.Запись);

	//	Пометить для асинхронного проведения 
	EmeWmsПроведениеДокументов.ПометитьДокументКПроведению(ЗаданиеНаДоставку.Ссылка);

	СоздатьОтметкуОбИмпортеЗаданияНаДоставку(ЗаданиеНаДоставку, ERPData.header.id);
	EmeWmsERPEngine.Success(ERPData);
	
КонецПроцедуры

// Убирает из ТЧ УПД документа заявки неотгруженные заказы
Процедура СкорректироватьТаблицуЗаказов(ЗаданиеНаДоставку, ОтгруженныеЗаказы)
	КартаУдалений = новый Соответствие;

	Для каждого СтрокаЗаказа из ЗаданиеНаДоставку.Задания цикл
		Если ОтгруженныеЗаказы.Найти(СтрокаЗаказа.Документ, "Ссылка") = неопределено Тогда
			КартаУдалений.Вставить(СтрокаЗаказа, СтрокаЗаказа);
		КонецЕсли;			
	КонецЦикла;                                
	
	Для каждого Элемент1 из КартаУдалений Цикл
		ЗаданиеНаДоставку.Задания.Удалить(Элемент1.Значение);
	КонецЦикла;		
	
КонецПроцедуры

// Получить таблицу сравнений списка заказов 
Функция ПолучитьТаблицуСравненийСпискаЗаказов(ИсходныеЗаказы, ОтгруженныеЗаказы);	
	ТаблицаСравнений = новый ТаблицаЗначений;
	ТаблицаСравнений.Колонки.Добавить("Ссылка");
	ТаблицаСравнений.Колонки.Добавить("ERP");
	
	Для каждого стр1 из ИсходныеЗаказы цикл
		Если ОтгруженныеЗаказы.Найти(стр1.Ссылка, "Ссылка") = неопределено Тогда
			стр2 = ТаблицаСравнений.Добавить();
			стр2.Ссылка = стр1.Ссылка;
			стр2.ERP = истина;
		КонецЕсли;			
	КонецЦикла;
	
	Для каждого стр1 из ОтгруженныеЗаказы цикл
		Если ИсходныеЗаказы.Найти(стр1.Ссылка, "Ссылка") = неопределено Тогда
			стр2 = ТаблицаСравнений.Добавить();
			стр2.Ссылка = стр1.Ссылка;
			стр2.ERP = ложь;
		КонецЕсли;			
	КонецЦикла;
	
	Возврат ТаблицаСравнений;
КонецФункции

// Получить текст расхождений для уведомления
Функция ПолучитьТекстРасхожденийСпискаЗаказов(Документ, ТаблицаРазличий);	
	Текст = "Между данными об исходном списке заказов в документе "+Строка(Документ.Ссылка) + Символы.ПС +
			" и данными по отгруженным товарам в EME.WMS имеются следующие различия:" + Символы.ПС + Символы.ПС;
	
	Для каждого стр1 из ТаблицаРазличий цикл
		Если стр1.ERP = истина Тогда
			Текст = Текст + "Заказ " + стр1.Ссылка+Символы.ПС +
			"есть в Задании на доставку 1С, но не был отправлен по WMS"+Символы.ПС+Символы.ПС;
		Иначе
			Текст = Текст + "Заказа " + стр1.Ссылка+Символы.ПС +
			"нет в Задании на доставку в 1С, но был отправлен по WMS"+Символы.ПС+Символы.ПС;
		КонецЕсли;
	КонецЦикла;			
	
	Текст = Текст + Символ(13)+"Требуется исправить документ Задания на доставку!";
	
	Возврат Текст;
КонецФункции

// Получить таблицу исходных заказов по документу задания на доставку
Функция ПолучитьИсходныеЗаказыКлиента(ЗаданиеНаДоставку)
	ТаблицаЗаказов = новый ТаблицаЗначений;
	ТаблицаЗаказов.Колонки.Добавить("Ссылка");
	
	Для каждого Строка1 из ЗаданиеНаДоставку.Задания Цикл
		СтрокаЗаказа = ТаблицаЗаказов.Добавить();
		СтрокаЗаказа.Ссылка = Строка1.Документ;
	КонецЦикла;
	ТаблицаЗаказов.Свернуть("Ссылка");
	
	Возврат ТаблицаЗаказов;
КонецФункции

// Создает в регистре пометку об импорте Задания на доставку
Процедура СоздатьОтметкуОбИмпортеЗаданияНаДоставку(Документ, ИдЕМЕ)
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеЗаданийНаДоставку.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.ДатаИмпорта = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsОтметкиОбИмпортеЗаданийНаДоставку.СоздатьМенеджерЗаписи();
	НоваяЗапись.ID = ИдЕМЕ;
	НоваяЗапись.Ссылка = Документ.Ссылка;
	НоваяЗапись.ДатаИмпорта = ТекущаяДата();    
    НоваяЗапись.Записать(); 
 
КонецПроцедуры
