
// #Область ОписаниеПеременных

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		Результат = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		Результат = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

// #КонецОбласти

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТребуемаяВерсия = МодульОбъекта().ТребуемаяВерсияДанныхПодсистемы();
	
	ТекстЗаголовка = 
	МодульОбъекта().ПараметрыВСтроку(НСтр(
	"ru = 'Выполняется обновление данных до версии %1
	|Обновление может занять от нескольких минут до нескольких часов
	|Пожалуйста, подождите...'"), ТребуемаяВерсия);
	
	Элементы.НадписьПереходНаНовуюВерсию.Заголовок = ТекстЗаголовка;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ОбновлениеВыполняетсяВДругомСеансе() Тогда
		ПодключитьОбработчикОжидания("ПроверитьОбновлениеВДругомСеансе", 10, Истина);
	Иначе
		ПодключитьОбработчикОжидания("ПерейтиНаНовуюВерсиюДанных", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ОбновлениеВыполняетсяВДругомСеансе()
	
	Возврат МодульОбъекта().ЗаблокироватьТекущуюВерсиюДанныхПодсистемы() = Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьОбновлениеВДругомСеансе()
	
	Если ОбновлениеВыполняетсяВДругомСеансе() Тогда
		ПодключитьОбработчикОжидания("ПроверитьОбновлениеВДругомСеансе", 10, Истина);
		Возврат;
	КонецЕсли;
	
	ОбновлениеЗавершено = Не МодульКлиента().НеобходимоПерейтиНаНовуюВерсиюДанных();
	Закрыть(ОбновлениеЗавершено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаНовуюВерсиюДанных()
	
	ПерейтиНаНовуюВерсиюДанныхНаСервере();
	
	Закрыть(Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПерейтиНаНовуюВерсиюДанныхНаСервере()
	
	МодульОбъекта().ПерейтиНаНовуюВерсиюДанных();
	
КонецПроцедуры

// #КонецОбласти

