
// #Область СлужебныйПрограммныйИнтерфейс

Функция ПутьКФормеМодуля() Экспорт
	
	Возврат ВзаимодействиеКонтурМаркировка.ПутьКФормеМодуля();
	
КонецФункции

Функция ПутьКОсновнойФормеМодуля() Экспорт
	
	Возврат ВзаимодействиеКонтурМаркировка.ПутьКОсновнойФормеМодуля();
	
КонецФункции

Функция ПараметрыСозданияМодуляКлиента() Экспорт
	
	Возврат ВзаимодействиеКонтурМаркировка.ПараметрыСозданияМодуляКлиента();
	
КонецФункции

Функция НайтиДокументУчетаПоДокументу1С(Знач Документ1С) Экспорт
	
	Возврат ВзаимодействиеКонтурМаркировка.НайтиДокументУчетаПоДокументу1С(Документ1С);
	
КонецФункции

Функция СоздатьДокументУчетаПоДокументу1С(Знач Документ1С, Знач НачатьРаботу = Ложь, Знач ЗагрузитьКоды = Истина) Экспорт
	
	Возврат ВзаимодействиеКонтурМаркировка.СоздатьДокументУчетаПоДокументу1С(Документ1С, НачатьРаботу, ЗагрузитьКоды);
	
КонецФункции

// #КонецОбласти
