
// #Область ОписаниеПеременных

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		Результат = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		Результат = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

// #КонецОбласти

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("АдресТаблицыКодов", АдресТаблицыКодов) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТаблицаКодов = ПолучитьИзВременногоХранилища(АдресТаблицыКодов);
	МодульОбъекта().ТаблицаКодов_ПрочитатьВсюИнформацию(ТаблицаКодов);
	
	ЗаполнитьКонтекстПоТаблицеКодов(ТаблицаКодов, Отказ);
	ЗаполнитьПредставлениеТаблицыКодов(ТаблицаКодов);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтекстПоТаблицеКодов(ТаблицаКодов, Отказ)
	
	Если НЕ ЗначениеЗаполнено(ТаблицаКодов) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ПерваяСтрока = ТаблицаКодов[0];
	
	Для Каждого Колонка Из Перечисление_ПоляТаблицыКодовДляРедактирования() Цикл
		
		НовоеПоле = ИзменяемыеДанные.Добавить();
		НовоеПоле.Ключ = Колонка;
		НовоеПоле.Значение = ПерваяСтрока[Колонка];
		НовоеПоле.ОписаниеТипов = ТаблицаКодов.Колонки[Колонка].ТипЗначения;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЭтаФорма.Закрыть(Ложь);
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовТаблицыФормыИзменяемыеДанные

&НаКлиенте
Процедура ИзменяемыеДанныеЗначениеПриИзменении(Элемент)
	
	Элементы.ИзменяемыеДанные.ТекущиеДанные.Изменять = Истина;
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьДанные(Команда)
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("СохранитьИзмененияПослеСогласия", ЭтаФорма);
	
	ТекстВопроса = НСтр("ru='Внесение изменений может привести к ошибкам при работе с модулем «Контур.Маркировка».
	|Вы уверены, что хотите сохранить эти данные?'");
	
	МодульКлиента().ПоказатьДиалогВопроса(ОписаниеОбработчика, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИзмененияПослеСогласия(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаписатьДанныеНаСервере();
		ЭтаФорма.Закрыть(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеНаСервере()

	ТаблицаКодов = ПолучитьИзВременногоХранилища(АдресТаблицыКодов);
	ПустойКлючНоменклатуры1С = МодульОбъекта().ПустойКлючНоменклатуры1С();
	ПоляАналитикиНоменклатуры = МодульОбъекта().РазделитьСтроку(ИменаПолейАналитикиНоменклатуры1С());
	
	ДанныеИзменены = Ложь;
	ИзмененаАналитикаНоменклатуры = Ложь;
	
	Для Каждого КлючЗначение Из ИзменяемыеДанные Цикл
		
		Если КлючЗначение.Изменять Тогда
			
			ДанныеИзменены = Истина;
			
			ТаблицаКодов.ЗаполнитьЗначения(КлючЗначение.Значение, КлючЗначение.Ключ);
			
			Если ПоляАналитикиНоменклатуры.Найти(КлючЗначение.Ключ) <> Неопределено Тогда
				ИзмененаАналитикаНоменклатуры = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ИзмененаАналитикаНоменклатуры Тогда
		ТаблицаКодов.ЗаполнитьЗначения(ПустойКлючНоменклатуры1С, "КлючНоменклатуры1С");
	КонецЕсли;
	
	Если ДанныеИзменены Тогда
		ТаблицаКодов_ЗаписатьВсюИнформацию(ТаблицаКодов);
	КонецЕсли;
	
	УдалитьИзВременногоХранилища(АдресТаблицыКодов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеТаблицыКодовНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	МодульКлиента().ОткрытьФормуПросмотраТаблицы(ЭтаФорма, АдресТаблицыКодов, Истина);
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПредставлениеТаблицыКодов(ТаблицаКодов)
	
	Шаблон = Нстр("ru='Таблица кодов(%1)'");
	
	ПредставлениеТаблицыКодов = МодульОбъекта().ПараметрыВСтроку(Шаблон, ТаблицаКодов.Количество());
	
КонецПроцедуры

&НаСервере
Функция Перечисление_ПоляТаблицыКодовДляРедактирования()
	
	Возврат МодульОбъекта().Перечисление_ПоляТаблицыКодовДляРедактирования();
	
КонецФункции

&НаСервере
Функция ИменаПолейАналитикиНоменклатуры1С()
	
	Возврат Справочники.КонтурМаркировка_КлючиНоменклатуры1С.ИменаПолейАналитикиНоменклатуры1С();
	
КонецФункции

&НаСервере
Процедура ТаблицаКодов_ЗаписатьВсюИнформацию(ТаблицаКодов)
	
	ПустойКлюч = МодульОбъекта().ПустойУникальныйИдентификатор();
	
	ТаблицаКодов.ЗаполнитьЗначения(ПустойКлюч, "КлючАгрегата");
	ТаблицаЗначений_ЗаполнитьКлючНоменклатуры1С(ТаблицаКодов);
	
	МодульОбъекта().ТаблицаКодов_ЗаписатьВсюИнформацию(ТаблицаКодов);
	
КонецПроцедуры

&НаСервере
Процедура ТаблицаЗначений_ЗаполнитьКлючНоменклатуры1С(ТаблицаЗначений)
	
	Если ТаблицаЗначений.Колонки.Найти("КлючНоменклатуры1С") = Неопределено
		Или ТаблицаЗначений.Колонки.Найти("Номенклатура") = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	КэшРезультатов = Новый Соответствие;
	ПустойКлючНоменклатуры1С = МодульОбъекта().ПустойКлючНоменклатуры1С();
	
	Для Каждого Стр Из ТаблицаЗначений.НайтиСтроки(Новый Структура("КлючНоменклатуры1С", ПустойКлючНоменклатуры1С)) Цикл
		
		Если НЕ ЗначениеЗаполнено(Стр.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		АналитикаНоменклатуры = МодульОбъекта().Новый_АналитикаНоменклатуры1С();
		ЗаполнитьЗначенияСвойств(АналитикаНоменклатуры, Стр);
		
		Стр.КлючНоменклатуры1С = МодульОбъекта().КлючНоменклатуры1С_Подобрать(АналитикаНоменклатуры, КэшРезультатов);
		
	КонецЦикла;
	
КонецПроцедуры

// #КонецОбласти
