
&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Возврат Вычислить("ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка()");
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		Результат = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		Результат = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

&НаСервере
Функция МодульКорректноУстановлен()
	
	Возврат ТипЗнч(СписокОпераций_ОтборТовар) <> Тип("Строка");
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЗапрещеноСозданиеНовойФормы") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ПроверитьКорректностьУстановки();
	
	ИдентификаторСеанса = Неопределено;
	Параметры.Свойство("ИдентификаторСеанса", ИдентификаторСеанса);
	Если Не ЗначениеЗаполнено(ИдентификаторСеанса) Тогда
		ИдентификаторСеанса = УникальныйИдентификатор;
	КонецЕсли;
	
	Модуль = РеквизитФормыВЗначение("Объект");
	Если Не Модуль.МодульИнициализирован(ИдентификаторСеанса) Тогда
		Модуль.ИнициализироватьИзОсновнойФормы(ИдентификаторСеанса);
	КонецЕсли;
	
	НастроитьЭлементыФормы();
	ЗаполнитьПериодыСписковПоУмолчанию();
	УстановитьОтборСпискаДокументов();
	НастроитьСписокВходящихУПД();
	НастроитьСписокАгрегатов();
	НастроитьСписокОпераций();
	НастроитьСписокУведомленийОПриемке();
	УстановитьЗаголовок();
	ЗаполнитьСписокВыбораОтборТипОперации();
	ЗаполнитьСписокВыбораОтборСтатусОперации();
	ПроверитьНаличиеНовостей();
	НастроитьКартинкиКомандФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ВладелецФормы = Неопределено Тогда
		МодульКлиента().ПриОткрытииОсновнойФормы();
	КонецЕсли;
	
	УстановитьВидимость();
	УстановитьПериодРабочегоСтола();
	УстановитьДатуПоследнегоОбмена();
	
	ПроверитьВыполнениеОбменаССервисом();
	ПроверитьЗаполнениеАнкеты();
	
	ОбновитьСписокДокументовУчета();
	ОбновитьСписокОпераций();
	ОбновитьСписокВходящихУПД();
	ОбновитьСписокОперацийАгрегатов();
	ОбновитьСписокУведомленийОПриемке();
	
	Если ВладелецФормы = Неопределено Тогда
		ПроверитьОбновление(Истина);
	Иначе
		ПродолжитьОткрытие();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ВладелецФормы <> Неопределено И ВладелецФормы.Открыта() Тогда
		Оповестить("КонтурМаркировка_СменитьВладельца", ВладелецФормы, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы = Ложь)
	
	Если Не ЗавершениеРаботы И ВладелецФормы = Неопределено Тогда
		МодульКлиента().ПриЗакрытииОсновнойФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСпискаДокументов()
	
	Если Не Найти(КлючНазначенияИспользования, "Документы") Тогда
		Возврат;
	КонецЕсли;
	
	ПериодДокументовУчета = Параметры.Период;
	
	СписокДокументов_ОчиститьОтборыНаСервере();
	ТекущийОтборСпискаДокументов = МодульОбъекта().Перечисление_СлужебныеОтборы().ОтборБезНазвания;
	ТаблицаДокументов_УстановитьСхемуСКД(СписокДокументовУчета.Выгрузить());
	
	ОтборКомпоновки = КомпоновщикНастроек.Настройки.Отбор;
	ОтборКомпоновки.Элементы.Очистить();
	ЗаполнитьОтборКомпоновкиДанных(ОтборКомпоновки, Параметры.ПараметрыОтбора);
	
	МодульОбъекта().СохранитьОтборСпискаДокументов(ТекущийОтборСпискаДокументов, КомпоновщикНастроек);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборДинамическогоСпискаПоПараметрамФормы(ДинамическийСписок)
	
	Если Не Параметры.Свойство("ПараметрыОтбора") Тогда
		Возврат;
	КонецЕсли;
	
	Если МодульОбъекта().ВерсияПлатформыНиже("8.3") Тогда
		ОтборКомпоновки = ДинамическийСписок.Отбор;
	ИначеЕсли МодульОбъекта().ВерсияРежимаСовместимостиНиже("8.3") Тогда
		ОтборКомпоновки = ДинамическийСписок.КомпоновщикНастроек.Настройки.Отбор;
	Иначе
		Для каждого Элемент Из ДинамическийСписок.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
			Если ТипЗнч(Элемент) = Тип("ОтборКомпоновкиДанных") Тогда
				ОтборКомпоновки = Элемент;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ЗаполнитьОтборКомпоновкиДанных(ОтборКомпоновки, Параметры.ПараметрыОтбора);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтборКомпоновкиДанных(Приемник, Источник)
	
	Для каждого ЭлементИсточник Из Источник.Элементы Цикл
		
		ЭлементПриемник = Приемник.Элементы.Добавить(ТипЗнч(ЭлементИсточник));
		ЗаполнитьЗначенияСвойств(ЭлементПриемник, ЭлементИсточник);
		
		Если ТипЗнч(ЭлементИсточник) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			ЗаполнитьОтборКомпоновкиДанных(ЭлементПриемник, ЭлементИсточник);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСпискаОпераций()
	
	Если Не Найти(КлючНазначенияИспользования, "Операции") Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьОтборДинамическогоСпискаПоПараметрамФормы(СписокОпераций);
	
	ПериодСпискаОпераций = Параметры.Период;
	Элементы.Закладки.ТекущаяСтраница = Элементы.ЗакладкаОперации;
	
	Если Не МодульОбъекта().ВерсияПлатформыНиже("8.3") Тогда
		СписокОпераций.АвтоматическоеСохранениеПользовательскихНастроек = Ложь;
	КонецЕсли;
	
	Если МодульОбъекта().ВерсияРежимаСовместимостиНиже("8.3") Тогда
		СформироватьОписаниеОтборов();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСпискаВходящихУПД()
	
	Если Не Найти(КлючНазначенияИспользования, "ПриемкаУПД") Тогда
		Возврат;
	КонецЕсли;
	
	ПериодВходящихУПД = Параметры.Период;
	Элементы.Закладки.ТекущаяСтраница = Элементы.ЗакладкаПриемкаУПД;
	
	Если Не МодульОбъекта().ВерсияПлатформыНиже("8.3") Тогда
		СписокВходящихУПД.АвтоматическоеСохранениеПользовательскихНастроек = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСпискаУведомленийОПриемке()
	
	Если Не Найти(КлючНазначенияИспользования, "УведомленияОПриемке") Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьОтборДинамическогоСпискаПоПараметрамФормы(СписокУведомленийОПриемке);
	
	ПериодУведомленийОПриемке = Параметры.Период;
	Элементы.Закладки.ТекущаяСтраница = Элементы.ЗакладкаУведомленияОПриемке;
	
	Если Не МодульОбъекта().ВерсияПлатформыНиже("8.3") Тогда
		СписокУведомленийОПриемке.АвтоматическоеСохранениеПользовательскихНастроек = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	РежимТехническогоСпециалиста = МодульКлиента().ВключенРежимТехническогоСпециалиста();
	НастроитьВидимостьПодменюТехническогоСпециалиста(РежимТехническогоСпециалиста);
	
	Если Не ЗначениеЗаполнено(КлючНазначенияИспользования) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаЗаголовок.Видимость = Ложь;
	
	Если Найти(КлючНазначенияИспользования, "Документы") Тогда
		ОтображаемаяСтраница = Элементы.ЗакладкаДокументыУчета;
		Элементы.Кнопка_ПоказатьЗавершенныеДокументы.Видимость = Ложь;
	ИначеЕсли Найти(КлючНазначенияИспользования, "ПриемкаУПД") Тогда
		ОтображаемаяСтраница = Элементы.ЗакладкаПриемкаУПД;
	ИначеЕсли Найти(КлючНазначенияИспользования, "УведомленияОПриемке") Тогда
		ОтображаемаяСтраница = Элементы.ЗакладкаУведомленияОПриемке;
	Иначе
		ОтображаемаяСтраница = Элементы.ЗакладкаОперации;
		Элементы.СписокОперацийБыстрыеОтборы.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.Закладки.ТекущаяСтраница = ОтображаемаяСтраница;
	Элементы.Закладки.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьПодменюТехническогоСпециалиста(РежимТехническогоСпециалиста)
	
	Элементы.Группа_ФункцииТехническогоСпециалиста.Видимость = РежимТехническогоСпециалиста;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОбновление(ПриОткрытии = Ложь)
	
	КонтекстОбновления = МодульКлиента().КонтекстОбновления();
	КонтекстОбновления.ВыполняетсяОткрытиеМодуля = ПриОткрытии;
	
	Если ПриОткрытии И КонтекстОбновления.ОбновлениеВыполнено Тогда
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПослеУведомленияОбУстановкеНовойВерсии", ЭтаФорма);
		МодульКлиента().ОткрытьФормуИнформацииОбОбновлении(ЭтаФорма, КонтекстОбновления, ОписаниеОбработчика);
		Возврат;
	КонецЕсли;
	
	МодульКлиента().ПроверитьДоступностьФайлаМодуляНаКлиенте(КонтекстОбновления);
	
	Если ПриОткрытии И Не КонтекстОбновления.ЕстьОбновлениеМодуля Тогда
		ПродолжитьОткрытиеПослеПроверкиОбновления();
		Возврат;
	КонецЕсли;
	
	Если ПриОткрытии Тогда
		
		Если КонтекстОбновления.ЕстьОбновлениеМодуля
			И Не КонтекстОбновления.ЕстьПодсистемаВСО Тогда
			ДобавитьУведомление(МодульКлиента().Перечисление_ТипыУведомлений().ОбновитесьДоНовойВерсии);
		КонецЕсли;
		
		Если КонтекстОбновления.НевозможноВыполнитьОбновление
			Или КонтекстОбновления.ПолученаОшибкаСервисаОбновлений
			Или КонтекстОбновления.НельзяПоказыватьУведомлениеОНовойВерсии Тогда
			МодульКлиента().Метрики_НевозможноВыполнитьОбновление(КонтекстОбновления);
			ПродолжитьОткрытиеПослеПроверкиОбновления();
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("Обновление_ОбработатьРешениеПользователя", ЭтаФорма);
	МодульКлиента().ОткрытьФормуИнформацииОбОбновлении(ЭтаФорма, КонтекстОбновления, ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьОткрытиеПослеПроверкиОбновления()
	
	Если МодульКлиента().НеобходимоПерейтиНаНовуюВерсиюДанных() Тогда
		ПерейтиНаНовуюВерсиюДанных();
		Возврат;
	КонецЕсли;
	
	ПродолжитьОткрытие();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаНовуюВерсиюДанных()
	
	ТребуемаяВерсия = МодульКлиента().ТребуемаяВерсияДанныхПодсистемы();
	ЗаголовокВопроса = НСтр("ru = 'Обновление подсистемы Контур.Маркировка'");
	
	ТекстВопроса = НСтр(
	"ru = 'Необходимо обновить данные подсистемы до версии %1
	|Обновление может занять от нескольких минут до нескольких часов.
	|Продолжить?'");
	ТекстВопроса = МодульКлиента().ПараметрыВСтроку(ТекстВопроса, ТребуемаяВерсия);
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
	"ПерейтиНаНовуюВерсиюДанных_ПослеСогласия", ЭтаФорма, ТребуемаяВерсия);
	
	МодульКлиента().ПоказатьДиалогВопроса(ОписаниеОбработчика, ТекстВопроса, РежимДиалогаВопрос.ДаНет, ЗаголовокВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаНовуюВерсиюДанных_ПослеСогласия(Ответ, НоваяВерсия) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Закрыть();
		Возврат;
	КонецЕсли;
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
	"ПерейтиНаНовуюВерсиюДанных_ПослеОбновленияДанных", ЭтаФорма, НоваяВерсия);
	
	МодульКлиента().ОткрытьФормуПереходаНаНовуюВерсиюДанных(ЭтаФорма, ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаНовуюВерсиюДанных_ПослеОбновленияДанных(ОбновлениеВыполнено, НоваяВерсия) Экспорт
	
	Если ОбновлениеВыполнено <> Истина Тогда
		Закрыть();
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = НСтр("ru = 'Обновление на новую версию данных %1 успешно завершено'");
	ТекстСообщения = МодульКлиента().ПараметрыВСтроку(ТекстСообщения, НоваяВерсия);
	МодульКлиента().СообщитьПользователюЛок(ТекстСообщения);
	
	ПродолжитьОткрытие();
	
КонецПроцедуры

&НаКлиенте
Процедура Обновление_ОбработатьРешениеПользователя(КонтекстОбновления, ДопПараметры = Неопределено) Экспорт
	
	Если КонтекстОбновления.ПолученОтказ Тогда
		МодульКлиента().ЗафиксироватьОтказОтОбновленияПриОткрытииМодуля(КонтекстОбновления);
	КонецЕсли;
	
	Если КонтекстОбновления.ПолученоСогласие Тогда
		Обновление_ПредложениеЗавершитьРаботуНаВсехУстройствах(КонтекстОбновления);
		Возврат;
	КонецЕсли;
	
	Если КонтекстОбновления.ВыполняетсяОткрытиеМодуля Тогда
		ПродолжитьОткрытиеПослеПроверкиОбновления();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Обновление_ПредложениеЗавершитьРаботуНаВсехУстройствах(КонтекстОбновления)
	
	ЗаголовокВопроса = НСтр("ru = 'Обновление модуля'");
	
	ТекстВопроса = НСтр(
	"ru = 'Для корректного обновления необходимо
	|завершить работу с текущей версией на всех устройствах.
	|Выполнить обновление?'");
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
	"Обновление_ПредложениеЗавершитьРаботуНаВсехУстройствах_ПослеСогласия", ЭтаФорма, КонтекстОбновления);
	
	МодульКлиента().ПоказатьДиалогВопроса(ОписаниеОбработчика, ТекстВопроса, РежимДиалогаВопрос.ДаНет, ЗаголовокВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура Обновление_ПредложениеЗавершитьРаботуНаВсехУстройствах_ПослеСогласия(Ответ, КонтекстОбновления) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОбновитьИПерезапуститьМодуль(КонтекстОбновления);
	Иначе
		Если КонтекстОбновления.ВыполняетсяОткрытиеМодуля Тогда
			ПродолжитьОткрытиеПослеПроверкиОбновления();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИПерезапуститьМодуль(КонтекстОбновления)
	
	Попытка
		МодульКлиента().ВыполнитьОбновлениеМодуля(КонтекстОбновления);
	Исключение
		
		Ошибка = ИнформацияОбОшибке();
		Действие = НСтр("ru = 'Выполнение обновления'");
		ТекстСообщения = НСтр("ru = 'Не удалось выполнить обновление'");
		
		МодульКлиента().ОбработатьОшибку(Действие, Ошибка,, ТекстСообщения);
		
		КонтекстОбновления.ОписаниеОшибки = Ошибка;
		
	КонецПопытки;
	
	МодульКлиента().Метрики_АвтоматическоеОбновление(КонтекстОбновления);
	
	Если КонтекстОбновления.ОбновлениеВыполнено Тогда
		
		ВариантыРасположения = МодульКлиента().Перечисление_ВариантыРасположенияОбработки();
		Если КонтекстОбновления.РасположениеМодуля = ВариантыРасположения.ВРасширении Тогда
			УведомитьПользователяОбУспешномОбновленииРасширенияКонфигурации();
		Иначе
			ПодключитьНовуюВерсиюПерезапуститьМодуль(КонтекстОбновления);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УведомитьПользователяОбУспешномОбновленииРасширенияКонфигурации()
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
			"ОбработатьДействиеПользователяПослеОбновленияРасширения",
			ЭтаФорма);
	
	ЗаголовокВопроса = НСтр("ru = 'Обновление модуля'");
	ТекстСообщения = НСтр("ru = 'Модуль автоматически обновлен до актуальной версии. Для работы с модулем перезапустите программу.'");
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru = 'Закрыть'"));
	Кнопки.Добавить(КодВозвратаДиалога.ОК, НСтр("ru = 'Перезапустить'"));
	
	МодульКлиента().ПоказатьДиалогВопроса(
		ОписаниеОбработчика,
		ТекстСообщения,
		Кнопки,
		ЗаголовокВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьДействиеПользователяПослеОбновленияРасширения(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		ЗавершитьРаботуСистемы(Ложь, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьОткрытие()
	
	Если МодульКлиента().ВерсияПлатформыНиже("8.3") Тогда
		// В событии ПриОткрытии ЭтаФорма.Открыта() для 8.2 = Ложь
		// Чтобы избежать ошибок продолжаем через обработчик ожидания
		ПодключитьОбработчикОжидания("ПослеОткрытия", 0.1, Истина);
	Иначе
		ПослеОткрытия();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОткрытия() Экспорт
	
	ОбновитьТекстУведомления();
	
	УстановитьОтборПоказатьЗавершенныеСпискаДокументовУчета();
	
	УстановитьЗаголовокПериодаСписка(Элементы.Кнопка_ПериодСпискаДокументов, ПериодДокументовУчета);
	УстановитьЗаголовокПериодаСписка(Элементы.Кнопка_ПериодСпискаВходящихУПД, ПериодВходящихУПД);
	УстановитьЗаголовокПериодаСписка(Элементы.Кнопка_ПериодОперацийАгрегатов, ПериодОперацийАгрегатов);
	УстановитьЗаголовокПериодаСписка(Элементы.Кнопка_ПериодСпискаОпераций, ПериодСпискаОпераций);
	УстановитьЗаголовокПериодаСписка(Элементы.Кнопка_ПериодСпискаУведомленийОПриемке, ПериодУведомленийОПриемке);
	
	Если ВладелецФормы = Неопределено Тогда
		МодульКлиента().ЗапуститьУдалениеУстаревшихДанных();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуПоследнегоОбмена()
	
	ДатаПоследнегоОбмена = ДатаПоследнегоОбмена();
	
	Если ЗначениеЗаполнено(ДатаПоследнегоОбмена) Тогда
		
		ДатаПоследнегоОбмена = МестноеВремя(ДатаПоследнегоОбмена);
		
		МинутВЧасе = 60;
		СекундВЧасе = 3600;
		ПрошлоМинут = Цел((ТекущаяДата() - ДатаПоследнегоОбмена) / МинутВЧасе);
		ПрошлоЧасов = Цел((ТекущаяДата() - ДатаПоследнегоОбмена) / СекундВЧасе);
		
		Если НачалоДня(ДатаПоследнегоОбмена) < НачалоДня(ТекущаяДата()) Тогда
			
			ДатаСтрокой = Строка(ДатаПоследнегоОбмена);
			
		ИначеЕсли ЗначениеЗаполнено(ПрошлоЧасов) Или ЗначениеЗаполнено(ПрошлоМинут) Тогда
			
			Если ЗначениеЗаполнено(ПрошлоЧасов) Тогда
				ПараметрыИсчисления = "час, часа, часов, м,,,,, 0";
				ДатаСтрокой = МодульКлиента().ЧислоСЕдиницейИзмерения(ПрошлоЧасов, ПараметрыИсчисления);
			Иначе
				ПараметрыИсчисления = "минута, минуты, минут, ж,,,,, 0";
				ДатаСтрокой = МодульКлиента().ЧислоСЕдиницейИзмерения(ПрошлоМинут, ПараметрыИсчисления);
			КонецЕсли;
			
			ДатаСтрокой = ДатаСтрокой + " " + НСтр("ru = 'назад'");
			
		Иначе
			ДатаСтрокой = НСтр("ru = 'только что'");
		КонецЕсли;
		
	Иначе
		ДатаСтрокой = НСтр("ru = 'никогда'");
	КонецЕсли;
	
	ТекстДатаОбмена = НСтр("ru = 'Обмен с сервисом: %1'");
	ТекстДатаОбмена = МодульКлиента().ПараметрыВСтроку(ТекстДатаОбмена, ДатаСтрокой);
	
	ЭтаФорма.Элементы.Ссылка_ДатаОбменаССервисом.Заголовок = ТекстДатаОбмена;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовок()
	
	Если Параметры.Свойство("Заголовок", Заголовок) Тогда
		Возврат;
	КонецЕсли;
	
	ВерсияМодуля = МодульОбъекта().ВерсияОбработки();
	ЭтоБетаВерсия = МодульОбъекта().ЭтоБетаВерсия();
	НастройкиМодуля = МодульОбъекта().НастройкиМодуля();
	ОписаниеДоработокМодуля = МодульОбъекта().ОписаниеДоработокМодуля();
	НаименованиеМодуля = МодульОбъекта().СведенияОВнешнейОбработке().Наименование;
	
	Если ЭтоБетаВерсия Тогда
		СтрокаБетаВерсия = "b";
	КонецЕсли;
	
	ДополнительноеОписаниеМодуля = Новый Массив;
	Если НастройкиМодуля.ТестовоеОкружение Тогда
		ДополнительноеОписаниеМодуля.Добавить("тестовое окружение");
	КонецЕсли;
	Если НастройкиМодуля.РежимТестирования Тогда
		ДополнительноеОписаниеМодуля.Добавить("режим тестирования");
	КонецЕсли;
	Если ЗначениеЗаполнено(ОписаниеДоработокМодуля) Тогда
		ДополнительноеОписаниеМодуля.Добавить("модуль доработан");
	КонецЕсли;
	Если НастройкиМодуля.РежимОтладки Тогда
		ДополнительноеОписаниеМодуля.Добавить("режим отладки");
	КонецЕсли;
	
	СтрокаДополнительноеОписание = "";
	Если ЗначениеЗаполнено(ДополнительноеОписаниеМодуля) Тогда
		СтрокаДополнительноеОписание = МодульОбъекта().СоединитьСтроку(ДополнительноеОписаниеМодуля, ", ");
		СтрокаДополнительноеОписание = МодульОбъекта().ПараметрыВСтроку(" (%1)", СтрокаДополнительноеОписание);
	КонецЕсли;
	
	ТекстЗаголовка = НаименованиеМодуля
	+ " "
	+ ВерсияМодуля
	+ СтрокаБетаВерсия
	+ СтрокаДополнительноеОписание;
	
	ЭтаФорма.Заголовок = ТекстЗаголовка;
	
КонецПроцедуры

&НаСервере
Функция ДатаПоследнегоОбмена()
	
	ВсеОрганизацииДляОбмена = МодульОбъекта().Организация_ВсеОрганизацииДляОбмена();
	
	Результат = '00010101';
	
	Для Каждого ОрганизацияДляОбмена Из ВсеОрганизацииДляОбмена Цикл
		
		Свойство = МодульОбъекта().Перечисление_ДопСвойства().ДатаПоследнегоОбмена;
		ДатаПоследнегоОбмена = МодульОбъекта().ДопСвойство_Прочитать(ОрганизацияДляОбмена, Свойство);
		Если Не ЗначениеЗаполнено(ДатаПоследнегоОбмена) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Результат)
			Или Результат > ДатаПоследнегоОбмена Тогда
			Результат = ДатаПоследнегоОбмена;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПериодыСписковПоУмолчанию()
	
	ЗаполнитьПустыеЗначенияПериода(ПериодДокументовУчета);
	ЗаполнитьПустыеЗначенияПериода(ПериодВходящихУПД);
	ЗаполнитьПустыеЗначенияПериода(ПериодОперацийАгрегатов);
	ЗаполнитьПустыеЗначенияПериода(ПериодСпискаОпераций);
	ЗаполнитьПустыеЗначенияПериода(ПериодУведомленийОПриемке);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериодРабочегоСтола()
	
	ПериодРабочегоСтола = МодульКлиента().СвойствоОбъекта(ВладелецФормы, "Период");
	Если Не ЗначениеЗаполнено(ПериодРабочегоСтола) Тогда
		Возврат;
	КонецЕсли;
	
	ПериодДокументовУчета = ПериодРабочегоСтола;
	ПериодВходящихУПД = ПериодРабочегоСтола;
	ПериодОперацийАгрегатов = ПериодРабочегоСтола;
	ПериодСпискаОпераций = ПериодРабочегоСтола;
	ПериодУведомленийОПриемке = ПериодРабочегоСтола;
	
КонецПроцедуры

&НаКлиенте
Функция ПредставлениеПериодаСтрокой(Период)
	
	Если Период.Вариант = ВариантСтандартногоПериода.Месяц
		Или Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод Тогда
		СтрокаПериода = ПредставлениеПериода(Период.ДатаНачала, Период.ДатаОкончания);
	Иначе
		СтрокаПериода = Строка(Период);
	КонецЕсли;
	
	Возврат СтрокаПериода;
	
КонецФункции

&НаКлиенте
Процедура УстановитьЗаголовокПериодаСписка(Элемент, Период)
	
	Элемент.Заголовок = ПредставлениеПериодаСтрокой(Период);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьСписокВходящихУПД()
	
	УстановитьОтборСпискаВходящихУПД();
	
	СписокВходящихУПД.ТекстЗапроса = ТекстЗапроса_СписокВходящихУПД();
	СписокВходящихУПД.ОсновнаяТаблица = "Справочник.КонтурМаркировка_Операции";
	СписокВходящихУПД.ДинамическоеСчитываниеДанных = Истина;
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	СписокВходящихУПД.Параметры.УстановитьЗначениеПараметра("ВходящийУПД", ТипыОпераций.ВходящийУПД);
	
	УстановитьПараметрыПериодаДинамическогоСписка(СписокВходящихУПД, ПериодВходящихУПД);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьСписокАгрегатов()
	
	СписокОперацийАгрегатов.ТекстЗапроса = ТекстЗапроса_СписокАгрегатов();
	СписокОперацийАгрегатов.ОсновнаяТаблица = "Справочник.КонтурМаркировка_Операции";
	СписокОперацийАгрегатов.ДинамическоеСчитываниеДанных = Истина;
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	ПодходящиеТипы = Новый Массив;
	ПодходящиеТипы.Добавить(ТипыОпераций.НаполнениеАгрегатовНаТСД);
	ПодходящиеТипы.Добавить(ТипыОпераций.РегистрацияАгрегатов);
	ПодходящиеТипы.Добавить(ТипыОпераций.ДобавлениеВАгрегат);
	ПодходящиеТипы.Добавить(ТипыОпераций.ИзъятиеИзАгрегата);
	
	СписокОперацийАгрегатов.Параметры.УстановитьЗначениеПараметра("ПодходящиеТипы", ПодходящиеТипы);
	
	УстановитьПараметрыПериодаДинамическогоСписка(СписокОперацийАгрегатов, ПериодОперацийАгрегатов);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьСписокОпераций()
	
	УстановитьОтборСпискаОпераций();
	
	СписокОпераций.ТекстЗапроса = ТекстЗапроса_СписокОпераций();
	СписокОпераций.ОсновнаяТаблица = "Справочник.КонтурМаркировка_Операции";
	СписокОпераций.ДинамическоеСчитываниеДанных = Истина;
	
	ТипыИнтерактивныхОпераций = МодульОбъекта().ТипыИнтерактивныхОпераций();
	СтатусыОпераций = МодульОбъекта().Перечисление_СтатусыОпераций();
	
	СписокОпераций.Параметры.УстановитьЗначениеПараметра("ПодходящиеТипы", ТипыИнтерактивныхОпераций);
	СписокОпераций.Параметры.УстановитьЗначениеПараметра("Новый", СтатусыОпераций.Новый);
	СписокОпераций.Параметры.УстановитьЗначениеПараметра("ОперацияЗавершена", СтатусыОпераций.ОперацияЗавершена);
	СписокОпераций.Параметры.УстановитьЗначениеПараметра("ОперацияОтменена", СтатусыОпераций.ОперацияОтменена);
	СписокОпераций.Параметры.УстановитьЗначениеПараметра("ОшибкаОбработки", СтатусыОпераций.ОшибкаОбработки);
	СписокОпераций.Параметры.УстановитьЗначениеПараметра("ОшибкаЗаполнения", СтатусыОпераций.ОшибкаЗаполнения);
	СписокОпераций.Параметры.УстановитьЗначениеПараметра("ОшибкаОтменыОперации", СтатусыОпераций.ОшибкаОтменыОперации);
	
	УстановитьПараметрыПериодаДинамическогоСписка(СписокОпераций, ПериодСпискаОпераций);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы()
	
	СписокДокументовУчета_ДобавитьКолонку_Контрагент();
	СписокДокументовУчета_ДобавитьКолонку_Склад();
	СписокДокументовУчета_ДобавитьКолонку_УчетныйДокумент();
	
	СписокДокументовУчета_СформироватьДополнительныеКолонки();
	
	СформироватьДополнительныеКнопки();
	СформироватьКомандыМенюОтборов();
	НастроитьЭлементыФормыДля82();
	
КонецПроцедуры

&НаСервере
Процедура СписокДокументовУчета_ДобавитьКолонку_Контрагент()
	
	ТипКонтрагента = МодульОбъекта().ТипыОбъектовИС().Контрагент;
	
	Если Не ЗначениеЗаполнено(ТипКонтрагента) Тогда
		Возврат;
	КонецЕсли;
	
	ТипПоля = Новый ОписаниеТипов(ТипКонтрагента);
	НовыйРеквизит = Новый РеквизитФормы("Контрагент", ТипПоля, "СписокДокументовУчета", "Контрагент");
	ИзменитьРеквизиты(МодульОбъекта().НовыйМассив(НовыйРеквизит));
	
	НовыйЭлемент = Элементы.Вставить("СписокДокументовУчетаКонтрагент", Тип("ПолеФормы")
	, Элементы.СписокДокументовУчета, Элементы.СписокДокументовУчетаСумма);
	
	НовыйЭлемент.ПутьКДанным = "СписокДокументовУчета.Контрагент";
	
КонецПроцедуры

&НаСервере
Процедура СписокДокументовУчета_ДобавитьКолонку_Склад()
	
	ТипСклада = МодульОбъекта().ТипыОбъектовИС().Склад;
	
	Если Не ЗначениеЗаполнено(ТипСклада) Тогда
		Возврат;
	КонецЕсли;
	
	ТипПоля = Новый ОписаниеТипов(ТипСклада);
	НовыйРеквизит = Новый РеквизитФормы("Склад", ТипПоля, "СписокДокументовУчета", "Склад");
	ИзменитьРеквизиты(МодульОбъекта().НовыйМассив(НовыйРеквизит));
	
	НовыйЭлемент = Элементы.Вставить("СписокДокументовУчетаСклад", Тип("ПолеФормы")
	, Элементы.СписокДокументовУчета, Элементы.СписокДокументовУчетаСтатус);
	
	НовыйЭлемент.ПутьКДанным = "СписокДокументовУчета.Склад";
	
КонецПроцедуры

&НаСервере
Процедура СписокДокументовУчета_ДобавитьКолонку_УчетныйДокумент()
	
	ТипПоля = Новый ОписаниеТипов(Документы.ТипВсеСсылки());
	НовыйРеквизит = Новый РеквизитФормы("Документ1С", ТипПоля, "СписокДокументовУчета", "Документ 1С");
	ИзменитьРеквизиты(МодульОбъекта().НовыйМассив(НовыйРеквизит));
	
	НовыйЭлемент = Элементы.Добавить("СписокДокументовУчетаДокумент1С"
	, Тип("ПолеФормы"), Элементы.СписокДокументовУчета);
	
	НовыйЭлемент.ПутьКДанным = "СписокДокументовУчета.Документ1С";
	
КонецПроцедуры

&НаСервере
Процедура СписокДокументовУчета_СформироватьДополнительныеКолонки()
	
	НастройкиДопКолонок = МодульОбъекта().НастройкиДополнительныхКолонокСпискаДокументов();
	
	СписокДокументовУчета_УдалитьДопКолонку("ДопКолонка1");
	СписокДокументовУчета_УдалитьДопКолонку("ДопКолонка2");
	СписокДокументовУчета_УдалитьДопКолонку("ДопКолонка3");
	
	СписокДокументовУчета_ДобавитьКолонку("ДопКолонка1", НастройкиДопКолонок.ДопКолонка1);
	СписокДокументовУчета_ДобавитьКолонку("ДопКолонка2", НастройкиДопКолонок.ДопКолонка2);
	СписокДокументовУчета_ДобавитьКолонку("ДопКолонка3", НастройкиДопКолонок.ДопКолонка3);
	
	ТребуетсяВызватьПМ_ПриЗаполненияСпискаДокументов = НастройкиДопКолонок.ТребуетсяОбработкаПриЗаполненияСписка;
	
КонецПроцедуры

&НаСервере
Процедура СписокДокументовУчета_ДобавитьКолонку(ИмяКолонки, НастройкиКолонки)
	
	ИмяЭлемента = "СписокДокументовУчета" + ИмяКолонки;
	ПутьКДанным = "СписокДокументовУчета." + ИмяКолонки;
	
	НовыйРеквизит = Новый РеквизитФормы(ИмяКолонки, Новый ОписаниеТипов(НастройкиКолонки.ТипКолонки), "СписокДокументовУчета", НастройкиКолонки.Заголовок);
	ИзменитьРеквизиты(МодульОбъекта().НовыйМассив(НовыйРеквизит));
	
	НовыйЭлемент = Элементы.Вставить(ИмяЭлемента, Тип("ПолеФормы"), Элементы.СписокДокументовУчета, Элементы["СписокДокументовУчетаКомментарий"]);
	
	НовыйЭлемент.ПутьКДанным = ПутьКДанным;
	НовыйЭлемент.Видимость = НастройкиКолонки.Видимость;
	
КонецПроцедуры

&НаСервере
Процедура СписокДокументовУчета_УдалитьДопКолонку(ИмяКолонки)
	
	ИмяЭлемента = "СписокДокументовУчета" + ИмяКолонки;
	ПутьКДанным = "СписокДокументовУчета." + ИмяКолонки;
	
	СуществующаяКолонка = Элементы.Найти(ИмяЭлемента);
	Если СуществующаяКолонка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Удалить(СуществующаяКолонка);
	
	МассивУдаляемыхРеквизитов = Новый Массив;
	МассивУдаляемыхРеквизитов.Добавить(ПутьКДанным);
	ИзменитьРеквизиты(, МассивУдаляемыхРеквизитов);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормыДля82()
	
	Если Не МодульОбъекта().ПоддерживаетсяАвтоОбработкаФоновыхЗаданий() Тогда
		Элементы.Кнопка_ЗапуститьВыполнениеФоновыхЗаданий82.Видимость = Истина;
	КонецЕсли;
	
	Если Не МодульОбъекта().ВерсияРежимаСовместимостиНиже("8.3") Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаКнопок_ПоискВСпискеДокументов82.Видимость = Истина;
	
	Элементы.ГруппаКнопок_ПоискВСпискеВходящихУПД82.Видимость = Истина;
	Элементы.ГруппаКнопок_НастройкиСпискаВходящихУПД.Вид = ВидГруппыФормы.ГруппаКнопок;
	
	Элементы.ГруппаКнопок_ПоискВСпискеОпераций.Видимость = Ложь;
	Элементы.ГруппаКнопок_ПоискВСпискеОпераций82.Видимость = Истина;
	Элементы.ГруппаКнопок_НастройкиСпискаОпераций.Вид = ВидГруппыФормы.ГруппаКнопок;
	
	Элементы.ГруппаКнопок_ПоискВСпискеАгрегатов.Видимость = Ложь;
	Элементы.ГруппаКнопок_ПоискВСпискеАгрегатов82.Видимость = Истина;
	Элементы.ГруппаКнопок_НастройкаСпискаАгрегатов.Вид = ВидГруппыФормы.ГруппаКнопок;
	
	Элементы.ГруппаКнопок_ПоискВСпискеУведомленийОПриемке.Видимость = Ложь;
	Элементы.ГруппаКнопок_ПоискВСпискеУведомленийОПриемке82.Видимость = Истина;
	Элементы.ГруппаКнопок_НастройкиСпискаУведомленийОПриемке.Вид = ВидГруппыФормы.ГруппаКнопок;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьКнопкиОбменаССервисом(ОбменССервисомВыполняется)
	
	Для Каждого Кнопка Из КнопкиОбменаССервисом() Цикл
		МодульКлиента().НастроитьКнопкуОбменаССервисом(Кнопка, ОбменССервисомВыполняется);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция КнопкиОбменаССервисом()
	
	Результат = Новый Массив;
	
	Результат.Добавить(Элементы.Кнопка_ВыполнитьОбменВСпискеДокументов);
	Результат.Добавить(Элементы.Кнопка_ВыполнитьОбменВСпискеОпераций);
	Результат.Добавить(Элементы.Кнопка_ВыполнитьОбменВСпискеВходящихУПД);
	Результат.Добавить(Элементы.Кнопка_ВыполнитьОбменВСпискеУведомленийОПриемке);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура НастроитьКартинкиКомандФормы()
	
	ОрганизацияДляПроверки = МодульОбъекта().Организация_ЕдинственнаяОрганизацияДляОбмена();
	ОписаниеТарифа = МодульОбъекта().Тариф(ОрганизацияДляПроверки);
	
	Для Каждого Элемент Из СоответствиеКомандИТиповОперацийДляПодписок() Цикл
		
		Команда = Элемент.Ключ;
		ТипОперации = Элемент.Значение;
		
		Если ТипОперации = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если МодульОбъекта().СозданиеОперацииОграниченоТарифом(ТипОперации, ОписаниеТарифа) Тогда
			Команда.Картинка = Элементы.КартинкаЗамок.Картинка;
		Иначе
			Команда.Картинка = Элементы.КартинкаПустая.Картинка;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СоответствиеКомандИТиповОперацийДляПодписок()
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(Команды.НоваяОперация_ЗаказКодов,               ТипыОпераций.ЗаказКодов);
	Результат.Вставить(Команды.НоваяОперация_НаполнениеАгрегатовНаТСД, ТипыОпераций.НаполнениеАгрегатовНаТСД);
	Результат.Вставить(Команды.НоваяОперация_ВозвратВОборотНаТСД,      ТипыОпераций.ВозвратВОборотНаТСД);
	Результат.Вставить(Команды.ДобавитьВАгрегат,                       ТипыОпераций.ДобавлениеВАгрегат);
	Результат.Вставить(Команды.ИзъятьИзАгрегата,                       ТипыОпераций.ИзъятиеИзАгрегата);
	Результат.Вставить(Команды.ДобавитьВАТК,                           ТипыОпераций.ДобавлениеВАТК);
	Результат.Вставить(Команды.ИзъятьИзАТК,                            ТипыОпераций.ИзъятиеИзАТК);
	
	Результат = Новый ФиксированноеСоответствие(Результат);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьСписокДокументовУчета(ИзмененыНастройки = Ложь)
	
	ОбновитьСписокДокументовУчетаНаСервере(ИзмененыНастройки);
	
	УстановитьДатуПоследнегоОбмена();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокДокументовУчетаНаСервере(ИзмененыНастройки = Ложь)
	
	Если ЗначениеЗаполнено(КлючНазначенияИспользования)
		И Не Найти(КлючНазначенияИспользования, "Документы") Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийДокумент = Неопределено;
	ТекущийДокумент1С = Неопределено;
	ТекущаяСтрока = Элементы.СписокДокументовУчета.ТекущаяСтрока;
	Если ЗначениеЗаполнено(ТекущаяСтрока) Тогда
		ТекущийДокумент = СписокДокументовУчета.НайтиПоИдентификатору(ТекущаяСтрока).ДокументУчета;
		ТекущийДокумент1С = СписокДокументовУчета.НайтиПоИдентификатору(ТекущаяСтрока).Документ1С;
	КонецЕсли;
	
	ЗаполнитьТаблицуДокументов();
	
	ТаблицаДокументов = СписокДокументовУчета.Выгрузить();
	
	Если ТребуетсяВызватьПМ_ПриЗаполненияСпискаДокументов Тогда
		МодульОбъекта().ПМ_ОбработатьСобытие_ПриЗаполненииСпискаДокументов(ТаблицаДокументов);
	КонецЕсли;
	
	ТаблицаДокументов_УстановитьСхемуСКД(ТаблицаДокументов, ИзмененыНастройки);
	
	ВосстановитьНастройкуОтбораСКД();
	СформироватьОписаниеОтборов();
	
	ТаблицаДокументов_ПрименитьОтборы(ТаблицаДокументов);
	
	СписокДокументовУчета.Загрузить(ТаблицаДокументов);
	
	ВосстановитьПозициюНаСтрокеСпискаДокументовУчета(ТекущийДокумент, ТекущийДокумент1С);
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьПозициюНаСтрокеСпискаДокументовУчета(ТекущийДокумент, ТекущийДокумент1С)
	
	Если ЗначениеЗаполнено(ТекущийДокумент1С) Тогда
		
		СтрДок = СписокДокументовУчета.НайтиСтроки(Новый Структура("Документ1С", ТекущийДокумент1С));
		Если ЗначениеЗаполнено(СтрДок) Тогда
			Элементы.СписокДокументовУчета.ТекущаяСтрока = СтрДок[0].ПолучитьИдентификатор();
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущийДокумент) Тогда
		
		СтрДок = СписокДокументовУчета.НайтиСтроки(Новый Структура("ДокументУчета", ТекущийДокумент));
		Если ЗначениеЗаполнено(СтрДок) Тогда
			Элементы.СписокДокументовУчета.ТекущаяСтрока = СтрДок[0].ПолучитьИдентификатор();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокВходящихУПД()
	
	УстановитьПараметрыПериодаДинамическогоСписка(СписокВходящихУПД, ПериодВходящихУПД);
	
	Элементы.СписокВходящихУПД.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокОперацийАгрегатов()
	
	УстановитьПараметрыПериодаДинамическогоСписка(СписокОперацийАгрегатов, ПериодОперацийАгрегатов);
	
	Элементы.СписокОперацийАгрегатов.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокОпераций()
	
	УстановитьПараметрыПериодаДинамическогоСписка(СписокОпераций, ПериодСпискаОпераций);
	
	Элементы.СписокОпераций.Обновить();
	
	УстановитьДатуПоследнегоОбмена();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуДокументов()
	
	СписокДокументовУчета.Очистить();
	
	НастройкиДокументов = МодульОбъекта().ДействующиеНастройкиДокументовУчета();
	Если Не ЗначениеЗаполнено(НастройкиДокументов) Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	МодульОбъекта().ТаблицаДокументов_ВТ_ДобавитьОрганизации1С(МенеджерВТ);
	МодульОбъекта().ТаблицаДокументов_ВТ_ДобавитьСклады1С(МенеджерВТ);
	
	ИменаТаблицДокументов = МодульОбъекта().ТаблицаДокументов_ВТ_ИменаТаблицДокументовУчета(
	МенеджерВТ, НастройкиДокументов, ПериодДокументовУчета, Истина);
	
	ТребуемыеДействия = МодульОбъекта().Перечисление_ТребуемыеДействияДокументовУчета();
	Статусы = МодульОбъекта().Перечисление_СтатусыДокументовУчета();
	ЗавершенныеСтатусы = Новый Массив;
	ЗавершенныеСтатусы.Добавить(Статусы.Завершен);
	ЗавершенныеСтатусы.Добавить(Статусы.Пропущен);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса_ОбщаяТаблицаДокументов(ИменаТаблицДокументов);
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.УстановитьПараметр("СтатусНовый", Статусы.Новый);
	Запрос.УстановитьПараметр("ДействиеНачатьРаботу", ТребуемыеДействия.НачатьРаботу);
	Запрос.УстановитьПараметр("ЗавершенныеСтатусы", ЗавершенныеСтатусы);
	
	НомерСтроки = 0;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НомерСтроки = НомерСтроки + 1;
		Стр = СписокДокументовУчета.Добавить();
		ЗаполнитьЗначенияСвойств(Стр, Выборка);
		Стр.НомерСтроки = НомерСтроки;
	КонецЦикла;
	
	МенеджерВТ.Закрыть();
	
КонецПроцедуры

&НаСервере
Функция ТекстЗапроса_СписокВходящихУПД()
	
	Результат =
	"ВЫБРАТЬ
	|	Спр.Ссылка КАК Ссылка,
	|	Спр.ПометкаУдаления КАК ПометкаУдаления,
	|	Спр.Код КАК Код,
	|	Спр.Дата КАК Дата,
	|	Спр.ТипОперации КАК ТипОперации,
	|	Спр.Организация КАК Организация,
	|	Спр.Склад КАК Склад,
	|	Спр.ВидПродукции КАК ВидПродукции,
	|	Спр.ДокументУчета КАК ДокументУчета,
	|	Спр.ОперацияОснование КАК ОперацияОснование,
	|	Спр.Ответственный КАК Ответственный,
	|	Спр.Комментарий КАК Комментарий,
	|	Статусы.Статус КАК Статус,
	|	Статусы.ДатаСтатуса КАК ДатаИзмененияСтатуса,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(НомераДокументов.Значение, """") КАК СТРОКА(1000)) КАК НомерДокумента,
	|	ВЫРАЗИТЬ(ДатыДокументов.Значение КАК ДАТА) КАК ДатаДокумента,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(НаименованиеКонтрагентов.Значение, """") КАК СТРОКА(1000)) КАК НаименованиеКонтрагента,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ИННКонтрагентов.Значение, """") КАК СТРОКА(1000)) КАК ИНН_Контрагента,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(СодержитОшибки.Значение, ЛОЖЬ) КАК БУЛЕВО) КАК СодержитОшибки,
	|	ВЫБОР
	|		КОГДА СодержитОшибки.Значение = ИСТИНА
	|			ТОГДА 2
	|		ИНАЧЕ 5
	|	КОНЕЦ КАК НомерКартинки
	|{ВЫБРАТЬ
	|	Ссылка.*,
	|	Код,
	|	Дата,
	|	ТипОперации,
	|	Организация.*,
	|	Склад.*,
	|	ВидПродукции.*,
	|	ДокументУчета.*,
	|	ОперацияОснование.*,
	|	Ответственный.*,
	|	Комментарий,
	|	Статус,
	|	ДатаИзмененияСтатуса,
	|	НомерДокумента,
	|	ДатаДокумента,
	|	НаименованиеКонтрагента,
	|	ИНН_Контрагента,
	|	СодержитОшибки,
	|	НомерКартинки}
	|ИЗ
	|	Справочник.КонтурМаркировка_Операции КАК Спр
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_СтатусыОпераций КАК Статусы
	|		ПО Спр.Ссылка = Статусы.Операция
	|			И (Статусы.ТипСтатуса = ""ОсновнойСтатус"")}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_ДопРеквизиты КАК НомераДокументов
	|		ПО Спр.Ссылка = НомераДокументов.Объект
	|			И (НомераДокументов.ИмяРеквизита = ""НомерДокумента"")}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_ДопРеквизиты КАК ДатыДокументов
	|		ПО Спр.Ссылка = ДатыДокументов.Объект
	|			И (ДатыДокументов.ИмяРеквизита = ""ДатаДокумента"")}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_ДопРеквизиты КАК НаименованиеКонтрагентов
	|		ПО Спр.Ссылка = НаименованиеКонтрагентов.Объект
	|			И (НаименованиеКонтрагентов.ИмяРеквизита = ""КонтрагентНаименование"")}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_ДопРеквизиты КАК ИННКонтрагентов
	|		ПО Спр.Ссылка = ИННКонтрагентов.Объект
	|			И (ИННКонтрагентов.ИмяРеквизита = ""КонтрагентИНН"")}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_ДопРеквизиты КАК СодержитОшибки
	|		ПО Спр.Ссылка = СодержитОшибки.Объект
	|			И (СодержитОшибки.ИмяРеквизита = ""СодержитОшибки"")}
	|ГДЕ
	|	Спр.ТипОперации = &ВходящийУПД
	|	И ВЫРАЗИТЬ(ДатыДокументов.Значение КАК ДАТА) МЕЖДУ &ДатаНачала И &ДатаОкончания
	|{ГДЕ
	|	Спр.Ссылка.*,
	|	Спр.Код,
	|	Спр.Дата,
	|	Спр.ТипОперации,
	|	Спр.Организация.*,
	|	Спр.Склад.*,
	|	Спр.ВидПродукции.*,
	|	Спр.ДокументУчета.*,
	|	Спр.ОперацияОснование.*,
	|	Спр.Ответственный.*,
	|	Спр.Комментарий,
	|	Статусы.Статус,
	|	Статусы.ДатаСтатуса,
	|	(ВЫРАЗИТЬ(ЕСТЬNULL(НомераДокументов.Значение, """") КАК СТРОКА(1000))) КАК НомерДокумента,
	|	(ВЫРАЗИТЬ(ДатыДокументов.Значение КАК ДАТА)) КАК ДатаДокумента,
	|	(ВЫРАЗИТЬ(ЕСТЬNULL(НаименованиеКонтрагентов.Значение, """") КАК СТРОКА(1000))) КАК НаименованиеКонтрагента,
	|	(ВЫРАЗИТЬ(ЕСТЬNULL(ИННКонтрагентов.Значение, """") КАК СТРОКА(1000))) КАК ИНН_Контрагента,
	|	(ВЫРАЗИТЬ(ЕСТЬNULL(СодержитОшибки.Значение, ЛОЖЬ) КАК БУЛЕВО)) КАК СодержитОшибки}";
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ТекстЗапроса_СписокАгрегатов()
	
	Результат =
	"ВЫБРАТЬ
	|	Спр.Ссылка КАК Ссылка,
	|	Спр.Дата КАК Дата,
	|	Спр.ТипОперации КАК ТипОперации,
	|	Спр.Организация КАК Организация,
	|	Спр.Склад КАК Склад,
	|	Спр.ВидПродукции КАК ВидПродукции,
	|	Спр.ОперацияОснование КАК ОперацияОснование,
	|	Спр.ДокументУчета КАК ДокументУчета,
	|	Статусы.Статус КАК Статус,
	|	Статусы.ДатаСтатуса КАК ДатаИзмененияСтатуса,
	|	Спр.Комментарий КАК Комментарий,
	|	Спр.Ответственный КАК Ответственный
	|{ВЫБРАТЬ
	|	Ссылка.*,
	|	Дата,
	|	ТипОперации,
	|	Организация.*,
	|	Склад.*,
	|	ВидПродукции.*,
	|	ОперацияОснование.*,
	|	ДокументУчета.*,
	|	Статус,
	|	ДатаИзмененияСтатуса,
	|	Комментарий,
	|	Ответственный.*}
	|ИЗ
	|	Справочник.КонтурМаркировка_Операции КАК Спр
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_СтатусыОпераций КАК Статусы
	|		ПО Спр.Ссылка = Статусы.Операция
	|			И (Статусы.ТипСтатуса = ""ОсновнойСтатус"")}
	|ГДЕ
	|	Спр.ТипОперации В(&ПодходящиеТипы)
	|	И Спр.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|{ГДЕ
	|	Спр.Ссылка.*,
	|	Спр.Дата,
	|	Спр.ТипОперации,
	|	Спр.Организация.*,
	|	Спр.Склад.*,
	|	Спр.ВидПродукции.*,
	|	Спр.ОперацияОснование.*,
	|	Спр.ДокументУчета.*,
	|	Статусы.Статус,
	|	Статусы.ДатаСтатуса,
	|	Спр.Комментарий,
	|	Спр.Ответственный.*}";
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ТекстЗапроса_СписокОпераций()
	
	Результат =
	"ВЫБРАТЬ
	|	Операции.Ссылка КАК Ссылка,
	|	Операции.Код КАК Номер,
	|	Операции.Дата КАК Дата,
	|	Операции.ТипОперации КАК ТипОперации,
	|	Операции.Организация КАК Организация,
	|	Операции.Склад КАК Склад,
	|	Операции.ДокументУчета КАК ДокументУчета,
	|	Операции.ОперацияОснование КАК ОперацияОснование,
	|	Операции.Комментарий КАК Комментарий,
	|	Статусы.Статус КАК Статус,
	|	ВЫБОР
	|		КОГДА Статусы.Статус ЕСТЬ NULL
	|				ИЛИ Статусы.Статус = &Новый
	|			ТОГДА 0
	|		КОГДА Статусы.Статус = &ОшибкаОбработки
	|				ИЛИ Статусы.Статус = &ОшибкаЗаполнения
	|				ИЛИ Статусы.Статус = &ОшибкаОтменыОперации
	|			ТОГДА 2
	|		КОГДА Статусы.Статус = &ОперацияОтменена
	|				ИЛИ Статусы.Статус = &ОперацияЗавершена
	|			ТОГДА 4
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК ИндексКартинки,
	|	ОчередьОбмена.ТребуемоеДействие КАК ТребуемоеДействие,
	|	ОчередьОбмена.ИдентификаторДокумента КАК ИдентификаторВСервисе,
	|	ЕСТЬNULL(НастройкиДокументов.Наименование, """") КАК ТипДокумента
	|{ВЫБРАТЬ
	|	Ссылка.*,
	|	Дата,
	|	Номер,
	|	ТипОперации,
	|	Организация.*,
	|	Склад.*,
	|	ОперацияОснование.*,
	|	ДокументУчета.*,
	|	Статус,
	|	Комментарий,
	|	ИндексКартинки,
	|	ТребуемоеДействие,
	|	ИдентификаторВСервисе}
	|ИЗ
	|	Справочник.КонтурМаркировка_Операции КАК Операции
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_СтатусыОпераций КАК Статусы
	|		ПО Операции.Ссылка = Статусы.Операция
	|			И (Статусы.ТипСтатуса = ""ОсновнойСтатус"")}
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_ОчередьОбмена КАК ОчередьОбмена
	|		ПО Операции.Ссылка = ОчередьОбмена.Операция
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтурМаркировка_ДокументыУчета КАК ДокументыУчета
	|		ПО Операции.ДокументУчета = ДокументыУчета.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтурМаркировка_ДопСправочники.ДопРеквизиты КАК НастройкиТиповДокументов
	|		ПО (ДокументыУчета.ТипДокумента = НастройкиТиповДокументов.Значение)
	|			И (НастройкиТиповДокументов.ИмяРеквизита = ""ТипДокумента"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтурМаркировка_ДопСправочники КАК НастройкиДокументов
	|		ПО (НастройкиТиповДокументов.Ссылка = НастройкиДокументов.Ссылка)
	|ГДЕ
	|	Операции.ТипОперации В(&ПодходящиеТипы)
	|	И Операции.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ЕСТЬNULL(НастройкиДокументов.ИмяСправочника, """") В ("""", ""НастройкиДокументаУчета"")
	|{ГДЕ
	|	Операции.Ссылка.*,
	|	Операции.Дата,
	|	Операции.Код КАК Номер,
	|	Операции.ТипОперации,
	|	Операции.Организация.*,
	|	Операции.Склад.*,
	|	Операции.ОперацияОснование.*,
	|	Операции.ДокументУчета.*,
	|	Операции.Комментарий,
	|	Статусы.Статус,
	|	ОчередьОбмена.ТребуемоеДействие,
	|	ОчередьОбмена.ИдентификаторДокумента КАК ИдентификаторВСервисе,
	|	(ЕСТЬNULL(НастройкиДокументов.Наименование, """")) КАК ТипДокумента}";
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ТекстЗапроса_ОбщаяТаблицаДокументов(ИменаТаблицДокументов)
	
	Результат = "";
	Разделитель = "";
	ТекстЗапроса = "";
	ПерваяНастройка = Истина;
	
	Для Каждого ИмяТаблицы Из ИменаТаблицДокументов Цикл
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ТабДок.Организация КАК Организация,
		|	ТабДок.Документ1С КАК Документ1С,
		|	ТабДок.ДокументУчета КАК ДокументУчета,
		|	ТабДок.Номер КАК Номер,
		|	ТабДок.Дата КАК Дата,
		|	ТабДок.Склад КАК Склад,
		|	ТабДок.Контрагент КАК Контрагент,
		|	ТабДок.Сумма КАК Сумма,
		|	ТабДок.ТипДокумента КАК ТипДокумента,
		|	ТабДок.Комментарий КАК Комментарий,
		|	ЕСТЬNULL(ОсновныеСтатусы.Статус, &СтатусНовый) КАК Статус,
		|	ЕСТЬNULL(ТребуемыеДействия.Статус, &ДействиеНачатьРаботу) КАК ТребуемоеДействие,
		|	ТабДок.ТипПоследнейОперации КАК ТипПоследнейОперации,
		|	ТабДок.СтатусПоследнейОперации КАК СтатусПоследнейОперации,
		|	ВЫБОР
		|		КОГДА ОсновныеСтатусы.Статус В (&ЗавершенныеСтатусы)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК РаботаЗавершена,
		|	ТабДок.ДопКолонка1 КАК ДопКолонка1,
		|	ТабДок.ДопКолонка2 КАК ДопКолонка2,
		|	ТабДок.ДопКолонка3 КАК ДопКолонка3
		|ИЗ
		|	ТекущаяТаблица КАК ТабДок
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_СтатусыДокументовУчета КАК ОсновныеСтатусы
		|		ПО (ОсновныеСтатусы.ДокументУчета = ТабДок.ДокументУчета)
		|			И (ОсновныеСтатусы.ТипСтатуса = ""ОсновнойСтатус"")
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_СтатусыДокументовУчета КАК ТребуемыеДействия
		|		ПО (ТребуемыеДействия.ДокументУчета = ТабДок.ДокументУчета)
		|			И (ТребуемыеДействия.ТипСтатуса = ""ТребуемоеДействие"")";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТекущаяТаблица", ИмяТаблицы);
		
		Если ПерваяНастройка Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВЫБРАТЬ", "ВЫБРАТЬ РАЗРЕШЕННЫЕ");
		КонецЕсли;
		
		ПерваяНастройка = Ложь;
		
		Результат = Результат + Разделитель + ТекстЗапроса;
		
		Разделитель = "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|";
		
	КонецЦикла;
	
	Результат = Результат + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ,
	|	Номер УБЫВ";
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура УстановитьОтборПоказатьЗавершенныеСпискаДокументовУчета()
	
	Если Элементы.Кнопка_ПоказатьЗавершенныеДокументы.Пометка Тогда
		Элементы.СписокДокументовУчета.ОтборСтрок = Неопределено;
	Иначе
		Элементы.СписокДокументовУчета.ОтборСтрок = Новый ФиксированнаяСтруктура("РаботаЗавершена", Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПараметрыПериодаДинамическогоСписка(Список, Период)
	
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала", Период.ДатаНачала);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", Период.ДатаОкончания);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьПустыеЗначенияПериода(Период)
	
	Если Не ЗначениеЗаполнено(Период.ДатаНачала)
		И Не ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		
		Период.Вариант = ВариантСтандартногоПериода.ЭтаНеделя;
		
	ИначеЕсли Не ЗначениеЗаполнено(Период.ДатаНачала) Тогда
		
		Период.ДатаНачала = НачалоНедели(Период.ДатаОкончания);
		
	ИначеЕсли Не ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		
		Период.ДатаОкончания = КонецНедели(Период.ДатаНачала);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовУчета_Период(Команда)
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
	"ПослеВыбораПериодаСпискаДокументовУчета", ЭтаФорма);
	МодульКлиента().ПоказатьДиалогРедактированияСтандартногоПериода(ОписаниеОбработчика, ПериодДокументовУчета);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПериодаСпискаДокументовУчета(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПериодДокументовУчета = Результат;
	
	ЗаполнитьПустыеЗначенияПериода(ПериодДокументовУчета);
	
	УстановитьЗаголовокПериодаСписка(Элементы.Кнопка_ПериодСпискаДокументов, ПериодДокументовУчета);
	
	ОбновитьСписокДокументовУчета();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВходящихУПД_Период(Команда)
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
	"ПослеВыбораПериодаСпискаВходящихУПД", ЭтаФорма);
	МодульКлиента().ПоказатьДиалогРедактированияСтандартногоПериода(ОписаниеОбработчика, ПериодВходящихУПД);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПериодаСпискаВходящихУПД(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПериодВходящихУПД = Результат;
	
	ЗаполнитьПустыеЗначенияПериода(ПериодВходящихУПД);
	
	УстановитьЗаголовокПериодаСписка(Элементы.Кнопка_ПериодСпискаВходящихУПД, ПериодВходящихУПД);
	
	ОбновитьСписокВходящихУПД();
	
КонецПроцедуры

&НаКлиенте
Процедура ОперацииАгрегатов_Период(Команда)
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
	"ПослеВыбораПериодаСпискаОперацииАгрегатов", ЭтаФорма);
	МодульКлиента().ПоказатьДиалогРедактированияСтандартногоПериода(ОписаниеОбработчика, ПериодОперацийАгрегатов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПериодаСпискаОперацииАгрегатов(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПериодОперацийАгрегатов = Результат;
	
	ЗаполнитьПустыеЗначенияПериода(ПериодОперацийАгрегатов);
	
	УстановитьЗаголовокПериодаСписка(Элементы.Кнопка_ПериодОперацийАгрегатов, ПериодОперацийАгрегатов);
	
	ОбновитьСписокОперацийАгрегатов();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОпераций_Период(Команда)
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
	"ПослеВыбораПериодаСпискаОпераций", ЭтаФорма);
	МодульКлиента().ПоказатьДиалогРедактированияСтандартногоПериода(ОписаниеОбработчика, ПериодСпискаОпераций);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПериодаСпискаОпераций(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПериодСпискаОпераций = Результат;
	
	ЗаполнитьПустыеЗначенияПериода(ПериодСпискаОпераций);
	
	УстановитьЗаголовокПериодаСписка(Элементы.Кнопка_ПериодСпискаОпераций, ПериодСпискаОпераций);
	
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовУчета_Обновить(Команда)
	
	ОбновитьСписокДокументовУчета();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовУчета_ПоказатьЗавершенные(Команда)
	
	Элемент = Элементы.Кнопка_ПоказатьЗавершенныеДокументы;
	
	Элемент.Пометка = Не Элемент.Пометка;
	
	УстановитьОтборПоказатьЗавершенныеСпискаДокументовУчета();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовУчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СписокДокументовУчета.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не МодульКлиента().ПроверитьУстановленнуюВерсиюМодуля() Тогда
		Возврат;
	КонецЕсли;
	
	Действие = МодульКлиента().Перечисление_ДействияМетрики().Замер_ОткрытиеФормыДокументаУчета;
	МодульКлиента().НачатьЗамерПроизводительности(Действие);
	
	ДокументУчета = ТекущиеДанные.ДокументУчета;
	Если Не ЗначениеЗаполнено(ДокументУчета) Тогда
		ДокументУчета = МодульКлиента().ДокументУчета_НайтиИлиСоздать(ТекущиеДанные.Документ1С, ЭтаФорма);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументУчета) Тогда
		МодульКлиента().ОткрытьФормуДокументаУчета(ДокументУчета, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВходящихУПДПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		МодульКлиента().ОткрытьФормуОперации(ТекущиеДанные.Ссылка, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВходящихУПДВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		МодульКлиента().ОткрытьФормуОперации(ТекущиеДанные.Ссылка, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокТоваров(Команда)
	
	МодульКлиента().ОткрытьФормуОбработки("Форма_Товары_Список", ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокОрганизаций(Команда)
	
	МодульКлиента().ОткрытьФормуОбработки("Форма_Организации_Список", ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокСкладов(Команда)
	
	МодульКлиента().ОткрытьФормуОбработки("Форма_Склады_Список", ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокПлощадок(Команда)
	
	МодульКлиента().ОткрытьФормуОбработки("Форма_Площадки_Список", ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокМобильныхУстройств(Команда)
	
	МодульКлиента().ОткрытьФормуОбработки("Форма_МобильныеУстройства_Список", ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокКоэффициентыПересчета(Команда)
	
	МодульКлиента().ОткрытьФормуСпискаКоэффициентовПересчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурМаркировка_ДокументУчета_Изменен"
		Или ИмяСобытия = "КонтурМаркировка_ДокументУчета_Удален" 
		Или ИмяСобытия = "КонтурМаркировка_ДокументУчета_Перезаполнен" Тогда
		
		ОбновитьСписокДокументовУчета();
		
	КонецЕсли;
		
	Если ИмяСобытия = "КонтурМаркировка_Операция_Изменен" Тогда
		
		Элементы.СписокОперацийАгрегатов.Обновить();
		ОбновитьСписокОпераций();
		ОбновитьСписокУведомленийОПриемке();
		
	КонецЕсли;
		
	Если ИмяСобытия = "КонтурМаркировка_НастройкиМодуля_Загружены" Тогда
		
		ОбновитьКэш = Истина;
		МодульКлиента().НастройкиМодуля(ОбновитьКэш);
		
	КонецЕсли;
	
	Если ИмяСобытия = "КонтурМаркировка_НастройкиМодуля_Обновлены" И Источник <> ЭтаФорма Тогда
		
		УстановитьЗаголовок();
		СписокДокументовУчета_СформироватьДополнительныеКолонки();
		СформироватьДополнительныеКнопки();
		
		ОбновленыНастройки = Истина;
		ОбновитьСписокДокументовУчета(ОбновленыНастройки);
		
	КонецЕсли;
	
	Если ИмяСобытия = "КонтурМаркировка_ИстекаетСрокДействияСертификата" Тогда
		
		ДобавитьУведомление(МодульКлиента().Перечисление_ТипыУведомлений().ИстекаетСрокДействияСертификата);
		
	КонецЕсли;
	
	Если ИмяСобытия = "КонтурМаркировка_ИзмененРежимТехническогоСпециалиста" Тогда
		НастроитьВидимостьПодменюТехническогоСпециалиста(Параметр);
	КонецЕсли;
	
	Если ИмяСобытия = "КонтурМаркировка_ПринудительноЗакрытьМодуль" Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбменССервисом(Команда)
	
	ВыполнитьОбменПоВсемОрганизациям();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбменПоВсемОрганизациям()
	
	Если Не МодульКлиента().ПроверитьУстановленнуюВерсиюМодуля() Тогда
		Возврат;
	КонецЕсли;
	
	МодульКлиента().ЗапуститьОбменПоВсемОрганизациям(ЭтаФорма);
	
	ОбновитьСтатусОбменаССервисом();

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбменУПДУведомления(Команда)
	
	ВыполнитьОбменПоВсемОрганизациям();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКонтекстПослеВыполненияОбмена()
	
	ОбновитьСписокДокументовУчетаНаСервере();
	ПроверитьЗаполнениеАнкеты();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиМодуля(Команда)
	
	МодульКлиента().ОткрытьФормуНастроекМодуля(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПодписания(Команда)
	
	МодульКлиента().ОткрытьФормуСпискаНастроекПодписания(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОставитьПожелание(Команда)
	
	ОписаниеОпроса = ОпросПользователя_ОбщаяОценка();
	МодульКлиента().ОткрытьФормуОпросаПользователя(ОписаниеОпроса, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ОпросПользователя_ОбщаяОценка()
	
	КлючиСценариев = МодульОбъекта().Перечисление_КлючиСценариевДляОпросов();
	
	Результат = МодульОбъекта().Новый_ОпросПользователя();
	Результат.КлючСценария = КлючиСценариев.ОбщаяОценка;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьТелеграмКанал(Команда)
	
	МодульКлиента().ОткрытьТелеграмКанал();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнформацияДляТехПоддержки(Команда)
	
	МодульКлиента().ОткрытьФормуОбработки("Форма_ИнформацияДляТехПоддержки", ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКонтурДоступ(Команда)
	
	МодульКлиента().ОткрытьКонтурДоступ();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКонфигуратор(Команда)
	
	МодульКлиента().ОткрытьКонфигуратор();
	
КонецПроцедуры

&НаКлиенте
Процедура РежимТехническогоСпециалиста(Команда)
	
	ВключенРежимТехническогоСпециалиста = МодульКлиента().ВключенРежимТехническогоСпециалиста();
	Если ВключенРежимТехническогоСпециалиста Тогда
		МодульКлиента().ОтключитьРежимТехническогоСпециалиста();
	Иначе
		МодульКлиента().ВключитьРежимТехническогоСпециалиста(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуАдминистратора(Команда)
	
	МодульКлиента().ОткрытьФормуАдминистратораМаркировки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактораДокументаУчета(Команда)
	
	ДокументУчета = Неопределено;
	
	Если Элементы.Закладки.ТекущаяСтраница = Элементы.ЗакладкаДокументыУчета Тогда
		
		ТекущиеДанные = Элементы.СписокДокументовУчета.ТекущиеДанные;
		
		Если ТекущиеДанные <> Неопределено Тогда
			ДокументУчета = ТекущиеДанные.ДокументУчета;
		КонецЕсли;
		
	КонецЕсли;
	
	МодульКлиента().ОткрытьФормуРедактораДокументаУчета(ДокументУчета);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактораОперации(Команда)
	
	Операция = Неопределено;
	
	Если Элементы.Закладки.ТекущаяСтраница = Элементы.ЗакладкаОперации Тогда
		
		ТекущиеДанные = Элементы.СписокОпераций.ТекущиеДанные;
		
		Если ТекущиеДанные <> Неопределено Тогда
			Операция = ТекущиеДанные.Ссылка;
		КонецЕсли;
		
	КонецЕсли;
	
	МодульКлиента().ОткрытьФормуРедактораОперации(Операция);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедакторКода(Команда)
	
	МодульКлиента().ОткрытьФормуРедактораКодаМаркировки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКонтурДиагностику(Команда)
	
	МодульКлиента().ОткрытьКонтурДиагностику();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКонтурСправку(Команда)
	
	МодульКлиента().ОткрытьКонтурСправку();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтартовыйПомощник(Команда)
	
	МодульКлиента().ОткрытьФормуСтартовогоПомощника(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокВидовАгрегатов(Команда)
	
	МодульКлиента().ОткрытьФормуОбработки("Форма_ВидыАгрегатов_Список", ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокАгрегатовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекСтрока = Элементы.СписокАгрегатов.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АгрегатСсылка = ТекСтрока.Ссылка;
	
	МодульКлиента().ОткрытьФормуАгрегата(АгрегатСсылка, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнформацияОКоде(Команда)
	
	МодульКлиента().ОткрытьФормуОбработки("Форма_ИнформацияОКоде", ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокШаблоновЭтикеток(Команда)
	
	МодульКлиента().ОткрытьФормуОбработки("Форма_ШаблоныЭтикеток_Список", ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОперацийАгрегатовПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		МодульКлиента().ОткрытьФормуОперации(ТекущиеДанные.Ссылка, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОперацийАгрегатовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		МодульКлиента().ОткрытьФормуОперации(ТекущиеДанные.Ссылка, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Агрегаты_Найти(Команда)
	
	Если Не ЗначениеЗаполнено(КодАгрегата) Тогда
		Возврат;
	КонецЕсли;
	
	КлючКодаАгрегата = МодульКлиента().КодМаркировки_НайтиКлюч(КодАгрегата);
	Если ЗначениеЗаполнено(КлючКодаАгрегата) Тогда
		МодульКлиента().ОткрытьФормуКодаМаркировки(КлючКодаАгрегата, , ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Документы_СортироватьПоВозрастанию(Команда)
	
	Направление = "Возр";
	Документы_СортироватьНаСервере(Направление);
	
КонецПроцедуры

&НаКлиенте
Процедура Документы_СортироватьПоУбыванию(Команда)
	
	Направление = "Убыв";
	Документы_СортироватьНаСервере(Направление);
	
КонецПроцедуры

&НаСервере
Процедура Документы_СортироватьНаСервере(Направление)
	
	Если Не ЗначениеЗаполнено(СписокДокументовУчета) Тогда
		Возврат;
	КонецЕсли;
	
	Элемент = Элементы.СписокДокументовУчета.ТекущийЭлемент;
	Если Элемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Элемент.ПутьКДанным) Тогда
		ИмяКолонки = СтрЗаменить(Элемент.ПутьКДанным, "СписокДокументовУчета.", "");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИмяКолонки) Тогда
		ИмяКолонки = СтрЗаменить(Элемент.Имя, "СписокДокументовУчета", "");
	КонецЕсли;
	
	СписокДокументовУчета.Сортировать(ИмяКолонки + " " + Направление, Новый СравнениеЗначений);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокНоменклатуры1С(Команда)
	
	МодульКлиента().ОткрытьФормуОбработки("Форма_Номенклатура1С_Список", ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокСервисПровайдеров(Команда)
	
	МодульКлиента().ОткрытьФормуОбработки("Форма_СервисПровайдеры_Список", ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура  ЗаполнитьСписокВыбора(СписокВыбора, НовыеЗначения)
	
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, НовыеЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПоследнегоОбменаНажатие(Элемент)
	
	МодульКлиента().СброситьКэш();
	
	УстановитьЗаголовок();
	УстановитьДатуПоследнегоОбмена();
	
КонецПроцедуры

// #Область ОтборыСпискаДокументов

&НаКлиенте
Процедура СписокДокументов_ОткрытьОтборы(Команда)
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПрименитьОтборСпискаДокументов", ЭтаФорма);
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("ТекущийОтборСпискаДокументов", ТекущийОтборСпискаДокументов);
	ПараметрыОтбора.Вставить("АдресСхемыСКД", АдресСхемыСКД);
	МодульКлиента().ОткрытьФормуОтбораСпискаДокументов(ЭтаФорма, ПараметрыОтбора, ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументов_ОчиститьОтборы(Команда)
	
	СписокДокументов_ОчиститьОтборыНаСервере();
	ОбновитьСписокДокументовУчета();
	
КонецПроцедуры

&НаСервере
Процедура СписокДокументов_ОчиститьОтборыНаСервере()
	
	ТекущийОтборСпискаДокументов = "";
	СохранитьДействующийОтборСпискаДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьОтборСпискаДокументов(НаименованиеОтбора, ДопПараметры = Неопределено) Экспорт
	
	Если НаименованиеОтбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьКомандыМенюОтборов();
	
	ДействующийОтбор = ДействующийОтборСпискаДокументов();
	
	Если ДействующийОтбор = ""
		И Не ЗначениеЗаполнено(НаименованиеОтбора) Тогда
		НаименованиеОтбора = "";
	КонецЕсли;
	
	ТекущийОтборСпискаДокументов = НаименованиеОтбора;
	СохранитьДействующийОтборСпискаДокументов();
	ОбновитьСписокДокументовУчета();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьДействующийОтборСпискаДокументов()
	
	МодульОбъекта().СохранитьДействующийОтборСпискаДокументов(ТекущийОтборСпискаДокументов);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОписаниеОтборов()
	
	Если Элементы.Закладки.ТекущаяСтраница = Элементы.ЗакладкаДокументыУчета Тогда
		
		СлужебныеОтборы = МодульОбъекта().Перечисление_СлужебныеОтборы();
		Если ТекущийОтборСпискаДокументов = СлужебныеОтборы.ОтборБезНазвания Тогда
			ОписаниеНастроекОтбора = Строка(КомпоновщикНастроек.ПолучитьНастройки().Отбор);
		Иначе
			ОписаниеНастроекОтбора = ТекущийОтборСпискаДокументов;
		КонецЕсли;
		
	Иначе
		
		Если Элементы.Закладки.ТекущаяСтраница = Элементы.ЗакладкаОперации Тогда
			ДинамическийСписок = СписокОпераций;
		ИначеЕсли Элементы.Закладки.ТекущаяСтраница = Элементы.ЗакладкаПриемкаУПД Тогда
			ДинамическийСписок = СписокВходящихУПД;
		ИначеЕсли Элементы.Закладки.ТекущаяСтраница = Элементы.ЗакладкаУведомленияОПриемке Тогда
			ДинамическийСписок = СписокУведомленийОПриемке;
		ИначеЕсли Элементы.Закладки.ТекущаяСтраница = Элементы.ЗакладкаТранспортныеУпаковки Тогда
			ДинамическийСписок = СписокОперацийАгрегатов;
		КонецЕсли;
		
		Если МодульОбъекта().ВерсияПлатформыНиже("8.3") Тогда
			ОписаниеНастроекОтбора = Строка(ДинамическийСписок.Отбор);
		Иначе
			ОписаниеНастроекОтбора = Строка(ДинамическийСписок.КомпоновщикНастроек.ПолучитьНастройки().Отбор);
		КонецЕсли;
		
	КонецЕсли;
	
	ОписаниеУсловий = "";
	Если ЗначениеЗаполнено(ОписаниеНастроекОтбора) Тогда
		ВидимостьОписания = Истина;
		Текст = НСтр("ru = 'Отбор: %1'");
		ОписаниеУсловий = МодульОбъекта().ПараметрыВСтроку(Текст, ОписаниеНастроекОтбора);
	КонецЕсли;
	
	ЭтаФорма.Элементы.УсловияОтбора.Заголовок = ОписаниеУсловий;
	
КонецПроцедуры

&НаСервере
Процедура ТаблицаДокументов_ПрименитьОтборы(ТаблицаДокументов)
	
	Если Не ЗначениеЗаполнено(ТекущийОтборСпискаДокументов) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТаблицаДокументов) Тогда
		Возврат;
	КонецЕсли;
	
	СхемаСКД = ПолучитьИзВременногоХранилища(АдресСхемыСКД);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	Макет = КомпоновщикМакета.Выполнить(СхемаСКД,
								КомпоновщикНастроек.ПолучитьНастройки(),,,
								Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ИсточникДанных = Новый Структура("ТаблицаДанных", ТаблицаДокументов);
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(Макет, ИсточникДанных);
	
	ПодходящиеСтроки = Новый ТаблицаЗначений;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ПодходящиеСтроки);
	процессорВывода.Вывести(ПроцессорКомпоновки);
	
	УдаляемыеСтроки = Новый Массив;
	
	Для Каждого Стр Из ТаблицаДокументов Цикл
		УдаляемыеСтроки.Добавить(Стр.НомерСтроки - 1);
	КонецЦикла;
	
	Для Сч = -(ПодходящиеСтроки.Количество() - 1) По 0 Цикл
		УдаляемыеСтроки.Удалить(ПодходящиеСтроки[-Сч].НомерСтроки - 1);
	КонецЦикла;
	
	Для Сч = -УдаляемыеСтроки.ВГраница() По 0 Цикл
		ТаблицаДокументов.Удалить(УдаляемыеСтроки[-Сч]);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ТаблицаДокументов_УстановитьСхемуСКД(ТаблицаДокументов, ИзмененыНастройки = Ложь)
	
	Если ЗначениеЗаполнено(АдресСхемыСКД) Тогда
		
		Если ИзмененыНастройки Тогда
			ПоместитьВоВременноеХранилище(ТаблицаДокументов_СформироватьСКД(ТаблицаДокументов), АдресСхемыСКД);
			КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыСКД));
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	СхемаСКД = ТаблицаДокументов_СформироватьСКД(ТаблицаДокументов);
	АдресСхемыСКД = ПоместитьВоВременноеХранилище(СхемаСКД, УникальныйИдентификатор);
	
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыСКД));
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаСКД.НастройкиПоУмолчанию);
	
КонецПроцедуры

&НаСервере
Функция ТаблицаДокументов_СформироватьСКД(ТаблицаДокументов)
	
	Результат = МодульОбъекта().ПолучитьМакет("МакетОтбораДокументыУчета");
	
	Настройки = Результат.НастройкиПоУмолчанию;
	НаборДанных = Результат.НаборыДанных.Найти("НаборДанных1");
	ПоляНабора = НаборДанных.Поля;
	ПоляНабора.Очистить();
	
	ТаблицаДокументов_УстановитьОтборыКолонок(ТаблицаДокументов, ПоляНабора, Результат);
	ТаблицаДокументов_УстановитьОтборыДопКолонок(ПоляНабора, Результат);
	ТаблицаОтборов_ДобавитьПоле_НомерСтроки(Настройки, ПоляНабора);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ТаблицаДокументов_УстановитьОтборыКолонок(ТаблицаДокументов, ПоляНабора, МакетОтбора)
	
	Для Каждого Колонка Из ТаблицаДокументов.Колонки Цикл
		
		ИмяКолонки = Колонка.Имя;
		
		Если Найти(ИмяКолонки, "ДопКолонка") > 0
			Или ИмяКолонки = "НомерСтроки"
			Или ИмяКолонки = "Дата" Тогда
			Продолжить;
		КонецЕсли;
		
		ПолеНабора = ПоляНабора.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		ПолеНабора.Поле = ИмяКолонки;
		ПолеНабора.ПутьКДанным = ИмяКолонки;
		ПолеНабора.Заголовок = Колонка.Заголовок;
		ПолеНабора.ТипЗначения = Колонка.ТипЗначения;
		
		Список = Новый СписокЗначений;
		
		Если ИмяКолонки = "ТипДокумента" Тогда
			
			ВсеНастройкиДокументов = МодульОбъекта().НастройкиДокументовУчета_ВсеЭлементы();
			
			Для Каждого НастройкаДокумента Из ВсеНастройкиДокументов Цикл
				Список.Добавить(НастройкаДокумента);
			КонецЦикла;
			
			Список.СортироватьПоПредставлению();
			ПолеНабора.УстановитьДоступныеЗначения(Список);
			
		ИначеЕсли ИмяКолонки = "Статус" Тогда
			
			ЗаполнитьСписокВыбора(Список, МодульОбъекта().Перечисление_СтатусыДокументовУчета());
			ПолеНабора.УстановитьДоступныеЗначения(Список);
			
		ИначеЕсли ИмяКолонки = "ТребуемоеДействие" Тогда
			
			ЗаполнитьСписокВыбора(Список, МодульОбъекта().Перечисление_ТребуемыеДействияДокументовУчета());
			ПолеНабора.УстановитьДоступныеЗначения(Список);
			
		ИначеЕсли ИмяКолонки = "ТипПоследнейОперации" Тогда
			
			ЗаполнитьСписокВыбора(Список, МодульОбъекта().Перечисление_ТипыОпераций());
			ПолеНабора.УстановитьДоступныеЗначения(Список);
			
		ИначеЕсли ИмяКолонки = "СтатусПоследнейОперации" Тогда
			
			ЗаполнитьСписокВыбора(Список, МодульОбъекта().Перечисление_СтатусыОпераций());
			ПолеНабора.УстановитьДоступныеЗначения(Список);
			
		ИначеЕсли ИмяКолонки = "Документ1С" Тогда
			
			ПолеНабора.Заголовок = "Документ 1С";
			
		КонецЕсли;
		
		ТаблицаДокументов_ДобавитьЭлементОтбора(ИмяКолонки, МакетОтбора);
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ТаблицаДокументов_УстановитьОтборыДопКолонок(ПоляНабора, МакетОтбора)
	
	НастройкиДопКолонок = МодульОбъекта().НастройкиДополнительныхКолонокСпискаДокументов();
	
	Для Каждого Настройка Из НастройкиДопКолонок Цикл
		
		Если Не МодульОбъекта().СтрокаНачинаетсяС(Настройка.Ключ, "ДопКолонка")
			Или Не Настройка.Значение.Видимость Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяКолонки = Настройка.Ключ;
		
		ПолеНабора = ПоляНабора.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		ПолеНабора.Поле = ИмяКолонки;
		ПолеНабора.ПутьКДанным = ИмяКолонки;
		ПолеНабора.Заголовок = Настройка.Значение.Заголовок;
		ПолеНабора.ТипЗначения = Новый ОписаниеТипов(Настройка.Значение.ТипКолонки);
		
		ТаблицаДокументов_ДобавитьЭлементОтбора(ИмяКолонки, МакетОтбора);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ТаблицаОтборов_ДобавитьПоле_НомерСтроки(Настройки, ПоляНабора)
	
	НовПоле = ПоляНабора.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НовПоле.Поле 		= "НомерСтроки";
	НовПоле.ПутьКДанным	= "НомерСтроки";
	НовПоле.Заголовок	= "НомерСтроки";
	НовПоле.ТипЗначения	= Новый ОписаниеТипов("Число");
	
	ГруппировкаСтрока 				= Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ГруппировкаСтрока.Использование = Истина;
	
	ПолеСтрока = ГруппировкаСтрока.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	ПолеСтрока.Использование = Истина;
	ПолеСтрока.Поле = Новый ПолеКомпоновкиДанных("НомерСтроки");
	
	ВыбранныеПоляДляСтроки = ГруппировкаСтрока.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	ВыбранныеПоляДляСтроки.Использование = Истина;
	
	ПорядокДляСтроки = ГруппировкаСтрока.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
	ПорядокДляСтроки.Использование = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ТаблицаДокументов_ДобавитьЭлементОтбора(ИмяКолонки, МакетОтбора)
	
	ЭлементОтбора = МакетОтбора.НастройкиПоУмолчанию.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения  = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяКолонки);
	ЭлементОтбора.Использование = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьКомандыМенюОтборов()
	
	Действие = "СписокДокументов_УстановитьПользовательскийОтбор";
	ГруппаКнопок = Элементы.ГруппаКнопок_ПользовательскиеОтборыСпискаДокументов;
	
	СохраненныеОтборы = МодульОбъекта().СписокСохраненныхОтборовБезСлужебных();
	
	Для Сч = 0 По МодульОбъекта().МаксимальноеКоличествоСохраненныхОтборов() - 1 Цикл
		
		ИмяКнопки =МодульОбъекта().ПараметрыВСтроку(НСтр("ru = 'СохраненныйОтбор_%1'"), Сч);
		
		КомандаКнопки = Команды.Найти(ИмяКнопки);
		Кнопка = Элементы.Найти(ИмяКнопки);
		
		Если КомандаКнопки = Неопределено Тогда
			
			КомандаКнопки = Команды.Добавить(ИмяКнопки);
			КомандаКнопки.Действие = Действие;
			
			Кнопка = Элементы.Добавить(ИмяКнопки, Тип("КнопкаФормы"), ГруппаКнопок);
			Кнопка.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
			Кнопка.ИмяКоманды = ИмяКнопки;
			
		КонецЕсли;
		
		Кнопка.Видимость = Ложь;
		
		Если СохраненныеОтборы.Количество() > Сч Тогда
			СохраненныйОтбор = СохраненныеОтборы[Сч];
			КомандаКнопки.Заголовок = СохраненныйОтбор.Значение;
			Кнопка.Видимость = Истина
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументов_УстановитьПользовательскийОтбор(Команда)
	
	ПрименитьОтборСпискаДокументов(ЗаголовокКоманды(Команда.Имя));
	
КонецПроцедуры

&НаСервере
Функция ЗаголовокКоманды(ИмяКоманды)
	
	Команда = Команды.Найти(ИмяКоманды);
	
	Возврат Команда.Заголовок;
	
КонецФункции

&НаСервере
Процедура ВосстановитьНастройкуОтбораСКД()
	
	Если Не ЗначениеЗаполнено(ТекущийОтборСпискаДокументов) Тогда
		ТекущийОтборСпискаДокументов = ДействующийОтборСпискаДокументов();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущийОтборСпискаДокументов) Тогда
		МодульОбъекта().ВосстановитьНастройкуОтбораСКД(ТекущийОтборСпискаДокументов, КомпоновщикНастроек)
	Иначе
		СхемаСКД = ПолучитьИзВременногоХранилища(АдресСхемыСКД);
		КомпоновщикНастроек.ЗагрузитьНастройки(СхемаСКД.НастройкиПоУмолчанию);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДействующийОтборСпискаДокументов()
	
	Возврат МодульОбъекта().ДействующийОтборСпискаДокументов();

КонецФункции

// #КонецОбласти //ОтборыСпискаДокументов

// Дополнительные кнопки

&НаСервере
Процедура СформироватьДополнительныеКнопки()
	
	РазмещенияКнопок = МодульОбъекта().Перечисление_РазмещениеДополнительныхКнопок();
	
	Действие = "СписокДокументов_ДополнительнаяКнопкаНажатие";
	ГруппаКнопок = Элементы.ГруппаДопКнопокСпискаДокументов;
	НастройкиКнопок = МодульОбъекта().НастройкиДополнительныхКнопок(РазмещенияКнопок.ОсновнаяФормаСписокДокументов);
	МодульОбъекта().ДобавитьНаФормуДополнительныеКнопки(ЭтаФорма, НастройкиКнопок, ГруппаКнопок, Действие);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументов_ДополнительнаяКнопкаНажатие(Команда)
	
	РазмещенияКнопок = МодульКлиента().Перечисление_РазмещениеДополнительныхКнопок();
	
	ПараметрыНажатия = МодульКлиента().Новый_ПараметрыНажатияДопКнопки();
	ПараметрыНажатия.Размещение = РазмещенияКнопок.ОсновнаяФормаСписокДокументов;
	ПараметрыНажатия.ВызывающаяФорма = ЭтаФорма;
	
	Для каждого Ид Из Элементы.СписокДокументовУчета.ВыделенныеСтроки Цикл
		
		Строка = СписокДокументовУчета.НайтиПоИдентификатору(Ид);
		
		Если ЗначениеЗаполнено(Строка.ДокументУчета) Тогда
			ПараметрыНажатия.ДопСведения.ВыбранныеДокументы.Добавить(Строка.ДокументУчета);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Строка.Документ1С) Тогда
			ПараметрыНажатия.ДопСведения.ВыбранныеДокументы1С.Добавить(Строка.Документ1С);
		КонецЕсли;
		
	КонецЦикла;
	
	МодульКлиента().ПриНажатииДополнительнойКнопки(ПараметрыНажатия, Команда);
	
КонецПроцедуры

// Центр поддержки

&НаКлиенте
Процедура ОткрытьЦентрПоддержки(Команда)
	
	МодульКлиента().ОткрытьЦентрПоддержки();
	
КонецПроцедуры

// Автоматическое обновление

&НаКлиенте
Процедура ПодключитьНовуюВерсиюПерезапуститьМодуль(КонтекстОбновления)
	
	ЭтаФорма.Закрыть();
	
	МодульКлиента().ПодключитьНовуюВерсиюМодуля(КонтекстОбновления);
	
	ОткрытьФорму(ИмяФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеУведомленияОбУстановкеНовойВерсии(Ответ, ДопПараметры = Неопределено) Экспорт
	
	ПродолжитьОткрытиеПослеПроверкиОбновления();
	
КонецПроцедуры

// Очередь уведомлений

&НаСервере
Процедура ПроверитьЗаполнениеАнкеты()
	
	Если МодульОбъекта().ЕстьНеЗаполненныеАнкеты() Тогда
		ТипыУведомлений = МодульОбъекта().Перечисление_ТипыУведомлений();
		ДобавитьУведомление(ТипыУведомлений.ЗаполнитеАнкету);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаличиеНовостей()
	
	Если ЗначениеЗаполнено(КлючНазначенияИспользования) Тогда
		Возврат;
	КонецЕсли;
	
	Если МодульОбъекта().СервисУведомлений_ЕстьНовостиМаркировки() Тогда
		Элементы.СсылкаНовости.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаУведомленияНажатие(Элемент)
	
	ТипыУведомлений = МодульКлиента().Перечисление_ТипыУведомлений();
	ТипУведомления = ПоследнееУведомление();
	
	Если ТипУведомления = ТипыУведомлений.ОбновитесьДоНовойВерсии Тогда
		ПроверитьОбновление();
	КонецЕсли;
	
	Если ТипУведомления = ТипыУведомлений.ЗаполнитеАнкету Тогда
		ОткрытьНастройкиОрганизацииВСервисе();
	КонецЕсли;
	
	Если ТипУведомления = ТипыУведомлений.ИстекаетСрокДействияСертификата Тогда
		ОткрытьФормуСпискаНастроекПодписания();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНовостиНажатие(Элемент)
	
	ОткрытьФормуВажныеУведомления();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВажныеУведомления()
	
	МодульКлиента().ОткрытьФормуВажныеУведомления(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСпискаНастроекПодписания()
	
	МодульКлиента().ОткрытьФормуСпискаНастроекПодписания(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУведомление(ТипУведомления)
	
	Если ОчередьУведомлений.НайтиПоЗначению(ТипУведомления) = Неопределено Тогда
		ОчередьУведомлений.Добавить(ТипУведомления);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТекстУведомления()
	
	Элемент = Элементы.СсылкаУведомления;
	
	ТипУведомления = ПоследнееУведомление();
	Если Не ЗначениеЗаполнено(ТипУведомления) Тогда
		Элемент.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	ОформлениеУведомлений = МодульКлиента().ОформлениеУведомлений();
	Оформление = ОформлениеУведомлений[ТипУведомления];
	ЗаполнитьЗначенияСвойств(Элемент, Оформление);
	
КонецПроцедуры

&НаКлиенте
Функция ПоследнееУведомление()
	
	Если Не ЗначениеЗаполнено(ОчередьУведомлений) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Индекс = ОчередьУведомлений.Количество() - 1;
	Элемент = ОчередьУведомлений.Получить(Индекс);
	Результат = Элемент.Значение;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПерейтиНаСтраницуОбновления()
	
	МодульКлиента().ОткрытьСтраницуОбновления();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиОрганизацииВСервисе()
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
	"ОткрытьНастройкиОрганизацииВСервисеПослеВыбора", ЭтаФорма);
	
	МодульКлиента().ОткрытьФормуВыбораОрганизации(ОписаниеОбработчика, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиОрганизацииВСервисеПослеВыбора(РезультатВыбора, ДопПараметры = Неопределено) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МодульКлиента().ОткрытьСтраницуНастроекОрганизации(РезультатВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьВыполнениеФоновыхЗаданий82(Команда)
	
	МодульКлиента().ОткрытьФормуОбработкиМодально("Форма_ВыполнениеФоновыхЗаданий", ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСвязанныеДокументы(Команда)
	
	ЭтоСписокДокументов = Ложь;
	
	Если Элементы.Закладки.ТекущаяСтраница = Элементы.ЗакладкаДокументыУчета Тогда
		ТекущиеДанные = Элементы.СписокДокументовУчета.ТекущиеДанные;
		ЭтоСписокДокументов = Истина;
	ИначеЕсли Элементы.Закладки.ТекущаяСтраница = Элементы.ЗакладкаОперации Тогда
		ТекущиеДанные = Элементы.СписокОпераций.ТекущиеДанные;
	ИначеЕсли Элементы.Закладки.ТекущаяСтраница = Элементы.ЗакладкаТранспортныеУпаковки Тогда
		ТекущиеДанные = Элементы.СписокОперацийАгрегатов.ТекущиеДанные;
	КонецЕсли;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	Если ЭтоСписокДокументов Тогда
		ПараметрыФормы.Вставить("ДокументУчета", ТекущиеДанные.ДокументУчета);
	Иначе
		ПараметрыФормы.Вставить("Операция", ТекущиеДанные.Ссылка);
	КонецЕсли;
	
	МодульКлиента().ОткрытьФормуОбработки("Форма_СвязанныеДокументы", ЭтаФорма, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура НоваяОперация_ЗаказКодов(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ЗаказКодов;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации,,,, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура НоваяОперация_ПечатьизСвободногоОстатка(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ПечатьКодов;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации,,,, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура НоваяОперация_НаполнениеАгрегатовНаТСД(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().НаполнениеАгрегатовНаТСД;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации,,,, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура НоваяОперация_ВозвратВОборотНаТСД(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ВозвратВОборотНаТСД;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации,,,, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура НоваяОперация_КорректировкаСведенийОКодах(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().КорректировкаСведенийОКодах;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации,,,, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура НоваяОперация_УведомлениеОСостоянииКодов(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().УведомлениеОСостоянииКодов;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации,,,, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОпераций_Удалить(Команда)
	
	ТекстВопроса = НСтр("ru = 'Операция будет удалена. Продолжить?'");
	Кнопки = РежимДиалогаВопрос.ДаНет;
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("СписокОпераций_Удалить_ПослеСогласия", ЭтаФорма);
	МодульКлиента().ПоказатьДиалогВопроса(ОписаниеОбработчика, ТекстВопроса, Кнопки);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОпераций_Удалить_ПослеСогласия(Ответ, ДопПараметры = Неопределено) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.СписокОпераций.ТекущиеДанные;
	
	Если МожноУдалитьОперацию(ТекущиеДанные.Статус) Тогда
		УдалитьОперациюНаСервере(ТекущиеДанные.Ссылка);
		Оповестить("КонтурМаркировка_Операция_Изменен", ТекущиеДанные.ДокументУчета);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьОперациюНаСервере(Операция)
	
	ДокументУчета = Операция.ДокументУчета;
	ТипОперации = Операция.ТипОперации;
	
	НачатьТранзакцию(МодульОбъекта().РежимУправленияБлокировкой());
	
	Попытка
		
		ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
		ТребуемыеДействия = МодульОбъекта().Перечисление_ТребуемыеДействияДокументовУчета();
		СтатусыДокументовУчета = МодульОбъекта().Перечисление_СтатусыДокументовУчета();
		
		МодульОбъекта().Операции_Удалить(Операция);
		
		Если ТипОперации = ТипыОпераций.ПодборТоваровИКодовНаТСД Тогда
			СтатусыДокумента = МодульОбъекта().ДокументУчета_Статусы(ДокументУчета);
			СтатусыДокумента.ОсновнойСтатус = СтатусыДокументовУчета.Новый;
			СтатусыДокумента.ТребуемоеДействие = ТребуемыеДействия.НачатьРаботу;
			МодульОбъекта().СтатусыДокументаУчета_Записать(ДокументУчета, СтатусыДокумента);
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		Ошибка = ИнформацияОбОшибке();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Функция МожноУдалитьОперацию(Статус)
	
	УдаляемыеСтатусы = МодульКлиента().УдаляемыеСтатусыОпераций();
	
	Возврат УдаляемыеСтатусы.Найти(Статус) <> Неопределено;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокВыбораОтборТипОперации()
	
	СписокВыбора = Элементы.СписокОпераций_ОтборТипОперации.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().ТипыИнтерактивныхОпераций();
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораОтборСтатусОперации()
	
	СписокВыбора = Элементы.СписокОпераций_ОтборСтатус.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().Перечисление_СтатусыОпераций();
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОпераций_УстановитьБыстрыйОтбор(ИмяПоля, ЗначениеОтбора)
	
	ОтборКомпоновкиДанных = СписокОпераций.Отбор;
	ИдентификаторОтбора = "БыстрыйОтбор_" + ИмяПоля;
	
	ЭлементОтбора = Неопределено;
	Для Каждого Элемент Из ОтборКомпоновкиДанных.Элементы Цикл
		Если Элемент.ИдентификаторПользовательскойНастройки = ИдентификаторОтбора Тогда
			ЭлементОтбора = Элемент;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЭлементОтбора = Неопределено Тогда
		ЭлементОтбора = ОтборКомпоновкиДанных.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ИдентификаторПользовательскойНастройки = ИдентификаторОтбора;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	КонецЕсли;
	
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
	ЭлементОтбора.ПравоеЗначение = ЗначениеОтбора;
	ЭлементОтбора.Использование = ЗначениеЗаполнено(ЗначениеОтбора);
	
	СформироватьОписаниеОтборов();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОперацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если Поле = Элементы.СписокОперацийИдентификаторВСервисе Тогда
		МодульКлиента().ОткрытьОперациюВСервисе(ТекущиеДанные.ТипОперации, ТекущиеДанные.ИдентификаторВСервисе);
	Иначе
		МодульКлиента().ОткрытьФормуОперации(ТекущиеДанные.Ссылка, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОперацийПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено 
		ИЛИ ТекущиеДанные.Свойство("ГруппировкаСтроки") Тогда
		МожноУдалитьОперацию = Ложь;
	Иначе
		МожноУдалитьОперацию = МожноУдалитьОперацию(ТекущиеДанные.Статус);
	КонецЕсли;
	
	Элементы.Кнопка_УдалитьОперациюВСпискеОпераций.Доступность = МожноУдалитьОперацию;
	Элементы.КонтекстноеМеню_УдалитьОперацию.Доступность = МожноУдалитьОперацию;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОпераций_ОтборТипОперацииПриИзменении(Элемент)
	
	СписокОпераций_УстановитьБыстрыйОтбор("ТипОперации", СписокОпераций_ОтборТипОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОпераций_ОтборСтатусПриИзменении(Элемент)
	
	СписокОпераций_УстановитьБыстрыйОтбор("Статус", СписокОпераций_ОтборСтатус);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОпераций_ОтборТоварПриИзменении(Элемент)
	
	СписокОпераций_УстановитьБыстрыйОтбор("Ссылка.Товары.Товар", СписокОпераций_ОтборТовар);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакладкиПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	СформироватьОписаниеОтборов();
	
КонецПроцедуры

&НаСервере
Процедура СписокОперацийПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	СформироватьОписаниеОтборов();
	
КонецПроцедуры

&НаСервере
Процедура СписокВходящихУПДПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	СформироватьОписаниеОтборов();
	
КонецПроцедуры

&НаСервере
Процедура СписокУведомленийОПриемкеПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	СформироватьОписаниеОтборов();
	
КонецПроцедуры

&НаСервере
Процедура СписокОперацийАгрегатовПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	СформироватьОписаниеОтборов();
	
КонецПроцедуры

// Список уведомлений о приемке

&НаКлиенте
Процедура СписокУведомленийОПриемке_Период(Команда)
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
	"ПослеВыбораПериодаСпискаУведомленийОПриемке", ЭтаФорма);
	МодульКлиента().ПоказатьДиалогРедактированияСтандартногоПериода(ОписаниеОбработчика, ПериодУведомленийОПриемке);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПериодаСпискаУведомленийОПриемке(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПериодУведомленийОПриемке = Результат;
	
	ЗаполнитьПустыеЗначенияПериода(ПериодУведомленийОПриемке);
	
	УстановитьЗаголовокПериодаСписка(Элементы.Кнопка_ПериодСпискаУведомленийОПриемке, ПериодУведомленийОПриемке);
	
	ОбновитьСписокУведомленийОПриемке();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокУведомленийОПриемке()
	
	УстановитьПараметрыПериодаДинамическогоСписка(СписокУведомленийОПриемке, ПериодУведомленийОПриемке);
	
	Элементы.СписокУведомленийОПриемке.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьСписокУведомленийОПриемке()
	
	УстановитьОтборСпискаУведомленийОПриемке();
	
	СписокУведомленийОПриемке.ТекстЗапроса = ТекстЗапроса_СписокУведомленийОПриемке();
	СписокУведомленийОПриемке.ОсновнаяТаблица = "Справочник.КонтурМаркировка_Операции";
	СписокУведомленийОПриемке.ДинамическоеСчитываниеДанных = Истина;
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	СтатусыОпераций = МодульОбъекта().Перечисление_СтатусыОпераций();
	ПоказыватьЗавершенные = Элементы.Кнопка_ПоказатьЗавершенныеВСпискеУведомленийОПриемке.Пометка;
	
	СписокУведомленийОПриемке.Параметры.УстановитьЗначениеПараметра("УведомлениеОПриемке", ТипыОпераций.УведомлениеОПриемке);
	СписокУведомленийОПриемке.Параметры.УстановитьЗначениеПараметра("ОтправленВАрхив", СтатусыОпераций.ОтправленВАрхив);
	СписокУведомленийОПриемке.Параметры.УстановитьЗначениеПараметра("ПоказыватьЗавершенные", ПоказыватьЗавершенные);
	
	УстановитьПараметрыПериодаДинамическогоСписка(СписокУведомленийОПриемке, ПериодУведомленийОПриемке);
	
КонецПроцедуры

&НаСервере
Функция ТекстЗапроса_СписокУведомленийОПриемке()
	
	Результат =
	"ВЫБРАТЬ
	|	Спр.Ссылка КАК Ссылка,
	|	Спр.ТипОперации КАК ТипОперации,
	|	Спр.Организация КАК Организация,
	|	Спр.Склад КАК Склад,
	|	Спр.ВидПродукции КАК ВидПродукции,
	|	Спр.ДокументУчета КАК ДокументУчета,
	|	Спр.ОперацияОснование КАК ОперацияОснование,
	|	Спр.Ответственный КАК Ответственный,
	|	Спр.Комментарий КАК Комментарий,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(НомераДокументов.Значение, """") КАК СТРОКА(1000)) КАК НомерЗаказаНаОтгрузку,
	|	ВЫРАЗИТЬ(ДатыДокументов.Значение КАК ДАТА) КАК ДатаОтгрузки,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(НаименованиеКонтрагентов.Значение, """") КАК СТРОКА(1000)) КАК НаименованиеКонтрагента,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ИННКонтрагентов.Значение, """") КАК СТРОКА(1000)) КАК ИНН_Контрагента,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(НомераДокументовОснования.Значение, """") КАК СТРОКА(1000)) КАК ДокументОснованиеНомер,
	|	ВЫРАЗИТЬ(ДатыДокументовОснования.Значение КАК ДАТА) КАК ДокументОснованиеДата,
	|	Статусы.Статус КАК Статус,
	|	Статусы.ДатаСтатуса КАК ДатаИзмененияСтатуса,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(СтатусыСверкиНаТСД.Значение, """") КАК СТРОКА(1000)) КАК СтатусСверкиНаТСД,
	|	ВЫРАЗИТЬ(ДатыПриемок.Значение КАК ДАТА) КАК ДатаПриемки,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(СтатусыПриемки.Значение, """") КАК СТРОКА(1000)) КАК СтатусПриемки,
	|	5 КАК НомерКартинки
	|{ВЫБРАТЬ
	|	Ссылка.*,
	|	ТипОперации,
	|	Организация.*,
	|	Склад.*,
	|	ВидПродукции.*,
	|	ДокументУчета.*,
	|	ОперацияОснование.*,
	|	Ответственный.*,
	|	Комментарий,
	|	НомерЗаказаНаОтгрузку,
	|	ДатаОтгрузки,
	|	НаименованиеКонтрагента,
	|	ИНН_Контрагента,
	|	ДокументОснованиеНомер,
	|	ДокументОснованиеДата,
	|	Статус,
	|	ДатаИзмененияСтатуса,
	|	СтатусСверкиНаТСД,
	|	ДатаПриемки,
	|	СтатусПриемки,
	|	НомерКартинки}
	|ИЗ
	|	Справочник.КонтурМаркировка_Операции КАК Спр
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_СтатусыОпераций КАК Статусы
	|		ПО Спр.Ссылка = Статусы.Операция
	|			И (Статусы.ТипСтатуса = ""ОсновнойСтатус"")}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_ДопРеквизиты КАК НомераДокументов
	|		ПО Спр.Ссылка = НомераДокументов.Объект
	|			И (НомераДокументов.ИмяРеквизита = ""НомерДокумента"")}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_ДопРеквизиты КАК ДатыДокументов
	|		ПО Спр.Ссылка = ДатыДокументов.Объект
	|			И (ДатыДокументов.ИмяРеквизита = ""ДатаДокумента"")}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_ДопРеквизиты КАК НаименованиеКонтрагентов
	|		ПО Спр.Ссылка = НаименованиеКонтрагентов.Объект
	|			И (НаименованиеКонтрагентов.ИмяРеквизита = ""КонтрагентНаименование"")}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_ДопРеквизиты КАК ИННКонтрагентов
	|		ПО Спр.Ссылка = ИННКонтрагентов.Объект
	|			И (ИННКонтрагентов.ИмяРеквизита = ""КонтрагентИНН"")}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_ДопРеквизиты КАК НомераДокументовОснования
	|		ПО Спр.Ссылка = НомераДокументовОснования.Объект
	|			И (НомераДокументовОснования.ИмяРеквизита = ""ДокументОснованиеНомер"")}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_ДопРеквизиты КАК ДатыДокументовОснования
	|		ПО Спр.Ссылка = ДатыДокументовОснования.Объект
	|			И (ДатыДокументовОснования.ИмяРеквизита = ""ДокументОснованиеДата"")}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_ДопРеквизиты КАК СтатусыСверкиНаТСД
	|		ПО Спр.Ссылка = СтатусыСверкиНаТСД.Объект
	|			И (СтатусыСверкиНаТСД.ИмяРеквизита = ""СтатусСверкиНаТСД"")}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_ДопРеквизиты КАК ДатыПриемок
	|		ПО Спр.Ссылка = ДатыПриемок.Объект
	|			И (ДатыПриемок.ИмяРеквизита = ""ДатаПриемки"")}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_ДопРеквизиты КАК СтатусыПриемки
	|		ПО Спр.Ссылка = СтатусыПриемки.Объект
	|			И (СтатусыПриемки.ИмяРеквизита = ""СтатусПриемки"")}
	|ГДЕ
	|	Спр.ТипОперации = &УведомлениеОПриемке
	|	И ВЫРАЗИТЬ(ДатыДокументов.Значение КАК ДАТА) МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ВЫБОР
	|			КОГДА &ПоказыватьЗавершенные
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ НЕ Статусы.Статус = &ОтправленВАрхив
	|		КОНЕЦ
	|{ГДЕ
	|	Спр.Ссылка.*,
	|	Спр.ТипОперации,
	|	Спр.Организация.*,
	|	Спр.Склад.*,
	|	Спр.ВидПродукции.*,
	|	Спр.ДокументУчета.*,
	|	Спр.ОперацияОснование.*,
	|	Спр.Ответственный.*,
	|	Спр.Комментарий,
	|	(ВЫРАЗИТЬ(ЕСТЬNULL(НомераДокументов.Значение, """") КАК СТРОКА(1000))) КАК НомерЗаказаНаОтгрузку,
	|	(ВЫРАЗИТЬ(ДатыДокументов.Значение КАК ДАТА)) КАК ДатаОтгрузки,
	|	(ВЫРАЗИТЬ(ЕСТЬNULL(НаименованиеКонтрагентов.Значение, """") КАК СТРОКА(1000))) КАК НаименованиеКонтрагента,
	|	(ВЫРАЗИТЬ(ЕСТЬNULL(ИННКонтрагентов.Значение, """") КАК СТРОКА(1000))) КАК ИНН_Контрагента,
	|	(ВЫРАЗИТЬ(ЕСТЬNULL(НомераДокументовОснования.Значение, """") КАК СТРОКА(1000))) КАК ДокументОснованиеНомер,
	|	(ВЫРАЗИТЬ(ДатыДокументовОснования.Значение КАК ДАТА)) КАК ДокументОснованиеДата,
	|	Статусы.Статус КАК Статус,
	|	Статусы.ДатаСтатуса КАК ДатаИзмененияСтатуса,
	|	(ВЫРАЗИТЬ(ЕСТЬNULL(СтатусыСверкиНаТСД.Значение, """") КАК СТРОКА(1000))) КАК СтатусСверкиНаТСД,
	|	(ВЫРАЗИТЬ(ДатыПриемок.Значение КАК ДАТА)) КАК ДатаПриемки,
	|	(ВЫРАЗИТЬ(ЕСТЬNULL(СтатусыПриемки.Значение, """") КАК СТРОКА(1000))) КАК СтатусПриемки}";
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СписокУведомленийОПриемке_ПоказатьЗавершенные(Команда)
	
	Элемент = Элементы.Кнопка_ПоказатьЗавершенныеВСпискеУведомленийОПриемке;
	Элемент.Пометка = Не Элемент.Пометка;
	
	ПоказыватьЗавершенные = Элемент.Пометка;
	СписокУведомленийОПриемке.Параметры.УстановитьЗначениеПараметра("ПоказыватьЗавершенные", ПоказыватьЗавершенные);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУведомленийОПриемкеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.СписокУведомленийОПриемке.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не МодульКлиента().ВыполнитьАвторизацию(ТекущиеДанные.Организация, ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	МодульКлиента().ОткрытьФормуОперации(ТекущиеДанные.Ссылка, ЭтаФорма);
	
КонецПроцедуры

// Трансформация агрегатов

&НаКлиенте
Процедура ДобавитьВАгрегат(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ДобавлениеВАгрегат;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации,,,, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзъятьИзАгрегата(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ИзъятиеИзАгрегата;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации,,,, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

// Трансформация АТК

&НаКлиенте
Процедура ДобавитьВАТК(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ДобавлениеВАТК;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации,,,, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзъятьИзАТК(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ИзъятиеИзАТК;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации,,,, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

// Отчет по виртуальному складу

&НаСервере
Функция КонтекстОтчетаПоВиртуальномуСкладу()
	
	Результат = МодульОбъекта().Новый_ОтчетПоВиртуальномуСкладу_Контекст();
	
	Результат.ФормаИнициатор = "ФормаМодуля";
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОтчетПоВиртуальномуСкладу(Команда)
	Контекст = КонтекстОтчетаПоВиртуальномуСкладу();
	МодульКлиента().ОткрытьФормуОтчетаПоВиртуальномуСкладу(ЭтаФорма, Контекст);
КонецПроцедуры

// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроверитьКорректностьУстановки()
	
	Если Метаданные.ОбщиеМодули.Найти("ВзаимодействиеКонтурМаркировка") = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Для работы модуля необходимо скачать и установить подсистему ""Контур.Маркировка""'");
	КонецЕсли;
	
	Если ТипЗнч(СписокОпераций_ОтборТовар) = Тип("Строка") Тогда
		ВызватьИсключение НСтр("ru = 'Нарушены типы реквизитов модуля!
		|Необходимо повторно скачать и установить модуль ""Контур.Маркировка""'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВыполнениеОбменаССервисом()
	
	Если МодульКлиента().ОбменССервисомВыполняется() Тогда
		НастроитьКнопкиОбменаССервисом(Истина);
		ПодключитьОбработчикОжидания("ОбновитьСтатусОбменаССервисом", 5, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусОбменаССервисом() Экспорт
	
	ОбменССервисомВыполняется = МодульКлиента().ОбменССервисомВыполняется();
	
	НастроитьКнопкиОбменаССервисом(ОбменССервисомВыполняется);
	
	Если ОбменССервисомВыполняется Тогда
		ПодключитьОбработчикОжидания("ОбновитьСтатусОбменаССервисом", 5, Истина);
	Иначе
		ОбновитьКонтекстПослеВыполненияОбмена();
		ОбновитьТекстУведомления();
		ОбновитьСписокОпераций();
		ОбновитьСписокВходящихУПД();
		ОбновитьСписокОперацийАгрегатов();
		ОбновитьСписокУведомленийОПриемке();
		НастроитьКартинкиКомандФормы();
		МодульКлиента().ОбработатьОшибкиОбменаССервисом(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти // СлужебныеПроцедурыИФункции
