// Copyright (C) 2012-2025 Engineer Mareev Enterprises

//	Модуль для УТ10.3 экспорт приходных ордеров на товары с сериями и характеристиками

//	$Приход товаров (ордерная схема)
//  Экспорт сообщений ASN:
//	 - В 1C (руч.) оператор по распоряжениям на приемку (Заказ поставщику, Инвойс, Перемещение товаров (как приход)) оформляет документ "Приходный ордер на товары", который при проведении в статусе "В работе" (авт.) помечается к экспорту.
//	 - 1C (авт.) экспортирует сообщение ASN.
//	 - EME.WMS (авт.) импортирует сообщение ASN и создает документ ASN.

//	?Перемещение как приход
//	?В 1C (руч.) оператор на основании проведенного документа ПеремещениеТоваров создает документ ПриходныйОрдерНаТовары, который при проведении в статусе "В работе" помечается к экспорту.
//	?1C (авт.) экспортирует сообщение ASN.
//	?EME.WMS (авт.) импортирует сообщение ASN и создает документ ASN.

#Область ПрограммныйИнтерфейс   

//	Функция ПолучитьИмяСообщения возвращает имя сообщения
Функция ПолучитьИмяСообщения() Экспорт
	Возврат "asn";
КонецФункции

//	#IBS 05.05.2023 Функция ПолучитьМетаданные возвращает метаданные сообщения
Функция ПолучитьМетаданные() Экспорт
	Возврат Метаданные.Документы.ПриходныйОрдерНаТовары;
КонецФункции

// #IBS 20.03.2025 Процедура Экспортировать экспортирует один приходный ордер с сериями (или характеристиками) и марками ЧЗ
Процедура Экспортировать(ERPData, Документ) Экспорт
	
	// Определим распоряжение, здесь не как в ERP
	Распоряжение = Неопределено; 	
	Если НЕ ЗначениеЗаполнено(Документ.ДокументПеремещения) Тогда
		Для каждого СтрокаТовара из Документ.Товары цикл
			Если ЗначениеЗаполнено(СтрокаТовара.ЗаказПоставщику) Тогда
				Распоряжение = СтрокаТовара.ЗаказПоставщику;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Если Распоряжение = Неопределено Тогда
		Распоряжение = Документ.ДокументПеремещения; 	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Распоряжение) Тогда
		Возврат;
	КонецЕсли;
	
	АктуализироватьУИДыСтрок(Документ.Ссылка);
	
	// Тип распоряжения	
	РаспоряжениеИмяОбъектаМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(Распоряжение)).ПолноеИмя();
	//Сообщить("Распоряжение "+ РаспоряжениеИмяОбъектаМетаданных);
	
	//	Заголовок заказа
	EmeWmsERPEngine.AppendHeaderLine(ERPData);
	
	ERPData.header.asn_id       = Документ.УникальныйИдентификатор();

	Если Константы.EmeWmsСоздаватьУникальныеСообщения.Получить() Тогда
		ERPData.header.id	  	= Новый УникальныйИдентификатор;
	Иначе
		ERPData.header.id	  	= ERPData.header.asn_id;		
	КонецЕсли;

	ERPData.header.asn_reg_no	  =	СокрЛП(Документ.Номер)+"/"+Формат(Год(Документ.Дата),"ЧГ=4");
	ERPData.header.asn_date	  	  =	Документ.Дата;
	ERPData.header.erp_doc_type	  = ПолучитьМетаданные().Имя;
	ERPData.header.ref_reg_no  	  =	Документ.НомерВходящегоДокумента;
	
	Если РаспоряжениеИмяОбъектаМетаданных = "Документ.ЗаказПоставщику" ИЛИ 
		РаспоряжениеИмяОбъектаМетаданных = "Документ.Инвойс" Тогда
		
		Контрагент = Распоряжение.Контрагент; 
		
		ERPData.header.supplier_id    =	Контрагент.УникальныйИдентификатор();
		ERPData.header.supplier_code  =	СокрЛП(Контрагент.Код);
		ERPData.header.supplier_name  =	Контрагент.Наименование;
		
		EmeWmsЭкспортКонтрагентов.РазрешитьЭкспорт(Контрагент);
		
		// Здесь возврат на основании ордера.
		//Если РаспоряжениеИмяОбъектаМетаданных = "Документ.ВозвратТоваровОтКлиента" Тогда
		//	 ERPData.header.is_return = 1;
		//КонецЕсли;
	ИначеЕсли РаспоряжениеИмяОбъектаМетаданных = "Документ.ПеремещениеТоваров" Тогда
		
		ERPData.header.supplier_id  	= Распоряжение.Организация.УникальныйИдентификатор();
		// #IBS 24.01.2024 у организаций пустой код
		ERPData.header.supplier_code  	= Распоряжение.Организация.ИНН;
		ERPData.header.supplier_name  	= Распоряжение.Организация.Наименование;   

	Иначе
		// Для остальных типов распоряжений
		Возврат;
	КонецЕсли;
		
	ERPData.header.whs_to_code 	  =	EmeWmsУтилиты.ПолучитьКодСкладаEMEПоСсылке(Документ.Склад);  // Код склада EME
	ERPData.header.vendor_to_code =	EmeWmsУтилиты.ПолучитьКодОрганизацииEMEПоСсылке(Распоряжение.Организация);
	ERPData.header.comment        =	Лев(Документ.Комментарий, 128);
																				  
	//	Использование серий в интеграции
	ИспользоватьСерииНастройка = Константы.EmeWmsИспользоватьСерии.Получить();	

	//	Строки заказа
	EmeWmsERPEngine.SelectChild(ERPData, "lines");
	Для Каждого СтрокаТовара Из Документ.Товары Цикл 
		Товар = СтрокаТовара.Номенклатура;
				
		EmeWmsERPEngine.AppendChildLine(ERPData);
		
		ERPData.lines.id			= СтрокаТовара.EmeWmsУИДСтроки;
		ERPData.lines.asn_line_no	= СтрокаТовара.НомерСтроки;
		ERPData.lines.goods_id		= СтрокаТовара.Номенклатура.УникальныйИдентификатор();
		ERPData.lines.goods_code	= СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовара.Номенклатура, "Код"));
		ERPData.lines.quantity		= СтрокаТовара.Количество;
		// Для основной единицы - берется значение из номенклатуры, для кода по классификатору
		ЕдиницаИзмерения 			= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовара.Номенклатура, "БазоваяЕдиницаИзмерения");
		ERPData.lines.mu_code		= ЕдиницаИзмерения.Код; 
		
		// Выгружаем серии или характеристики товара
		ИспользоватьСерии 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Товар, "ВестиУчетПоСериям"); 

		// Серии или серийные номера
		Если Не ИспользоватьСерииНастройка Тогда
			ИспользоватьСерии = Ложь;
		КонецЕсли;
		
		Если ИспользоватьСерии Тогда // Серии
			// Здесь в сериях номер не заполняется, только наименование, содержащее номер и дату документа в виде текста.
			СерийныйНомер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовара.СерияНоменклатуры, "Наименование");
			СрокГодности = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовара.СерияНоменклатуры, "СрокГодности");
			Если ЗначениеЗаполнено(СерийныйНомер) Тогда 
				ERPData.lines.lot_no = СерийныйНомер;
				ERPData.lines.bbd = СрокГодности;
			КонецЕсли;
		Иначе // Характеристики
			ИспользоватьХарактеристики = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Товар,  "ВестиУчетПоХарактеристикам");
			Если ИспользоватьХарактеристики Тогда
				Если ЗначениеЗаполнено(СтрокаТовара.ХарактеристикаНоменклатуры) Тогда
					ERPData.lines.lot_no = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовара.ХарактеристикаНоменклатуры, "Наименование");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ EmeWmsЭкспортНоменклатуры.Экспортирован(СтрокаТовара.Номенклатура) Тогда
			EmeWmsЭкспортНоменклатуры.РазрешитьЭкспортСГруппами(СтрокаТовара.Номенклатура);
		КонецЕсли;   
		
		//#COA Чепиков 27.05.2025 в строках ASN необходимо передавать клиента под которого пришла поставка
		Если РаспоряжениеИмяОбъектаМетаданных = "Документ.ЗаказПоставщику" Тогда
			ЗаказПоставщикуТовары = Распоряжение.Товары;
		ИначеЕсли РаспоряжениеИмяОбъектаМетаданных = "Документ.ПеремещениеТоваров" ИЛИ 
			РаспоряжениеИмяОбъектаМетаданных = "Документ.Инвойс" Тогда
			ЗаказПоставщикуТовары = СтрокаТовара.ЗаказПоставщику.Товары;
		КонецЕсли;
		
		Для каждого СтрокаЗаказа Из ЗаказПоставщикуТовары Цикл
			Если СтрокаЗаказа.Номенклатура = СтрокаТовара.Номенклатура
				И СтрокаЗаказа.ХарактеристикаНоменклатуры = СтрокаТовара.ХарактеристикаНоменклатуры Тогда
				
				Если ЗначениеЗаполнено(СтрокаЗаказа.Заказ) Тогда
					Покупатель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаЗаказа.Заказ, "Контрагент");
					
					Если ЗначениеЗаполнено(Покупатель) Тогда
						ERPData.lines.customer_id = Покупатель.УникальныйИдентификатор();			
						
						Если Не EmeWmsЭкспортКонтрагентов.Экспортирован(Покупатель) Тогда
							EmeWmsЭкспортКонтрагентов.ПометитьКЭкспорту(Покупатель);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				Прервать;  
			КонецЕсли;
		КонецЦикла;

		//#COA Чепиков 27.05.2025 в строках АСН нужно передавать цену
		ERPData.lines.price = СтрокаТовара.Цена;
		
		// EmeWmsЭкспортНоменклатуры.ПометитьКЭкспортуБезусловно(СтрокаТовара.Номенклатура);
	КонецЦикла;	  
	
КонецПроцедуры   

#КонецОбласти

#Область ЭкспортныеСлужебныеПроцедурыИФункции

//	#IBS 05.05.2023 Функция ПолучитьВыборкуСсылок возвращает выборку ссылок для экспорта
Функция ПолучитьВыборкуСсылок() Экспорт
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	EmeWmsПометкиКЭкспортуПриходныхОрдеровНаТовары.ПриходныйОрдерНаТовары КАК Ссылка
		|ИЗ
		|	РегистрСведений.EmeWmsПометкиКЭкспортуПриходныхОрдеровНаТовары КАК EmeWmsПометкиКЭкспортуПриходныхОрдеровНаТовары
		|ГДЕ
		|	EmeWmsПометкиКЭкспортуПриходныхОрдеровНаТовары.КЭкспорту";
		
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции

//	#IBS 05.05.2023 Функция РазрешенКЭкспорту возвращает Истина, если приходный ордер разрешен к экспорту.
Функция РазрешенКЭкспорту(Документ) Экспорт
	
	ДатаЗапускаИнтеграции = Константы.EmeWmsДатаЗапускаИнтеграции.Получить();
	Если ЗначениеЗаполнено(ДатаЗапускаИнтеграции)
			И Документ.Дата < ДатаЗапускаИнтеграции Тогда
		ОтменитьЭкспорт(Документ);
		Возврат Ложь;
	КонецЕсли;	
	
	// Настройку ордерной схемы получим из маппинга
	Если Не EmeWmsУтилиты.ПолучитьИспользованиеОрдернойСхемыВПриходеДляСклада(Документ.Склад) Тогда
		ОтменитьЭкспорт(Документ);
		Возврат Ложь;
	КонецЕсли;
	
	Если Документ.ПометкаУдаления Тогда
		ОтменитьЭкспорт(Документ);
		Возврат Ложь;
	КонецЕсли;

	//#COA Чепиков 27.05.2025 по результатам тестирования, пожелание Заказчика выгружать не проведенные. 
	//Проводить при импорте Receipt в статусе "Закрыт".
	//Если Не Документ.Проведен Тогда
	//	ОтменитьЭкспорт(Документ);
	//	Возврат Ложь;
	//КонецЕсли;
	
	// #COA 24.11.2023 по ИЗ к Экспорту в статусе "В работе"
	//Если Документ.Статус <> Перечисления.СтатусыПриходныхОрдеров.ВРаботе Тогда
	//	ОтменитьЭкспорт(Документ);       
	//	Возврат Ложь;
	//КонецЕсли;   
	
	// #IBS 12.02.2024 По складам не WMS не экспортировать
	КодСклада = EmeWmsУтилиты.ПолучитьКодСкладаEMEПоСсылке(Документ.Склад);
	Если НЕ ЗначениеЗаполнено(КодСклада) Тогда
		ОтменитьЭкспорт(Документ);
		Возврат Ложь;
	КонецЕсли;

	// Не выгружать заново импортированные документы
	Если ПриходныйОрдерИмпортирован(Документ) Тогда
		ПодтвердитьЭкспорт(Документ);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат истина;
	
КонецФункции

//	#IBS 05.05.2023 Процедура ПометитьКЭкспорту помечает 
Процедура ПометитьКЭкспорту(Документ) Экспорт

	Если Не РазрешенКЭкспорту(Документ) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТовара Из Документ.Товары Цикл 
		Если НЕ EmeWmsЭкспортНоменклатуры.Экспортирован(СтрокаТовара.Номенклатура) Тогда
			EmeWmsЭкспортНоменклатуры.РазрешитьЭкспортСГруппами(СтрокаТовара.Номенклатура);
		КонецЕсли;   		
	КонецЦикла;
	
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуПриходныхОрдеровНаТовары.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПриходныйОрдерНаТовары.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Истина;
		Запись.Дата = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsПометкиКЭкспортуПриходныхОрдеровНаТовары.СоздатьМенеджерЗаписи();
	НоваяЗапись.ПриходныйОрдерНаТовары = Документ.Ссылка;
	НоваяЗапись.КЭкспорту = Истина;
	НоваяЗапись.Дата = ТекущаяДата();
    НоваяЗапись.Записать(); 
		
КонецПроцедуры

//	Процедура ОтменитьЭкспорт отменяет экспорт документа.
Процедура ОтменитьЭкспорт(Документ) Экспорт

	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуПриходныхОрдеровНаТовары.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПриходныйОрдерНаТовары.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Ложь;
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
КонецПроцедуры

//	#IBS 05.05.2023 Функция ПомеченКЭкспорту возвращает Истина, если приходный ордер помечен к экспорту.
Функция ПомеченКЭкспорту(Документ) Экспорт
	
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуПриходныхОрдеровНаТовары.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПриходныйОрдерНаТовары.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Возврат Запись.КЭкспорту;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

//	#IBS 05.05.2023 Процедура ПодтвердитьЭкспорт подтверждает экспорт приходного ордера.
Процедура ПодтвердитьЭкспорт(Документ) Экспорт

	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуПриходныхОрдеровНаТовары.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПриходныйОрдерНаТовары.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Ложь;
		Запись.ДатаЭкспорта = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
КонецПроцедуры

//	#IBS 05.05.2023 Процедура ПометитьКЭкспорту помечает приходный ордер при записи.
Процедура ПометитьКЭкспортуПриЗаписиПриходногоОрдераНаТовары(Источник, Отказ) Экспорт

	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ПометитьКЭкспорту(Источник);
		 
КонецПроцедуры

#КонецОбласти

#Область ЛокальныеСлужебныеПроцедурыИФункции

// #IBS 19.06.2023 Создать новые УИДы строк и исправить дубли, если возникли
Функция АктуализироватьУИДыСтрок(ДокументСсылка)
	Документ = ДокументСсылка.ПолучитьОбъект();
	// Для УИД строк ТЧ
	КлючиСтрок = Новый Соответствие;
	БылиСозданыИдентификаторы = Ложь;
	Для Каждого СтрокаТовара Из Документ.Товары Цикл 
		// Генерация специальных UID строк документа при выгрузке
		Если НЕ ЗначениеЗаполнено(СтрокаТовара.EmeWmsУИДСтроки) ИЛИ КлючиСтрок.Получить(СтрокаТовара.EmeWmsУИДСтроки) <> Неопределено Тогда
			СтрокаТовара.EmeWmsУИДСтроки = Новый УникальныйИдентификатор();
			БылиСозданыИдентификаторы = Истина;
		КонецЕсли;
		КлючиСтрок.Вставить(СтрокаТовара.EmeWmsУИДСтроки, 0);
	КонецЦикла;	
	
	Если БылиСозданыИдентификаторы Тогда
		// При записи не перепроводить, не регистрировать по подписке к Эксопрту
		Документ.ОбменДанными.Загрузка = Истина;		
		Документ.Записать();
	КонецЕсли;
КонецФункции

// #IBS 05.05.2023 Проверить, был импортирован приходный ордер, или нет.
Функция ПриходныйОрдерИмпортирован(Документ)
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеПриходныхОрдеровНаТовары.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Возврат Истина;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции

#КонецОбласти
