//	Copyright (C) 2012-2025 Engineer Mareev Enterprises
//  Модуль для УТ 10.3                                

// 	$Изменение характеристик товара со сменой статуса (по инициативе WMS)
// 	Импорт сообщений СHANGE с изменением статуса товара:
//	- Оператор WMS (руч.) создает и оформляет документ изменения характеристик товара со сменой статуса, закрывает его.
//	- WMS (авт.) выгружает сообщение CHANGE.
//	- 1C (авт.) импортирует сообщение CHANGE и создает документ Перемещение товаров.

#Область ПрограммныйИнтерфейс 

// Импортирует сообщение change в документы разного типа
Процедура Импортировать(ERPData, Трассировка, ТемаСообщения) Экспорт

	// ?Тип документа-основания 1С во входящем сообщении
	Если ЗначениеЗаполнено(ERPData.header.erp_doc_type) Тогда // Принимаются сообщения по инициативе wms
		Возврат;
	КонецЕсли;
	
	Если ERPData.header.is_status_change <> 1 Тогда
		Возврат;
	КонецЕсли;

	// ?Идентификтор документа EME для регистров контроля
	ИдЕМЕ = ERPData.header.change_id;
	// ?Номер документа EME для комментариев
	НомерЕМЕ = ERPData.header.change_reg_no;
	
	// ?Код организации-владельца EME
	КодОрганизации = ERPData.header.vendor_code;
	ОрганизацияСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаОрганизациюПоКодуEME(КодОрганизации);
	Если ОрганизацияСсылка.Пустая() Тогда
		EmeWmsERPEngine.ErrorHeader(ERPData, "VNDBAD");
		Возврат;
	КонецЕсли;
	
	//	Если были ошибки
	Если EmeWmsERPEngine.HasErrors(ERPData) Тогда
		Возврат;
	КонецЕсли;    
	
	ТаблицаСкладов = РазметитьТаблицуСкладов();

	ПолучитьКоличестваПеремещаемыхТоваров(ERPData, ТаблицаСкладов);
	Для каждого СтрокаСкладов Из ТаблицаСкладов Цикл
		СкладОтправитель =	СтрокаСкладов.СкладОтправитель;
		СкладПолучатель = 	СтрокаСкладов.СкладПолучатель;
		КартаТоваров = 		СтрокаСкладов.КартаТоваров;
		СтатусНачальный = 	СтрокаСкладов.СтатусНачальный;
		СтатусКонечный = 	СтрокаСкладов.СтатусКонечный;
		// Это ордерное перемещение по обычной схеме - со склада на склад
		Если СкладОтправитель <> СкладПолучатель Тогда 
			// Создадим новое перемещение, перемещений может быть несколько, как и статусов, создадим отдельный ИД EME для импорта
			ИдентификаторДокумента = ИдЕМЕ + "/" + СтатусНачальный + "/" + СтатусКонечный;
			ПеремещениеСсылка = СоздатьИзменитьДокументПеремещенияТоваров(ERPData, ИдентификаторДокумента, НомерЕМЕ, ОрганизацияСсылка, СкладОтправитель, СкладПолучатель, КартаТоваров);

			СоздатьОтметкуОбИмпортеПеремещенияТоваров(ПеремещениеСсылка, ИдентификаторДокумента);
		КонецЕсли;
	КонецЦикла;     

	EmeWmsERPEngine.Success(ERPData);
КонецПроцедуры

#КонецОбласти

#Область ЭкспортныеСлужебныеПроцедурыИФункции

//	Функция ПолучитьИмяСообщения возвращает имя сообщения
Функция ПолучитьИмяСообщения() Экспорт
	Возврат "change";
КонецФункции

//	Функция ПолучитьМетаданные возвращает метаданные сообщения
Функция ПолучитьМетаданные() Экспорт
	Возврат Метаданные.Документы.ПеремещениеТоваров;
КонецФункции

#КонецОбласти

#Область ЛокальныеСлужебныеПроцедурыИФункции

// #IBS 21.05.2023 Таблица для складов по сообщению
Функция РазметитьТаблицуСкладов()
	ТаблицаСкладов = Новый ТаблицаЗначений;
	ТаблицаСкладов.Колонки.Добавить("СкладОтправитель");
	ТаблицаСкладов.Колонки.Добавить("СкладПолучатель");
	ТаблицаСкладов.Колонки.Добавить("КартаТоваров");
	ТаблицаСкладов.Колонки.Добавить("СтатусНачальный");
	ТаблицаСкладов.Колонки.Добавить("СтатусКонечный");
	
	Возврат ТаблицаСкладов;
КонецФункции

// #IBS 31.03.2025 получить таблицу складов с картами товаров   
// Таблица складов: склад-отправитель, склад-получачель, карта товаров
// Карта товаров: ключ = UID товара + UID серии + UID характеристики, значение = количество в ед.хранения
Процедура ПолучитьКоличестваПеремещаемыхТоваров(ERPData, ТаблицаСкладов)

	//	Использование серий в интеграции
	ИспользоватьСерии = Константы.EmeWmsИспользоватьСерии.Получить();	

	// Для типа сообщения с изменения статуса организация и склад не меняются
	КодСкладаОтправителя = ERPData.header.whs_code;
	КодСкладаПолучателя = КодСкладаОтправителя;
	КодОрганизацииОтправителя = ERPData.header.vendor_code;
	КодОрганизацииПолучателя = КодОрганизацииОтправителя;
	
	// Весь товар в сообщении
	EmeWmsERPEngine.SelectChild(ERPData, "lines");
	Пока EmeWmsERPEngine.NextChildLine(ERPData) Цикл
		// ?Код зоны ЕМЕ
		КодЗоныОтправителя = ERPData.lines.zone_code;
		// ?Старый статус товара
		СтатусНачальный = EmeWmsСтатусы.ИспользоватьКакСтатус(ERPData.lines.old_stock_status);
		СкладОтправитель 	= EmeWmsУтилиты.ПолучитьСсылкуНаСкладПоКодуEME(КодСкладаОтправителя, КодЗоныОтправителя, КодОрганизацииОтправителя, СтатусНачальный);
		Если СкладОтправитель.Пустая() Тогда
			// #IBS Это не ошибка. Есть статусы вне маппинга
			//EmeWmsERPEngine.ErrorHeader(ERPData, "WHSBAD");
			Продолжить;
		КонецЕсли;

		// ?Код зоны ЕМЕ
		КодЗоныПолучателя = ERPData.lines.zone_code;
		// ?Новый статус товара
		СтатусКонечный = EmeWmsСтатусы.ИспользоватьКакСтатус(ERPData.lines.new_stock_status);
		СкладПолучатель 	= EmeWmsУтилиты.ПолучитьСсылкуНаСкладПоКодуEME(КодСкладаПолучателя, КодЗоныПолучателя, КодОрганизацииПолучателя, СтатусКонечный);
		Если СкладПолучатель.Пустая() Тогда
			// #IBS Это не ошибка. Есть статусы вне маппинга
			//EmeWmsERPEngine.ErrorHeader(ERPData, "WTOBAD");
			Продолжить;
		КонецЕсли;     
		
		// Затем найдем товары и единицы
		УИДТовара = ERPData.lines.goods_id;
		УИДЕдиницы = ERPData.lines.pack_id;
		Если УИДТовара = "" Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "GDSNUL");
			Продолжить
		КонецЕсли;  
		
		// Теперь найдем пару складов в таблице складов
		КартаТоваров = Неопределено;
		Для Каждого СтрокаСкладов из ТаблицаСкладов Цикл
			Если СтрокаСкладов.СкладОтправитель = СкладОтправитель И СтрокаСкладов.СкладПолучатель = СкладПолучатель И    
				СтрокаСкладов.СтатусНачальный = СтатусНачальный И СтрокаСкладов.СтатусКонечный = СтатусКонечный Тогда
				 КартаТоваров = СтрокаСкладов.КартаТоваров;
			КонецЕсли;
		КонецЦикла;
		// Если нет такой, создадим строку складов
		Если КартаТоваров = Неопределено Тогда     
			КартаТоваров = Новый Соответствие;;
			СтрокаСкладов = ТаблицаСкладов.Добавить();
			СтрокаСкладов.СкладОтправитель = СкладОтправитель;
			СтрокаСкладов.СкладПолучатель = СкладПолучатель;
			СтрокаСкладов.КартаТоваров = КартаТоваров;
			СтрокаСкладов.СтатусНачальный = СтатусНачальный;
			СтрокаСкладов.СтатусКонечный = СтатусКонечный;
		КонецЕсли;
		
		
		ТоварСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаТовар(УИДТовара);
		Если ТоварСсылка.Пустая() Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "GDSBAD");
			Продолжить
		КонецЕсли;
		
		ЕдиницаИзмерения = EmeWmsУтилиты.ПолучитьСсылкуНаЕдиницуИзмерения(УИДЕдиницы);
		Если ЕдиницаИзмерения.Пустая() Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "PCKBAD");
			Продолжить
		КонецЕсли;
		
		РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТоварСсылка, "ВестиУчетПоСериям, ВестиУчетПоХарактеристикам"); 

		Если Не ИспользоватьСерии Тогда
			РеквизитыНоменклатуры.ВестиУчетПоСериям = Ложь;
		КонецЕсли;

		СерияНоменклатуры 		   	= Неопределено;
		ХарактеристикаНоменклатуры 	= Неопределено;
		
		Если РеквизитыНоменклатуры.ВестиУчетПоСериям Тогда   
			СерияНоменклатуры = EmeWmsУтилиты.ПолучитьСериюПоНаименованию(ERPData.lines.old_lot_no, ТоварСсылка);
		ИначеЕсли РеквизитыНоменклатуры.ВестиУчетПоХарактеристикам Тогда
			ХарактеристикаНоменклатуры = EmeWmsУтилиты.ПолучитьХарактеристикуПоНаименованию(ERPData.lines.old_lot_no, ТоварСсылка);
		КонецЕсли;
		
		КлючТовара = EmeWmsУтилиты.СоздатьКлючТовара(ТоварСсылка, СерияНоменклатуры, ХарактеристикаНоменклатуры);
		КоличествоВБазовой = EmeWmsУтилиты.ПересчетВДругуюЕдиницу(ERPData.lines.quantity, ЕдиницаИзмерения, ТоварСсылка.БазоваяЕдиницаИзмерения);
		
		КоличествоПоКарте = ?(КартаТоваров.Получить(КлючТовара) = неопределено, 0.0, КартаТоваров.Получить(КлючТовара));
		КартаТоваров.Вставить(КлючТовара, КоличествоПоКарте + КоличествоВБазовой);
	КонецЦикла;
	
КонецПроцедуры

// Функция создает документ перемещения на склад брака по карте товаров брака, возвращает ссылку на документ перемещения
Функция СоздатьИзменитьДокументПеремещенияТоваров(ERPData, ИдЕМЕ, НомерЕМЕ, ОрганизацияСсылка, СкладОтправитель, СкладПолучатель, КартаТоваров)
	Перем Документ, ТаблицаРазличий;
	
	ДокументСсылка = НайтиДокументПеремещенияТоваров(ИдЕМЕ);
	Если ДокументСсылка.Пустая() Тогда
		Документ = Документы.ПеремещениеТоваров.СоздатьДокумент();
		Документ.Дата = ТекущаяДата();
		Документ.Организация = ОрганизацияСсылка;
		Документ.СкладОтправитель = СкладОтправитель;
		Документ.СкладПолучатель =  СкладПолучатель;
		Документ.ОтражатьВБухгалтерскомУчете = Истина;
		Документ.ОтражатьВУправленческомУчете = Истина;
		Документ.ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.ТоварыПродукция;
		
		Документ.Комментарий = "Создан на основании документа изменения характеристик EME: " +
			НомерЕМЕ + " (" + ИдЕМЕ + ")" + " (" + ERPData.header.comment + ")";
	Иначе
		Документ = ДокументСсылка.ПолучитьОбъект();
		Документ.Комментарий = "Изменен на основании документа изменения характеристик EME: " +
			НомерЕМЕ + " (" + ИдЕМЕ + ")" + " (" + ERPData.header.comment + ")";
	КонецЕсли;
		
	EmeWmsУтилиты.СкорректироватьТЧДокумента(Документ.Товары, КартаТоваров, Истина);		
	ПересчитатьУпаковкиДокумента(Документ);
	// EmeWmsДрайвер.ЗаполнитьСтатусыУказанияСерий(Документ, Документы.ПеремещениеТоваров);

	Документ.Записать(РежимЗаписиДокумента.Запись);
	СоздатьОтметкуОбИмпортеПеремещенияТоваров(Документ, ИдЕМЕ);
	// #IBS 04.04.2023 Новый механизм проведения
	EmeWmsПроведениеДокументов.ПометитьДокументКПроведению(Документ.Ссылка, 0);
	
	Возврат Документ.Ссылка;
КонецФункции

// Пересчитывает количества упаковок товара в ТЧ Товары
Процедура ПересчитатьУпаковкиДокумента(Документ)
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоУпаковок");
	Для Каждого СтрокаТовара Из Документ.Товары Цикл
		СтрокаТовара.Коэффициент = СтрокаТовара.ЕдиницаИзмерения.Коэффициент;
		ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТовара, Документ);
	КонецЦикла;
КонецПроцедуры    

// Функция возвращает ссылку на документ Перемещение товаров по ИД EME
Функция НайтиДокументПеремещенияТоваров(ИдЕМЕ)
	Перем Запрос, док1;
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Перемещение.Ссылка КАК Ссылка
		|ИЗ
		|	
		|РегистрСведений.EmeWmsОтметкиОбИмпортеПеремещенийТоваров КАК Перемещение
		|ГДЕ
		|	Перемещение.ID = &ИдЕМЕ";
	Запрос.УстановитьПараметр("ИдЕМЕ", ИдЕМЕ);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		док1 = Выборка.Ссылка.ПолучитьОбъект();
		Если НЕ док1.ПометкаУдаления Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Документы.ПеремещениеТоваров.ПустаяСсылка();

КонецФункции

// #IBS 21.06.2023 Создает в регистре пометку об импорте документа перемещения с номером перемещения в EME
Процедура СоздатьОтметкуОбИмпортеПеремещенияТоваров(Документ, ИдЕМЕ)
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеПеремещенийТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.ДатаИмпорта = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsОтметкиОбИмпортеПеремещенийТоваров.СоздатьМенеджерЗаписи();
	НоваяЗапись.ID = ИдЕМЕ;
	НоваяЗапись.Ссылка = Документ.Ссылка;
	НоваяЗапись.ДатаИмпорта = ТекущаяДата();
    НоваяЗапись.Записать(); 
 
КонецПроцедуры   

 #КонецОбласти

        