
&НаКлиенте
Перем КэшНаКлиенте;

&НаКлиенте
Перем КэшСтекаМетрик;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Возврат ЭтаФорма;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Отказ = Истина;
	
	ОпределитьФайловыйРежимИБ();
	
	// вычисляем при открытии, так-как используется серверный вызов
	ДоступенПараметрЗавершенияРаботыПередЗакрытием();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииОсновнойФормы() Экспорт
	
	Замер_ДлительностьСеанса_Начать();
	
	Метрика_ОкружениеНаКлиенте(Перечисление_ДействияМетрики().ОткрытиеОсновнойФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииОсновнойФормы() Экспорт
	
	Метрики_ПриЗакрытииОсновнойФормы();
	
	Кэш_Очистить();
	
КонецПроцедуры

// #Область ПрограммныйИнтерфейс

// #Область КонтурИнтеграция

&НаКлиенте
Процедура КонтурИнтеграция_ВыполнитьПодключаемуюКомандуИнтеграцииПерейти(Форма) Экспорт
	
	ОткрытьФормуМодуля();
	
	Топик = Перечисление_ТопикиМетрики().Статистика;
	Действие = Перечисление_ДействияМетрики().ОткрытиеМодуля;
	Категория = Перечисление_КатегорииМетрики().КроссПродукт;
	ОписаниеМетрики = Новый_ОписаниеМетрики(Категория, Действие);
	
	СтекМетрик_ДобавитьСобытие(Топик, ОписаниеМетрики);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтурИнтеграция_ВыполнитьПодключаемуюКомандуИнтеграции(Команда, Форма, Источник, Документ1С, ПослеВыполненияКоманды) Экспорт
	
	ДокументУчета = ДокументУчета_НайтиИлиСоздать(Документ1С, Форма);
	
	ПослеЗакрытияДокумента = ОписаниеОбработчикаОповещения("КонтурИнтеграция_ПослеЗакрытияДокумента"
	, ЭтаФорма, ПослеВыполненияКоманды);
	
	ОткрытьФормуДокументаУчета(ДокументУчета, , ПослеЗакрытияДокумента);
	
	Топик = Перечисление_ТопикиМетрики().Статистика;
	Категория = Перечисление_КатегорииМетрики().КроссПродукт;
	Действие = Перечисление_ДействияМетрики().ОткрытиеДокументаПоТребуемомуДействию;
	ТребуемоеДействие = КонтурИнтеграция_ТребуемоеДействиеПоКомандеФормы(Команда);
	
	ОписаниеМетрики = Новый_ОписаниеМетрики(Категория, Действие, , ТребуемоеДействие);
	ОписаниеМетрики.ДокументУчета = ДокументУчета;
	
	СтекМетрик_ДобавитьСобытие(Топик, ОписаниеМетрики);
	
КонецПроцедуры

// #Область КонтурИнтеграция

&НаКлиенте
Функция ВыполнитьАвторизацию(Организация, ВызывающаяФорма, ПродлеватьДоступГИС = Истина) Экспорт
	
	Если Не ПроверитьУстановленнуюВерсиюМодуля() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	КонтекстОбмена = КонтекстОбменаНаСервере(Организация, ПродлеватьДоступГИС);
	
	Результат = Авторизация_Выполнить(КонтекстОбмена);
	
	ПоказатьОшибкиСертификата(КонтекстОбмена, ВызывающаяФорма);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьОбменПоВсемОрганизациям(ВызывающаяФорма) Экспорт
	
	ОтправитьМетрики();
	
	Для каждого КонтекстОбмена Из ВсеКонтекстыДляОбмена(ВызывающаяФорма) Цикл
		
		ВыполнитьОбменССервисом(КонтекстОбмена);
		
		ПоказатьОшибкиСертификата(КонтекстОбмена, ВызывающаяФорма);
		
	КонецЦикла;
	
КонецПроцедуры

// Вызывает события ПМ для продолжения обработки нажатия дополнительной кнопки
//
// Параметры:
//  ПараметрыНажатия - Структура - см. Новый_ПараметрыНажатияДопКнопки();
//
&НаКлиенте
Процедура ПродолжитьОбработкуНажатияДопКнопки(ПараметрыНажатия) Экспорт
	
	ВызывающаяФорма = ПараметрыНажатия.ВызывающаяФорма;
	ПараметрыНажатия.ВызывающаяФорма = Неопределено;
	
	ПМ_ОбработатьСобытиеНаСервере("ПриНажатииДопКнопкиНаСервере", ПараметрыНажатия);
	ПараметрыНажатия.ВызывающаяФорма = ВызывающаяФорма;
	
	ПМ_ОбработатьСобытие("ПослеНажатияДопКнопкиНаКлиенте", ПараметрыНажатия);
	
КонецПроцедуры

&НаКлиенте
Функция ФичаФлагВключен(ФичаФлаг) Экспорт
	
	ФичаФлагиВключения = Перечисление_ФичаФлагиВключения();
	ФичаФлагиОтключения = Перечисление_ФичаФлагиОтключения();
	
	Результат = Ложь;
	
	Если ЕстьЗначениеВСтруктуре(ФичаФлагиВключения, ФичаФлаг) Тогда
		Результат = ОтложеннуюФункциюМожноИспользовать(ФичаФлаг);
	КонецЕсли;
	
	Если ЕстьЗначениеВСтруктуре(ФичаФлагиОтключения, ФичаФлаг) Тогда
		Результат = Не ВременнуюФункциюНужноОтключить(ФичаФлаг);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОтложеннуюФункциюМожноИспользовать(ИмяФункции) Экспорт
	
	ДатаВключения = СвойствоСтруктуры(СписокОтложенныхФункций().ДатыВключения, ИмяФункции, '00010101');
	
	Возврат (ТекущаяДата() >= ДатаВключения);
	
КонецФункции

&НаКлиенте
Функция ВременнуюФункциюНужноОтключить(ИмяФункции) Экспорт
	
	ДатаОтключения = СвойствоСтруктуры(СписокВременныхФункций().ДатыОтключения, ИмяФункции, '00010101');
	
	Возврат (ТекущаяДата() >= ДатаОтключения);
	
КонецФункции

&НаКлиенте
Функция ЗначенияРеквизитовОбъекта_Марк(Ссылка, Реквизиты) Экспорт
	
	Возврат ЗначенияРеквизитовОбъектаНаСервере(Ссылка, Реквизиты);
	
КонецФункции

&НаКлиенте
Функция ЗначениеРеквизитаОбъекта_Марк(Ссылка, ИмяРеквизита) Экспорт
	
	Возврат ЗначениеРеквизитаОбъектаНаСервере(Ссылка, ИмяРеквизита);
	
КонецФункции

&НаКлиенте
Процедура ПоказатьДиалогВопроса(ОписаниеОбработчика, ТекстВопроса, Кнопки = Неопределено, ЗаголовокДиалога = "") Экспорт
	
	Если Кнопки = Неопределено Тогда
		Кнопки = РежимДиалогаВопрос.ДаНетОтмена;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗаголовокДиалога) Тогда
		ЗаголовокДиалога = НаименованиеМодуля();
	КонецЕсли;
	
	Если ДоступныАсинхронныеФормы() Тогда
		ОповещениеОЗакрытии = НовоеОписаниеОповещения(ОписаниеОбработчика);
		Выполнить("ПоказатьВопрос(ОповещениеОЗакрытии, ТекстВопроса, Кнопки, , , ЗаголовокДиалога)");
	Иначе
		Ответ = Вопрос(ТекстВопроса, Кнопки, , , ЗаголовокДиалога);
		ВызватьОбработчикОповещения(ОписаниеОбработчика, Ответ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтурПлагины_ОбработатьСлужебнуюКоманду(ИмяКоманды, ПараметрыКоманды) Экспорт
	
	СлужебныеКоманды = Перечисление_СлужебныеКомандыБиблиотекиПлагинов();
	
	КонтурПлагины_ОбработатьСлужебнуюКомандуНаСервере(ИмяКоманды, ПараметрыКоманды);
	
КонецПроцедуры

&НаСервере
Процедура КонтурПлагины_ОбработатьСлужебнуюКомандуНаСервере(ИмяКоманды, ПараметрыКоманды)
	
	МодульОбъекта().КонтурПлагины_ОбработатьСлужебнуюКоманду(ИмяКоманды, ПараметрыКоманды);
	
КонецПроцедуры

// Контракт описания обработчика оповещения
//
// Параметры:
//  Обработчик - Строка - имя обработчика;
//  Модуль - ФормаКлиентскогоПриложения - форма, в которой расположен модуль обработчика;
//  ДопПараметры - Структура - доп параметры для
// 
// Возвращаемое значение:
//  Структура - содержит входящие параметры
//
&НаКлиенте
Функция ОписаниеОбработчикаОповещения(Обработчик, Модуль, ДопПараметры = Неопределено) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Модуль", Модуль);
	Результат.Вставить("Обработчик", Обработчик);
	Результат.Вставить("ДопПараметры", ДопПараметры);
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что в базе можно асинхронно открывать формы с подключением обработчика оповещения
// 
// Возвращаемое значение:
//  Булево - Истина, если использовать асинхронное открытие форм можно
//
&НаКлиенте
Функция ДоступныАсинхронныеФормы() Экспорт
	
	Возврат Не ВерсияРежимаСовместимостиНиже("8.3.3");
	
КонецФункции

// Создает описание оповещения
//
// Параметры:
//  ОписаниеОбработчика - Структура - см. ОписаниеОбработчикаОповещения()
// 
// Возвращаемое значение:
//  ОписаниеОповещения - описание оповещения;
//  Неопределено - если описания обработчика нет;
//
&НаКлиенте
Функция НовоеОписаниеОповещения(ОписаниеОбработчика) Экспорт
	
	Если ОписаниеОбработчика = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(ОписаниеОбработчика) = Тип("ОписаниеОповещения") Тогда
		Возврат ОписаниеОбработчика;
	КонецЕсли;
	
	ПараметрыОповещения = Новый Массив;
	ПараметрыОповещения.Добавить(ОписаниеОбработчика.Обработчик);
	ПараметрыОповещения.Добавить(ОписаниеОбработчика.Модуль);
	ПараметрыОповещения.Добавить(ОписаниеОбработчика.ДопПараметры);
	
	Результат = Новый("ОписаниеОповещения", ПараметрыОповещения);
	
	Возврат Результат;
	
КонецФункции

// Вызывает экспортный метод в модуле
//
// Параметры:
//  ОписаниеОбработчика - Структура - см ОписаниеОбработчикаОповещения();
//  Результат - Произвольный - (необязательный) результат, который нужно передать в обработчик;
//
&НаКлиенте
Процедура ВызватьОбработчикОповещения(ОписаниеОбработчика, Результат = NULL) Экспорт
	
	Если ОписаниеОбработчика = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДоступныАсинхронныеФормы() Тогда
		
		Оповещение = НовоеОписаниеОповещения(ОписаниеОбработчика);
		
		Если Результат = NULL Тогда
			СтрокаКоманды = "ВыполнитьОбработкуОповещения(Оповещение)";
		Иначе
			СтрокаКоманды = "ВыполнитьОбработкуОповещения(Оповещение, Результат)";
		КонецЕсли;
		
		Выполнить(СтрокаКоманды);
		
	Иначе
		
		ПараметрыОповещения = Новый Структура;
		ПараметрыОповещения.Вставить("Результат", Результат);
		ПараметрыОповещения.Вставить("ОписаниеОбработчика", ОписаниеОбработчика);
		Кэш_Поместить("ПараметрыВызоваОбработчикаОповещенияОФ", ПараметрыОповещения);
		
		ПодключитьОбработчикОжидания("ВызватьОбработчикОповещенияОФ", 0.1, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВызватьОбработчикОповещенияОФ()
	
	ПараметрыОповещения = Кэш_Прочитать("ПараметрыВызоваОбработчикаОповещенияОФ");
	Кэш_Поместить("ПараметрыВызоваОбработчикаОповещенияОФ", Неопределено);
	
	Результат = ПараметрыОповещения.Результат;
	ОписаниеОбработчика = ПараметрыОповещения.ОписаниеОбработчика;
	
	Модуль = ОписаниеОбработчика.Модуль;
	Обработчик = ОписаниеОбработчика.Обработчик;
	ДопПараметры = ОписаниеОбработчика.ДопПараметры;
	
	Если Результат = NULL Тогда
		СтрокаКоманды = "Модуль." + Обработчик + "(ДопПараметры)";
	Иначе
		СтрокаКоманды = "Модуль." + Обработчик + "(Результат, ДопПараметры)";
	КонецЕсли;
	
	Выполнить(СтрокаКоманды);
	
КонецПроцедуры

// Формирует сообщение об ошибке привязанное к ячейке табличной части
//
// Параметры:
//  ТекстОшибки - Строка - текст ошибки;
//  ИдентификаторФормы - УникальныйИдентификатор - идентификатор формы, к которой должно быть "привязано" сообщение;
//  ТаблицаФормы - ТаблицаФормы - таблица, к которой должно быть "привязано" сообщение;
//  ИмяКолонки   - Строка - имя колонки, к которой должно быть "привязано" сообщение;
//  ИндексСтроки - Число  - индекс строки, к которой должно быть "привязано" сообщение;
//
&НаКлиенте
Процедура СообщитьОбОшибкеВСтрокеТабЧасти(ТекстОшибки
	, ИдентификаторФормы
	, ТаблицаФормы
	, ИмяКолонки
	, ИндексСтроки) Экспорт
	
	Если ВерсияПлатформыНиже("8.3") Тогда
		НомерСтроки = ИндексСтроки + 1;
		ТекстСообщения = ПараметрыВСтроку(НСтр(
		"ru = 'В таб. части ""%1"" в строке %2: %3'"), ТаблицаФормы.Заголовок, НомерСтроки, ТекстОшибки);
		СообщитьПользователюЛок(ТекстСообщения, ИдентификаторФормы);
	Иначе
		Индекс = Формат(ИндексСтроки, "ЧН=0; ЧГ=0");
		ПолеФормы = ПараметрыВСтроку("%1[%2].%3", ТаблицаФормы.Имя, Индекс, ИмяКолонки);
		СообщитьПользователюЛок(ТекстОшибки, ИдентификаторФормы, ПолеФормы);
	КонецЕсли;
	
КонецПроцедуры

// #Область ПрограммныеПеречисления

&НаКлиенте
Функция Перечисление_ТипыОпераций() Экспорт
	
	КлючКэш = "ТипыОпераций";
	
	Результат = Кэш_Прочитать(КлючКэш);
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_ТипыОперацийНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_ТипыОперацийНаСервере()
	
	Возврат МодульОбъекта().Перечисление_ТипыОпераций();
	
КонецФункции

&НаКлиенте
Функция Перечисление_РазмещениеДополнительныхКнопок() Экспорт
	
	КлючКэш = "РазмещениеДополнительныхКнопок";
	
	Результат = Кэш_Прочитать(КлючКэш);
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_РазмещениеДополнительныхКнопокНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_РазмещениеДополнительныхКнопокНаСервере()
	
	Возврат МодульОбъекта().Перечисление_РазмещениеДополнительныхКнопок();
	
КонецФункции

// #КонецОбласти // ПрограммныеПеречисления

// #КонецОбласти // ПрограммныйИнтерфейс

// #Область СлужебныйПрограммныйИнтерфейс

// Находит или создает документ учета в маркировке по документу 1С
//
// Параметры:
//  Документ1С - ДокументСсылка - документ 1С;
// 
// Возвращаемое значение:
//  СправочникСсылка.КонтурМаркировка_ДокументыУчета - документ учета;
//
&НаКлиенте
Функция НайтиИлиСоздатьДокументУчетаПоДокументу1С(Документ1С, ВызывающаяФорма) Экспорт
	
	Возврат ДокументУчета_НайтиИлиСоздать(Документ1С, ВызывающаяФорма);
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуДокументаУчета(ДокументУчетаСсылка, Владелец = Неопределено, ОбработчкиПослеЗакрытия = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура("Ссылка", ДокументУчетаСсылка);
	ОткрытьФормуОбработки("Форма_ДокументУчета", Владелец, ПараметрыФормы, ОбработчкиПослеЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСпискаКоэффициентовПересчета(Владелец = Неопределено) Экспорт
	
	ОткрытьФормуОбработки("Форма_КоэффициентыПересчета_Список", Владелец);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуКоэффициентаПересчета(КлючНоменклатуры1С, Владелец = Неопределено, Копирование = Ложь) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Копирование", Копирование);
	ПараметрыФормы.Вставить("КлючНоменклатуры1С", КлючНоменклатуры1С);
	
	ОткрытьФормуОбработкиМодально("Форма_КоэффициентПересчета", Владелец, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСпискаНастроекПодписания(Владелец = Неопределено) Экспорт
	
	ОткрытьФормуОбработкиМодально("Форма_НастройкаПодписания_Список", Владелец);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастройкиПодписания(ПараметрыФормы = Неопределено
	, Владелец = Неопределено
	, ОписаниеОбработчика = Неопределено) Экспорт
	
	ОткрытьФормуОбработкиМодально("Форма_НастройкаПодписания", Владелец, ПараметрыФормы, ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСертификата(Сертификат, Владелец = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ссылка", Сертификат);
	
	ОткрытьФормуОбработкиМодально("Форма_Сертификат", Владелец, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораСертификата(ОтпечатокСертификата
	, ВидСертификата = Неопределено
	, Владелец = Неопределено
	, ОписаниеОбработчика = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ВидСертификата", ВидСертификата);
	ПараметрыФормы.Вставить("ОтпечатокСертификата", ОтпечатокСертификата);
	
	ОткрытьФормуОбработкиМодально("Форма_Сертификаты_Список", Владелец, ПараметрыФормы, ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОпросаПользователя(ПараметрыФормы, Владелец = Неопределено, ОписаниеОбработчика = Неопределено) Экспорт
	
	ОткрытьФормуОбработкиМодально("Форма_ОпросПользователя", Владелец, ПараметрыФормы, ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуЗагрузкиКодов(Владелец, ОписаниеОбработчика, РежимСканера = Ложь, ДляУдаления = Ложь) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимСканера", РежимСканера);
	ПараметрыФормы.Вставить("ДляУдаления", ДляУдаления);
	
	ОткрытьФормуОбработкиМодально("Форма_ЗагрузкаКодов", Владелец, ПараметрыФормы, ОписаниеОбработчика);
	
КонецПроцедуры

// #КонецОбласти // СлужебныйПрограммныйИнтерфейс

// Кэш

&НаКлиенте
Функция Кэш_Прочитать(Ключ)
	
	Если ЗначениеЗаполнено(КэшНаКлиенте) Тогда
		Результат = КэшНаКлиенте.Получить(Ключ);
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Кэш_Поместить(Ключ, Значение)
	
	Если КэшНаКлиенте = Неопределено Тогда
		КэшНаКлиенте = Новый Соответствие;
	КонецЕсли;
	
	КэшНаКлиенте.Вставить(Ключ, Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура Кэш_Очистить()
	
	Если ЗначениеЗаполнено(КэшНаКлиенте) Тогда
		КэшНаКлиенте.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьКэш() Экспорт
	
	Кэш_Очистить();
	СброситьКэшНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СброситьКэшНаСервере()
	
	МодульОбъекта().СброситьКэш();
	
КонецПроцедуры

// Настройки модуля

&НаКлиенте
Функция НастройкиМодуля(ОбновитьКэш = Ложь) Экспорт
	
	КлючКэш = "НастройкиМодуля";
	Результат = Кэш_Прочитать(КлючКэш);
	Если Результат <> Неопределено И Не ОбновитьКэш Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = НастройкиМодуляНаСервере(ОбновитьКэш);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Если ОбновитьКэш Тогда
		Оповестить("КонтурМаркировка_НастройкиМодуля_Обновлены");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция НастройкиМодуляНаСервере(ОбновитьКэш)
	
	Возврат МодульОбъекта().НастройкиМодуля(ОбновитьКэш);
	
КонецФункции

&НаКлиенте
Процедура НастройкиМодуля_Записать(НовыеНастройки, ВызывающаяФорма = Неопределено) Экспорт
	
	НастройкиМодуля_ЗаписатьНаСервере(НовыеНастройки);
	
	Кэш_Очистить();
	
	Оповестить("КонтурМаркировка_НастройкиМодуля_Обновлены", , ВызывающаяФорма);
	
КонецПроцедуры

&НаСервере
Процедура НастройкиМодуля_ЗаписатьНаСервере(НовыеНастройки)
	
	МодульОбъекта().НастройкиМодуля_Записать(НовыеНастройки);
	
	Действие = МодульОбъекта().Перечисление_ДействияМетрики().ЗаписьВБазу;
	МодульОбъекта().Метрика_НастройкиМодуля(Действие);
	МодульОбъекта().Метрики_ДопПараметрыЭтикеток(Действие);
	
	Функциональность = МодульОбъекта().Перечисление_ФункциональностьМодуля().ДопКолонокиВСпискеДокументов;
	МодульОбъекта().СтекМетрик_УдалитьФункциональность(Функциональность);
	
КонецПроцедуры

// #Область СтараяВерсияМодуля

&НаСервере
Процедура СтараяВерсияМодуля_Записать(ВерсияМодуля)
	
	МодульОбъекта().СтараяВерсияМодуля_Записать(ВерсияМодуля);
	
КонецПроцедуры

// #КонецОбласти // СтараяВерсияМодуля

// #Область УстановленнаяВерсияМодуля

&НаКлиенте
Функция ПроверитьУстановленнуюВерсиюМодуля() Экспорт
	
	РезультатПроверки = ПроверитьУстановленнуюВерсиюМодуляНаСервере();
	Если Не РезультатПроверки.Успешно Тогда
		ПоказатьОшибкуПроверкиУстановленнойВерсииМодуля(РезультатПроверки);
	КонецЕсли;
	
	Возврат РезультатПроверки.Успешно;
	
КонецФункции

&НаСервере
Функция ПроверитьУстановленнуюВерсиюМодуляНаСервере()
	
	Возврат МодульОбъекта().ПроверитьУстановленнуюВерсиюМодуля();
	
КонецФункции

&НаКлиенте
Процедура ПоказатьОшибкуПроверкиУстановленнойВерсииМодуля(РезультатПроверки)
	
	ОписаниеОбработчика = ОписаниеОбработчикаОповещения(
	"ПослеОтображенияОшибкиУстановленнойВерсииМодуля",
	ЭтаФорма);
	
	ЗаголовокВопроса = НСтр("ru = 'Проверка версии модуля'");
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить("ЗакрытьМодуль", НСтр("ru = 'Закрыть'"));
	
	Если РезультатПроверки.ПоказатьКнопкуПерезапуска Тогда
		Кнопки.Добавить("Перезапустить1С", НСтр("ru = 'Перезапустить 1С'"));
	КонецЕсли;
	
	ПоказатьДиалогВопроса(
	ОписаниеОбработчика,
	РезультатПроверки.ТекстСообщения,
	Кнопки,
	ЗаголовокВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтображенияОшибкиУстановленнойВерсииМодуля(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Результат = "Перезапустить1С" Тогда
		ЗавершитьРаботуСистемы(Ложь, Истина);
	КонецЕсли;
	
	Если Результат = "ЗакрытьМодуль" Тогда
		Оповестить("КонтурМаркировка_ПринудительноЗакрытьМодуль");
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти // УстановленнаяВерсияМодуля

// Временные и отложенные функции

&НаКлиенте
Функция СписокВременныхФункций()
	
	КлючКэш = "СписокВременныхФункций";
	Результат = Кэш_Прочитать(КлючКэш);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = СписокВременныхФункцийНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция СписокВременныхФункцийНаСервере()
	
	Возврат МодульОбъекта().СписокВременныхФункций();
	
КонецФункции

&НаКлиенте
Функция СписокОтложенныхФункций()
	
	КлючКэш = "СписокОтложенныхФункций";
	Результат = Кэш_Прочитать(КлючКэш);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = СписокОтложенныхФункцийНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция СписокОтложенныхФункцийНаСервере()
	
	Возврат МодульОбъекта().СписокОтложенныхФункций();
	
КонецФункции

&НаКлиенте
Процедура СписокОтложенныхФункций_Записать(СписокФункций) Экспорт
	
	СписокОтложенныхФункций_ЗаписатьНаСервере(СписокФункций);
	
КонецПроцедуры

&НаСервере
Процедура СписокОтложенныхФункций_ЗаписатьНаСервере(СписокФункций)
	
	МодульОбъекта().СписокОтложенныхФункций_Записать(СписокФункций);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВременныхФункций_Записать(СписокФункций) Экспорт
	
	СписокВременныхФункций_ЗаписатьНаСервере(СписокФункций);
	
КонецПроцедуры

&НаСервере
Процедура СписокВременныхФункций_ЗаписатьНаСервере(СписокФункций)
	
	МодульОбъекта().СписокВременныхФункций_Записать(СписокФункций);
	
КонецПроцедуры

&НаКлиенте
Функция Новый_СписокОтложенныхФункций() Экспорт
	
	Возврат Новый_СписокОтложенныхФункцийНаСервере();
	
КонецФункции

&НаСервере
Функция Новый_СписокОтложенныхФункцийНаСервере()
	
	Возврат МодульОбъекта().Новый_СписокОтложенныхФункций();
	
КонецФункции

&НаКлиенте
Функция Новый_СписокВременныхФункций() Экспорт
	
	Возврат Новый_СписокВременныхФункцийНаСервере();
	
КонецФункции

&НаСервере
Функция Новый_СписокВременныхФункцийНаСервере()
	
	Возврат МодульОбъекта().Новый_СписокВременныхФункций();
	
КонецФункции

// Переход на новую версию модуля

&НаКлиенте
Функция НеобходимоПерейтиНаНовуюВерсиюДанных() Экспорт
	
	Возврат НеобходимоПерейтиНаНовуюВерсиюДанныхНаСервере();
	
КонецФункции

&НаСервере
Функция НеобходимоПерейтиНаНовуюВерсиюДанныхНаСервере()
	
	Возврат МодульОбъекта().НеобходимоПерейтиНаНовуюВерсиюДанных();
	
КонецФункции

&НаКлиенте
Функция ТребуемаяВерсияДанныхПодсистемы() Экспорт
	
	Возврат ТребуемаяВерсияДанныхПодсистемыНаСервере();
	
КонецФункции

&НаСервере
Функция ТребуемаяВерсияДанныхПодсистемыНаСервере()
	
	Возврат МодульОбъекта().ТребуемаяВерсияДанныхПодсистемы();
	
КонецФункции


// Программные перечисления

&НаКлиенте
Функция Перечисление_СпособыВводаВОборот() Экспорт
	
	КлючКэш = "СпособыВводаВОборот";
	
	Результат = Кэш_Прочитать(КлючКэш);
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_СпособыВводаВОборотНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_СпособыВводаВОборотНаСервере()
	
	Возврат МодульОбъекта().Перечисление_СпособыВводаВОборот();
	
КонецФункции

&НаКлиенте
Функция Перечисление_СпособыВыпускаТоваров() Экспорт
	
	КлючКэш = "СпособыВыпускаТоваров";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_СпособыВыпускаТоваровНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_СпособыВыпускаТоваровНаСервере()
	
	Возврат МодульОбъекта().Перечисление_СпособыВыпускаТоваров();
	
КонецФункции

&НаКлиенте
Функция Перечисление_СтатусыОпераций() Экспорт
	
	КлючКэш = "СтатусыОпераций";
	
	Результат = Кэш_Прочитать(КлючКэш);
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_СтатусыОперацийНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_СтатусыОперацийНаСервере()
	
	Возврат МодульОбъекта().Перечисление_СтатусыОпераций();
	
КонецФункции

&НаКлиенте
Функция Перечисление_ТребуемыеДействия() Экспорт
	
	КлючКэш = "ТребуемыеДействия";
	
	Результат = Кэш_Прочитать(КлючКэш);
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_ТребуемыеДействияНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_ТребуемыеДействияНаСервере()
	
	Возврат МодульОбъекта().Перечисление_ТребуемыеДействия();
	
КонецФункции

&НаКлиенте
Функция Перечисление_СтатусыДокументовУчета() Экспорт
	
	КлючКэш = "СтатусыДокументовУчета";
	
	Результат = Кэш_Прочитать(КлючКэш);
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_СтатусыДокументовУчетаНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_СтатусыДокументовУчетаНаСервере()
	
	Возврат МодульОбъекта().Перечисление_СтатусыДокументовУчета();
	
КонецФункции

&НаКлиенте
Функция Перечисление_ТребуемыеДействияДокументовУчета() Экспорт
	
	КлючКэш = "ТребуемыеДействияДокументовУчета";
	
	Результат = Кэш_Прочитать(КлючКэш);
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_ТребуемыеДействияДокументовУчетаНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_ТребуемыеДействияДокументовУчетаНаСервере()
	
	Возврат МодульОбъекта().Перечисление_ТребуемыеДействияДокументовУчета();
	
КонецФункции

&НаКлиенте
Функция Перечисление_ТипыФайлов()
	
	КлючКэш = "ТипыФайлов";
	
	Результат = Кэш_Прочитать(КлючКэш);
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_ТипыФайловНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_ТипыФайловНаСервере()
	
	Возврат МодульОбъекта().Перечисление_ТипыФайлов();
	
КонецФункции

&НаКлиенте
Функция Перечисление_ВариантыРасположенияОбработки() Экспорт
	
	КлючКэш = "ВариантыРасположенияОбработки";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_ВариантыРасположенияОбработкиНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_ВариантыРасположенияОбработкиНаСервере()
	
	Возврат МодульОбъекта().Перечисление_ВариантыРасположенияОбработки();
	
КонецФункции

&НаКлиенте
Функция Перечисление_ФорматыФайловСКодами() Экспорт
	
	КлючКэш = "ФорматыФайловСКодами";
	
	Результат = Кэш_Прочитать(КлючКэш);
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_ФорматыФайловСКодамиНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_ФорматыФайловСКодамиНаСервере()
	
	Возврат МодульОбъекта().Перечисление_ФорматыФайловСКодами();
	
КонецФункции

&НаКлиенте
Функция Перечисление_ТипыФайловСКодами() Экспорт
	
	КлючКэш = "ТипыФайловСКодами";
	
	Результат = Кэш_Прочитать(КлючКэш);
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_ТипыФайловСКодамиНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_ТипыФайловСКодамиНаСервере()
	
	Возврат МодульОбъекта().Перечисление_ТипыФайловСКодами();
	
КонецФункции

&НаКлиенте
Функция Перечисление_ПринятыеРешения() Экспорт
	
	КлючКэш = "ПринятыеРешения";
	
	Результат = Кэш_Прочитать(КлючКэш);
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_ПринятыеРешенияНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_ПринятыеРешенияНаСервере()
	
	Возврат МодульОбъекта().Перечисление_ПринятыеРешения();
	
КонецФункции

&НаКлиенте
Функция Перечисление_ВидыДокументовОбязательнойСертификации() Экспорт
	
	КлючКэш = "ВидыДокументовОбязательнойСертификации";
	
	Результат = Кэш_Прочитать(КлючКэш);
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_ВидыДокументовОбязательнойСертификацииНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_ВидыДокументовОбязательнойСертификацииНаСервере()
	
	Возврат МодульОбъекта().Перечисление_ВидыДокументовОбязательнойСертификации();
	
КонецФункции

&НаКлиенте
Функция Перечисление_ТипыПроизводственныхЗаказов() Экспорт
	
	КлючКэш = "ТипыПроизводственныхЗаказов";
	
	Результат = Кэш_Прочитать(КлючКэш);
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_ТипыПроизводственныхЗаказовНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_ТипыПроизводственныхЗаказовНаСервере()
	
	Возврат МодульОбъекта().Перечисление_ТипыПроизводственныхЗаказов();
	
КонецФункции

&НаКлиенте
Функция Перечисление_ВидыПервичныхДокументов() Экспорт
	
	КлючКэш = "ВидыПервичныхДокументов";
	
	Результат = Кэш_Прочитать(КлючКэш);
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_ВидыПервичныхДокументовНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_ВидыПервичныхДокументовНаСервере()
	
	Возврат МодульОбъекта().Перечисление_ВидыПервичныхДокументов();
	
КонецФункции

&НаКлиенте
Функция Перечисление_ПричиныВыводаИзОборота() Экспорт
	
	КлючКэш = "ПричиныВыводаИзОборота";
	
	Результат = Кэш_Прочитать(КлючКэш);
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_ПричиныВыводаИзОборотаНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_ПричиныВыводаИзОборотаНаСервере()
	
	Возврат МодульОбъекта().Перечисление_ПричиныВыводаИзОборота();
	
КонецФункции

&НаКлиенте
Функция Перечисление_ПричиныПеремаркировки() Экспорт
	
	КлючКэш = "ПричиныПеремаркировки";
	
	Результат = Кэш_Прочитать(КлючКэш);
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_ПричиныПеремаркировкиНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_ПричиныПеремаркировкиНаСервере()
	
	Возврат МодульОбъекта().Перечисление_ПричиныПеремаркировки();
	
КонецФункции

&НаКлиенте
Функция Перечисление_ТипыОтгрузок() Экспорт
	
	КлючКэш = "ТипыОтгрузок";
	
	Результат = Кэш_Прочитать(КлючКэш);
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_ТипыОтгрузокНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_ТипыОтгрузокНаСервере()
	
	Возврат МодульОбъекта().Перечисление_ТипыОтгрузок();
	
КонецФункции

&НаКлиенте
Функция Перечисление_ПричиныВыводаИзОборотаПриОтгрузке() Экспорт
	
	КлючКэш = "ПричиныВыводаИзОборотаПриОтгрузке";
	
	Результат = Кэш_Прочитать(КлючКэш);
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_ПричиныВыводаИзОборотаПриОтгрузкеНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_ПричиныВыводаИзОборотаПриОтгрузкеНаСервере()
	
	Возврат МодульОбъекта().Перечисление_ПричиныВыводаИзОборотаПриОтгрузке();
	
КонецФункции

&НаКлиенте
Функция Перечисление_ТипыИспользованияКодов() Экспорт
	
	КлючКэш = "ТипыИспользованияКодов";
	
	Результат = Кэш_Прочитать(КлючКэш);
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_ТипыИспользованияКодовНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_ТипыИспользованияКодовНаСервере()
	
	Возврат МодульОбъекта().Перечисление_ТипыИспользованияКодов();
	
КонецФункции

&НаКлиенте
Функция Перечисление_ПричиныВыбытияКодов() Экспорт
	
	КлючКэш = "ПричиныВыбытияКодов";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_ПричиныВыбытияКодовНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_ПричиныВыбытияКодовНаСервере()
	
	Возврат МодульОбъекта().Перечисление_ПричиныВыбытияКодов();
	
КонецФункции

&НаКлиенте
Функция Перечисление_ИменаКартинокШтрихкодов()
	
	КлючКэш = "ИменаКартинокШтрихкодов";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_ИменаКартинокШтрихкодовНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_ИменаКартинокШтрихкодовНаСервере()
	
	Возврат МодульОбъекта().Перечисление_ИменаКартинокШтрихкодов();
	
КонецФункции

&НаКлиенте
Функция Перечисление_ПериодичностьВыполненияЗаданий() Экспорт
	
	КлючКэш = "ПериодичностьВыполненияЗаданий";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_ПериодичностьВыполненияЗаданийНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_ПериодичностьВыполненияЗаданийНаСервере()
	
	Возврат МодульОбъекта().Перечисление_ПериодичностьВыполненияЗаданий();
	
КонецФункции

&НаКлиенте
Функция Перечисление_ТопикиМетрики() Экспорт
	
	КлючКэш = "ТопикиМетрики";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_ТопикиМетрикиНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_ТопикиМетрикиНаСервере()
	
	Возврат МодульОбъекта().Перечисление_ТопикиМетрики();
	
КонецФункции

&НаКлиенте
Функция Перечисление_КатегорииМетрики() Экспорт
	
	КлючКэш = "КатегорииМетрики";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_КатегорииМетрикиНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_КатегорииМетрикиНаСервере()
	
	Возврат МодульОбъекта().Перечисление_КатегорииМетрики();
	
КонецФункции

&НаКлиенте
Функция Перечисление_ДействияМетрики() Экспорт
	
	КлючКэш = "ДействияМетрики";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_ДействияМетрикиНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_ДействияМетрикиНаСервере()
	
	Возврат МодульОбъекта().Перечисление_ДействияМетрики();
	
КонецФункции

&НаКлиенте
Функция Перечисление_ТипыУведомлений() Экспорт
	
	КлючКэш = "ТипыУведомлений";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_ТипыУведомленийНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_ТипыУведомленийНаСервере()
	
	Возврат МодульОбъекта().Перечисление_ТипыУведомлений();
	
КонецФункции

&НаКлиенте
Функция Перечисление_ВидыПродукции() Экспорт
	
	КлючКэш = "ВидыПродукции";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_ВидыПродукцииНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_ВидыПродукцииНаСервере()
	
	Возврат МодульОбъекта().Перечисление_ВидыПродукции();
	
КонецФункции

&НаКлиенте
Функция Перечисление_ТипыКодовМаркировки() Экспорт
	
	КлючКэш = "ТипыКодовМаркировки";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_ТипыКодовМаркировкиНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_ТипыКодовМаркировкиНаСервере()
	
	Возврат МодульОбъекта().Перечисление_ТипыКодовМаркировки();
	
КонецФункции

&НаКлиенте
Функция Перечисление_СтатусыСверкиНаТСД() Экспорт
	
	КлючКэш = "СтатусыСверкиНаТСД";
	
	Результат = Кэш_Прочитать(КлючКэш);
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_СтатусыСверкиНаТСДНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_СтатусыСверкиНаТСДНаСервере()
	
	Возврат МодульОбъекта().Перечисление_СтатусыСверкиНаТСД();
	
КонецФункции

&НаКлиенте
Функция Перечисление_СтатусыТовараНаСверке() Экспорт
	
	КлючКэш = "СтатусыТовараНаСверке";
	
	Результат = Кэш_Прочитать(КлючКэш);
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_СтатусыТовараНаСверкеНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_СтатусыТовараНаСверкеНаСервере()
	
	Возврат МодульОбъекта().Перечисление_СтатусыТовараНаСверке();
	
КонецФункции

&НаКлиенте
Функция Перечисление_ВидыСертификатов() Экспорт
	
	КлючКэш = "ВидыСертификатов";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_ВидыСертификатовНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_ВидыСертификатовНаСервере()
	
	Возврат МодульОбъекта().Перечисление_ВидыСертификатов();
	
КонецФункции

&НаКлиенте
Функция Перечисление_ТипыИсходныхОтгрузок() Экспорт
	
	КлючКэш = "ТипыИсходныхОтгрузок";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_ТипыИсходныхОтгрузокНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_ТипыИсходныхОтгрузокНаСервере()
	
	Возврат МодульОбъекта().Перечисление_ТипыИсходныхОтгрузок();
	
КонецФункции

&НаКлиенте
Функция Перечисление_СвойстваОбъектов1С() Экспорт
	
	КлючКэш = "СвойстваОбъектов1С";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_СвойстваОбъектов1СНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_СвойстваОбъектов1СНаСервере()
	
	Возврат МодульОбъекта().Перечисление_СвойстваОбъектов1С();
	
КонецФункции

&НаКлиенте
Функция Перечисление_ТипыСроковГодности() Экспорт
	
	КлючКэш = "ТипыСроковГодности";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_ТипыСроковГодностиНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_ТипыСроковГодностиНаСервере()
	
	Возврат МодульОбъекта().Перечисление_ТипыСроковГодности();
	
КонецФункции

&НаКлиенте
Функция ОформлениеУведомлений() Экспорт
	
	КлючКэш = "ОформлениеУведомлений";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ОформлениеУведомленийНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ОформлениеУведомленийНаСервере()
	
	Возврат МодульОбъекта().ОформлениеУведомлений();
	
КонецФункции

&НаСервере
Функция ВсеВидыПродукцииНаСервере(Исключения = Неопределено)
	
	Возврат МодульОбъекта().ВсеВидыПродукции(Исключения);
	
КонецФункции

&НаКлиенте
Функция Перечисление_ПричиныВозвратаВОборот() Экспорт
	
	КлючКэш = "ПричиныВозвратаВОборот";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_ПричиныВозвратаВОборотНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_ПричиныВозвратаВОборотНаСервере()
	
	Возврат МодульОбъекта().Перечисление_ПричиныВозвратаВОборот();
	
КонецФункции

&НаКлиенте
Функция ДопустимыеПричиныВозвратаВОборот(ВидПродукции) Экспорт
	
	КлючКэш = "ДопустимыеПричиныВозвратаВОборот: " + ВидПродукции;
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ДопустимыеПричиныВозвратаВОборотНаСервере(ВидПродукции);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДопустимыеПричиныВозвратаВОборотНаСервере(ВидПродукции)
	
	Возврат МодульОбъекта().ДопустимыеПричиныВозвратаВОборот(ВидПродукции);
	
КонецФункции

&НаКлиенте
Функция ДопустимыеВидыПродукцииДляВидаКорректируемыхСведений(ВидСведений) Экспорт
	
	КлючКэш = "ДопустимыеВидыПродукцииДляВидаКорректируемыхСведений: " + ВидСведений;
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ДопустимыеВидыПродукцииДляВидаКорректируемыхСведенийНаСервере(ВидСведений);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДопустимыеВидыПродукцииДляВидаКорректируемыхСведенийНаСервере(ВидСведений)
	
	Возврат МодульОбъекта().ДопустимыеВидыПродукцииДляВидаКорректируемыхСведений(ВидСведений);
	
КонецФункции

&НаКлиенте
Функция ДопустимыеВидыКорректируемыхСведенийОКодах(ВидПродукции) Экспорт
	
	КлючКэш = "ДопустимыеВидыКорректируемыхСведенийОКодах: " + ВидПродукции;
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ДопустимыеВидыКорректируемыхСведенийОКодахНаСервере(ВидПродукции);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДопустимыеВидыКорректируемыхСведенийОКодахНаСервере(ВидПродукции)
	
	Возврат МодульОбъекта().ДопустимыеВидыКорректируемыхСведенийОКодах(ВидПродукции);
	
КонецФункции

&НаКлиенте
Функция ДопустимыеВидыПервичныхДокументовДляВозвратаВОборот() Экспорт
	
	КлючКэш = "ДопустимыеВидыПервичныхДокументовДляВозвратаВОборот";
	
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ДопустимыеВидыПервичныхДокументовДляВозвратаВОборотНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДопустимыеВидыПервичныхДокументовДляВозвратаВОборотНаСервере()
	
	Возврат МодульОбъекта().ДопустимыеВидыПервичныхДокументовДляВозвратаВОборот();
	
КонецФункции

&НаКлиенте
Функция ДопустимыеВидыПродукцииДляСообщенияОбОтгрузке(ТипОтгрузки, ОбъемноСортовойУчет) Экспорт
	
	КлючКэш = "ДопустимыеВидыПродукцииДляСообщенияОбОтгрузке: " + ТипОтгрузки + ", " + ОбъемноСортовойУчет;
	
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ДопустимыеВидыПродукцииДляСообщенияОбОтгрузкеНаСервере(ТипОтгрузки, ОбъемноСортовойУчет);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДопустимыеВидыПродукцииДляСообщенияОбОтгрузкеНаСервере(ТипОтгрузки, ОбъемноСортовойУчет)
	
	Возврат МодульОбъекта().ДопустимыеВидыПродукцииДляСообщенияОбОтгрузке(ТипОтгрузки, ОбъемноСортовойУчет);
	
КонецФункции

&НаКлиенте
Функция ДопустимыеСтраныДляСообщенияОбОтгрузке(ВидПродукции) Экспорт
	
	КлючКэш = "ДопустимыеСтраныДляСообщенияОбОтгрузке: " + ВидПродукции;
	
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ДопустимыеСтраныДляСообщенияОбОтгрузкеНаСервере(ВидПродукции);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДопустимыеСтраныДляСообщенияОбОтгрузкеНаСервере(ВидПродукции)
	
	Возврат МодульОбъекта().ДопустимыеСтраныДляСообщенияОбОтгрузке(ВидПродукции);
	
КонецФункции

&НаКлиенте
Функция ДопустимыеВидыПродукцииДляОперацийАгрегации() Экспорт
	
	КлючКэш = "ДопустимыеВидыПродукцииДляОперацийАгрегации";
	
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ДопустимыеВидыПродукцииДляОперацийАгрегацииНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДопустимыеВидыПродукцииДляОперацийАгрегацииНаСервере()
	
	Возврат МодульОбъекта().ДопустимыеВидыПродукцииДляОперацийАгрегации();
	
КонецФункции

&НаКлиенте
Функция ДопустимыеВидыПродукцииДляРегистрацииНаборов() Экспорт
	
	КлючКэш = "ДопустимыеВидыПродукцииДляРегистрацииНаборов";
	
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ДопустимыеВидыПродукцииДляРегистрацииНаборовНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДопустимыеВидыПродукцииДляРегистрацииНаборовНаСервере()
	
	Возврат МодульОбъекта().ДопустимыеВидыПродукцииДляРегистрацииНаборов();
	
КонецФункции

&НаКлиенте
Функция ИнтернетАдреса() Экспорт
	
	КлючКэш = "ИнтернетАдреса";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ИнтернетАдресаНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ИнтернетАдресаНаСервере()
	
	Возврат МодульОбъекта().ИнтернетАдреса();
	
КонецФункции

&НаКлиенте
Функция ТипыИнтерактивныхОпераций() Экспорт
	
	КлючКэш = "ТипыИнтерактивныхОпераций";
	
	Результат = Кэш_Прочитать(КлючКэш);
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ТипыИнтерактивныхОперацийНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ТипыИнтерактивныхОперацийНаСервере()
	
	Возврат МодульОбъекта().ТипыИнтерактивныхОпераций();
	
КонецФункции

&НаКлиенте
Функция ТипыОперацийСВыгрузкойКодов() Экспорт
	
	КлючКэш = "ТипыОперацийСВыгрузкойКодов";
	
	Результат = Кэш_Прочитать(КлючКэш);
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ТипыОперацийСВыгрузкойКодовНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ТипыОперацийСВыгрузкойКодовНаСервере()
	
	Возврат МодульОбъекта().ТипыОперацийСВыгрузкойКодов();
	
КонецФункции

&НаКлиенте
Функция Перечисление_ФункциональностьМодуля() Экспорт
	
	КлючКэш = "ФункциональностьМодуля";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_ФункциональностьМодуляНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_ФункциональностьМодуляНаСервере()
	
	Возврат МодульОбъекта().Перечисление_ФункциональностьМодуля();
	
КонецФункции

&НаКлиенте
Функция Перечисление_ФичаФлаги() Экспорт
	
	КлючКэш = "ФичаФлаги";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_ФичаФлагиНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_ФичаФлагиНаСервере()
	
	Возврат МодульОбъекта().Перечисление_ФичаФлаги();
	
КонецФункции

&НаКлиенте
Функция Перечисление_ФичаФлагиВключения()
	
	КлючКэш = "ФичаФлагиВключения";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_ФичаФлагиВключенияНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_ФичаФлагиВключенияНаСервере()
	
	Возврат МодульОбъекта().Перечисление_ФичаФлагиВключения();
	
КонецФункции

&НаКлиенте
Функция Перечисление_ФичаФлагиОтключения()
	
	КлючКэш = "ФичаФлагиОтключения";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_ФичаФлагиОтключенияНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_ФичаФлагиОтключенияНаСервере()
	
	Возврат МодульОбъекта().Перечисление_ФичаФлагиОтключения();
	
КонецФункции

&НаКлиенте
Функция Перечисление_ВидыКорректируемыхСведений() Экспорт
	
	КлючКэш = "ВидыКорректируемыхСведений";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_ВидыКорректируемыхСведенийНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_ВидыКорректируемыхСведенийНаСервере()
	
	Возврат МодульОбъекта().Перечисление_ВидыКорректируемыхСведений();
	
КонецФункции

&НаКлиенте
Функция Перечисление_КлючиСценариевДляОпросов() Экспорт
	
	КлючКэш = "КлючиСценариевДляОпросов";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_КлючиСценариевДляОпросовНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_КлючиСценариевДляОпросовНаСервере()
	
	Возврат МодульОбъекта().Перечисление_КлючиСценариевДляОпросов();
	
КонецФункции

&НаКлиенте
Функция Перечисление_ПравилаЗаполненияРеквизитов() Экспорт
	
	КлючКэш = "ПравилаЗаполненияРеквизитов";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_ПравилаЗаполненияРеквизитовНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_ПравилаЗаполненияРеквизитовНаСервере()
	
	Возврат МодульОбъекта().Перечисление_ПравилаЗаполненияРеквизитов();
	
КонецФункции

&НаКлиенте
Функция Перечисление_РеквизитыОперацийДляАвтозаполнения() Экспорт
	
	КлючКэш = "РеквизитыОперацийДляАвтозаполнения";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_РеквизитыОперацийДляАвтозаполненияНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_РеквизитыОперацийДляАвтозаполненияНаСервере()
	
	Возврат МодульОбъекта().Перечисление_РеквизитыОперацийДляАвтозаполнения();
	
КонецФункции

&НаКлиенте
Функция Перечисление_СкрываемыеПоляТоваровДокумента() Экспорт
	
	КлючКэш = "СкрываемыеПоляТоваровДокумента";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_СкрываемыеПоляТоваровДокументаНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_СкрываемыеПоляТоваровДокументаНаСервере()
	
	Возврат МодульОбъекта().Перечисление_СкрываемыеПоляТоваровДокумента();
	
КонецФункции

&НаКлиенте
Функция Перечисление_СкрываемыеПоляТоваровОперации() Экспорт
	
	КлючКэш = "СкрываемыеПоляТоваровОперации";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_СкрываемыеПоляТоваровОперацииНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_СкрываемыеПоляТоваровОперацииНаСервере()
	
	Возврат МодульОбъекта().Перечисление_СкрываемыеПоляТоваровОперации();
	
КонецФункции

&НаКлиенте
Функция Перечисление_СкрываемыеПоляТоваровМаркировки() Экспорт
	
	КлючКэш = "СкрываемыеПоляТоваровМаркировки";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_СкрываемыеПоляТоваровМаркировкиНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_СкрываемыеПоляТоваровМаркировкиНаСервере()
	
	Возврат МодульОбъекта().Перечисление_СкрываемыеПоляТоваровМаркировки();
	
КонецФункции

&НаКлиенте
Функция Перечисление_СпособыОткрытияЗначения() Экспорт
	
	КлючКэш = "СпособыОткрытияЗначения";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_СпособыОткрытияЗначенияНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_СпособыОткрытияЗначенияНаСервере()
	
	Результат = Новый Структура();
	
	Результат.Вставить("ВФормеОбъекта", "Открыть в форме объекта");
	Результат.Вставить("ВФормеРедактора", "Открыть в Контур.Маркировка (Администратор)");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Перечисление_ФорматыИзображений() Экспорт
	
	КлючКэш = "ФорматыИзображений";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_ФорматыИзображенийНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_ФорматыИзображенийНаСервере()
	
	Возврат МодульОбъекта().Перечисление_ФорматыИзображений();
	
КонецФункции

&НаКлиенте
Функция ИмяОбщейОрганизацииДляМетрик()
	
	КлючКэш = "ИмяОбщейОрганизацииДляМетрик";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ИмяОбщейОрганизацииДляМетрикНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ИмяОбщейОрганизацииДляМетрикНаСервере()
	
	Возврат МодульОбъекта().ИмяОбщейОрганизацииДляМетрик();
	
КонецФункции

&НаКлиенте
Функция ДопустимыеВидыПродукцииДляОтчетаОНанесении() Экспорт
	
	КлючКэш = "ДопустимыеВидыПродукцииДляОтчетаОНанесении";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ДопустимыеВидыПродукцииДляОтчетаОНанесенииНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДопустимыеВидыПродукцииДляОтчетаОНанесенииНаСервере()
	
	Возврат МодульОбъекта().ДопустимыеВидыПродукцииДляОтчетаОНанесении();
	
КонецФункции

&НаКлиенте
Функция ДопустимыеВидыПродукцииДляТрансформацииАгрегата() Экспорт
	
	КлючКэш = "ДопустимыеВидыПродукцииДляТрансформацииАгрегата";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ДопустимыеВидыПродукцииДляТрансформацииАгрегатаНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДопустимыеВидыПродукцииДляТрансформацииАгрегатаНаСервере()
	
	Возврат МодульОбъекта().ДопустимыеВидыПродукцииДляТрансформацииАгрегата();
	
КонецФункции

&НаКлиенте
Функция ДопустимыеВидыПродукцииДляФормированияАТК() Экспорт
	
	КлючКэш = "ДопустимыеВидыПродукцииДляФормированияАТК";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ДопустимыеВидыПродукцииДляФормированияАТКНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДопустимыеВидыПродукцииДляФормированияАТКНаСервере()
	
	Возврат МодульОбъекта().ДопустимыеВидыПродукцииДляФормированияАТК();
	
КонецФункции

&НаКлиенте
Функция ДопустимыеВидыПродукцииДляЗаказаКодов(СпособВыпускаТоваров, ТипКодаМаркировки) Экспорт
	
	КлючКэш = "ДопустимыеВидыПродукцииДляЗаказаКодов: " + СпособВыпускаТоваров + ", " + ТипКодаМаркировки;
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ДопустимыеВидыПродукцииДляЗаказаКодовНаСервере(СпособВыпускаТоваров, ТипКодаМаркировки);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДопустимыеВидыПродукцииДляЗаказаКодовНаСервере(СпособВыпускаТоваров, ТипКодаМаркировки)
	
	Возврат МодульОбъекта().ДопустимыеВидыПродукцииДляЗаказаКодов(СпособВыпускаТоваров, ТипКодаМаркировки);
	
КонецФункции

&НаКлиенте
Функция ДопустимыеВидыПродукцииДляПеремаркировки() Экспорт
	
	КлючКэш = "ДопустимыеВидыПродукцииДляПеремаркировки";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ДопустимыеВидыПродукцииДляПеремаркировкиНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДопустимыеВидыПродукцииДляПеремаркировкиНаСервере()
	
	Возврат МодульОбъекта().ДопустимыеВидыПродукцииДляПеремаркировки();
	
КонецФункции

&НаКлиенте
Функция ДопустимыеВидыПродукцииДляЗаказаНаборов() Экспорт
	
	КлючКэш = "ДопустимыеВидыПродукцииДляЗаказаНаборов";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ДопустимыеВидыПродукцииДляЗаказаНаборовНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДопустимыеВидыПродукцииДляЗаказаНаборовНаСервере()
	
	Возврат МодульОбъекта().ДопустимыеВидыПродукцииДляЗаказаНаборов();
	
КонецФункции

&НаКлиенте
Функция ДопустимыеВидыПродукцииДляЗаказаКИГУ() Экспорт
	
	КлючКэш = "ДопустимыеВидыПродукцииДляЗаказаКИГУ";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ДопустимыеВидыПродукцииДляЗаказаКИГУНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДопустимыеВидыПродукцииДляЗаказаКИГУНаСервере()
	
	Возврат МодульОбъекта().ДопустимыеВидыПродукцииДляЗаказаКИГУ();
	
КонецФункции

&НаКлиенте
Функция ДопустимыеВидыПродукцииДляЗаказаКомплектов() Экспорт
	
	КлючКэш = "ДопустимыеВидыПродукцииДляЗаказаКомплектов";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ДопустимыеВидыПродукцииДляЗаказаКомплектовНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДопустимыеВидыПродукцииДляЗаказаКомплектовНаСервере()
	
	Возврат МодульОбъекта().ДопустимыеВидыПродукцииДляЗаказаКомплектов();
	
КонецФункции

&НаКлиенте
Функция ДопустимыеВидыПродукцииДляУведомленияОСостоянииКодов() Экспорт
	
	КлючКэш = "ДопустимыеВидыПродукцииДляУведомленияОСостоянииКодов";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ДопустимыеВидыПродукцииДляУведомленияОСостоянииКодовНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДопустимыеВидыПродукцииДляУведомленияОСостоянииКодовНаСервере()
	
	Возврат МодульОбъекта().ДопустимыеВидыПродукцииДляУведомленияОСостоянииКодов();
	
КонецФункции

&НаКлиенте
Функция ДопустимыеСпособыВыпускаТоваров(ВидПродукции, ТипКодаМаркировки) Экспорт
	
	КлючКэш = "ДопустимыеСпособыВыпускаТоваров: " + ВидПродукции + ", " + ТипКодаМаркировки;
	
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ДопустимыеСпособыВыпускаТоваровНаСервере(ВидПродукции, ТипКодаМаркировки);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДопустимыеСпособыВыпускаТоваровНаСервере(ВидПродукции, ТипКодаМаркировки)
	
	Возврат МодульОбъекта().ДопустимыеСпособыВыпускаТоваров(ВидПродукции, ТипКодаМаркировки);
	
КонецФункции

&НаКлиенте
Функция ДопустимыеТипыКодовМаркировки(СпособВыпускаТоваров, ВидПродукции) Экспорт
	
	КлючКэш = "ДопустимыеТипыКодовМаркировки: " + СпособВыпускаТоваров + ", " + ВидПродукции;
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ДопустимыеТипыКодовМаркировкиНаСервере(СпособВыпускаТоваров, ВидПродукции);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДопустимыеТипыКодовМаркировкиНаСервере(СпособВыпускаТоваров, ВидПродукции)
	
	Возврат МодульОбъекта().ДопустимыеТипыКодовМаркировки(СпособВыпускаТоваров, ВидПродукции);
	
КонецФункции

&НаКлиенте
Функция ВидПродукцииТребуетУказатьОбъемВОтчетеОНанесении(ВидПродукции) Экспорт
	
	КлючКэш = "ВидПродукцииТребуетУказатьОбъемВОтчетеОНанесении: " + ВидПродукции;
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ВидПродукцииТребуетУказатьОбъемВОтчетеОНанесенииНаСервере(ВидПродукции);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ВидПродукцииТребуетУказатьОбъемВОтчетеОНанесенииНаСервере(ВидПродукции)
	
	Возврат МодульОбъекта().ВидПродукцииТребуетУказатьОбъемВОтчетеОНанесении(ВидПродукции);
	
КонецФункции

&НаКлиенте
Функция ДопустимыеПричиныВыбытияКодов(ВидПродукции) Экспорт
	
	КлючКэш = "ДопустимыеПричиныВыбытияКодов: " + ВидПродукции;
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ДопустимыеПричиныВыбытияКодовНаСервере(ВидПродукции);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДопустимыеПричиныВыбытияКодовНаСервере(ВидПродукции)
	
	Возврат МодульОбъекта().ДопустимыеПричиныВыбытияКодов(ВидПродукции);
	
КонецФункции

&НаКлиенте
Функция ДопустимыеВидыПродукцииДляВыбытияКодов() Экспорт
	
	КлючКэш = "ДопустимыеВидыПродукцииДляВыбытияКодов";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ДопустимыеВидыПродукцииДляВыбытияКодовНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДопустимыеВидыПродукцииДляВыбытияКодовНаСервере()
	
	Возврат МодульОбъекта().ДопустимыеВидыПродукцииДляВыбытияКодов();
	
КонецФункции

&НаКлиенте
Функция ДопустимыеСпособыВводаВОборот(ВидПродукции) Экспорт
	
	КлючКэш = "ДопустимыеСпособыВводаВОборот: " + ВидПродукции;
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ДопустимыеСпособыВводаВОборотНаСервере(ВидПродукции);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДопустимыеСпособыВводаВОборотНаСервере(ВидПродукции)
	
	Возврат МодульОбъекта().ДопустимыеСпособыВводаВОборот(ВидПродукции);
	
КонецФункции

&НаКлиенте
Функция ДопустимыеВидыПродукцииДляВводаВОборот() Экспорт
	
	КлючКэш = "ДопустимыеВидыПродукцииДляВводаВОборот";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ДопустимыеВидыПродукцииДляВводаВОборотНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДопустимыеВидыПродукцииДляВводаВОборотНаСервере()
	
	Возврат МодульОбъекта().ДопустимыеВидыПродукцииДляВводаВОборот();
	
КонецФункции

&НаКлиенте
Функция ДопустимыеВидыПервичногоДокумента(ПричинаВыводаИзОборота) Экспорт
	
	КлючКэш = "ДопустимыеВидыПервичногоДокумента: " + ПричинаВыводаИзОборота;
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ДопустимыеВидыПервичногоДокументаНаСервере(ПричинаВыводаИзОборота);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДопустимыеВидыПервичногоДокументаНаСервере(ПричинаВыводаИзОборота)
	
	Возврат МодульОбъекта().ДопустимыеВидыПервичногоДокумента(ПричинаВыводаИзОборота);
	
КонецФункции

&НаКлиенте
Функция ДопустимыеВидыПродукцииДляВозвратаВОборот() Экспорт
	
	КлючКэш = "ДопустимыеВидыПродукцииДляВозвратаВОборот";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ДопустимыеВидыПродукцииДляВозвратаВОборотНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДопустимыеВидыПродукцииДляВозвратаВОборотНаСервере()
	
	Возврат МодульОбъекта().ДопустимыеВидыПродукцииДляВозвратаВОборот();
	
КонецФункции

&НаКлиенте
Функция ДопустимыеВидыПродукцииДляВыводаИзОборота(ОбъемноСортовойУчет) Экспорт
	
	КлючКэш = "ДопустимыеВидыПродукцииДляВыводаИзОборота: " + ОбъемноСортовойУчет;
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ДопустимыеВидыПродукцииДляВыводаИзОборотаНаСервере(ОбъемноСортовойУчет);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДопустимыеВидыПродукцииДляВыводаИзОборотаНаСервере(ОбъемноСортовойУчет)
	
	Возврат МодульОбъекта().ДопустимыеВидыПродукцииДляВыводаИзОборота(ОбъемноСортовойУчет);
	
КонецФункции

&НаКлиенте
Функция ДопустимыеВидыПродукцииДляКорректировкиСведенийОКодах() Экспорт
	
	КлючКэш = "ДопустимыеВидыПродукцииДляКорректировкиСведенийОКодах";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ДопустимыеВидыПродукцииДляКорректировкиСведенийОКодахНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДопустимыеВидыПродукцииДляКорректировкиСведенийОКодахНаСервере()
	
	Возврат МодульОбъекта().ДопустимыеВидыПродукцииДляКорректировкиСведенийОКодах();
	
КонецФункции

&НаКлиенте
Функция ДопустимыеПричиныВыводаИзОборота(ВидПродукции, ОбъемноСортовойУчет) Экспорт
	
	КлючКэш = "ДопустимыеПричиныВыводаИзОборота: " + ВидПродукции + ", " + ОбъемноСортовойУчет;
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ДопустимыеПричиныВыводаИзОборотаНаСервере(ВидПродукции, ОбъемноСортовойУчет);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДопустимыеПричиныВыводаИзОборотаНаСервере(ВидПродукции, ОбъемноСортовойУчет)
	
	Возврат МодульОбъекта().ДопустимыеПричиныВыводаИзОборота(ВидПродукции, ОбъемноСортовойУчет);
	
КонецФункции

&НаКлиенте
Функция ДопустимыеПричиныПеремаркировки(ВидПродукции) Экспорт
	
	КлючКэш = "ДопустимыеПричиныПеремаркировки: " + ВидПродукции;
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ДопустимыеПричиныПеремаркировкиНаСервере(ВидПродукции);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДопустимыеПричиныПеремаркировкиНаСервере(ВидПродукции)
	
	Возврат МодульОбъекта().ДопустимыеПричиныПеремаркировки(ВидПродукции);
	
КонецФункции

&НаКлиенте
Функция ДопустимыеТипыПроизводственныхЗаказов(ВидПродукции) Экспорт
	
	КлючКэш = "ДопустимыеТипыПроизводственныхЗаказов: " + ВидПродукции;
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ДопустимыеТипыПроизводственныхЗаказовНаСервере(ВидПродукции);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДопустимыеТипыПроизводственныхЗаказовНаСервере(ВидПродукции)
	
	Возврат МодульОбъекта().ДопустимыеТипыПроизводственныхЗаказов(ВидПродукции);
	
КонецФункции

&НаКлиенте
Функция ДопустимыеСтраныДляВыводаИзОборота(ВидПродукции, ПричинаВыводаИзОборота) Экспорт
	
	КлючКэш = "ДопустимыеСтраныДляВыводаИзОборота:" + ПричинаВыводаИзОборота + ", " + ВидПродукции;
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ДопустимыеСтраныДляВыводаИзОборотаНаСервере(ВидПродукции, ПричинаВыводаИзОборота);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДопустимыеСтраныДляВыводаИзОборотаНаСервере(ВидПродукции, ПричинаВыводаИзОборота)
	
	Возврат МодульОбъекта().ДопустимыеСтраныДляВыводаИзОборота(ВидПродукции, ПричинаВыводаИзОборота);
	
КонецФункции

&НаКлиенте
Функция СписокСтранЕАЭС() Экспорт
	
	КлючКэш = "СписокСтранЕАЭС";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = СписокСтранЕАЭСНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция СписокСтранЕАЭСНаСервере()
	
	Возврат МодульОбъекта().СписокСтранЕАЭС();
	
КонецФункции

&НаКлиенте
Функция Перечисление_СостоянияКодов() Экспорт
	
	КлючКэш = "СостоянияКодов";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_СостоянияКодовНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_СостоянияКодовНаСервере()
	
	Возврат МодульОбъекта().Перечисление_СостоянияКодов();
	
КонецФункции

// Обмен с сервисом

&НаКлиенте
Процедура ВыполнитьОбменПоОрганизации(ВызывающаяФорма, Организация, ДокументУчета = Неопределено) Экспорт
	
	КонтекстОбмена = КонтекстОбменаНаСервере(Организация);
	КонтекстОбмена.ДокументУчета = ДокументУчета;
	
	Если Авторизация_Выполнить(КонтекстОбмена) Тогда
		ВыполнитьОбменССервисом(КонтекстОбмена);
	КонецЕсли;
	
	ПоказатьОшибкиСертификата(КонтекстОбмена, ВызывающаяФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбменССервисом(КонтекстОбмена)
	
	ВыполнитьОбмен = Истина;
	
	Пока ВыполнитьОбмен Цикл
		ВыполнитьОбменССервисомНаСервере(КонтекстОбмена);
		ВыполнитьОбмен = ОчередьОбмена_ПодписатьФайлы(КонтекстОбмена);
	КонецЦикла;
	
	ПредупредитьЧтоСрокДействияСертификатаИстекает(КонтекстОбмена);
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбменССервисомНаСервере(КонтекстОбмена)
	
	МодульОбъекта().ВыполнитьОбменССервисом(КонтекстОбмена);
	
КонецПроцедуры

&НаКлиенте
Функция ОчередьОбмена_ПодписатьФайлы(КонтекстОбмена)
	
	Если Не ЗначениеЗаполнено(КонтекстОбмена.ФайлыДляПодписи) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПроверитьДоступностьПодписиНаКлиенте(КонтекстОбмена);
	
	Если Не КонтекстОбмена.ДоступнаПодписьНаКлиенте Тогда
		Возврат Ложь;
	КонецЕсли;
	
	МассивФайлов = МассивСтруктур_Выгрузить(КонтекстОбмена.ФайлыДляПодписи, "ДанныеФайла");
	
	Попытка
		
		Подписи = Плагин_ПодписатьДанные(МассивФайлов, КонтекстОбмена.ОтпечатокСертификата);
		
	Исключение
		
		Ошибка = ИнформацияОбОшибке();
		Действие = НСтр("ru = 'Подпись файлов'");
		ДопИнформация = Новый СписокЗначений;
		ДопИнформация.Добавить(КонтекстОбмена.Организация, "Организация");
		ДопИнформация.Добавить(КонтекстОбмена.Сертификат, "Сертификат");
		ДопИнформация.Добавить(КонтекстОбмена.ОтпечатокСертификата, "Отпечаток сертификата");
		ОбработатьОшибку(Действие, Ошибка, ДопИнформация);
		
		КонтекстОбмена.ТекстОшибки = КраткоеПредставлениеОшибки(Ошибка);
		КонтекстОбмена.НеУдалосьПодписатьФайлы = Истина;
		
		Возврат Ложь;
		
	КонецПопытки;
	
	Для Сч = 0 По КонтекстОбмена.ФайлыДляПодписи.ВГраница() Цикл
		ОписаниеФайла = КонтекстОбмена.ФайлыДляПодписи[Сч];
		ОписаниеФайла.ДанныеФайла = Подписи[Сч];
		ОписаниеФайла.ПодписанЭП = Истина;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ОчередьОбмена_ПрочитатьНовуюПорциюФайловДляПодписи(КонтекстОбмена)
	
	Возврат МодульОбъекта().ОчередьОбмена_ПрочитатьНовуюПорциюФайловДляПодписи(КонтекстОбмена);
	
КонецФункции

&НаСервере
Процедура ОчередьОбмена_ЗаписатьФайлыПодписейУстановитьНовоеДействие(КонтекстОбмена)
	
	МодульОбъекта().ОчередьОбмена_ЗаписатьФайлыПодписей(КонтекстОбмена);
	МодульОбъекта().ОчередьОбмена_УстановитьДействиеОтправитьПодпись(КонтекстОбмена);
	
КонецПроцедуры

&НаКлиенте
Функция ВсеКонтекстыДляОбмена(ВызывающаяФорма = Неопределено)
	
	Результат = Новый Массив;
	
	Для каждого КонтекстОбмена Из ВсеКонтекстыОбменаНаСервере() Цикл
		
		Если Не Авторизация_Выполнить(КонтекстОбмена) Тогда
			Если ВызывающаяФорма <> Неопределено Тогда
				ПоказатьОшибкиСертификата(КонтекстОбмена, ВызывающаяФорма);
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		Результат.Добавить(КонтекстОбмена);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ВсеКонтекстыОбменаНаСервере()
	
	Результат = Новый Массив;
	
	Для каждого Организация Из МодульОбъекта().Организация_ВсеОрганизации() Цикл
		
		КонтекстОбмена = МодульОбъекта().КонтекстОбменаССервисом(Организация);
		Если Не КонтекстОбмена.ОбменВозможен Тогда
			Продолжить;
		КонецЕсли;
		
		МодульОбъекта().Авторизация_Выполнить(КонтекстОбмена);
		
		Результат.Добавить(КонтекстОбмена);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Выгрузка кодов в файл

&НаКлиенте
Процедура СохранитьКодыВФайл(ПараметрыСохранения) Экспорт
	
	Настройки = НастройкиМодуля();
	
	Если Настройки.ВыгружатьВФайлКодыСКрипточастью Тогда
		ТекстПредупреждения = НСтр("ru = 'Выгружаемые коды содержат крипточасть и могут быть использованы только для печати с последующим нанесением.
									|После сохранения коды будут помечены напечатанными'");
	Иначе
		ТекстПредупреждения = НСтр("ru = 'Выгружаемые коды без крипточасти не подходят для печати и последующего нанесения.'");
	КонецЕсли;
	
	Обработчик = ОписаниеОбработчикаОповещения("СохранитьКодыВФайл_ПослеСогласия", ЭтаФорма, ПараметрыСохранения);
	ПоказатьДиалогВопроса(Обработчик, ТекстПредупреждения, РежимДиалогаВопрос.ОКОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьКодыВФайл_ПослеСогласия(Ответ, ПараметрыСохранения) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	ФорматыФайловСКодами = Перечисление_ФорматыФайловСКодами();
	Если ПараметрыСохранения.ФорматФайла = ФорматыФайловСКодами.xlsx Тогда
		ЗаголовокВыбора = НСтр("ru = 'Сохранение кодов в Excel'");
	ИначеЕсли ПараметрыСохранения.ФорматФайла = ФорматыФайловСКодами.csv Тогда
		ЗаголовокВыбора = НСтр("ru = 'Сохранение кодов в CSV'");
	Иначе
		ВызватьИсключение ПараметрыВСтроку(НСтр(
		"ru = 'Не поддерживается выгрузка кодов в файл с типом: %1'"), ПараметрыСохранения.ФорматФайла);
	КонецЕсли;
	
	ОписаниеОбработчика = ОписаниеОбработчикаОповещения("СохранитьКодыВФайл_ПослеВыбораКаталога"
														, ЭтаФорма
														, ПараметрыСохранения);
	
	ПоказатьДиалогВыбораКаталога(ОписаниеОбработчика, ЗаголовокВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьКодыВФайл_ПослеВыбораКаталога(ВыбранныеФайлы, ПараметрыСохранения) Экспорт
	
	Если Не ЗначениеЗаполнено(ВыбранныеФайлы) Тогда
		Возврат;
	КонецЕсли;
	
	Каталог = ВыбранныеФайлы[0];
	ТипыФайловСКодами = Перечисление_ТипыФайловСКодами();
	
	Ссылка = ПараметрыСохранения.Ссылка;
	ФорматФайла = ПараметрыСохранения.ФорматФайла;
	ТипФайлаСКодами = ПараметрыСохранения.ТипФайлаСКодами;
	
	Если ТипФайлаСКодами = ТипыФайловСКодами.ФайлКодовДокументаУчета Тогда
		МассивФайлов = ВыгрузитьКодыДокументаУчетаВФайл(Ссылка, ФорматФайла);
	ИначеЕсли ТипФайлаСКодами = ТипыФайловСКодами.ФайлКодовОперации Тогда
		МассивФайлов = ВыгрузитьКодыОперацииВФайл(Ссылка, ФорматФайла);
	ИначеЕсли ТипФайлаСКодами = ТипыФайловСКодами.ФайлКодовСОшибками Тогда
		МассивФайлов = ВыгрузитьКодыСОшибкамиВФайл(Ссылка, ФорматФайла);
	Иначе
		ВызватьИсключение ПараметрыВСтроку(НСтр(
		"ru = 'Не поддерживается выгрузка кодов в файл с типом: %1'"), ТипФайлаСКодами);
	КонецЕсли;
	
	Для каждого Элемент Из МассивФайлов Цикл
		ПутьКФайлу = ОбъединитьПути(Каталог, Элемент.ИмяФайла);
		Элемент.ДвоичныеДанные.Записать(ПутьКФайлу);
	КонецЦикла;
	
	Если ТипФайлаСКодами = ТипыФайловСКодами.ФайлКодовОперации Тогда
		Оповестить("КонтурМаркировка_КодыВыгружены", Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ВыгрузитьКодыДокументаУчетаВФайл(ДокументУчетаСсылка, ФорматФайла) Экспорт
	
	Возврат ВыгрузитьКодыДокументаУчетаВФайлНаСервере(ДокументУчетаСсылка, ФорматФайла);
	
КонецФункции

&НаСервере
Функция ВыгрузитьКодыДокументаУчетаВФайлНаСервере(ДокументУчетаСсылка, ФорматФайла)
	
	Возврат МодульОбъекта().ВыгрузитьКодыДокументаУчетаВФайл(ДокументУчетаСсылка, ФорматФайла);
	
КонецФункции

&НаКлиенте
Функция ВыгрузитьКодыОперацииВФайл(ОперацияСсылка, ФорматФайла) Экспорт
	
	Возврат ВыгрузитьКодыОперацииВФайлНаСервере(ОперацияСсылка, ФорматФайла);
	
КонецФункции

&НаСервере
Функция ВыгрузитьКодыОперацииВФайлНаСервере(ОперацияСсылка, ФорматФайла)
	
	Возврат МодульОбъекта().ВыгрузитьКодыОперацииВФайл(ОперацияСсылка, ФорматФайла);
	
КонецФункции

&НаКлиенте
Функция ВыгрузитьКодыСОшибкамиВФайл(ОперацияСсылка, ФорматФайла) Экспорт
	
	Возврат ВыгрузитьКодыСОшибкамиВФайлНаСервере(ОперацияСсылка, ФорматФайла);
	
КонецФункции

&НаСервере
Функция ВыгрузитьКодыСОшибкамиВФайлНаСервере(ОперацияСсылка, ФорматФайла)
	
	Возврат МодульОбъекта().ВыгрузитьКодыСОшибкамиВФайл(ОперацияСсылка, ФорматФайла);
	
КонецФункции

&НаКлиенте
Функция Новый_ПараметрыСохраненияФайлаСКодами() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("Ссылка");
	Результат.Вставить("ФорматФайла");
	Результат.Вставить("ТипФайлаСКодами");
	
	Возврат Результат;
	
КонецФункции

// Центр поддержки

&НаКлиенте
Процедура ОткрытьЦентрПоддержки() Экспорт
	
	ЦентрПоддержки = Модуль_ЦентрПоддержки();
	ПараметрыСессии = ЦентрПоддержки.МодельПараметрыСессии();
	
	Файл = ЦентрПоддержки.МодельФайла();
	Файл.ИмяФайла = "Диагностика.txt";
	Файл.Данные = СформироватьДвоичныеДанныеДиагностики();
	ПараметрыСессии.Файлы.Добавить(Файл);
	
	ЦентрПоддержки.ОткрытьЦентрПоддержки(ПараметрыСессии);
	
	Метрика_Функциональность_ЦентрПоддержки();
	
КонецПроцедуры

&НаКлиенте
Функция Модуль_ЦентрПоддержки() Экспорт
	
	Результат = ОткрытьФормуОбработки("ЦП_Сервис");
	ТопикПродукта = ТопикПродуктаДляВТехПоддержке();
	Результат.Инит(ТопикПродукта, ЭтаФорма, ЭтаФорма);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Модуль_Диагностика()
	
	Результат = ОткрытьФормуОбработки("ЦП_Диагностика");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция _ЗаписатьJson(Значение) Экспорт
	
	Возврат ЗначениеВСтрокуJSON(Значение);
	
КонецФункции // _ЗаписатьJson

&НаКлиенте
Функция _ПрочитатьJson(Строка) Экспорт
	
	ПрочитатьВСоответствие = Истина;
	
	Возврат ЗначениеИзСтрокиJSON(Строка, ПрочитатьВСоответствие);
	
КонецФункции // _ПрочитатьJson

&НаСервере
Функция _ОтправитьЗапрос(Запрос) Экспорт
	
	ОписаниеЗапроса = МодульОбъекта().Новый_ОписаниеЗапросаHTTP();
	ОписаниеЗапроса.Хост = Запрос.Хост;
	ОписаниеЗапроса.ПутьНаСервере = Запрос.Ресурс;
	ОписаниеЗапроса.Метод = Запрос.Метод;
	ОписаниеЗапроса.ТелоЗапроса = Запрос.Тело;
	ОписаниеЗапроса.Заголовки = Запрос.Заголовки;
	ОписаниеЗапроса.Схема = "https";
	ОписаниеЗапроса.ТелоОтветаКакДвоичныеДанные = Истина;
	
	МодульОбъекта().ЗаполнитьНастройкиПроксиСервера(ОписаниеЗапроса);
	
	Ответ = МодульОбъекта().ВыполнитьHTTPЗапрос(ОписаниеЗапроса);
	Результат = Новый Структура;
	Результат.Вставить("КодСостояния", Ответ.КодОтвета);
	Результат.Вставить("Тело", Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции // _ОтправитьЗапрос

&НаКлиенте
Функция СформироватьДвоичныеДанныеДиагностики()
	
	МодульДиагностики = Модуль_Диагностика();
	
	МассивПрав = Новый Массив;
	МассивПрав.Добавить("Добавление");
	МассивПрав.Добавить("Изменение");
	
	МассивПравРС = Новый Массив;
	МассивПравРС.Добавить("Чтение");
	МассивПравРС.Добавить("Изменение");

	Диагностики = Новый Массив;
	
	Диагностика = МодульДиагностики.ДиагностикаМетаданные();
	Диагностика.ПолныйПуть = "Справочник.КонтурМаркировка_ШаблоныЭтикеток";
	Диагностика.ПраваДоступа = МассивПрав;
	Диагностики.Добавить(Диагностика);
	
	Диагностика = МодульДиагностики.ДиагностикаМетаданные();
	Диагностика.ПолныйПуть = "Справочник.Контрагенты";
	Диагностика.ПраваДоступа = МассивПрав;
	Диагностики.Добавить(Диагностика);
	
	Диагностика = МодульДиагностики.ДиагностикаМетаданные();
	Диагностика.ПолныйПуть = "Справочник.Организации";
	Диагностика.ПраваДоступа = МассивПрав;
	Диагностики.Добавить(Диагностика);
	
	Диагностика = МодульДиагностики.ДиагностикаМетаданные();
	Диагностика.ПолныйПуть = "Справочник.Пользователи";
	Диагностика.ПраваДоступа = МассивПрав;
	Диагностики.Добавить(Диагностика);
	
	Диагностика = МодульДиагностики.ДиагностикаМетаданные();
	Диагностика.ПолныйПуть = "Справочник.Номенклатура";
	Диагностика.ПраваДоступа = МассивПрав;
	Диагностики.Добавить(Диагностика);
	
	Диагностика = МодульДиагностики.ДиагностикаМетаданные();
	Диагностика.ПолныйПуть = "Справочник.ХарактеристикиНоменклатуры";
	Диагностика.ПраваДоступа = МассивПрав;
	Диагностики.Добавить(Диагностика);
	
	Диагностика = МодульДиагностики.ДиагностикаМетаданные();
	Диагностика.ПолныйПуть = "Справочник.СерииНоменклатуры";
	Диагностика.ПраваДоступа = МассивПрав;
	Диагностики.Добавить(Диагностика);

	Диагностика = МодульДиагностики.ДиагностикаМетаданные();
	Диагностика.ПолныйПуть = "РегистрСведений.КонтурМаркировка_СтатусыКодов";
	Диагностика.ПраваДоступа = МассивПравРС;
	Диагностики.Добавить(Диагностика);
	
	РезультатДиагностики = МодульДиагностики.ВыполнитьДиагностики(Диагностики);
	Отчет = МодульДиагностики.СформироватьОтчет(РезультатДиагностики, "Текстовый");
	
	Возврат ДвоичныеДанныеИзСтроки(Отчет);
	
КонецФункции

&НаКлиенте
Функция ТопикПродуктаДляВТехПоддержке()
	
	Возврат "marking-1c";
	
КонецФункции

// Плагин

&НаКлиенте
Процедура ЗапуститьПодключениеКонтурПлагина() Экспорт
	
	Модуль_Плагин().ПодключитьПлагин();
	
КонецПроцедуры

// Создает форму "МодульКлиента" из обработки плагина
// 
// Возвращаемое значение:
//  ФормаКлиентскогоПриложения
//
&НаКлиенте
Функция Модуль_Плагин()
	
	КлючКэш = "МодульПлагин";
	Результат = Кэш_Прочитать(КлючКэш);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ПолучитьФорму("Обработка.КонтурМаркировка_Плагин.Форма.МодульКлиента");
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

// Формирует картинки штрихкодов через Конутр.Плагин для 1С
//
// Параметры:
//  Штрихкоды - Массив - содержит значения штрихкодов;
//  ПараметрыКартинки - Структура - см. Плагин_ПараметрыКартинкиШтрихкода()
// 
// Возвращаемое значение:
//  Массив - содержит двоичные данные картинок штрихкодов, в том же порядке что и входящий массив штрихкодов
//
&НаКлиенте
Функция Плагин_КартинкиШтрихкодов(Штрихкоды, ПараметрыКартинки)
	
	Попытка
		Результат = Модуль_Плагин().КартинкиШтрихкодов(Штрихкоды, ПараметрыКартинки);
	Исключение
		Ошибка = ИнформацияОбОшибке();
		Метод = "КартинкиШтрихкодов";
		МодульОбъекта().Плагин_ОбработатьОшибку(Метод, Ошибка);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Проверяет что через Конутр.Плагин для 1С можно сформировать картинки штрихкодов
// 
// Возвращаемое значение:
//  Булево - Истина, если картинки штрихкодов сформировать получиться
//
&НаКлиенте
Функция Плагин_ПечататьШтрихкодовЧерезПлагинДоступна()
	
	Попытка
		Результат = Модуль_Плагин().ПечататьШтрихкодовЧерезПлагинДоступна();
	Исключение
		Ошибка = ИнформацияОбОшибке();
		Метод = "ПечататьШтрихкодовЧерезПлагинДоступна";
		МодульОбъекта().Плагин_ОбработатьОшибку(Метод, Ошибка);
	КонецПопытки;
	
	Возврат Результат;

	
КонецФункции

// Параметры для печати штрихкодов
//
// Параметры:
//  ТипШтрихкода - Перечисления.КонтурМаркировка_ТипыШтрихкодов - тип штрихкодов
// 
// Возвращаемое значение:
//  Структура - содержит свойства:
//   * ТипШтрихкода      - Перечисления.КонтурМаркировка_ТипыШтрихкодов - тип штрихкодов;
//   * ФорматИзображения - Строка - см. Перечисление_ФорматыИзображений();
//   * Ширина            - Число  - ширина картинки в пикселях;
//   * Высота            - Число  - высота картинки в пикселях;
//   * УголПоворота      - Число  - угол поворота картинки в градусах,
//                         допустимые значения: 0, 90, 180, 270;
//   * ДобавитьОтступ    - Булево - Истина, если нужно добавить отступ вокруг штрихкода;
//   * ОтображатьТекст   - Булево - Истина, если нужно добавить строку с кодом;
//
&НаКлиенте
Функция Плагин_ПараметрыКартинкиШтрихкода(ТипШтрихкода)
	
	Попытка
		Результат = Модуль_Плагин().ПараметрыКартинкиШтрихкода(ТипШтрихкода);
	Исключение
		Ошибка = ИнформацияОбОшибке();
		Метод = "ПараметрыКартинкиШтрихкода";
		МодульОбъекта().Плагин_ОбработатьОшибку(Метод, Ошибка);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Получает список сертификатов установленных на компьютере
//
// Параметры:
// 
// Возвращаемое значение:
//  Массив - содержит структуры, см. Модуль_Плагин().Новый_ОписаниеСертификата()
//
&НаКлиенте
Функция Плагин_СписокСертификатов() Экспорт
	
	ПараметрыПоиска = Плагин_ПараметрыПоискаСертификатов();
	ПараметрыПоиска.ЕстьЗакрытыйКлюч = Истина;
	
	Результат = Новый Массив;
	
	Попытка
		СписокСертификатов = Модуль_Плагин().СписокСертификатов(ПараметрыПоиска);
	Исключение
		Ошибка = ИнформацияОбОшибке();
		Метод = "СписокСертификатов";
		МодульОбъекта().Плагин_ОбработатьОшибку(Метод, Ошибка);
	КонецПопытки;

	Если ЗначениеЗаполнено(СписокСертификатов) Тогда
		Для Каждого ОписаниеСертификата Из СписокСертификатов Цикл
			
			Если ОбъектСодержитНедопустимыеСимволыXML(ОписаниеСертификата) Тогда
				Продолжить;
			КонецЕсли;
			
			Результат.Добавить(ОписаниеСертификата);
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Подписывает данные указанным сертификатом
//
// Параметры:
//  Файлы - Массив - ДвоичныеДанные файлов или строки в формате base64, которые нужно подписать;
//  ОтпечатокСертификата - Строка - отпечаток сертификата, которым нужно подписать;
//  ПрисоединитьПодпись - Булево - Истина, если контент и подпись должны быть в одном файле;
//
// Возвращаемое значение:
//  Массив из ДвоичныеДанные - подписи, в том же порядке что и массив файлов
//  Массив из Строка - подписи, в том же порядке что и массив файлов (base64)
//
&НаКлиенте
Функция Плагин_ПодписатьДанные(Файлы, ОтпечатокСертификата, ПрисоединитьПодпись = Ложь) Экспорт
	
	Попытка
		Результат = Модуль_Плагин().ПодписатьДанные(Файлы, ОтпечатокСертификата, ПрисоединитьПодпись);
	Исключение
		Ошибка = ИнформацияОбОшибке();
		Метод = "ПодписатьДанные";
		МодульОбъекта().Плагин_ОбработатьОшибку(Метод, Ошибка);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Получает файл установленного на компьютере сертификата
//
// Параметры:
//  ОтпечатокСертификата - Строка - отпечаток сертификата
// 
// Возвращаемое значение:
//  ДвоичныеДанные
//
&НаКлиенте
Функция Плагин_ФайлСертификата(ОтпечатокСертификата)
	
	Попытка
		Результат = Модуль_Плагин().ФайлСертификата(ОтпечатокСертификата);
	Исключение
		Ошибка = ИнформацияОбОшибке();
		Метод = "ФайлСертификата";
		МодульОбъекта().Плагин_ОбработатьОшибку(Метод, Ошибка);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Выполняет расшифровку контента
//
// Параметры:
//  Контент - ДвоичныеДанные, Строка - файл или строка base64
// 
// Возвращаемое значение:
//  ДвоичныеДанные - расшифрованные данные
//
&НаКлиенте
Функция Плагин_РасшифроватьКонтент(Контент)
	
	Попытка
		Результат = Модуль_Плагин().РасшифроватьКонтент(Контент);
	Исключение
		Ошибка = ИнформацияОбОшибке();
		Метод = "РасшифроватьКонтент";
		МодульОбъекта().Плагин_ОбработатьОшибку(Метод, Ошибка);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Содержит описание параметров для поиска сертификатов на компьютере
// 
// Параметры поиска сертификатов на компьютере
//
// Возвращаемое значение:
//  Структура:
//   Отпечаток             - Строка - (необязательный) отпечаток сертификата;
//   СерийныйНомер         - Строка - (необязательный) серийный номер сертификата;
//   ЕстьЗакрытыйКлюч      - Булево - (необязательный) проверять наличие закрытого ключа;
//   ТолькоПервый          - Булево - (необязательный) возвращать первый найденный сертификат;
//   РасположениеХранилища - Строка - (необязательный) см. Перечисление_РасположениеХранилищСертификатов();
//   ТипХранилища          - Строка - (необязательный) см. Перечисление_ТипыХранилищСертификатов();
//
&НаКлиенте
Функция Плагин_ПараметрыПоискаСертификатов()

	Попытка
		Результат = Модуль_Плагин().ПараметрыПоискаСертификатов();
	Исключение
		Ошибка = ИнформацияОбОшибке();
		Метод = "ПараметрыПоискаСертификатов";
		МодульОбъекта().Плагин_ОбработатьОшибку(Метод, Ошибка);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Находит сертификат установленный на компьютере
//
// Параметры:
//  ОтпечатокСертификата - Строка - отпечаток сертификата;
// 
// Возвращаемое значение:
//  Структура - см. Модуль_Плагин().Новый_ОписаниеСертификата()
//
&НаКлиенте
Функция Плагин_НайтиСертификат(ОтпечатокСертификата)
	
	ПараметрыПоиска = Плагин_ПараметрыПоискаСертификатов();
	ПараметрыПоиска.Отпечаток = ОтпечатокСертификата;
	ПараметрыПоиска.ТолькоПервый = Истина;
	
	Попытка
		МассивСертификатов = Модуль_Плагин().СписокСертификатов(ПараметрыПоиска);
	Исключение
		Ошибка = ИнформацияОбОшибке();
		Метод = "СписокСертификатов";
		МодульОбъекта().Плагин_ОбработатьОшибку(Метод, Ошибка);
	КонецПопытки;
	
	Результат = Неопределено;
	Если ЗначениеЗаполнено(МассивСертификатов) Тогда
		Результат = МассивСертификатов[0];
		Если ОбъектСодержитНедопустимыеСимволыXML(Результат) Тогда
			Результат = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Этикетки

// Заполняет этикетки картинками штрихкодов на клиенте
//
// Параметры:
//  ТабличныйДокумент - ТабличныйДокумент - табличный документ с этикетками;
//  ПараметрыЗаполнения - Структура - см. Этикетки_ПараметрыЗаполненияКартинокШтрихкодовНаКлиенте();
//
&НаКлиенте
Процедура Этикетки_ЗаполнитьКартинкиШтрихкодов(ТабличныйДокумент, ПараметрыЗаполнения) Экспорт
	
	Если Не ЗначениеЗаполнено(ПараметрыЗаполнения)
		Или ТабличныйДокумент.ВысотаТаблицы = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Этикетки_СформироватьКартинкиШтрихкодовПоШаблонам(ПараметрыЗаполнения);
	Этикетки_ЗаполнитьКартинкиШтрихкодовВТабличномДокументе(ТабличныйДокумент, ПараметрыЗаполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура Этикетки_СформироватьКартинкиШтрихкодовПоШаблонам(ПараметрыЗаполнения)
	
	ШтрихкодыПоШаблонам = МассивСтруктур_Разбить(ПараметрыЗаполнения.ОписанияЭтикеток, "ШаблонЭтикетки");
	
	Для каждого Элемент Из ШтрихкодыПоШаблонам Цикл
		
		ШаблонЭтикетки = Элемент.Ключ;
		Если Не ЗначениеЗаполнено(ШаблонЭтикетки) Тогда
			Продолжить;
		КонецЕсли;
		
		МассивШтрихкодов = Элемент.Значение;
		НастройкиШаблона = ПараметрыЗаполнения.НастройкиШаблонов[ШаблонЭтикетки];
		
		Этикетки_СформироватьКартинкиGTIN(МассивШтрихкодов, ШаблонЭтикетки, НастройкиШаблона);
		Этикетки_СформироватьКартинкиАгрегатов(МассивШтрихкодов, ШаблонЭтикетки, НастройкиШаблона);
		Этикетки_СформироватьКартинкиDataMatrix(МассивШтрихкодов, ШаблонЭтикетки, НастройкиШаблона);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Этикетки_СформироватьКартинкиGTIN(ОписанияЭтикеток, ШаблонЭтикетки, НастройкиШаблона)
	
	ТипШтрихкода = ПредопределенноеЗначение("Перечисление.КонтурМаркировка_ТипыШтрихкодов.EAN13");
	
	РазмерыКартинки = НастройкиШаблона.РазмерыКартинок.GTIN;
	ПараметрыШтрихкода = НастройкиШаблона.ПараметрыШтрихкодов.GTIN;
	
	Если РазмерыКартинки.Ширина = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ШаблонЭтикетки", ШаблонЭтикетки);
	СтрокиЭтикеток = МассивСтруктур_НайтиСтроки(ОписанияЭтикеток, Отбор);
	
	Если Не ЗначениеЗаполнено(СтрокиЭтикеток) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыКартинки = Плагин_ПараметрыКартинкиШтрихкода(ТипШтрихкода);
	ЗаполнитьПоляСтруктуры(ПараметрыКартинки, ПараметрыШтрихкода);
	ЗаполнитьПоляСтруктуры(ПараметрыКартинки, РазмерыКартинки);
	
	МассивШтрихкодов = Новый Массив;
	Для Каждого Стр Из СтрокиЭтикеток Цикл
		Если ЗначениеЗаполнено(Стр.GTIN_Штрихкод)
			И МассивШтрихкодов.Найти(Стр.GTIN_Штрихкод) = Неопределено Тогда
			МассивШтрихкодов.Добавить(Стр.GTIN_Штрихкод);
		КонецЕсли;
	КонецЦикла;
	
	КартинкиШтрихкодов = Плагин_КартинкиШтрихкодов(МассивШтрихкодов, ПараметрыКартинки);
	
	Для Каждого Стр Из СтрокиЭтикеток Цикл
		ИндексКартинки = МассивШтрихкодов.Найти(Стр.GTIN_Штрихкод);
		Стр.GTIN_Картинка = КартинкиШтрихкодов[ИндексКартинки];
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Этикетки_СформироватьКартинкиАгрегатов(ОписанияЭтикеток, ШаблонЭтикетки, НастройкиШаблона)
	
	НужныеТипыШтрихкодов = Новый Массив;
	НужныеТипыШтрихкодов.Добавить(ПредопределенноеЗначение("Перечисление.КонтурМаркировка_ТипыШтрихкодов.SSCC"));
	НужныеТипыШтрихкодов.Добавить(ПредопределенноеЗначение("Перечисление.КонтурМаркировка_ТипыШтрихкодов.GS1_128"));
	НужныеТипыШтрихкодов.Добавить(ПредопределенноеЗначение("Перечисление.КонтурМаркировка_ТипыШтрихкодов.Code128"));
	
	Для каждого ТипШтрихкода Из НужныеТипыШтрихкодов Цикл
		
		РазмерыКартинки = НастройкиШаблона.РазмерыКартинок.Агрегат;
		ПараметрыШтрихкода = НастройкиШаблона.ПараметрыШтрихкодов.Агрегат;
		
		Если РазмерыКартинки.Ширина = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Отбор = Новый Структура;
		Отбор.Вставить("ТипШтрихкода", ТипШтрихкода);
		Отбор.Вставить("ШаблонЭтикетки", ШаблонЭтикетки);
		СтрокиЭтикеток = МассивСтруктур_НайтиСтроки(ОписанияЭтикеток, Отбор);
		
		Если Не ЗначениеЗаполнено(СтрокиЭтикеток) Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыКартинки = Плагин_ПараметрыКартинкиШтрихкода(ТипШтрихкода);
		ЗаполнитьПоляСтруктуры(ПараметрыКартинки, ПараметрыШтрихкода);
		ЗаполнитьПоляСтруктуры(ПараметрыКартинки, РазмерыКартинки);
		ПараметрыКартинки.ПодогнатьРазмер = Истина;
		
		МассивШтрихкодов = Новый Массив;
		Для Каждого Стр Из СтрокиЭтикеток Цикл
			МассивШтрихкодов.Добавить(ВосстановитьРазделительGS1(Стр.Агрегат_Штрихкод));
		КонецЦикла;
		
		КартинкиШтрихкодов = Плагин_КартинкиШтрихкодов(МассивШтрихкодов, ПараметрыКартинки);
		
		Для Индекс = 0 По СтрокиЭтикеток.ВГраница() Цикл
			СтрокиЭтикеток[Индекс].Агрегат_Картинка = КартинкиШтрихкодов[Индекс];
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Этикетки_СформироватьКартинкиDataMatrix(ОписанияЭтикеток, ШаблонЭтикетки, НастройкиШаблона)
	
	ТипШтрихкода = ПредопределенноеЗначение("Перечисление.КонтурМаркировка_ТипыШтрихкодов.GS1_DataMatrix");
	
	РазмерыКартинки = НастройкиШаблона.РазмерыКартинок.DataMatrix;
	ПараметрыШтрихкода = НастройкиШаблона.ПараметрыШтрихкодов.DataMatrix;
	
	Если РазмерыКартинки.Ширина = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ТипШтрихкода", ТипШтрихкода);
	Отбор.Вставить("ШаблонЭтикетки", ШаблонЭтикетки);
	СтрокиЭтикеток = МассивСтруктур_НайтиСтроки(ОписанияЭтикеток, Отбор);
	
	Если Не ЗначениеЗаполнено(СтрокиЭтикеток) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыКартинки = Плагин_ПараметрыКартинкиШтрихкода(ТипШтрихкода);
	ЗаполнитьПоляСтруктуры(ПараметрыКартинки, ПараметрыШтрихкода);
	ЗаполнитьПоляСтруктуры(ПараметрыКартинки, РазмерыКартинки);
	ПараметрыКартинки.ПодогнатьРазмер = Истина;
	
	МассивШтрихкодов = Новый Массив;
	Для Каждого Стр Из СтрокиЭтикеток Цикл
		МассивШтрихкодов.Добавить(ВосстановитьРазделительGS1(Стр.DataMatrix_Штрихкод));
	КонецЦикла;
	
	КартинкиШтрихкодов = Плагин_КартинкиШтрихкодов(МассивШтрихкодов, ПараметрыКартинки);
	
	Для Индекс = 0 По СтрокиЭтикеток.ВГраница() Цикл
		СтрокиЭтикеток[Индекс].DataMatrix_Картинка = КартинкиШтрихкодов[Индекс];
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Этикетки_ЗаполнитьКартинкиШтрихкодовВТабличномДокументе(ТабличныйДокумент, ПараметрыЗаполнения)
	
	ИменаКартинок = Перечисление_ИменаКартинокШтрихкодов();
	ОписанияЭтикеток = ПараметрыЗаполнения.ОписанияЭтикеток;
	
	ЭтикеткиПоНомерам = Новый Соответствие;
	Для Каждого ОписаниеЭтикетки Из ОписанияЭтикеток Цикл
		ЭтикеткиПоНомерам.Вставить(ОписаниеЭтикетки.НомерЭтикетки, ОписаниеЭтикетки);
	КонецЦикла;
	
	ПрефиксНомера = "_Этикетка";
	ДлинаПрефикса = СтрДлина(ПрефиксНомера);
	
	Для Каждого Рисунок Из ТабличныйДокумент.Рисунки Цикл
		Для каждого Элемент Из ИменаКартинок Цикл
			ИмяКартинки = Элемент.Значение;
			Если Найти(Рисунок.Имя, ИмяКартинки) = 1 Тогда
				НачалоНомера = Найти(Рисунок.Имя, ПрефиксНомера);
				НомерЭтикетки = Число(Сред(Рисунок.Имя, НачалоНомера + ДлинаПрефикса));
				Рисунок.Картинка = Новый Картинка(ЭтикеткиПоНомерам[НомерЭтикетки][ИмяКартинки]);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция Новый_ПараметрыСортировкиЭтикеток() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ПолеСортировкиЭтикеток1");
	Результат.Вставить("ПолеСортировкиЭтикеток2");
	Результат.Вставить("ПолеСортировкиЭтикеток3");
	Результат.Вставить("НаправлениеСортировкиЭтикеток1");
	Результат.Вставить("НаправлениеСортировкиЭтикеток2");
	Результат.Вставить("НаправлениеСортировкиЭтикеток3");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция КоличествоПараметровСортировкиЭтикеток() Экспорт
	
	КлючКэш = "КоличествоПараметровСортировкиЭтикеток";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = КоличествоПараметровСортировкиЭтикетокНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция КоличествоПараметровСортировкиЭтикетокНаСервере()
	
	Возврат МодульОбъекта().КоличествоПараметровСортировкиЭтикеток();
	
КонецФункции

// Организации, склады, сервис-провайдеры

&НаКлиенте
Функция ВсеОрганизацииСАвторизацией(ВызывающаяФорма)
	
	Результат = Новый Массив;
	
	Для каждого КонтекстОбмена Из ВсеКонтекстыДляОбмена(ВызывающаяФорма) Цикл
		Результат.Добавить(КонтекстОбмена.Организация);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Организация_ПерваяСАвторизацией()
	
	Для каждого КонтекстОбмена Из ВсеКонтекстыОбменаНаСервере() Цикл
		
		Если Авторизация_Выполнить(КонтекстОбмена) Тогда
			Возврат КонтекстОбмена.Организация;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Функция Организация_ИдентификаторИзСервиса(Организация, ВызывающаяФорма) Экспорт
	
	Если Не ВыполнитьАвторизацию(Организация, ВызывающаяФорма, Ложь) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Организация_ИдентификаторИзСервисаНаСервере(Организация);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Организация_ИдентификаторИзСервисаНаСервере(Организация) Экспорт
	
	Возврат МодульОбъекта().Организация_ИдентификаторИзСервиса(Организация);
	
КонецФункции

&НаКлиенте
Функция Организация_ИдентификаторGS1ИзСервиса(Организация, ВызывающаяФорма) Экспорт
	
	Если Не ВыполнитьАвторизацию(Организация, ВызывающаяФорма, Истина) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Организация_ИдентификаторGS1ИзСервисаНаСервере(Организация);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Организация_ИдентификаторGS1ИзСервисаНаСервере(ОрганизацияСсылка) Экспорт
	
	Возврат МодульОбъекта().Организация_ИдентификаторGS1ИзСервиса(ОрганизацияСсылка);
	
КонецФункции

&НаСервере
Процедура Склады_Сохранить(ОргID,МассивСкладов)
	
	Для Каждого Склад Из МассивСкладов Цикл
		
		НайденныйСклад = Справочники.КонтурМаркировка_Склады.НайтиПоРеквизиту("Идентификатор",Склад.ID);
		
		Если ЗначениеЗаполнено(НайденныйСклад) Тогда
			СкладОбъект = НайденныйСклад.ПолучитьОбъект();
		Иначе
			СкладОбъект = Справочники.КонтурМаркировка_Склады.СоздатьЭлемент();
			
		КонецЕсли;
		СкладОбъект.Организация = Справочники.КонтурМаркировка_Организации.НайтиПоРеквизиту("Идентификатор", ОргID);
		СкладОбъект.Наименование = Склад.name;
		СкладОбъект.Адрес = Склад.address;
		СкладОбъект.GLN = Склад.gln;
		СкладОбъект.Идентификатор = Склад.ID;
		СкладОбъект.Записать();
		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура СинхронизироватьСклады(ВызывающаяФорма) Экспорт
	
	Для Каждого Организация Из ВсеОрганизацииСАвторизацией(ВызывающаяФорма) Цикл
		СинхронизироватьСкладыНаСервере(Организация);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СинхронизироватьСкладыНаСервере(Организация)
	
	МодульОбъекта().СинхронизироватьСклады(Организация);
	
КонецПроцедуры

// Синхронизирует сервис-провайдеров по всем организациям
//
&НаКлиенте
Процедура СинхронизироватьСервисПровайдеров(ВызывающаяФорма) Экспорт
	
	Для Каждого Организация Из ВсеОрганизацииСАвторизацией(ВызывающаяФорма) Цикл
		СервисПровайдеры_Синхронизировать(Организация);
	КонецЦикла;
	
КонецПроцедуры

// Синхронизирует список сервис-провайдеров по организации с сервисом.
//
// Параметры:
//  Организация - СправочникСсылка.КонтурМаркировка_Организации - организация;
//
&НаСервере
Процедура СервисПровайдеры_Синхронизировать(Организация)
	
	МодульОбъекта().СервисПровайдеры_Синхронизировать(Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура СинхронизироватьПлощадки(ВызывающаяФорма) Экспорт
	
	Для Каждого Организация Из ВсеОрганизацииСАвторизацией(ВызывающаяФорма) Цикл
		СинхронизироватьПлощадкиНаСервере(Организация);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СинхронизироватьПлощадкиНаСервере(Организация)
	
	МодульОбъекта().СинхронизироватьПлощадки(Организация);
	
КонецПроцедуры

// Синхронизирует места осуществления деятельности по всем организациям
//
&НаКлиенте
Процедура СинхронизироватьМобильныеУстройства(ВызывающаяФорма) Экспорт
	
	Для Каждого Организация Из ВсеОрганизацииСАвторизацией(ВызывающаяФорма) Цикл
		СинхронизироватьМобильныеУстройстваНаСервере(Организация);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СинхронизироватьМобильныеУстройстваНаСервере(Организация)
	
	МодульОбъекта().СинхронизироватьМобильныеУстройства(Организация);
	
КонецПроцедуры


// Товары

&НаКлиенте
Функция Товары_ВсеGTIN() Экспорт
	
	Возврат Товары_ВсеGTINНаСервере();
	
КонецФункции

&НаСервере
Функция Товары_ВсеGTINНаСервере()
	
	Возврат МодульОбъекта().Товары_ВсеGTIN();
	
КонецФункции

&НаКлиенте
Функция Товары_ВсеВидыПродукции() Экспорт
	
	КлючКэш = "ВидыПродукцииТоваров";
	Результат = Кэш_Прочитать(КлючКэш);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Товары_ВсеВидыПродукцииНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Товары_ВсеВидыПродукцииНаСервере()
	
	Возврат МодульОбъекта().Товары_ВсеВидыПродукции();
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьТоварыИзНоменклатуры1С(ИдентификаторФормы) Экспорт
	
	ВсеКонтекстыДляОбмена();
	
	РезультатЗагрузки = Товары_ЗагрузитьИзНоменклатуры1С();
	
	СообщениеНетДанных = НСтр("ru = 'Информации о новых товарах не найдено.'");
	СообщитьРезультатЗагрузкиТоваров(РезультатЗагрузки, ИдентификаторФормы, СообщениеНетДанных);
	
	Оповестить("КонтурМаркировка_Товар_Изменен");
	
	Метрика_Функциональность_ЗагрузкаТоваровИзНоменклатуры1С();
	
КонецПроцедуры

&НаСервере
Функция Товары_ЗагрузитьИзНоменклатуры1С()
	
	МассивGTIN = МодульОбъекта().Номенклатура1С_МассивGTIN();
	
	Результат = МодульОбъекта().Товары_СоздатьОбновитьПоИнформацииИзСервиса(МассивGTIN, Истина);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьТоварыПоДаннымДиадок(ИдентификаторФормы) Экспорт
	
	ВсеКонтекстыДляОбмена();
	
	РезультатЗагрузки = Товары_ЗагрузитьПоДаннымДиадок();
	
	СообщениеНетДанных = НСтр("ru = 'Информации о новых товарах не найдено.'");
	СообщитьРезультатЗагрузкиТоваров(РезультатЗагрузки, ИдентификаторФормы, СообщениеНетДанных);
	
	Оповестить("КонтурМаркировка_Товар_Изменен");
	
КонецПроцедуры

&НаСервере
Функция Товары_ЗагрузитьПоДаннымДиадок()
	
	МассивGTIN = МодульОбъекта().ДанныеДиадок_МассивGTIN();
	
	Результат = МодульОбъекта().Товары_СоздатьОбновитьПоИнформацииИзСервиса(МассивGTIN, Истина);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СоздатьТоварыМаркировки(МассивНоменклатуры, ИдентификаторФормы) Экспорт
	
	ВсеКонтекстыДляОбмена();
	
	Результат = Товары_СоздатьИзНоменклатуры1С(МассивНоменклатуры);
	СообщениеНетДанных = НСтр("ru = 'Среди выбранной номенклатуры информации о новых товарах не найдено'");
	СообщитьРезультатЗагрузкиТоваров(Результат, ИдентификаторФормы, СообщениеНетДанных);
	
	Оповестить("КонтурМаркировка_Товар_Изменен");
	
	Метрика_Функциональность_СозданиеТоваровИзНоменклатуры1С();
	
КонецПроцедуры

&НаСервере
Функция Товары_СоздатьИзНоменклатуры1С(МассивНоменклатуры)
	
	МассивGTIN = МодульОбъекта().Номенклатура1С_МассивGTIN(МассивНоменклатуры);
	
	Результат = МодульОбъекта().Товары_СоздатьОбновитьПоИнформацииИзСервиса(МассивGTIN, Истина);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьТоварыИзНациональногоКаталога(МассивGTIN, ИдентификаторФормы) Экспорт
	
	ВсеКонтекстыДляОбмена();
	
	РезультатОбновления = Товары_ОбновитьИзНациональногоКаталога(МассивGTIN);
	СообщениеНетДанных = НСтр("ru = 'Новой информации о товарах в национальном каталоге не найдено'");
	СообщитьРезультатЗагрузкиТоваров(РезультатОбновления, ИдентификаторФормы, СообщениеНетДанных);
	
	Оповестить("КонтурМаркировка_Товар_Изменен");
	
	Метрика_Функциональность_ОбновлениеТоваровИзНацКаталога();
	
КонецПроцедуры

&НаСервере
Функция Товары_ОбновитьИзНациональногоКаталога(МассивGTIN)
	
	Результат = МодульОбъекта().Товары_СоздатьОбновитьПоИнформацииИзСервиса(МассивGTIN);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЗаполнитьОписаниеТовараДаннымиСервиса(ОписаниеТовара, ИдентификаторФормы) Экспорт
	
	ВсеКонтекстыДляОбмена();
	
	РезультатЗаполнения = Товар_ЗаполнитьИзСервиса(ОписаниеТовара);
	
	Если ЗначениеЗаполнено(ОписаниеТовара.ДопРеквизиты.ОшибкаГИСМТ) Тогда
		СообщитьПользователюЛок(ОписаниеТовара.ДопРеквизиты.ОшибкаГИСМТ);
		Возврат Ложь;
	КонецЕсли;
	
	СообщениеНетДанных = НСтр("ru = 'Данные товара актуальны'");
	СообщитьРезультатЗагрузкиТоваров(РезультатЗаполнения, ИдентификаторФормы, СообщениеНетДанных);
	
	Если ЗначениеЗаполнено(ОписаниеТовара.Ссылка) Тогда
		Метрика_Функциональность_ОбновлениеТовараИзНацКаталога();
	Иначе
		Метрика_Функциональность_ЗаполнениеНовогоТовараИзНацКаталога();
	КонецЕсли;
	
	Возврат РезультатЗаполнения.ЕстьИзменения;
	
КонецФункции

&НаСервере
Функция Товар_ЗаполнитьИзСервиса(ОписаниеТовара)
	
	Возврат МодульОбъекта().Товар_ЗаполнитьИзСервиса(ОписаниеТовара);
	
КонецФункции

&НаКлиенте
Процедура НормализоватьGTIN(GTIN) Экспорт
	
	GTIN = СтрЗаменить(GTIN, " ", "");
	GTIN = Прав("00000000000000" + GTIN, 14);
	
КонецПроцедуры

// Документы учета

&НаКлиенте
Функция ДокументУчета_НайтиИлиСоздать(Документ1С, ВызывающаяФорма) Экспорт
	
	Результат = ДокументУчета_НайтиПоДокументу1СНаСервере(Документ1С);
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = ДокументУчета_СоздатьИЗагрузитьНовыеКоды(Документ1С, ВызывающаяФорма);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ДокументУчета_СоздатьИЗагрузитьНовыеКоды(Документ1С, ВызывающаяФорма)
	
	РезультатСоздания = ДокументУчета_СоздатьИПолучитьКодыИзПМ(Документ1С, ВызывающаяФорма.УникальныйИдентификатор);
	ДокументУчета = РезультатСоздания.ДокументУчета;
	
	Если Не РезультатСоздания.Свойство("АдресРезультатаПМ") Тогда
		Возврат ДокументУчета;
	КонецЕсли;
	
	Если Не ВыполнитьАвторизацию(РезультатСоздания.Организация, ВызывающаяФорма) Тогда
		ДокументУчета_Удалить(ДокументУчета);
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		ДокументУчета_ЗагрузитьКодыВНовыйДокумент(ДокументУчета, РезультатСоздания.АдресРезультатаПМ);
	Исключение
		Ошибка = ИнформацияОбОшибке();
		Действие = НСтр("ru = 'Загрузка кодов маркировки в документ'");
		ДопИнформация = Новый Структура("Документ1С", Документ1С);
		ТекстСообщения = НСтр("ru = 'Не удалось загрузить коды маркировки в документ: %1'");
		ТекстСообщения = ПараметрыВСтроку(ТекстСообщения, Документ1С);
		ОбработатьОшибку(Действие, Ошибка, ДопИнформация, ТекстСообщения, ВызывающаяФорма.УникальныйИдентификатор);
		ДокументУчета_Удалить(ДокументУчета);
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат ДокументУчета;
	
КонецФункции

&НаСервере
Функция ДокументУчета_НайтиПоДокументу1СНаСервере(Документ1С)
	
	Возврат МодульОбъекта().ДокументУчета_НайтиПоДокументу1С(Документ1С);
	
КонецФункции

&НаСервере
Функция ДокументУчета_СоздатьИПолучитьКодыИзПМ(Документ1С, ИдентификаторФормы)
	
	ДокументУчета = МодульОбъекта().ДокументУчета_НайтиПоДокументу1С(Документ1С);
	
	ЭтоНовыйДокумент = Не ЗначениеЗаполнено(ДокументУчета);
	
	Если ЭтоНовыйДокумент Тогда
		ОписаниеДокумента = МодульОбъекта().Новый_ДокументУчета();
		МодульОбъекта().ДокументУчета_Заполнить(ОписаниеДокумента, Документ1С);
	Иначе
		ОписаниеДокумента = МодульОбъекта().ДокументУчета_ПрочитатьДокумент(ДокументУчета);
	КонецЕсли;
	
	РезультатПМ = МодульОбъекта().ПМ_ТаблицаКодовДляНовогоДокумента(ОписаниеДокумента);
	
	Если ЭтоНовыйДокумент Тогда
		МодульОбъекта().ДокументУчета_Записать(ОписаниеДокумента);
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ДокументУчета", ОписаниеДокумента.Ссылка);
	Результат.Вставить("Организация", ОписаниеДокумента.Организация);
	
	Если ЗначениеЗаполнено(РезультатПМ.ТаблицаКодов) Тогда
		Результат.Вставить("АдресРезультатаПМ", ПоместитьВоВременноеХранилище(РезультатПМ, ИдентификаторФормы));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ДокументУчета_ЗагрузитьКодыВНовыйДокумент(ДокументУчета, АдресРезультатаПМ)
	
	РезультатПМ = ПолучитьИзВременногоХранилища(АдресРезультатаПМ);
	УдалитьИзВременногоХранилища(АдресРезультатаПМ);
	
	ТаблицаКодов = РезультатПМ.ТаблицаКодов;
	ПараметрыЗагрузки = РезультатПМ.ПараметрыЗагрузкиКодов;
	
	МодульОбъекта().КодыДокументов_ДобавитьНовыеКоды(ТаблицаКодов, ДокументУчета, ПараметрыЗагрузки);
	
	СтатусыДокументаУчета = МодульОбъекта().СтатусыДокументаУчета_Прочитать(ДокументУчета);
	СтатусыДокументаУчета.ОсновнойСтатус = МодульОбъекта().Перечисление_СтатусыДокументовУчета().ВРаботе;
	СтатусыДокументаУчета.ТребуемоеДействие = МодульОбъекта().ДокументУчета_НовоеТребуемоеДействие(ДокументУчета
	, СтатусыДокументаУчета.ОсновнойСтатус);
	
	МодульОбъекта().СтатусыДокументаУчета_Записать(ДокументУчета, СтатусыДокументаУчета);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументУчета_Удалить(ДокументУчета) Экспорт
	
	ДокументУчета_УдалитьНаСервере(ДокументУчета);
	
КонецПроцедуры

&НаСервере
Процедура ДокументУчета_УдалитьНаСервере(ДокументУчета)
	
	МодульОбъекта().ДокументУчета_Удалить(ДокументУчета);
	
КонецПроцедуры

&НаКлиенте
Функция ДокументУчета_ОсновнойСтатус(ДокументУчета) Экспорт
	
	Возврат ДокументУчета_ОсновнойСтатусНаСервере(ДокументУчета);
	
КонецФункции

&НаСервере
Функция ДокументУчета_ОсновнойСтатусНаСервере(ДокументУчета)
	
	Возврат МодульОбъекта().ДокументУчета_ОсновнойСтатус(ДокументУчета);
	
КонецФункции

&НаКлиенте
Функция ДокументУчета_Статусы(ДокументУчета) Экспорт
	
	Возврат ДокументУчета_СтатусыНаСервере(ДокументУчета);
	
КонецФункции

&НаСервере
Функция ДокументУчета_СтатусыНаСервере(ДокументУчета)
	
	Результат = МодульОбъекта().ДокументУчета_Статусы(ДокументУчета);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ВидыДокументовДляПодбораКодов(ДокументУчета) Экспорт
	
	Возврат ДокументУчета_ВидыДокументовДляПодбораКодовНаСервере(ДокументУчета);
	
КонецФункции

&НаСервере
Функция ДокументУчета_ВидыДокументовДляПодбораКодовНаСервере(ДокументУчета)
	
	Возврат МодульОбъекта().ДокументУчета_ВидыДокументовДляПодбораКодов(ДокументУчета);
	
КонецФункции

&НаКлиенте
Функция ДокументУчета_НовоеТребуемоеДействие(ДокументУчета, СтатусДокументаУчета) Экспорт
	
	Возврат ДокументУчета_НовоеТребуемоеДействиеНаСервере(ДокументУчета, СтатусДокументаУчета);
	
КонецФункции

&НаСервере
Функция ДокументУчета_НовоеТребуемоеДействиеНаСервере(ДокументУчета, СтатусДокументаУчета)
	
	Возврат МодульОбъекта().ДокументУчета_НовоеТребуемоеДействие(ДокументУчета, СтатусДокументаУчета);
	
КонецФункции

&НаКлиенте
Процедура ДокументУчета_РаспределитьКодыМаркировки(ДокументУчета) Экспорт
	
	ДокументУчета_РаспределитьКодыМаркировкиНаСервере(ДокументУчета);
	Оповестить("КонтурМаркировка_КодыВДокументах_Изменен", ДокументУчета);
	
КонецПроцедуры

&НаСервере
Процедура ДокументУчета_РаспределитьКодыМаркировкиНаСервере(ДокументУчета)
	
	МодульОбъекта().ДокументУчета_РаспределитьКодыМаркировки(ДокументУчета);
	
КонецПроцедуры

// Операции

&НаКлиенте
Функция Операция_Создать(ТипОперации
	, ДокументУчетаСсылка = Неопределено
	, ОперацияОснование = Неопределено
	, Организация = Неопределено) Экспорт
	
	Возврат Операция_СоздатьНаСервере(ТипОперации, ДокументУчетаСсылка, ОперацияОснование, Организация);
	
КонецФункции

&НаСервере
Функция Операция_СоздатьНаСервере(ТипОперации
	, ДокументУчетаСсылка = Неопределено
	, ОперацияОснование = Неопределено
	, Организация = Неопределено)
	
	Возврат МодульОбъекта().Операция_Создать(ТипОперации, ДокументУчетаСсылка, ОперацияОснование, Организация);
	
КонецФункции

&НаКлиенте
Процедура Операция_ВосстановитьОбменСМоментаОшибки(Операция) Экспорт
	
	Операция_ВосстановитьОбменСМоментаОшибкиНаСервере(Операция);
	
КонецПроцедуры

&НаСервере
Процедура Операция_ВосстановитьОбменСМоментаОшибкиНаСервере(Операция)
	
	МодульОбъекта().Операция_ВосстановитьОбменСМоментаОшибки(Операция);
	
КонецПроцедуры

&НаКлиенте
Процедура Операция_СоздатьИОткрыть(ТипОперации,
	ДокументУчета = Неопределено,
	ОперацияОснование = Неопределено,
	Организация = Неопределено,
	Владелец = Неопределено) Экспорт
	
	Если ОперацияОграниченаТарифом(ТипОперации, Организация) Тогда
		ОткрытьФормуОграниченияПоТарифу(Владелец, Организация, ТипОперации);
		Возврат;
	КонецЕсли;
	
	Операция = Операция_Создать(ТипОперации, ДокументУчета, ОперацияОснование, Организация);
	ОткрытьФормуОперации(Операция, Владелец);
	
КонецПроцедуры

&НаКлиенте
Функция Операция_СоздатьИЗаполнитьОперациюПечати(ДокументУчета
	, ОперацияОснование = Неопределено
	, ПараметрыПодбораКодов = Неопределено) Экспорт
	
	Результат = Операция_СоздатьИЗаполнитьОперациюПечатиНаСервере(ДокументУчета
	, ОперацияОснование
	, ПараметрыПодбораКодов);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Операция_СоздатьИЗаполнитьОперациюПечатиНаСервере(ДокументУчета
	, ОперацияОснование = Неопределено
	, ПараметрыПодбораКодов = Неопределено)
	
	Результат = МодульОбъекта().Операция_СоздатьИЗаполнитьОперациюПечати(ДокументУчета
	, ОперацияОснование
	, ПараметрыПодбораКодов);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция КодыОпераций_ЕстьКоды(Операция, КлючСтрокиОперации = Неопределено) Экспорт
	
	Возврат КодыОпераций_ЕстьКодыНаСервере(Операция, КлючСтрокиОперации);
	
КонецФункции

&НаСервере
Функция КодыОпераций_ЕстьКодыНаСервере(Операция, КлючСтрокиОперации = Неопределено)
	
	Возврат МодульОбъекта().КодыОпераций_ЕстьКоды(Операция, КлючСтрокиОперации)
	
КонецФункции

// Свойства объектов

&НаКлиенте
Процедура УстановитьПризнакНоменклатурыНеПодлежитМаркировке(Номенклатура, Значение) Экспорт
	
	УстановитьПризнакНоменклатурыНеПодлежитМаркировкеНаСервере(Номенклатура, Значение);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПризнакНоменклатурыНеПодлежитМаркировкеНаСервере(Номенклатура, Значение)
	
	МодульОбъекта().УстановитьПризнакНоменклатурыНеПодлежитМаркировке(Номенклатура, Значение);
	
КонецПроцедуры

// #Область КодыМаркировки

&НаКлиенте
Функция КодМаркировки_НайтиКлюч(КодМаркировки) Экспорт
	
	Возврат КодМаркировки_НайтиКлючНаСервере(КодМаркировки);
	
КонецФункции

&НаСервере
Функция КодМаркировки_НайтиКлючНаСервере(КодМаркировки)
	
	Возврат МодульОбъекта().КодМаркировки_НайтиКлюч(КодМаркировки);
	
КонецФункции

&НаКлиенте
Функция КодМаркировки_ВидПродукции(КодМаркировкиИлиКлючКода) Экспорт
	
	Возврат КодМаркировки_ВидПродукцииНаСервере(КодМаркировкиИлиКлючКода);
	
КонецФункции

&НаСервере
Функция КодМаркировки_ВидПродукцииНаСервере(КодМаркировкиИлиКлючКода)
	
	Возврат МодульОбъекта().КодМаркировки_ВидПродукции(КодМаркировкиИлиКлючКода);
	
КонецФункции

// #КонецОбласти

// #Область КодыДокументов

&НаКлиенте
Функция КодыДокументов_ПодготовитьТаблицуКодовДляЗагрузки(КодыМаркировки, ЗагружатьПолныеКоды, РазделителиGS1) Экспорт
	
	Возврат КодыДокументов_ПодготовитьТаблицуКодовДляЗагрузкиНаСервере(КодыМаркировки, ЗагружатьПолныеКоды, РазделителиGS1);
	
КонецФункции

&НаСервере
Функция КодыДокументов_ПодготовитьТаблицуКодовДляЗагрузкиНаСервере(КодыМаркировки, ЗагружатьПолныеКоды, РазделителиGS1)
	
	Возврат МодульОбъекта().КодыДокументов_ПодготовитьТаблицуКодовДляЗагрузки(КодыМаркировки, ЗагружатьПолныеКоды, РазделителиGS1);
	
КонецФункции

// #КонецОбласти

// #Область Тарификация

&НаСервере
Функция ОперацияОграниченаТарифом(ТипОперации, Организация)
	
	Возврат МодульОбъекта().СозданиеОперацииОграниченоТарифом(ТипОперации, МодульОбъекта().Тариф(Организация));
	
КонецФункции

&НаКлиенте
Функция Перечисление_СервисыПодписок() Экспорт
	
	КлючКэш = "СервисыПодписок";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_СервисыПодписокНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_СервисыПодписокНаСервере()
	
	Возврат МодульОбъекта().Перечисление_СервисыПодписок();
	
КонецФункции

// #КонецОбласти // Тарификация

// #Область РежимТехническогоСпециалиста

&НаКлиенте
Функция СписокСпособовОткрытияЗначения() Экспорт
	
	КлючКэш = "СписокСпособовОткрытияЗначения";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Новый СписокЗначений;
	ЗаполнитьСписокВыбора(Результат, Перечисление_СпособыОткрытияЗначения());
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПодтвердитьДействияТехническогоСпециалиста(ОписаниеОбработчика) Экспорт
	
	ТекстВопроса = НСтр("ru='Внесение изменений может привести к ошибкам при работе с модулем «Контур.Маркировка».
	|Вы уверены, что хотите выполнить команду?'");
	
	ПоказатьДиалогВопроса(ОписаниеОбработчика, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

// #КонецОбласти // РежимТехническогоСпециалиста

// Открытие форм обработки

&НаКлиенте
Процедура ОткрытьФормуМодуля(Владелец = Неопределено) Экспорт
	
	ОткрытьФормуОбработки("ФормаМодуля", Владелец);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастроекМодуля(Владелец, ТекущаяСтраница = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекущаяСтраница", ТекущаяСтраница);
	
	ОткрытьФормуОбработкиМодально("Форма_НастройкиМодуля", Владелец, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастройкиДокумента(Настройка, Владелец) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ссылка", Настройка);
	ОткрытьФормуОбработкиМодально("Форма_НастройкиДокумента", Владелец, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуКодаМаркировки(КлючКодаИлиКодМаркировки, Организация = Неопределено, Владелец = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(КлючКодаИлиКодМаркировки) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(КлючКодаИлиКодМаркировки) = Тип("УникальныйИдентификатор") Тогда
		КлючКода = КлючКодаИлиКодМаркировки;
	Иначе
		КлючКода = КодМаркировки_НайтиКлюч(КлючКодаИлиКодМаркировки);
		Если Не ЗначениеЗаполнено(КлючКода) Тогда
			ТекстОшибки = НСтр("ru = 'Код маркировки не найден в базе: %1'");
			ВызватьИсключение ПараметрыВСтроку(ТекстОшибки, КлючКодаИлиКодМаркировки);
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КлючКода", КлючКода);
	ПараметрыФормы.Вставить("Организация", Организация);
	ОткрытьФормуОбработки("Форма_КодМаркировки", Владелец, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОрганизации(Организация, Владелец = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура("Ссылка", Организация);
	ОткрытьФормуОбработки("Форма_Организация", Владелец, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСклада(СкладСсылка, Владелец = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура("Ссылка", СкладСсылка);
	ОткрытьФормуОбработки("Форма_Склад", Владелец, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСпискаСкладов(Владелец = Неопределено) Экспорт
	
	ОткрытьФормуОбработкиМодально("Форма_Склады_Список", Владелец);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВидаАгрегата(ВидАгрегата, Владелец = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура("Ссылка", ВидАгрегата);
	ОткрытьФормуОбработки("Форма_ВидАгрегата", Владелец, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораВидаАгрегата(ОписаниеОбработчика
	, ВидАгрегата = Неопределено
	, Организация = Неопределено
	, Владелец = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	
	Если ЗначениеЗаполнено(ВидАгрегата) Тогда
		ПараметрыФормы.Вставить("Ссылка", ВидАгрегата);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		ПараметрыФормы.Вставить("Организация", Организация);
	КонецЕсли;
	
	ОткрытьФормуОбработкиМодально("Форма_ВидыАгрегатов_Список", Владелец, ПараметрыФормы, ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуТовара(Товар, Владелец = Неопределено, Копирование = Ложь) Экспорт
	
	ПараметрыФормы = Новый Структура;
	
	Если Копирование Тогда
		ПараметрыФормы.Вставить("СсылкаДляКопирования", Товар);
	Иначе
		ПараметрыФормы.Вставить("Ссылка", Товар);
	КонецЕсли;
	
	ОткрытьФормуОбработки("Форма_Товар", Владелец, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСозданияТовара(GTIN, Владелец) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("GTINДляЗаполнения", GTIN);
	ОткрытьФормуОбработки("Форма_Товар", Владелец, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуДобавленияТовара(Владелец) Экспорт
	
	ОткрытьФормуОбработкиМодально("Форма_ДобавлениеТовара", Владелец);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОперации(Операция, Владелец = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ссылка", Операция);
	ОткрытьФормуОбработки("Форма_Операция", Владелец, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораВходящегоУПД(ОписаниеОбработчика, Владелец, ПараметрыФормы = Неопределено) Экспорт
	
	Если ПараметрыФормы = Неопределено Тогда
		ПараметрыФормы = Новый Структура;
	КонецЕсли;
	
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ОткрытьФормуОбработкиМодально("Форма_Операции_СписокВходящихУПД", Владелец, ПараметрыФормы, ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПереходаНаНовуюВерсиюДанных(Владелец, ОписаниеОбработчика = Неопределено) Экспорт
	
	ОткрытьФормуОбработкиМодально("Форма_ПереходНаНовуюВерсиюДанных", Владелец, , ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуШаблонаЭтикетки(ШаблонЭтикетки, Владелец = Неопределено, Копирование = Ложь) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Копирование", Копирование);
	
	Если Копирование Тогда
		ПараметрыФормы.Вставить("СсылкаДляКопирования", ШаблонЭтикетки);
	ИначеЕсли ТипЗнч(ШаблонЭтикетки) = Тип("Строка") Тогда
		ПараметрыФормы.Вставить("ПримерЭтикетки", ШаблонЭтикетки);
	Иначе
		ПараметрыФормы.Вставить("Ссылка", ШаблонЭтикетки);
	КонецЕсли;
	
	ОткрытьФормуОбработки("Форма_ШаблонЭтикетки", Владелец, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуКлючаНоменклатуры1С(КлючНоменклатуры1С, Владелец) Экспорт
	
	ПараметрыФормы = Новый Структура("Ссылка", КлючНоменклатуры1С);
	ОткрытьФормуОбработкиМодально("Форма_Номенклатура1С", Владелец, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораКлючаНоменклатуры1С(ОписаниеОбработчика, КлючНоменклатуры1С, Владелец) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("Ссылка", КлючНоменклатуры1С);
	ОткрытьФормуОбработкиМодально("Форма_Номенклатура1С", Владелец, ПараметрыФормы, ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораВидаДокумента(ОписаниеОбработчика, ВидыДокументовДляВыбора, Владелец) Экспорт
	
	Если Не ЗначениеЗаполнено(ВидыДокументовДляВыбора) Тогда
		Возврат;
	КонецЕсли;
	
	СписокВыбора = Новый СписокЗначений;
	Для каждого Элемент Из ВидыДокументовДляВыбора Цикл
		СписокВыбора.Добавить(Элемент, Элемент.Представление);
	КонецЦикла;
	
	Если ВидыДокументовДляВыбора.Количество() = 1 Тогда
		ВызватьОбработчикОповещения(ОписаниеОбработчика, СписокВыбора[0]);
	Иначе
		ЗаголовокВыбора = НСтр("ru = 'Виды документов'");
		ПоказатьДиалогВыбораЗначенияВСписке(ОписаниеОбработчика, СписокВыбора, ЗаголовокВыбора);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСервисПровайдера(СервисПровайдер, Владелец = Неопределено, Копирование = Ложь) Экспорт
	
	ПараметрыФормы = Новый Структура;
	
	Если Копирование Тогда
		ПараметрыФормы.Вставить("СсылкаДляКопирования", СервисПровайдер);
	Иначе
		ПараметрыФормы.Вставить("Ссылка", СервисПровайдер);
	КонецЕсли;
	
	ОткрытьФормуОбработки("Форма_СервисПровайдер", Владелец, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораСервисПровайдера(ОписаниеОбработчика, СервисПровайдер, Владелец) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("Ссылка", СервисПровайдер);
	ОткрытьФормуОбработкиМодально("Форма_СервисПровайдеры_Список", Владелец, ПараметрыФормы, ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПлощадки(Площадка, Владелец = Неопределено, Копирование = Ложь) Экспорт
	
	ПараметрыФормы = Новый Структура;
	
	Если Копирование Тогда
		ПараметрыФормы.Вставить("СсылкаДляКопирования", Площадка);
	Иначе
		ПараметрыФормы.Вставить("Ссылка", Площадка);
	КонецЕсли;
	
	ОткрытьФормуОбработки("Форма_Площадка", Владелец, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораПлощадки(ОписаниеОбработчика, Площадка, Организация, ВидПродукции, Владелец) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("Ссылка", Площадка);
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("ВидПродукции", ВидПродукции);
	
	ОткрытьФормуОбработкиМодально("Форма_Площадки_Список", Владелец, ПараметрыФормы, ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораОрганизации(ОписаниеОбработчика, Владелец) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	
	ОткрытьФормуОбработкиМодально("Форма_Организации_Список", Владелец, ПараметрыФормы, ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораШаблонаЭтикетки(ПослеВыбора, ТекущийШаблон, ТипЭтикетки, Владелец) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ТипЭтикетки", ТипЭтикетки);
	ПараметрыФормы.Вставить("ТекущийШаблон", ТекущийШаблон);
	
	ОткрытьФормуОбработкиМодально("Форма_ШаблоныЭтикеток_Список", Владелец, ПараметрыФормы, ПослеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуИнформацииОбОбновлении(Владелец, КонтекстОбновления, ОписаниеОбработчика = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура("КонтекстОбновления", КонтекстОбновления);
	
	ОткрытьФормуОбработкиМодально("Форма_ИнформацияОбОбновлении", Владелец, ПараметрыФормы, ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОтбораСпискаДокументов(Владелец, ПараметрыОтбора = Неопределено, ОписаниеОбработчика = Неопределено) Экспорт
	
	ОткрытьФормуОбработкиМодально("Форма_ОтборДокументовУчета", Владелец, ПараметрыОтбора, ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПросмотраСтруктуры(Владелец, Структура
	, ЗаголовокФормы = ""
	, РазрешитьРедактирование = Ложь
	, ОписаниеОбработчика = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура;
	
	Если ЭтоСтруктура(Структура)
		Или ЭтоСоответствие(Структура) Тогда
		ПараметрыФормы.Вставить("Структура", Структура);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗаголовокФормы) Тогда
		ПараметрыФормы.Вставить("Заголовок", ЗаголовокФормы);
	КонецЕсли;
	
	ПараметрыФормы.Вставить("РазрешитьРедактирование", РазрешитьРедактирование);
	
	ОткрытьФормуОбработкиМодально("Форма_ПросмотрСтруктуры", Владелец, ПараметрыФормы, ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОтчетаПоВиртуальномуСкладу(Владелец, КонтекстОтчета, ОписаниеОбработчика = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура("КонтекстОтчета", КонтекстОтчета);
	
	ОткрытьФормуОбработкиМодально("Форма_ОтчетПоВиртуальномуСкладу", Владелец, ПараметрыФормы, ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВажныеУведомления(Владелец) Экспорт
	
	ОткрытьФормуОбработкиМодально("Форма_УведомленияПользователя", Владелец);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПросмотраСписка(Владелец, КонтекстФормы, ОписаниеОбработчика = Неопределено) Экспорт
	
	ПараметрыФормы = Новый_ПараметрыФормыРедактированияСписка();
	ЗаполнитьЗначенияСвойств(ПараметрыФормы, КонтекстФормы);
	
	Список = ПараметрыФормы.Список;
	Если Не ЭтоМассив(Список)
		И Не ЭтоСписокЗначений(Список) Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФормуОбработкиМодально("Форма_ПросмотрСписка", Владелец, ПараметрыФормы, ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуМобильноеУстройство(МобильноеУстройство, Владелец = Неопределено, Копирование = Ложь) Экспорт
	
	ПараметрыФормы = Новый Структура;
	
	Если Копирование Тогда
		ПараметрыФормы.Вставить("СсылкаДляКопирования", МобильноеУстройство);
	Иначе
		ПараметрыФормы.Вставить("Ссылка", МобильноеУстройство);
	КонецЕсли;
	
	ОткрытьФормуОбработки("Форма_МобильноеУстройство", Владелец, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРеквизитовДоставки(Владелец, КонтекстФормы, ОписаниеОбработчика = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура("КонтекстФормы", КонтекстФормы);
	
	ОткрытьФормуОбработкиМодально("Форма_РеквизитыДоставки", Владелец, ПараметрыФормы, ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРедакторЗаводскихСерийныхНомеров(Владелец, КонтекстФормы, ОписаниеОбработчика = Неопределено) Экспорт
	
	ОткрытьФормуОбработкиМодально("Форма_РедакторЗСН", Владелец, КонтекстФормы, ОписаниеОбработчика);
	Метрика_Функциональность_ОткрытиеФормыРедактораЗСН();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАльтернативныеСрокиГодности(Владелец, КонтекстФормы, ОписаниеОбработчика = Неопределено) Экспорт
	
	ОткрытьФормуОбработкиМодально("Форма_АльтернативныеСрокиГодности", Владелец, КонтекстФормы, ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСтартовогоПомощника(Владелец, ДанныеПлагина = Неопределено) Экспорт
	
	ОткрытьФормуОбработкиМодально("Форма_СтартовыйПомощник", Владелец, ДанныеПлагина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОграниченияПоТарифу(Владелец, Организация, ТипОперации = Неопределено, Сервис = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("ТипОперации", ТипОперации);
	ПараметрыФормы.Вставить("Сервис", Сервис);
	
	ОткрытьФормуОбработкиМодально("Форма_ОграничениеПоТарифу", Владелец, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиСортировкиЭтикеток(Владелец, НастройкиСортировкиЭтикеток, ОписаниеОбработчика = Неопределено) Экспорт
	
	КонтекстФормы = Новый Структура("НастройкиСортировкиЭтикеток", НастройкиСортировкиЭтикеток);
	
	ОткрытьФормуОбработкиМодально("Форма_НастройкиСортировкиЭтикеток", Владелец, КонтекстФормы, ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуАдминистратораМаркировки() Экспорт
	
	ОткрытьФормуОбработки("АДМ_ОсновнаяФорма");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактораКодаМаркировки(КлючКода = Неопределено
	, Владелец = Неопределено 
	, ОписаниеОбработчика = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура("КлючКода", КлючКода);
	ОткрытьФормуОбработки("АДМ_РедакторКодаМаркировки", Владелец, ПараметрыФормы, ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактораДокументаУчета(ДокументУчета = Неопределено
	, Владелец = Неопределено
	, ОписаниеОбработчика = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура("ДокументУчета", ДокументУчета);
	ОткрытьФормуОбработки("АДМ_РедакторДокументаУчета", Владелец, ПараметрыФормы, ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактораОперации(Операция = Неопределено
	, Владелец = Неопределено
	, ОписаниеОбработчика = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура("Операция", Операция);
	ОткрытьФормуОбработки("АДМ_РедакторОперации", Владелец, ПараметрыФормы, ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПросмотраТаблицы(Владелец, АдресТаблицы, ЭтоТаблицаКодов = Ложь) Экспорт
	
	ПараметрыФормы = Новый Структура("АдресТаблицы, ЭтоТаблицаКодов", АдресТаблицы, ЭтоТаблицаКодов);
	ОткрытьФормуОбработки("Форма_ПросмотрТаблицы", Владелец, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуГрупповоеИзменениеИнформацииОКодах(Владелец, АдресТаблицыКодов, ОписаниеОбработчика = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура("АдресТаблицыКодов", АдресТаблицыКодов);
	ОткрытьФормуОбработки("АДМ_ГрупповоеИзменениеИнформацииОКодах", ЭтаФорма, ПараметрыФормы, ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуИсторииЗапросовВСервис(ВызывающаяФорма, Операция) Экспорт
	
	ОткрытьФормуОбработки("Форма_ИсторияЗапросовВСервис", ВызывающаяФорма, Новый Структура("Операция", Операция));
	
КонецПроцедуры


// Открытие форм

&НаКлиенте
Функция ИмяОбработки() Экспорт
	
	ЧастиИмени = РазделитьСтроку(ИмяФормы, ".");
	Результат = ЧастиИмени[0] + "." + ЧастиИмени[1];
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОткрытьФормуОбработки(ИмяФормыОбработки
	, Знач Владелец = Неопределено
	, ПараметрыФормы = Неопределено
	, ОбработчкиПослеЗакрытия = Неопределено) Экспорт
	
	Если Не ПроверитьУстановленнуюВерсиюМодуля() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПутьКФорме = ИмяОбработки() + ".Форма." + ИмяФормыОбработки;
	
	Если ПараметрыФормы = Неопределено Тогда
		ПараметрыФормы = Новый Структура;
	КонецЕсли;
	
	Если Владелец = Неопределено Тогда
		Владелец = ОткрытаяФормаРабочегоСтола();
		Если Владелец = Неопределено
			И ПутьКФорме <> ПутьКФормеМодуля() Тогда
			Владелец = ОткрытаяФормаМодуля();
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтоФорма(Владелец) Тогда
		Если ПутьКФорме = ПутьКФормеМодуля()
			И Владелец.ИмяФормы = ПутьКФормеРабочегоСтола() Тогда
			ПараметрыФормы.Вставить("ИдентификаторСеанса", Владелец.УникальныйИдентификатор);
		КонецЕсли;
		Если Владелец.Открыта() Тогда
			ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
		КонецЕсли;
	КонецЕсли;
	
	Если ДоступныАсинхронныеФормы() Тогда
		ОповещениеОЗакрытии = НовоеОписаниеОповещения(ОбработчкиПослеЗакрытия);
		Результат = Вычислить("ОткрытьФорму(ПутьКФорме, ПараметрыФормы, Владелец, , , , ОповещениеОЗакрытии)");
	Иначе
		Если ОбработчкиПослеЗакрытия = Неопределено Тогда
			Результат = ОткрытьФорму(ПутьКФорме, ПараметрыФормы, Владелец, , Окно);
		Иначе
			Результат = ОткрытьФормуМодально(ПутьКФорме, ПараметрыФормы, Владелец);
			ВызватьОбработчикОповещения(ОбработчкиПослеЗакрытия, Результат);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуОбработкиМодально(ИмяФормыОбработки, Владелец
	, ПараметрыФормы = Неопределено
	, ОписаниеОбработчика = Неопределено) Экспорт
	
	Если ПараметрыФормы = Неопределено Тогда
		ПараметрыФормы = Новый Структура;
	КонецЕсли;
	
	ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	
	ПутьКФорме = ИмяОбработки() + ".Форма." + ИмяФормыОбработки;
	
	Если ДоступныАсинхронныеФормы() Тогда
		ОповещениеОЗакрытии = НовоеОписаниеОповещения(ОписаниеОбработчика);
		РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		Выполнить("ОткрытьФорму(ПутьКФорме, ПараметрыФормы, Владелец, , , , ОповещениеОЗакрытии, РежимОткрытияОкна)");
	Иначе
		Результат = ОткрытьФормуМодально(ПутьКФорме, ПараметрыФормы, Владелец);
		ВызватьОбработчикОповещения(ОписаниеОбработчика, Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОбъектаИС(СсылкаНаОбъект) Экспорт
	
	Если ДоступныАсинхронныеФормы() Тогда
		Выполнить("ПоказатьЗначение( , СсылкаНаОбъект)");
	Иначе
		ОткрытьЗначение(СсылкаНаОбъект);
	КонецЕсли;
	
КонецПроцедуры

// Открывает форму списка выбора объекта 1С
//
// Параметры:
//  ОписаниеОбъектаДляВыбора - Структура - см. Новый_ОписаниеВидаДокументаДляВыбора();
//  Владелец - ФормаКлиентскогоПриложения - владелец формы выбора;
//  ОписаниеОбработчика - Структура - см ОписаниеОбработчикаОповещения();
//
&НаКлиенте
Процедура ОткрытьФормуВыбораОбъектаИС(ОписаниеОбъектаДляВыбора, Владелец, ОписаниеОбработчика) Экспорт
	
	ПолноеИмя = ОписаниеОбъектаДляВыбора.ПолноеИмяОбъекта;
	ИмяФормыВыбора = ОписаниеОбъектаДляВыбора.ИмяФормыВыбора;
	ПараметрыФормы = ОписаниеОбъектаДляВыбора.ПараметрыФормы;
	
	Если ЗначениеЗаполнено(ИмяФормыВыбора) Тогда
		ПутьКФормеВыбора = ПолноеИмя + ".Форма." + ИмяФормыВыбора;
	Иначе
		ПутьКФормеВыбора = ПолноеИмя + ".ФормаВыбора";
	КонецЕсли;
	
	Если ПараметрыФормы = Неопределено Тогда
		ПараметрыФормы = Новый Структура;
	КонецЕсли;
	
	Если ЭтоФорма(Владелец)
		И Владелец.Открыта() Тогда
		ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	КонецЕсли;
	
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	
	Если ДоступныАсинхронныеФормы() И ЭтоУправляемаяФормаВыбора(ПутьКФормеВыбора) Тогда
		ОповещениеОЗакрытии = НовоеОписаниеОповещения(ОписаниеОбработчика);
		РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		Выполнить("ОткрытьФорму(ПутьКФормеВыбора, ПараметрыФормы, Владелец, , , , ОповещениеОЗакрытии, РежимОткрытияОкна)");
	Иначе
		Результат = ОткрытьФормуМодально(ПутьКФормеВыбора, ПараметрыФормы, Владелец);
		ВызватьОбработчикОповещения(ОписаниеОбработчика, Результат);
	КонецЕсли;
	
КонецПроцедуры


// Диалоги

&НаКлиенте
Процедура ПоказатьДиалогПредупреждения(ТекстСообщения, ЗаголовокДиалога = "", ОписаниеОбработчика = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ЗаголовокДиалога) Тогда
		ЗаголовокДиалога = НаименованиеМодуля();
	КонецЕсли;
	
	Если ДоступныАсинхронныеФормы() Тогда
		ОповещениеОЗакрытии = НовоеОписаниеОповещения(ОписаниеОбработчика);
		Выполнить("ПоказатьПредупреждение(ОповещениеОЗакрытии, ТекстСообщения, , ЗаголовокДиалога)");
	Иначе
		Предупреждение(ТекстСообщения, , ЗаголовокДиалога);
		ВызватьОбработчикОповещения(ОписаниеОбработчика);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиПредупреждениеСКнопкойПодробно(ТекстСообщения, ТекстПодробно, Форма = Неопределено, ЗаголовокДиалога = "") Экспорт
	
	Если Не ЗначениеЗаполнено(ЗаголовокДиалога) Тогда
		ЗаголовокДиалога = НаименованиеМодуля();
	КонецЕсли;
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить("ОК");
	Кнопки.Добавить("Подробно...");
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Форма", Форма);
	ДопПараметры.Вставить("ТекстПодробно", ТекстПодробно);
	
	ОписаниеОбработчика = ОписаниеОбработчикаОповещения(
	"ВывестиПредупреждениеСКнопкойПодробно_ПослеПредупреждения", ЭтаФорма, ДопПараметры);
	
	ПоказатьДиалогВопроса(ОписаниеОбработчика, ТекстСообщения, Кнопки, ЗаголовокДиалога);
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиПредупреждениеСКнопкойПодробно_ПослеПредупреждения(Ответ, ДопПараметры) Экспорт
	
	Если Ответ <> "Подробно..." Тогда
		Возврат;
	КонецЕсли;
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ДопПараметры.ТекстПодробно;
	
	Если ДопПараметры.Форма <> Неопределено Тогда
		Сообщение.ИдентификаторНазначения = ДопПараметры.Форма.УникальныйИдентификатор;
	КонецЕсли;
	
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДиалогРедактированияСтандартногоПериода(ОписаниеОбработчика, Период) Экспорт
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	Диалог.Период = Период;
	
	Если ДоступныАсинхронныеФормы() Тогда
		ОповещениеОЗакрытии = НовоеОписаниеОповещения(ОписаниеОбработчика);
		Диалог.Показать(ОповещениеОЗакрытии);
	Иначе
		Если Диалог.Редактировать() Тогда
			ВызватьОбработчикОповещения(ОписаниеОбработчика, Диалог.Период);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДиалогВводаЗначения(ОписаниеОбработчика
	, Значение = Неопределено
	, Подсказка = Неопределено
	, ТипЗначения = Неопределено) Экспорт
	
	Если ДоступныАсинхронныеФормы() Тогда
		ОповещениеОЗакрытии = НовоеОписаниеОповещения(ОписаниеОбработчика);
		Выполнить("ПоказатьВводЗначения(ОповещениеОЗакрытии, Значение, Подсказка, ТипЗначения)");
	Иначе
		Результат = Неопределено;
		ЗначениеВведено = ВвестиЗначение(Значение, Подсказка, ТипЗначения);
		Если ЗначениеВведено Тогда
			Результат = Значение;
		КонецЕсли;
		ВызватьОбработчикОповещения(ОписаниеОбработчика, Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДиалогВводаСтроки(ОписаниеОбработчика, ТекСтрока, Подсказка
	, ДлинаСтроки = 0
	, Многострочность = Ложь) Экспорт
	
	Если ДоступныАсинхронныеФормы() Тогда
		ОповещениеОЗакрытии = НовоеОписаниеОповещения(ОписаниеОбработчика);
		Выполнить("ПоказатьВводСтроки(ОповещениеОЗакрытии, ТекСтрока, Подсказка, ДлинаСтроки, Многострочность)");
	Иначе
		Если ВвестиСтроку(ТекСтрока, Подсказка, ДлинаСтроки, Многострочность) Тогда
			Результат = ТекСтрока;
		Иначе
			Результат = Неопределено;
		КонецЕсли;
		ВызватьОбработчикОповещения(ОписаниеОбработчика, Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДиалогВводаДаты(ОписаниеОбработчика, ТекДата, Подсказка, ЧастьДаты = Неопределено) Экспорт
	
	Если ЧастьДаты = Неопределено Тогда
		ЧастьДаты = ЧастиДаты.ДатаВремя;
	КонецЕсли;
	
	Если ДоступныАсинхронныеФормы() Тогда
		ОповещениеОЗакрытии = НовоеОписаниеОповещения(ОписаниеОбработчика);
		Выполнить("ПоказатьВводДаты(ОповещениеОЗакрытии, ТекДата, Подсказка, ЧастьДаты)");
	Иначе
		Если ВвестиДату(ТекДата, Подсказка, ЧастьДаты) Тогда
			Результат = ТекДата;
		Иначе
			Результат = Неопределено;
		КонецЕсли;
		ВызватьОбработчикОповещения(ОписаниеОбработчика, Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДиалогВыбораИзСписка(ОписаниеОбработчика, Значения, Элемент, Форма, ТекЗначение = Неопределено) Экспорт
	
	СписокВыбора = Новый СписокЗначений;
	ЗаполнитьСписокВыбора(СписокВыбора, Значения);
	НачальноеЗначение = СписокВыбора.НайтиПоЗначению(ТекЗначение);
	
	Если ДоступныАсинхронныеФормы() Тогда
		ОповещениеОЗакрытии = НовоеОписаниеОповещения(ОписаниеОбработчика);
		Форма.ПоказатьВыборИзСписка(ОповещениеОЗакрытии, СписокВыбора, Элемент, НачальноеЗначение);
	Иначе
		ВыбранноеЗначение = Форма.ВыбратьИзСписка(СписокВыбора, Элемент, НачальноеЗначение);
		ВызватьОбработчикОповещения(ОписаниеОбработчика, ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДиалогВыбораЗначенияВСписке(ОписаниеОбработчика, СписокЗначений
	, ЗаголовокДиалога = Неопределено
	, ТекущееЗначение = Неопределено) Экспорт
	
	НачальноеЗначение = СписокЗначений.НайтиПоЗначению(ТекущееЗначение);
	
	Если ДоступныАсинхронныеФормы() Тогда
		ОповещениеОЗакрытии = НовоеОписаниеОповещения(ОписаниеОбработчика);
		СписокЗначений.ПоказатьВыборЭлемента(ОповещениеОЗакрытии, ЗаголовокДиалога, НачальноеЗначение);
	Иначе
		ВыбранноеЗначение = СписокЗначений.ВыбратьЭлемент(ЗаголовокДиалога, НачальноеЗначение);
		ВызватьОбработчикОповещения(ОписаниеОбработчика, ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДиалогОтметкиЭлементовВСписке(ОписаниеОбработчика, СписокЗначений, ЗаголовокДиалога) Экспорт
	
	Если ДоступныАсинхронныеФормы() Тогда
		ОповещениеОЗакрытии = НовоеОписаниеОповещения(ОписаниеОбработчика);
		СписокЗначений.ПоказатьОтметкуЭлементов(ОповещениеОЗакрытии, ЗаголовокДиалога);
	Иначе
		
		Результат = Неопределено;
		
		НажатаКнопкаОК = СписокЗначений.ОтметитьЭлементы(ЗаголовокДиалога);
		Если НажатаКнопкаОК Тогда
			Результат = СписокЗначений;
		КонецЕсли;
		
		ВызватьОбработчикОповещения(ОписаниеОбработчика, Результат);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДиалогВыбораИзМеню(ВызывающаяФорма, ОписаниеОбработчика, СписокЗначений, Элемент = Неопределено) Экспорт
	
	Если ДоступныАсинхронныеФормы() Тогда
		ОповещениеОЗакрытии = НовоеОписаниеОповещения(ОписаниеОбработчика);
		Выполнить("ВызывающаяФорма.ПоказатьВыборИзМеню(ОповещениеОЗакрытии, СписокЗначений, Элемент)");
	Иначе
		Результат = ВызывающаяФорма.ВыбратьИзМеню(СписокЗначений, Элемент);
		ВызватьОбработчикОповещения(ОписаниеОбработчика, Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДиалогРасписанияРегламентногоЗадания(ОписаниеОбработчика, Расписание) Экспорт
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);
	
	Если ДоступныАсинхронныеФормы() Тогда
		ОповещениеОЗакрытии = НовоеОписаниеОповещения(ОписаниеОбработчика);
		Диалог.Показать(ОповещениеОЗакрытии);
	Иначе
		Диалог.ОткрытьМодально();
		ВызватьОбработчикОповещения(ОписаниеОбработчика, Диалог.Расписание);
	КонецЕсли;
	
КонецПроцедуры

// Возвращает структуру параметров диалога выбора файла
// 
// Возвращаемое значение:
//  Структура - параметры диалога выбора файла:
//   * Заголовок - Строка - Содержит текст заголовка окна диалога выбора файла (файлов);
//   * Каталог - Строка - Содержит значение текущего каталога;
//   * МножественныйВыбор - Булево - Содержит признак множественного выбора файлов;
//   * Фильтр - Строка - Содержит строку с набором файловых фильтров;
//
&НаКлиенте
Функция Новый_ПараметрыДиалогаВыбораФайла() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Заголовок", "");
	Результат.Вставить("Каталог", "");
	Результат.Вставить("МножественныйВыбор", Истина);
	Результат.Вставить("Фильтр", "");
	
	Возврат Результат;
	
КонецФункции

// Показывает диалог выбора файла
//
// Параметры:
//  ОписаниеОбработчика - Структура - см. функцию ОписаниеОбработчикаОповещения();
//  ПараметрыВыбора - Структура - см. функцию Новый_ПараметрыДиалогаВыбораФайла();
//
&НаКлиенте
Процедура ПоказатьДиалогВыбораФайла(ОписаниеОбработчика, ПараметрыВыбора) Экспорт
	
	ЗаголовокДиалога = ПараметрыВыбора.Заголовок;
	
	Если Не ЗначениеЗаполнено(ЗаголовокДиалога) Тогда
		ЗаголовокДиалога = НаименованиеМодуля();
	КонецЕсли;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = ПараметрыВыбора.Фильтр;
	Диалог.Заголовок = ЗаголовокДиалога;
	Диалог.МножественныйВыбор = ПараметрыВыбора.МножественныйВыбор;
	Диалог.Каталог = ПараметрыВыбора.Каталог;
	
	Если ДоступныАсинхронныеФормы() Тогда
		ОповещениеОЗакрытии = НовоеОписаниеОповещения(ОписаниеОбработчика);
		Диалог.Показать(ОповещениеОЗакрытии);
	Иначе
		Если Диалог.Выбрать() Тогда
			Результат = Диалог.ВыбранныеФайлы;
		Иначе
			Результат = Неопределено;
		КонецЕсли;
		ВызватьОбработчикОповещения(ОписаниеОбработчика, Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДиалогВыбораКаталога(ОписаниеОбработчика
	, ЗаголовокДиалога = Неопределено
	, ТекКаталог = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ЗаголовокДиалога) Тогда
		ЗаголовокДиалога = НаименованиеМодуля();
	КонецЕсли;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Каталог = ТекКаталог;
	Диалог.Заголовок = ЗаголовокДиалога;
	
	Если ДоступныАсинхронныеФормы() Тогда
		ОповещениеОЗакрытии = НовоеОписаниеОповещения(ОписаниеОбработчика);
		Диалог.Показать(ОповещениеОЗакрытии);
	Иначе
		КаталогВыбран = Диалог.Выбрать();
		Если КаталогВыбран Тогда
			Результат = ЗначениеВМассиве(Диалог.Каталог);
			ВызватьОбработчикОповещения(ОписаниеОбработчика, Результат);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДиалогСохраненияФайла(ОписаниеОбработчика
	, Фильтр = ""
	, ЗаголовокДиалога = ""
	, ИмяФайла = ""
	, Расширение = ""
	, Каталог = "") Экспорт
	
	Если Не ЗначениеЗаполнено(ЗаголовокДиалога) Тогда
		ЗаголовокДиалога = НаименованиеМодуля();
	КонецЕсли;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Фильтр = Фильтр;
	Диалог.Каталог = Каталог;
	Диалог.Расширение = Расширение;
	Диалог.ПолноеИмяФайла = ИмяФайла;
	Диалог.Заголовок = ЗаголовокДиалога;
	
	Если ДоступныАсинхронныеФормы() Тогда
		ОповещениеОЗакрытии = НовоеОписаниеОповещения(ОписаниеОбработчика);
		Диалог.Показать(ОповещениеОЗакрытии);
	Иначе
		ФайлВыбран = Диалог.Выбрать();
		Если ФайлВыбран Тогда
			ВызватьОбработчикОповещения(ОписаниеОбработчика, Диалог.ВыбранныеФайлы);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Формирует и выводит сообщение, которое может быть "привязано" к форме.
//
// Параметры:
//  ТекстСообщения     - Строка                  - текст выводимого сообщения.
//  ИдентификаторФормы - УникальныйИдентификатор - идентификатор формы, к которой должно быть "привязано" сообщение.
//                                                 Если не указан, сообщение привязывается к активному окну.
//  ПолеФормы          - Строка                  - путь к реквизиту формы, для которого нужно вывести сообщение.
//
// Варианты вызова:
//   СообщитьПользователюЛок(НСтр("ru = 'Сообщение об ошибке.'")) - Сообщение будет "привязано" к активной форме.
//
//   СообщитьПользователюЛок(НСтр("ru = 'Сообщение об ошибке.'"),
//   ОбщийКонтекстКлиентСервер.ИдентификаторФормы)       - Сообщение будет "привязано" к основной форме.
//
//   СообщитьПользователюЛок(НСтр("ru = 'Сообщение об ошибке.'"),
//   ОбщийКонтекстКлиентСервер.ИдентификаторФормы,
//   "Объект.СписокДокументов[2]")                             - Сообщение выводится в списке документов основной формы
//                                                               рядом со строкой с индексом 2.
//
&НаКлиенте
Процедура СообщитьПользователюЛок(ТекстСообщения, ИдентификаторФормы = Неопределено, ПолеФормы = Неопределено) Экспорт
	
	Сообщение = Новый СообщениеПользователю;
	
	Сообщение.Текст = ТекстСообщения;
	
	Если ЗначениеЗаполнено(ИдентификаторФормы) Тогда
		Сообщение.ИдентификаторНазначения = ИдентификаторФормы;
	КонецЕсли;
	
	Если ПолеФормы <> Неопределено Тогда
		Сообщение.Поле = ПолеФормы;
	КонецЕсли;
	
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаКлиенте
Процедура СообщитьРезультатЗагрузкиТоваров(РезультатЗагрузки, ИдентификаторФормы, СообщениеНетДанных = "") Экспорт
	
	Если Не ЗначениеЗаполнено(РезультатЗагрузки) Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьИзменения = СвойствоСтруктуры(РезультатЗагрузки, "ЕстьИзменения", Ложь);
	СозданоТоваров =РезультатЗагрузки.СозданоТоваров;
	ОбновленоТоваров = РезультатЗагрузки.ОбновленоТоваров;
	
	Если Не ЕстьИзменения
		И Не ЗначениеЗаполнено(СозданоТоваров)
		И Не ЗначениеЗаполнено(ОбновленоТоваров) Тогда
		Если ЗначениеЗаполнено(СообщениеНетДанных) Тогда
			СообщитьПользователюЛок(СообщениеНетДанных, УникальныйИдентификатор);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СозданоТоваров) Тогда
		ТекстСообщения = НСтр("ru = 'Создано новых товаров: %1'");
		ТекстСообщения = ПараметрыВСтроку(ТекстСообщения, СозданоТоваров);
		СообщитьПользователюЛок(ТекстСообщения, ИдентификаторФормы);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОбновленоТоваров) Тогда
		ТекстСообщения = НСтр("ru = 'Обновлено товаров: %1'");
		ТекстСообщения = ПараметрыВСтроку(ТекстСообщения, ОбновленоТоваров);
		СообщитьПользователюЛок(ТекстСообщения, ИдентификаторФормы);
	КонецЕсли;
	
КонецПроцедуры

// Показывает вопрос для сохранения изменений в карточке объекта и вызывает нужный обработчик
//
// Параметры:
//  ОбработчикЗаписи - Строка - экспортный метод для записи изменений;
//  ВызывающаяФорма - ФормаКлиентскогоПриложения - форма владелец обработчика;
//  Отказ - Булево - признак отказа от закрытия формы;
//  ЗавершениеРаботы - Булево - признак того, что происходит процесс завершения работы приложения;
//
&НаКлиенте
Процедура СохранитьИзмененияНаФорме(ОбработчикЗаписи, ВызывающаяФорма, Отказ = Ложь, ЗавершениеРаботы = Ложь) Экспорт
	
	Если Не ВызывающаяФорма.Модифицированность Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоЗавершениеРаботыПрограммы(ЗавершениеРаботы) Тогда
		Возврат; // При завершении работы программы серверный вызов недоступен
	КонецЕсли;
	
	Отказ = Истина;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ВызывающаяФорма", ВызывающаяФорма);
	ДопПараметры.Вставить("ОбработчикЗаписи", ОбработчикЗаписи);
	
	ТекстВопроса = НСтр("ru = 'Сохранить изменения?'");
	ОписаниеОбработчика = ОписаниеОбработчикаОповещения("СохранитьИзмененияНаФормеПослеСогласия", ЭтаФорма, ДопПараметры);
	ПоказатьДиалогВопроса(ОписаниеОбработчика, ТекстВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИзмененияНаФормеПослеСогласия(Ответ, ДопПараметры) Экспорт
	
	ВызывающаяФорма = ДопПараметры.ВызывающаяФорма;
	ОбработчикЗаписи = ДопПараметры.ОбработчикЗаписи;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОписаниеОбработчика = ОписаниеОбработчикаОповещения(ОбработчикЗаписи, ВызывающаяФорма);
		ВызватьОбработчикОповещения(ОписаниеОбработчика);
	КонецЕсли;
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		ВызывающаяФорма.Модифицированность = Ложь;
		ВызывающаяФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

// Возвращает структуру параметров формы редактирования списка
// 
// Возвращаемое значение:
//  Структура - параметры диалога выбора файла:
//   * ЗаголовокФормы - Строка - Содержит текст заголовка окна диалога выбора файла (файлов);
//   * Список - СписокЗначений, Массив - Содержит редактируемый или просматриваемый список;
//   * РазрешитьРедактирование - Булево - Истина - список можно редактировать, Ложь - Только просмотр;
//   * ИспользоватьПометки - Булево - Истина - список редактируется только выставлением пометок;
//   * МассивТипов - Массив - Содержит массив возможных типов списка занчений
//
&НаКлиенте
Функция Новый_ПараметрыФормыРедактированияСписка() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Заголовок", "");
	Результат.Вставить("Список", Неопределено);
	Результат.Вставить("РазрешитьРедактирование", Ложь);
	Результат.Вставить("ИспользоватьПометки", Ложь);
	Результат.Вставить("МассивТипов", Новый Массив);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура НастроитьКнопкуОбменаССервисом(Кнопка, ОбменССервисомВыполняется) Экспорт
	
	Если ОбменССервисомВыполняется Тогда
		Кнопка.Заголовок = НСтр("ru = 'Выполняется обмен...'");
		Кнопка.Доступность = Ложь;
	Иначе
		Кнопка.Заголовок = НСтр("ru = 'Обмен с сервисом'");
		Кнопка.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Авторизация

&НаСервере
Функция КонтекстОбменаНаСервере(Организация, ПродлеватьДоступГИС = Истина) Экспорт
	
	КонтекстОбмена = МодульОбъекта().КонтекстОбменаССервисом(Организация, , ПродлеватьДоступГИС);
	
	МодульОбъекта().Авторизация_Выполнить(КонтекстОбмена);
	
	Возврат КонтекстОбмена;
	
КонецФункции

&НаКлиенте
Функция Авторизация_Выполнить(КонтекстОбмена) Экспорт
	
	НужнаАвторизацияПортала = КонтекстОбмена.ТребуетсяАвторизацияПортала И Не КонтекстОбмена.ВыполненаАвторизацияПортала;
	НужнаАвторизацияГИС = КонтекстОбмена.ТребуетсяАвторизацияГИС И Не КонтекстОбмена.ВыполненаАвторизацияГИС;
	
	Если Не НужнаАвторизацияПортала И Не НужнаАвторизацияГИС Тогда
		Возврат Истина;
	КонецЕсли;
	
	ПроверитьДоступностьПодписиНаКлиенте(КонтекстОбмена);
	Если Не КонтекстОбмена.ДоступнаПодписьНаКлиенте Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НужнаАвторизацияПортала Тогда
		Если АвторизацияПортал_Выполнить(КонтекстОбмена) Тогда
			// После авторизации на портале дополнительно проверяется доступ в ГИС МТ
			НужнаАвторизацияГИС = КонтекстОбмена.ТребуетсяАвторизацияГИС И Не КонтекстОбмена.ВыполненаАвторизацияГИС;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если НужнаАвторизацияГИС
		И Не АвторизацияГИС_Продлить(КонтекстОбмена) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция АвторизацияПортал_Выполнить(КонтекстОбмена)
	
	Организация = КонтекстОбмена.Организация;
	Сертификат = КонтекстОбмена.Сертификат;
	ОтпечатокСертификата = КонтекстОбмена.ОтпечатокСертификата;
	
	Попытка
		
		ФайлСертификата = Плагин_ФайлСертификата(ОтпечатокСертификата);
		ЗашифрованныйКлюч = Портал_ЗапроситьАвторизацию(ФайлСертификата);
		
	Исключение
		
		Ошибка = ИнформацияОбОшибке();
		Действие = "Авторизация в сервисе Контур.Маркировка";
		ДопИнформация = Новый Структура;
		ДопИнформация.Вставить("Организация", Организация);
		ДопИнформация.Вставить("Сертификат", Сертификат);
		ТекстСообщения = ПараметрыВСтроку(НСтр(
		"ru = 'Не удалось выполнить авторизацию в сервисе Контур.Маркировка по организации: %1'"), Организация);
		ОбработатьОшибку(Действие, Ошибка, ДопИнформация, ТекстСообщения);
		
		Если КонтекстОбмена.ВызыватьИсключение Тогда
			ВызватьИсключение;
		КонецЕсли;
		
		Возврат Ложь;
		
	КонецПопытки;
	
	Попытка
		
		РасшифрованныйКлюч = Плагин_РасшифроватьКонтент(ЗашифрованныйКлюч);
		
	Исключение
		
		Ошибка = ИнформацияОбОшибке();
		Действие = "Расшифровка ключа авторизации в сервисе Контур.Маркировка";
		ДопИнформация = Новый Структура;
		ДопИнформация.Вставить("Организация", Организация);
		ДопИнформация.Вставить("Сертификат", Сертификат);
		ОбработатьОшибку(Действие, Ошибка, ДопИнформация);
		
		КонтекстОбмена.ТекстОшибки = КраткоеПредставлениеОшибки(Ошибка);
		КонтекстОбмена.НеУдалосьРасшифроватьКонтент = Истина;
		
		Если КонтекстОбмена.ВызыватьИсключение Тогда
			ВызватьИсключение;
		КонецЕсли;
		
		Возврат Ложь;
		
	КонецПопытки;
	
	АвторизацияПортал_ВыполнитьПослеРасшифровки(РасшифрованныйКлюч, КонтекстОбмена);
	
	Возврат КонтекстОбмена.ВыполненаАвторизацияПортала;
	
КонецФункции

&НаСервере
Процедура АвторизацияПортал_ВыполнитьПослеРасшифровки(РасшифрованныйКлюч, КонтекстОбмена)
	
	МодульОбъекта().АвторизацияПортал_ВыполнитьПослеРасшифровки(РасшифрованныйКлюч, КонтекстОбмена);
	
КонецПроцедуры

&НаСервере
Процедура АвторизацияГИС_Проверить(КонтекстОбмена)
	
	МодульОбъекта().АвторизацияГИС_Проверить(КонтекстОбмена);
	
КонецПроцедуры

&НаСервере
Функция Портал_ЗапроситьАвторизацию(ФайлСертификата)
	
	Возврат МодульОбъекта().Портал_ЗапроситьАвторизацию(ФайлСертификата);
	
КонецФункции

&НаКлиенте
Функция АвторизацияГИС_Продлить(КонтекстОбмена)
	
	Организация = КонтекстОбмена.Организация;
	Сертификат = КонтекстОбмена.Сертификат;
	ОтпечатокСертификата = КонтекстОбмена.ОтпечатокСертификата;
	
	Попытка
		
		ФайлыДляПодписи = Маркировка_ФайлыАвторизацииГИС(Организация, Сертификат);
		АвторизацияГИС_ПодписатьФайлы(ФайлыДляПодписи, КонтекстОбмена);
		АвторизацияГИС_ПродлитьПослеПодписания(Организация, Сертификат, ФайлыДляПодписи);
		
	Исключение
		
		Ошибка = ИнформацияОбОшибке();
		Действие = "Продление авторизации в ГИС МТ";
		ДопИнформация = Новый Структура;
		ДопИнформация.Вставить("Организация", Организация);
		ДопИнформация.Вставить("Сертификат", Сертификат);
		ТекстСообщения = ПараметрыВСтроку(НСтр(
		"ru = 'Не удалось продлить авторизацию в ГИС МТ по организации: %1'"), Организация);
		ОбработатьОшибку(Действие, Ошибка, ДопИнформация, ТекстСообщения);
		
		КонтекстОбмена.ТекстОшибки = КраткоеПредставлениеОшибки(Ошибка);
		
		Если КонтекстОбмена.ВызыватьИсключение Тогда
			ВызватьИсключение;
		КонецЕсли;
		
		Возврат Ложь;
		
	КонецПопытки;
	
	КонтекстОбмена.ВыполненаАвторизацияГИС = Истина;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура АвторизацияГИС_ПодписатьФайлы(ФайлыДляПодписи, КонтекстОбмена)
	
	Организация = КонтекстОбмена.ОтпечатокСертификата;
	Сертификат = КонтекстОбмена.Сертификат;
	ОтпечатокСертификата = КонтекстОбмена.ОтпечатокСертификата;
	
	МассивФайлов = Новый Массив;
	Для каждого ОписаниеФайла Из ФайлыДляПодписи Цикл
		ДополнитьМассив(МассивФайлов, МассивСтруктур_Выгрузить(ОписаниеФайла.contents, "content"));
	КонецЦикла;
	
	Попытка
		
		Подписи = Плагин_ПодписатьДанные(МассивФайлов, ОтпечатокСертификата, Истина);
		
	Исключение
		
		Ошибка = ИнформацияОбОшибке();
		Действие = НСтр("ru = 'Подписание файлов для продления в ГИС МТ'");
		ДопИнформация = Новый Структура;
		ДопИнформация.Вставить("Организация", Организация);
		ДопИнформация.Вставить("Сертификат", Сертификат);
		ДопИнформация.Вставить("ОтпечатокСертификата", ОтпечатокСертификата);
		ОбработатьОшибку(Действие, Ошибка, ДопИнформация);
		
		КонтекстОбмена.ТекстОшибки = КраткоеПредставлениеОшибки(Ошибка);
		КонтекстОбмена.НеУдалосьПодписатьФайлы = Истина;
		
		ВызватьИсключение;
		
	КонецПопытки;
	
	Для каждого ОписаниеФайла Из ФайлыДляПодписи Цикл
		Для каждого Элемент Из ОписаниеФайла.contents Цикл
			ИндексПодписи = МассивФайлов.Найти(Элемент.content);
			Элемент.content = Подписи[ИндексПодписи];
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура АвторизацияГИС_ПродлитьПослеПодписания(Организация, Сертификат, ПодписанныеФайлы)
	
	МодульОбъекта().АвторизацияГИС_ПродлитьПослеПодписания(Организация, Сертификат, ПодписанныеФайлы);
	
КонецПроцедуры

&НаСервере
Функция Маркировка_ФайлыАвторизацииГИС(Организация, Сертификат)
	
	Возврат МодульОбъекта().Маркировка_ФайлыАвторизацииГИС(Организация, Сертификат);
	
КонецФункции

// Сертификаты

&НаКлиенте
Процедура ПоказатьОшибкиСертификата(КонтекстОбмена, ВызывающаяФорма)
	
	Сертификат = КонтекстОбмена.Сертификат;
	Организация = КонтекстОбмена.Организация;
	
	Если Не ЗначениеЗаполнено(Сертификат) Тогда
		
		Действие = НСтр("ru = 'Проверка сертификата'");
		ШаблонОшибки = НСтр("ru = 'Не указана настройка подписания для ""%1""'");
		ТекстСообщения = ПараметрыВСтроку(ШаблонОшибки, Организация);
		ОбработатьОшибку(Действие, , Организация, ТекстСообщения, ВызывающаяФорма.УникальныйИдентификатор);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Организация", Организация);
		ОткрытьФормуНастройкиПодписания(ПараметрыФормы, ВызывающаяФорма);
		
		Возврат;
		
	КонецЕсли;
	
	НетДоступаВГИС = 
	КонтекстОбмена.ТребуетсяАвторизацияГИС
	И Не КонтекстОбмена.ВыполненаАвторизацияГИС;
	
	НетДоступаКПорталу = 
	КонтекстОбмена.ТребуетсяАвторизацияПортала
	И Не КонтекстОбмена.ВыполненаАвторизацияПортала;
	
	НеУдалосьПодписать = КонтекстОбмена.НеУдалосьПодписатьФайлы;
	НеУдалосьРасшифровать = КонтекстОбмена.НеУдалосьРасшифроватьКонтент;
	
	Если НетДоступаВГИС
		Или НетДоступаКПорталу
		Или НеУдалосьПодписать
		Или НеУдалосьРасшифровать Тогда
		
		ВидСертификата = ЗначениеРеквизитаОбъекта_Марк(Сертификат, "ВидСертификата");
		Если ВидСертификата = Перечисление_ВидыСертификатов().НаФизЛицо Тогда
			Пользователь = Пользователи_ТекущийПользователь();
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Сертификат", Сертификат);
		ПараметрыФормы.Вставить("Организация", Организация);
		ПараметрыФормы.Вставить("Пользователь", Пользователь);
		ПараметрыФормы.Вставить("КонтекстОбмена", КонтекстОбмена);
		ОткрытьФормуНастройкиПодписания(ПараметрыФормы, ВызывающаяФорма);
		
	КонецЕсли;
	
КонецПроцедуры

// Проверяет сертификат установленный на компьютер клиента
//
// Параметры:
//  КонтекстОбмена - Строка - см. Новый_КонтекстОбмена();
//
&НаКлиенте
Процедура ПроверитьДоступностьПодписиНаКлиенте(КонтекстОбмена)
	
	Если Не КонтекстОбмена.ПроверитьСертификатНаКлиенте Тогда
		Возврат;
	КонецЕсли;
	
	Сертификат = КонтекстОбмена.Сертификат;
	Организация = КонтекстОбмена.Организация;
	ОтпечатокСертификата = КонтекстОбмена.ОтпечатокСертификата;
	
	Если Не ЗначениеЗаполнено(Сертификат) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не МожноИспользоватьКриптографиюНаКлиенте() Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстОбмена.ПроверитьСертификатНаКлиенте = Ложь;
	
	Попытка
		ДанныеСертификата = Плагин_НайтиСертификат(ОтпечатокСертификата);
	Исключение
		
		Ошибка = ИнформацияОбОшибке();
		Действие = НСтр("ru = 'Проверка сертификата'");
		ДопИнформация = Новый СписокЗначений;
		ДопИнформация.Добавить(Организация, "Организация");
		ДопИнформация.Добавить(Сертификат, "Сертификат");
		ДопИнформация.Добавить(ОтпечатокСертификата, "Отпечаток сертификата");
		ОбработатьОшибку(Действие, Ошибка, ДопИнформация);
		
		КонтекстОбмена.ТекстОшибки = ПодробноеПредставлениеОшибки(Ошибка);
		
		Возврат;
		
	КонецПопытки;
	
	Если Не ЗначениеЗаполнено(ДанныеСертификата) Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстОбмена.СертификатУстановленНаКлиенте = Истина;
	
	Если ДанныеСертификата.ЕстьЗакрытыйКлюч Тогда
		КонтекстОбмена.ЕстьЗакрытыйКлюч = Истина;
	КонецЕсли;
	
	Если Не СрокДействияСертификатаИстек(ДанныеСертификата.ДатаОкончания) Тогда
		
		КонтекстОбмена.СертификатДействует = Истина;
		
		Если СрокДействияСертификатаЗаканчивается(ДанныеСертификата.ДатаОкончания) Тогда
			КонтекстОбмена.СрокДействияСертификатаИстекает = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если КонтекстОбмена.СертификатУстановленНаКлиенте
		И КонтекстОбмена.СертификатДействует
		И КонтекстОбмена.ЕстьЗакрытыйКлюч Тогда
		КонтекстОбмена.ДоступнаПодписьНаКлиенте = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьФайлыОчередиОбменаНаКлиенте(КонтекстОбмена)
	
	Если КонтекстОбмена.ДоступнаПодписьНаСервере Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьДоступностьПодписиНаКлиенте(КонтекстОбмена);
	Если Не КонтекстОбмена.ДоступнаПодписьНаКлиенте Тогда
		Возврат;
	КонецЕсли;
	
	ПодписатьФайлы = Истина;
	Пока ПодписатьФайлы Цикл
		Если ОчередьОбмена_ПрочитатьНовуюПорциюФайловДляПодписи(КонтекстОбмена)
			И ОчередьОбмена_ПодписатьФайлы(КонтекстОбмена) Тогда
			ОчередьОбмена_ЗаписатьФайлыПодписейУстановитьНовоеДействие(КонтекстОбмена);
		Иначе
			ПодписатьФайлы = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредупредитьЧтоСрокДействияСертификатаИстекает(КонтекстОбмена)
	
	Если КонтекстОбмена.СрокДействияСертификатаИстекает Тогда
		Оповестить("КонтурМаркировка_ИстекаетСрокДействияСертификата");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СрокДействияСертификатаИстек(ДатаОкончания)
	
	Результат = ДатаОкончания < НачалоДня(ТекущаяДата());
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СрокДействияСертификатаЗаканчивается(ДатаОкончания)
	
	ДатаПредупреждения = ДатаОкончания - СрокПредупрежденияОбОкончанииСертификата();
	
	Результат = ДатаПредупреждения < ТекущаяДата();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СрокПредупрежденияОбОкончанииСертификата()
	
	КлючКэш = "СрокПредупрежденияОбОкончанииСертификата";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = СрокПредупрежденияОбОкончанииСертификатаНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция СрокПредупрежденияОбОкончанииСертификатаНаСервере()
	
	Возврат МодульОбъекта().СрокПредупрежденияОбОкончанииСертификата();
	
КонецФункции

// #Область ОбновлениеМодуля

&НаКлиенте
Функция КонтекстОбновления() Экспорт
	
	Возврат КонтекстОбновленияНаСервере();
	
КонецФункции

&НаСервере
Функция КонтекстОбновленияНаСервере()
	
	Возврат МодульОбъекта().КонтекстОбновления();
	
КонецФункции

&НаКлиенте
Процедура ПроверитьДоступностьФайлаМодуляНаКлиенте(КонтекстОбновления) Экспорт
	
	Информация = КонтекстОбновления.ИнформацияОФайлеНаДиске;
	
	Если Не ЗначениеЗаполнено(Информация.ПутьКФайлу) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не КонтекстОбновления.ЕстьОбновлениеМодуля Тогда
		Возврат;
	КонецЕсли;
	
	Файл = НовыйФайл(Информация.ПутьКФайлу);
	
	ДоступенНаКлиенте = Ложь;
	
	Если Файл.Существует() Тогда
		
		Каталог	 = Файл.Путь;
		ИмяФайла = Файл.Имя;
		
		ИмяТестовогоФайла   = "KonturMARK_WriteTest.txt";
		ПутьКТестовомуФайлу = ОбъединитьПути(Каталог, ИмяТестовогоФайла);
		
		Попытка
			// BSLLS:FileSystemAccess-off
			Запись = Новый ЗаписьТекста(ПутьКТестовомуФайлу);
			// BSLLS:FileSystemAccess-on
			Запись.Записать("Тест записи файла перед обновлением " + ИмяФайла);
			Запись.Закрыть();
			ДоступенНаКлиенте = Истина;
		Исключение
			Ошибка = ИнформацияОбОшибке();
		КонецПопытки;
		
		Попытка
			// BSLLS:FileSystemAccess-off
			УдалитьФайлы(ПутьКТестовомуФайлу);
			// BSLLS:FileSystemAccess-on
		Исключение
			Ошибка = ИнформацияОбОшибке();
			ДоступенНаКлиенте = Ложь;
		КонецПопытки;
		
	КонецЕсли;
	
	Информация.ДоступенНаКлиенте = ДоступенНаКлиенте;
	
	Если Не Информация.ДоступенНаСервере
		И Не Информация.ДоступенНаКлиенте Тогда
		КонтекстОбновления.НевозможноВыполнитьОбновление = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Скачивает новую версию модуля и записывает его на диск или в справочник
//
// Параметры:
//  КонтекстОбновления - Структура - см. функцию Новый_КонтекстОбновленияМодуля();
//
&НаКлиенте
Процедура ВыполнитьОбновлениеМодуля(КонтекстОбновления) Экспорт
	
	РасположениеМодуля = КонтекстОбновления.РасположениеМодуля;
	ВариантыРасположения = Перечисление_ВариантыРасположенияОбработки();
	
	// Фиксируем старую версию модуля заранее,
	// чтобы избежать ошибки записи в расширении после обновления подсистемы
	СтараяВерсияМодуля_Записать(КонтекстОбновления.ТекущаяВерсияМодуля);
	
	Если РасположениеМодуля = ВариантыРасположения.НаДиске Тогда
		
		ОбновитьМодульНаДиске(КонтекстОбновления);
		
	ИначеЕсли РасположениеМодуля = ВариантыРасположения.ВСправочнике Тогда
		
		ОбновитьМодульВСправочнике(КонтекстОбновления);
		
	ИначеЕсли РасположениеМодуля = ВариантыРасположения.ВРасширении Тогда
		
		ОбновитьРасширениеКонфигурации(КонтекстОбновления);
		
	Иначе
		
		ТекстОшибки = ПараметрыВСтроку(НСтр(
		"ru = 'Не удалось обновить модуль!
		|Некорректное расположение модуля: %1'"), РасположениеМодуля);
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	КонтекстОбновления.ОбновлениеВыполнено = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьМодульНаДиске(КонтекстОбновления)
	
	ИнформацияОФайле = КонтекстОбновления.ИнформацияОФайлеНаДиске;
	
	Если ИнформацияОФайле.ДоступенНаКлиенте Тогда
		
		ОбновитьМодульНаДискеНаКлиенте(КонтекстОбновления);
		
	ИначеЕсли ИнформацияОФайле.ДоступенНаСервере Тогда
		
		ОбновитьМодульНаДискеНаСервере(КонтекстОбновления);
		
	Иначе
		
		ТекстОшибки = ПараметрыВСтроку(НСтр(
		"ru = 'Не удалось обновить модуль!
		|Нет доступа к файлу: %1'"), ИнформацияОФайле.ПутьКФайлу);
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьМодульНаДискеНаКлиенте(КонтекстОбновления)
	
	СсылкаНаФайл = КонтекстОбновления.АдресОбновления;
	ПутьКФайлу = КонтекстОбновления.ИнформацияОФайлеНаДиске.ПутьКФайлу;
	
	ФайлНовойВерсии = СкачатьФайлИзИнтернета(СсылкаНаФайл);
	
	ФайлНовойВерсии.Записать(ПутьКФайлу);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьМодульНаДискеНаСервере(КонтекстОбновления)
	
	МодульОбъекта().ОбновитьМодульНаДискеНаСервере(КонтекстОбновления);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьМодульВСправочнике(КонтекстОбновления)
	
	МодульОбъекта().ОбновитьМодульВСправочнике(КонтекстОбновления);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьРасширениеКонфигурации(КонтекстОбновления)
	
	МодульОбъекта().ОбновитьРасширениеКонфигурации(КонтекстОбновления);
	
КонецПроцедуры

// Подключает новую версию модуля в метаданные сеанса
//
// Параметры:
//  КонтекстОбновления - Структура - см. функцию Новый_КонтекстОбновленияМодуля();
//
&НаКлиенте
Процедура ПодключитьНовуюВерсиюМодуля(КонтекстОбновления) Экспорт
	
	РасположениеМодуля	 = КонтекстОбновления.РасположениеМодуля;
	ВариантыРасположения = Перечисление_ВариантыРасположенияОбработки();
	
	Если РасположениеМодуля = ВариантыРасположения.НаДиске Тогда
		
		ИнформацияОФайле = КонтекстОбновления.ИнформацияОФайлеНаДиске;
		ПодключитьОбработкуМодуляИзФайла(ИнформацияОФайле.ПутьКФайлу);
		
	ИначеЕсли РасположениеМодуля = ВариантыРасположения.ВСправочнике Тогда
		
		ИнформацияОбОбработке = КонтекстОбновления.ИнформацияОДополнительнойОбработке;
		ПодключитьОбработкуМодуляИзСправочника(ИнформацияОбОбработке.Ссылка);
		
	Иначе
		
		ТекстОшибки = ПараметрыВСтроку(НСтр(
		"ru = 'Не удалось подключить внешнюю обработку модуля!
		|Некорректное расположение модуля: %1'"), РасположениеМодуля);
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПодключитьОбработкуМодуляИзФайла(ПутьКФайлу)
	
	МодульОбъекта().МодульОбщегоНазначения().СоздатьВнешнююОбработкуБезПредупреждений(ПутьКФайлу);
	
КонецПроцедуры 

&НаСервере
Процедура ПодключитьОбработкуМодуляИзСправочника(ВнешняяОбработка)
	
	ДвоичныеДанные = МодульОбъекта().ДвоичныеДанныеИзСправочникаВнешнихОбработок(ВнешняяОбработка);
	АдресОбработки = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	
	МодульОбъекта().МодульОбщегоНазначения().ПодключитьВнешнююОбработкуБезПредупреждений(АдресОбработки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗафиксироватьОтказОтОбновленияПриОткрытииМодуля(КонтекстОбновления) Экспорт
	
	Если Не КонтекстОбновления.ВыполняетсяОткрытиеМодуля Тогда
		Возврат;
	КонецЕсли;
	
	ЗафиксироватьКоличествоУведомленйОНовойВерсии(КонтекстОбновления.НоваяВерсияМодуля);
	Метрики_ОтсрочкаОбновленияМодуля(КонтекстОбновления);
	
КонецПроцедуры

&НаСервере
Процедура ЗафиксироватьКоличествоУведомленйОНовойВерсии(НоваяВерсияМодуля)
	
	МодульОбъекта().ЗафиксироватьКоличествоУведомленйОНовойВерсии(НоваяВерсияМодуля);
	
КонецПроцедуры

// #КонецОбласти ОбновлениеМодуля

// Обработка ошибок

// Записывает ошибку в журнал регистрации и сообщает пользователю
//
// Параметры:
//  Действие			 - Строка - действие, при котором возникла ошибка;
//  Ошибка				 - ИнформацияОбОшибке, Строка - информация об ошибке;
//  ДопИнформация		 - Строка, Соответствие - доп информация для записи в журнал регистрации;
//  ТекстСообщения		 - Строка - текст сообщения пользователю;
//  ИдентификаторФормы	 - УникальныйИдентификатор - см. СообщитьПользователюЛок();
//  ПолеФормы			 - Строка                  - см. СообщитьПользователюЛок();
//
&НаКлиенте
Процедура ОбработатьОшибку(Действие, Ошибка
	, ДопИнформация		 = Неопределено
	, ТекстСообщения	 = Неопределено
	, ИдентификаторФормы = Неопределено
	, ПолеФормы			 = Неопределено
	, СсылкаНаОбъект	 = Неопределено) Экспорт
	
	ИнформацияОбОшибке = Ошибка;
	Если ТипЗнч(ИнформацияОбОшибке) = Тип("ИнформацияОбОшибке")
		И ВерсияПлатформыНиже("8.3.16") Тогда
		ИнформацияОбОшибке = ПодробноеПредставлениеОшибки(Ошибка);
	КонецЕсли;
	
	ОбработатьОшибкуНаСервере(Действие, ИнформацияОбОшибке
	, ДопИнформация
	, ТекстСообщения
	, ИдентификаторФормы
	, ПолеФормы
	, СсылкаНаОбъект);
	
КонецПроцедуры

// Записывает ошибку в журнал регистрации и сообщает пользователю
//
// Параметры:
//  Действие			 - Строка - действие, при котором возникла ошибка;
//  Ошибка				 - ИнформацияОбОшибке, Строка - информация об ошибке;
//  ДопИнформация		 - Строка, Соответствие - доп информация для записи в журнал регистрации;
//  ТекстСообщения		 - Строка - текст сообщения пользователю;
//  ИдентификаторФормы	 - УникальныйИдентификатор - см. СообщитьПользователюЛок();
//  ПолеФормы			 - Строка                  - см. СообщитьПользователюЛок();
//
&НаСервере
Процедура ОбработатьОшибкуНаСервере(Действие, Ошибка
	, ДопИнформация		 = Неопределено
	, ТекстСообщения	 = Неопределено
	, ИдентификаторФормы = Неопределено
	, ПолеФормы			 = Неопределено
	, СсылкаНаОбъект	 = Неопределено)
	
	МодульОбъекта().ОбработатьОшибку(Действие, Ошибка
	, ДопИнформация
	, ТекстСообщения
	, ИдентификаторФормы
	, ПолеФормы
	, СсылкаНаОбъект);
	
КонецПроцедуры


// Техническая поддержка

&НаКлиенте
Процедура ОткрытьТелеграмКанал() Экспорт
	
	ПараметрыКанала = ПараметрыКаналаТелеграм();
	
	Попытка
		
		ОткрытьИнтернетСтраницу(ПараметрыКанала.Ссылка);
		
		Функциональность = Перечисление_ФункциональностьМодуля().ТелеграмКанал;
		СтекМетрик_ДобавитьФункциональность(Функциональность);
		
	Исключение
		ТекстСообщения = НСтр(
		"ru = 'К сожалению, нам не удалось открыть Телеграм канал на компьютере
		|Пожалуйста, попробуйте в мобильном приложении найти наш канал %1'");
		ТекстСообщения = ПараметрыВСтроку(ТекстСообщения, ПараметрыКанала.ИмяЧата);
		СообщитьПользователюЛок(ТекстСообщения);
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ПараметрыКаналаТелеграм() Экспорт
	
	Возврат МодульОбъекта().ПараметрыКаналаТелеграм();
	
КонецФункции

&НаКлиенте
Процедура ОткрытьКонтурДоступ() Экспорт
	
	ОткрытьИнтернетСтраницу(ИнтернетАдреса().КонтурДоступ);
	
	Функциональность = Перечисление_ФункциональностьМодуля().КонтурДоступ;
	СтекМетрик_ДобавитьФункциональность(Функциональность);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКонтурДиагностику() Экспорт
	
	ОткрытьИнтернетСтраницу(ИнтернетАдреса().КонтурДиагностика);
	
	Функциональность = Перечисление_ФункциональностьМодуля().КонтурДиагностика;
	СтекМетрик_ДобавитьФункциональность(Функциональность);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКонтурСправку() Экспорт
	
	ОткрытьИнтернетСтраницу(ИнтернетАдреса().КонтурСправка);
	
	Функциональность = Перечисление_ФункциональностьМодуля().КонтурСправка;
	СтекМетрик_ДобавитьФункциональность(Функциональность);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИнформациюОМобильныхУстройствах() Экспорт
	
	ОткрытьИнтернетСтраницу(ИнтернетАдреса().ИнформацияОМобильныхУстройствах);
	
	Функциональность = Перечисление_ФункциональностьМодуля().ИнформацияОМобильныхУстройствах;
	СтекМетрик_ДобавитьФункциональность(Функциональность);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИнструкциюПоНастройкеРегламентногоЗадания() Экспорт
	
	ОткрытьИнтернетСтраницу(ИнтернетАдреса().СправкаПоНастройкеРегЗадания);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправкуКакОбновитьСертификат() Экспорт
	
	ОткрытьИнтернетСтраницу(ИнтернетАдреса().СправкаКакОбновитьСертификат);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправкуКакПривязатьСертификатВГИС() Экспорт
	
	ОткрытьИнтернетСтраницу(ИнтернетАдреса().СправкаКакПривязатьСертификатВГИС);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправкуКакНачатьРаботуССервисамиКонтура() Экспорт
	
	ОткрытьИнтернетСтраницу(ИнтернетАдреса().СправкаКакНачатьРаботуССервисамиКонтура);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправкуКакУстановитьСертификат() Экспорт
	
	ОткрытьИнтернетСтраницу(ИнтернетАдреса().СправкаКакУстановитьСертификат);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправкуНаКомпьютереНетСертификата() Экспорт
	
	ОткрытьИнтернетСтраницу(ИнтернетАдреса().СправкаНаКомпьютереНетСертификата);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправкуОбновлениеПодсистемы() Экспорт
	
	ОткрытьИнтернетСтраницу(ИнтернетАдреса().СправкаОбновлениеПодсистемы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтраницуОбновления() Экспорт
	
	ОткрытьИнтернетСтраницу(ИнтернетАдреса().СтраницаОбновления);
	
	Функциональность = Перечисление_ФункциональностьМодуля().СтраницаОбновления;
	СтекМетрик_ДобавитьФункциональность(Функциональность);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтраницуНастроекОрганизации(Организация) Экспорт
	
	ИдентификаторОрганизации = ЗначениеРеквизитаОбъекта_Марк(Организация, "Идентификатор");
	
	ПутьКНастройкам = "/organizations/{organizationId}/settings";
	ПутьКНастройкам = СтрЗаменить(ПутьКНастройкам, "{organizationId}", ИдентификаторОрганизации);
	
	АдресСайта = АдресСайтаКонтурМаркировки();
	АдресСтраницы = АдресСайта + ПутьКНастройкам;
	
	ОткрытьИнтернетСтраницу(АдресСтраницы);
	
	Функциональность = Перечисление_ФункциональностьМодуля().СтраницаНастроекОрганизации;
	СтекМетрик_ДобавитьФункциональность(Функциональность);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтраницуТарифовОрганизации(Организация) Экспорт
	
	ИдентификаторОрганизации = ЗначениеРеквизитаОбъекта_Марк(Организация, "Идентификатор");
	
	ПутьКНастройкам = "/organizations/{organizationId}/payment";
	ПутьКНастройкам = СтрЗаменить(ПутьКНастройкам, "{organizationId}", ИдентификаторОрганизации);
	
	АдресСайта = АдресСайтаКонтурМаркировки();
	АдресСтраницы = АдресСайта + ПутьКНастройкам;
	
	ОткрытьИнтернетСтраницу(АдресСтраницы);
	
	Функциональность = Перечисление_ФункциональностьМодуля().СтраницаТарифаОрганизации;
	СтекМетрик_ДобавитьФункциональность(Функциональность);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтраницуСИнформациейОПартионномУчете() Экспорт
	
	ОткрытьИнтернетСтраницу(ИнтернетАдреса().ИнформацияОПартионномУчете);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЛичныйКабинетКонтурМаркировка() Экспорт
	
	ОткрытьИнтернетСтраницу(АдресСайтаКонтурМаркировки());
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправкуКакДобавитьЯщикДиадок() Экспорт
	
	ОткрытьИнтернетСтраницу(ИнтернетАдреса().СправкаКакДобавитьЯщикДиадок);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправкуАвтоподбораПозицииНаТСД() Экспорт
	
	ОткрытьИнтернетСтраницу(ИнтернетАдреса().СправкаАвтоподборПозицииНаТСД);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИнформациюОТарифах() Экспорт
	
	ОткрытьИнтернетСтраницу(ИнтернетАдреса().ИнформацияОТарифах);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКонфигуратор() Экспорт
	
	#Если Не ВебКлиент Тогда
		// BSLLS:ExternalAppStarting-off
		ЗапуститьСистему("DESIGNER");
		// BSLLS:ExternalAppStarting-on
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Функция ВключенРежимТехническогоСпециалиста() Экспорт
	
	Возврат ВключенРежимТехническогоСпециалистаНаСервере();
	
КонецФункции

&НаСервере
Функция ВключенРежимТехническогоСпециалистаНаСервере()
	
	Возврат МодульОбъекта().ВключенРежимТехническогоСпециалиста();
	
КонецФункции

&НаКлиенте
Процедура ВключитьРежимТехническогоСпециалиста(ВызывающаяФорма) Экспорт
	
	ОписаниеОбработчика = ОписаниеОбработчикаОповещения("ПослеВводаПароляТехническогоСпециалиста", ЭтаФорма);
	ОткрытьФормуОбработки("АДМ_ВводПароля", ВызывающаяФорма,, ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаПароляТехническогоСпециалиста(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Результат = Истина Тогда
		ИзменитьРежимТехническогоСпециалистаНаСервере(Результат);
		Оповестить("КонтурМаркировка_ИзмененРежимТехническогоСпециалиста", Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьРежимТехническогоСпециалиста() Экспорт
	
	ИзменитьРежимТехническогоСпециалистаНаСервере();
	Оповестить("КонтурМаркировка_ИзмененРежимТехническогоСпециалиста", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьРежимТехническогоСпециалистаНаСервере(НовыйСтатусРежима = Ложь)
	
	МодульОбъекта().ИзменитьРежимТехническогоСпециалиста(НовыйСтатусРежима);
	
КонецПроцедуры

// Документы в сервисе

&НаКлиенте
Процедура ОткрытьОперациюВСервисе(ТипОперации, ИдентификаторДокумента) Экспорт
	
	Если Не ЗначениеЗаполнено(ИдентификаторДокумента) Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКДокументу = ПутьКДокументуВСервисе(ТипОперации);
	Если Не ЗначениеЗаполнено(ПутьКДокументу) Тогда
		Возврат; // На сайте нет такой операции или переход пока не поддерживается
	КонецЕсли;
	
	АдресСайта = АдресСайтаКонтурМаркировки();
	АдресСтраницы = АдресСайта + ПутьКДокументу + ИдентификаторДокумента;
	
	ОткрытьИнтернетСтраницу(АдресСтраницы);
	
	Метрика_Операции_ПереходВСервис(ТипОперации);
	
КонецПроцедуры

&НаКлиенте
Функция ПутьКДокументуВСервисе(ТипОперации)
	
	КлючКэш = "ПутьКДокументуВСервисе: " + ТипОперации;
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ПутьКДокументуВСервисеНаСервере(ТипОперации);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКДокументуВСервисеНаСервере(ТипОперации)
	
	Возврат МодульОбъекта().ПутьКДокументуВСервисе(ТипОперации);
	
КонецФункции

&НаКлиенте
Функция АдресСайтаКонтурМаркировки() Экспорт
	
	Возврат АдресСайтаКонтурМаркировкиНаСервере();
	
КонецФункции

&НаСервере
Функция АдресСайтаКонтурМаркировкиНаСервере()
	
	Возврат МодульОбъекта().АдресСайтаКонтурМаркировки();
	
КонецФункции

// Метрики

&НаКлиенте
Процедура Метрики_ПриЗакрытииОсновнойФормы()
	
	Действие = Перечисление_ДействияМетрики().ЗакрытиеОсновнойФормы;
	Метрика_СтатистикаСеансаНаКлиенте(Действие);
	Метрика_СтатистикаСеансаНаСервере(Действие);
	
	ОтправитьМетрики();
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ОкружениеНаКлиенте(Действие)
	
	Топик = Перечисление_ТопикиМетрики().Статистика;
	Категория = Перечисление_КатегорииМетрики().ОкружениеНаКлиенте;
	ДопСведения = ОписаниеКонтекстаНаКлиенте();
	ОписаниеМетрики = Новый_ОписаниеМетрики(Категория, Действие, ДопСведения);
	СтекМетрик_ДобавитьСобытие(Топик, ОписаниеМетрики);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрики_НевозможноВыполнитьОбновление(КонтекстОбновления) Экспорт
	
	Если Не КонтекстОбновления.ВыполняетсяОткрытиеМодуля Тогда
		Возврат;
	КонецЕсли;
	
	Действие = Перечисление_ДействияМетрики().НевозможноВыполнитьОбновление;
	Метрика_АвтоматическоеОбновление(Действие, КонтекстОбновления);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрики_АвтоматическоеОбновление(КонтекстОбновления) Экспорт
	
	Действие = Перечисление_ДействияМетрики().АвтоматическоеОбновление;
	Метрика_АвтоматическоеОбновление(Действие, КонтекстОбновления);
	
	ОтправитьМетрики();
	
КонецПроцедуры

&НаКлиенте
Процедура Метрики_БыстраяНастройка(ДанныеНастройки, ДанныеПлагина) Экспорт
	
	Если ДанныеНастройки.НастройкаЗавершена Тогда
		МетрикаОП_БыстраяНастройка();
	КонецЕсли;
	
	Действие = Перечисление_ДействияМетрики().БыстраяНастройка;
	Метрика_БыстраяНастройка(Действие, ДанныеНастройки, ДанныеПлагина);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрики_ОтсрочкаОбновленияМодуля(КонтекстОбновления)
	
	Действие = Перечисление_ДействияМетрики().ОтсрочкаАвтоматическогоОбновления;
	Метрика_АвтоматическоеОбновление(Действие, КонтекстОбновления);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_АвтоматическоеОбновление(Действие, КонтекстОбновления)
	
	Топик = Перечисление_ТопикиМетрики().Статистика;
	Категория = Перечисление_КатегорииМетрики().АвтоматическоеОбновление;
	ДопСведения = ОписаниеКонтекстаОбновленияДляМетрики(КонтекстОбновления);
	ОписаниеМетрики = Новый_ОписаниеМетрики(Категория, Действие, ДопСведения);
	СтекМетрик_ДобавитьСобытие(Топик, ОписаниеМетрики);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_БыстраяНастройка(Действие, ДанныеНастройки, ДанныеПлагина)
	
	Топик = Перечисление_ТопикиМетрики().Статистика;
	
	ИдентификаторПлагина = ДанныеПлагина.ИдентификаторПлагина;
	ВерсияПлагина = ДанныеПлагина.ВерсияПлагина;
	
	Если ЗначениеЗаполнено(ИдентификаторПлагина)
		И ЗначениеЗаполнено(ВерсияПлагина) Тогда
		Категория = Перечисление_КатегорииМетрики().ИнтеграцияДиадок;
	Иначе
		Категория = Перечисление_КатегорииМетрики().НастройкиМодуля;
	КонецЕсли;
	
	ОписаниеМетрики = Новый_ОписаниеМетрики(Категория, Действие, ДанныеНастройки, ВерсияПлагина, ИдентификаторПлагина);
	СтекМетрик_ДобавитьСобытие(Топик, ОписаниеМетрики);
	
	ОтправитьМетрики();
	
КонецПроцедуры

&НаКлиенте
Процедура МетрикаОП_БыстраяНастройка()
	
	Топик = Перечисление_ТопикиМетрики().ОбщепродуктоваяСтатистика;
	Действие = Перечисление_ДействияМетрики().СтартовыйПомощник;
	Категория = Перечисление_КатегорииМетрики().Настройка;
	ОписаниеМетрики = Новый_ОписаниеМетрики(Категория, Действие);
	СтекМетрик_ДобавитьСобытие(Топик, ОписаниеМетрики);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_СтатистикаСеансаНаКлиенте(Действие)
	
	Топик = Перечисление_ТопикиМетрики().Статистика;
	Категория = Перечисление_КатегорииМетрики().СтатистикаСеанса;
	ДопСведения = ОписаниеСтатистикиСеансаНаКлиенте();
	ОписаниеМетрики = Новый_ОписаниеМетрики(Категория, Действие, ДопСведения);
	СтекМетрик_ДобавитьСобытие(Топик, ОписаниеМетрики);
	
КонецПроцедуры

&НаСервере
Процедура Метрика_СтатистикаСеансаНаСервере(Действие)
	
	МодульОбъекта().Метрика_СтатистикаСеансаНаСервере(Действие);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_НажатиеДополнительнойКнопки(ПараметрыНажатия)
	
	ДопСведения = Новый Структура;
	ДопСведения.Вставить("ИмяКнопки", ПараметрыНажатия.ИмяКнопки);
	ДопСведения.Вставить("Размещение", ПараметрыНажатия.Размещение);
	
	Топик = Перечисление_ТопикиМетрики().Поведение;
	Действие = Перечисление_ДействияМетрики().НажатиеДопКнопки;
	Категория = Перечисление_КатегорииМетрики().ДополнительныеКнопки;
	ОписаниеМетрики = Новый_ОписаниеМетрики(Категория, Действие, ДопСведения);
	СтекМетрик_ДобавитьСобытие(Топик, ОписаниеМетрики);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ПоведениеРабочегоСтола(Раздел, Действие, Идентификатор) Экспорт
	
	Топик = Перечисление_ТопикиМетрики().Поведение;
	Категория = Перечисление_КатегорииМетрики().РабочийСтол;
	ОписаниеМетрики = Новый_ОписаниеМетрики(Категория, Действие, , , Раздел);
	ОписаниеМетрики.ИдентификаторТрассировки = Идентификатор;
	СтекМетрик_ДобавитьСобытие(Топик, ОписаниеМетрики);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_Операции_ПереходВСервис(ТипОперации)
	
	ДопСведения = Новый Структура;
	ДопСведения.Вставить("ТипОперации", ТипОперации);
	
	Топик = Перечисление_ТопикиМетрики().Статистика;
	Категория = Перечисление_КатегорииМетрики().Операции;
	Действие = Перечисление_ДействияМетрики().ПереходВСервис;
	ОписаниеМетрики = Новый_ОписаниеМетрики(Категория, Действие, ДопСведения);
	СтекМетрик_ДобавитьСобытие(Топик, ОписаниеМетрики);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрики_ПечатьЭтикетокСЗаполненнымиПараметрами(ПараметрыПечатиДляМетрики, Организация) Экспорт
	
	Если Не ПараметрыПечатиДляМетрики.ЗаполненТовар
		И Не ПараметрыПечатиДляМетрики.ЗаполненаНоменклатура1С
		И Не ЗначениеЗаполнено(ПараметрыПечатиДляМетрики.КоличествоКодовТребуется) Тогда
		Возврат;
	КонецЕсли;
	
	Топик = Перечисление_ТопикиМетрики().Статистика;
	Категория = Перечисление_КатегорииМетрики().ПараметрыПечати;
	Действие = Перечисление_ДействияМетрики().ПечатьЭтикетокСЗаполненнымиПараметрами;
	Идентификатор = ЗначениеРеквизитаОбъекта_Марк(Организация, "Идентификатор");
	
	ОписаниеМетрики = Новый_ОписаниеМетрики(Категория, Действие, ПараметрыПечатиДляМетрики, Идентификатор);
	ОписаниеМетрики.Организация = Организация;
	СтекМетрик_ДобавитьСобытие(Топик, ОписаниеМетрики);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_Функциональность_ПечатьКодовИзСвободногоОстатка(Организация) Экспорт
	
	Функциональность = Перечисление_ФункциональностьМодуля().ПечатьКодовИзСвободногоОстатка;
	СтекМетрик_ДобавитьФункциональность(Функциональность, Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_Функциональность_ДопКнопки()
	
	Функциональность = Перечисление_ФункциональностьМодуля().ДополнительныеКнопки;
	СтекМетрик_ДобавитьФункциональность(Функциональность);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_Функциональность_ЦентрПоддержки()
	
	Функциональность = Перечисление_ФункциональностьМодуля().ЦентрПоддержки;
	СтекМетрик_ДобавитьФункциональность(Функциональность);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_Функциональность_ОткрытиеПодчиненнойОперацииСтроки(Организация) Экспорт
	
	Функциональность = Перечисление_ФункциональностьМодуля().ОткрытиеПодчиненнойОперацииНаУровнеСтроки;
	СтекМетрик_ДобавитьФункциональность(Функциональность, Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_Функциональность_ОткрытиеФормыИнформацииДляТехПоддержки() Экспорт
	
	Функциональность = Перечисление_ФункциональностьМодуля().ОткрытиеФормыИнформацииДляТехПоддержки;
	СтекМетрик_ДобавитьФункциональность(Функциональность);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_Функциональность_ОткрытиеФормыНовостей() Экспорт
	
	Функциональность = Перечисление_ФункциональностьМодуля().ОткрытиеФормыНовостей;
	СтекМетрик_ДобавитьФункциональность(Функциональность);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_Функциональность_ОткрытиеФормыРедактораЗСН()
	
	Функциональность = Перечисление_ФункциональностьМодуля().ОткрытиеФормыРедактораЗСН;
	СтекМетрик_ДобавитьФункциональность(Функциональность);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_Функциональность_ЗагрузкаТоваровИзНоменклатуры1С() Экспорт
	
	Функциональность = Перечисление_ФункциональностьМодуля().ЗагрузкаТоваровИзНоменклатуры1С;
	СтекМетрик_ДобавитьФункциональность(Функциональность);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_Функциональность_СозданиеТоваровИзНоменклатуры1С() Экспорт
	
	Функциональность = Перечисление_ФункциональностьМодуля().СозданиеТоваровИзНоменклатуры1С;
	СтекМетрик_ДобавитьФункциональность(Функциональность);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_Функциональность_ОбновлениеТоваровИзНацКаталога()
	
	Функциональность = Перечисление_ФункциональностьМодуля().ОбновлениеТоваровИзНацКаталога;
	СтекМетрик_ДобавитьФункциональность(Функциональность);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_Функциональность_ОбновлениеТовараИзНацКаталога() Экспорт
	
	Функциональность = Перечисление_ФункциональностьМодуля().ОбновлениеТовараИзНацКаталога;
	СтекМетрик_ДобавитьФункциональность(Функциональность);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_Функциональность_ЗаполнениеНовогоТовараИзНацКаталога()
	
	Функциональность = Перечисление_ФункциональностьМодуля().ЗаполнениеНовогоТовараИзНацКаталога;
	СтекМетрик_ДобавитьФункциональность(Функциональность);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_Функциональность_ПримененыОтборыСпискаДокументов() Экспорт
	
	Функциональность = Перечисление_ФункциональностьМодуля().ПримененыОтборыСпискаДокументов;
	СтекМетрик_ДобавитьФункциональность(Функциональность);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_Функциональность_СохраненыПользовательскиеОтборыСпискаДокументов() Экспорт
	
	Функциональность = Перечисление_ФункциональностьМодуля().СохраненыПользовательскиеОтборыСпискаДокументов;
	СтекМетрик_ДобавитьФункциональность(Функциональность);
	
КонецПроцедуры

// Проверяет что использование функциональности уже учтено в метриках
//
// Параметры:
//  Функциональность - Строка - см. функцию Перечисление_ФункциональностьМодуля();
//  Организация - СправочникСсылка.КонтурМаркировка_Организации - (необязательный) организация;
// 
// Возвращаемое значение:
//  Булево - Истина, если функциональность уже добавлена
//
&НаКлиенте
Функция Метрики_Функциональность_Учтена(Функциональность, Организация = Неопределено)
	
	Если Организация = Неопределено Тогда
		Организация = ИмяОбщейОрганизацииДляМетрик();
	КонецЕсли;
	
	НаборФункциональности = СтекМетрик_Прочитать().ФункциональностьПоОрганизациям[Организация];
	ЕстьВНаборе = ЗначениеСоответствия(НаборФункциональности, Функциональность) <> Неопределено;
	
	Возврат ЕстьВНаборе;
	
КонецФункции

// Удаляет из сетка данные об использовании функциональности
//
// Параметры:
//  Функциональность - Строка - см. функцию Перечисление_ФункциональностьМодуля();
//  Организация - СправочникСсылка.КонтурМаркировка_Организации - (необязательный) организация;
//
&НаКлиенте
Процедура Метрики_Функциональность_Удалить(Функциональность, Организация = Неопределено) Экспорт
	
	Если Организация = Неопределено Тогда
		Организация = ИмяОбщейОрганизацииДляМетрик();
	КонецЕсли;
	
	СтекМетрик = СтекМетрик_Прочитать();
	
	НаборФункциональности = СтекМетрик.ФункциональностьПоОрганизациям[Организация];
	Если НаборФункциональности = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НаборФункциональности.Удалить(Функциональность);
	
	СтекМетрик_Поместить(СтекМетрик);
	
КонецПроцедуры

// #Область МетрикиНаКлиенте

// #Область СтекМетрикНаКлиенте

&НаКлиенте
Функция СтекМетрик_Прочитать()
	
	Если КэшСтекаМетрик = Неопределено Тогда
		КэшСтекаМетрик = Новый_СтекМетрик();
		КэшСтекаМетрик.КонтекстПриложенияНаКлиенте = КонтекстПриложения();
	КонецЕсли;
	
	Возврат КэшСтекаМетрик;
	
КонецФункции

&НаКлиенте
Процедура СтекМетрик_ДобавитьСобытие(Топик, ОписаниеМетрики)
	
	СтекМетрик = СтекМетрик_Прочитать();
	СтекМетрик.Топики[Топик].Добавить(ОписаниеМетрики);
	СтекМетрик.РазмерСтека = СтекМетрик.РазмерСтека + 1;
	
	СтекМетрик_ЗаполнитьДатуПервогоСобытия(СтекМетрик);
	СтекМетрик_Поместить(СтекМетрик);
	
	Если НужноОтправитьМетрики(СтекМетрик) Тогда
		ОтправитьМетрики();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтекМетрик_ДобавитьФункциональность(Функциональность, Организация = Неопределено) Экспорт
	
	Если Организация = Неопределено Тогда
		Организация = ИмяОбщейОрганизацииДляМетрик();
	КонецЕсли;
	
	СтекМетрик = СтекМетрик_Прочитать();
	
	НаборФункциональности = СтекМетрик.ФункциональностьПоОрганизациям[Организация];
	Если НаборФункциональности = Неопределено Тогда
		НаборФункциональности = Новый Соответствие;
		СтекМетрик.ФункциональностьПоОрганизациям.Вставить(Организация, НаборФункциональности);
	КонецЕсли;
	
	КоличествоИспользований = ЗначениеСоответствия(НаборФункциональности, Функциональность, 0) + 1;
	НаборФункциональности.Вставить(Функциональность, КоличествоИспользований);
	
	СтекМетрик_ЗаполнитьДатуПервогоСобытия(СтекМетрик);
	СтекМетрик_Поместить(СтекМетрик);
	
КонецПроцедуры

&НаКлиенте
Процедура СтекМетрик_Поместить(СтекМетрик)
	
	КэшСтекаМетрик = СтекМетрик;
	
КонецПроцедуры

&НаКлиенте
Процедура СтекМетрик_Очистить(СтекМетрик)
	
	Для Каждого Элемент Из СтекМетрик.Топики Цикл
		Элемент.Значение.Очистить();
	КонецЦикла;
	
	СтекМетрик.РазмерСтека = 0;
	СтекМетрик.ДатаПервогоСобытия = '00010101';
	
	Для каждого Элемент1 Из СтекМетрик.ФункциональностьПоОрганизациям Цикл
		НаборФункций = Элемент1.Значение;
		Для каждого Элемент2 Из НаборФункций Цикл
			НаборФункций[Элемент2.Ключ] = 0;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СтекМетрик_ЗаполнитьДатуПервогоСобытия(СтекМетрик)
	
	Если Не ЗначениеЗаполнено(СтекМетрик.ДатаПервогоСобытия) Тогда
		СтекМетрик.ДатаПервогоСобытия = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СтекМетрик_МаксимальныйРазмер()
	
	КлючКэш = "СтекМетрик_МаксимальныйРазмер";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = СтекМетрик_МаксимальныйРазмерНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция СтекМетрик_МаксимальныйРазмерНаСервере()
	
	Возврат МодульОбъекта().СтекМетрик_МаксимальныйРазмер();
	
КонецФункции

// #КонецОбласти // СтекМетрикНаКлиенте

// #Область ЗамерПроизводительностиНаКлиенте

&НаКлиенте
Процедура НачатьЗамерПроизводительности(Действие) Экспорт
	
	ОписаниеЗамера = Новый_ОписаниеЗамера();
	
	СтекМетрик = СтекМетрик_Прочитать();
	СтекМетрик.ЗамерыПроизводительности.Вставить(Действие, ОписаниеЗамера);
	СтекМетрик_Поместить(СтекМетрик);
	
КонецПроцедуры

&НаКлиенте
Процедура ОстановитьЗамерПроизводительности(Действие) Экспорт
	
	СтекМетрик = СтекМетрик_Прочитать();
	
	ОписаниеЗамера = СтекМетрик.ЗамерыПроизводительности[Действие];
	Если ОписаниеЗамера = Неопределено Тогда
		ОстановитьЗамерПроизводительностиНаСервере(Действие);
		Возврат;
	КонецЕсли;
	
	ОписаниеЗамера.ВремяНачалаПаузы = ТекущийTimestamp();
	
	СтекМетрик_Поместить(СтекМетрик);
	
КонецПроцедуры

&НаСервере
Процедура ОстановитьЗамерПроизводительностиНаСервере(Действие)
	
	МодульОбъекта().ОстановитьЗамерПроизводительности(Действие);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьЗамерПроизводительности(Действие) Экспорт
	
	СтекМетрик = СтекМетрик_Прочитать();
	
	ОписаниеЗамера = СтекМетрик.ЗамерыПроизводительности[Действие];
	Если ОписаниеЗамера = Неопределено Тогда
		ПродолжитьЗамерПроизводительностиНаСервере(Действие);
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОписаниеЗамера.ВремяНачалаПаузы) Тогда
		ДлительностьПаузы = ТекущийTimestamp() - ОписаниеЗамера.ВремяНачалаПаузы;
		ОписаниеЗамера.ДлительностьПаузы = ОписаниеЗамера.ДлительностьПаузы + ДлительностьПаузы;
		ОписаниеЗамера.ВремяНачалаПаузы = Неопределено;
	КонецЕсли;
	
	СтекМетрик_Поместить(СтекМетрик);
	
КонецПроцедуры

&НаСервере
Процедура ПродолжитьЗамерПроизводительностиНаСервере(Действие)
	
	МодульОбъекта().ПродолжитьЗамерПроизводительности(Действие);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьЗамерПроизводительности(Действие, ДопПараметры = Неопределено) Экспорт
	
	СтекМетрик = СтекМетрик_Прочитать();
	ОписаниеЗамера = СтекМетрик.ЗамерыПроизводительности[Действие];
	Если ОписаниеЗамера = Неопределено Тогда
		ЗавершитьЗамерПроизводительностиНаСервере(Действие);
		Возврат;
	КонецЕсли;
	
	СтекМетрик.ЗамерыПроизводительности.Удалить(Действие);
	СтекМетрик_Поместить(СтекМетрик);
	
	Топик = Перечисление_ТопикиМетрики().Здоровье;
	Категория = Перечисление_КатегорииМетрики().ЗамерПроизводительности;
	ДопСведения = ОписаниеЗамераПроизводительности(ОписаниеЗамера, ДопПараметры);
	ОписаниеМетрики = Новый_ОписаниеМетрики(Категория, Действие, ДопСведения);
	СтекМетрик_ДобавитьСобытие(Топик, ОписаниеМетрики);
	
КонецПроцедуры

&НаСервере
Процедура ЗавершитьЗамерПроизводительностиНаСервере(Действие, ДопПараметры = Неопределено)
	
	МодульОбъекта().ЗавершитьЗамерПроизводительности(Действие, ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Функция ОписаниеЗамераПроизводительности(ОписаниеЗамера, ДопПараметры = Неопределено)
	
	ВремяНачалаЗамера = ОписаниеЗамера.ВремяНачалаЗамера;
	ДлительностьПаузы = ОписаниеЗамера.ДлительностьПаузы;
	ВремяОкончанияЗамера = ТекущийTimestamp();
	
	Если ЗначениеЗаполнено(ОписаниеЗамера.ВремяНачалаПаузы) Тогда
		ДлительностьПаузы = ДлительностьПаузы + (ВремяОкончанияЗамера - ОписаниеЗамера.ВремяНачалаПаузы);
	КонецЕсли;
	
	Длительность = (ВремяОкончанияЗамера - ВремяНачалаЗамера) - ДлительностьПаузы;
	
	Результат = Новый Структура;
	Результат.Вставить("Длительность", Длительность);
	Результат.Вставить("ВремяНачалаЗамера", ВремяНачалаЗамера);
	Результат.Вставить("ВремяОкончанияЗамера", ВремяОкончанияЗамера);
	
	Если ЗначениеЗаполнено(ДопПараметры) Тогда
		ДополнитьСтруктуру(Результат, ДопПараметры);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Новый_ОписаниеЗамера()
	
	Результат = Новый Структура;
	Результат.Вставить("ВремяНачалаЗамера", ТекущийTimestamp());
	Результат.Вставить("ВремяНачалаПаузы", Неопределено);
	Результат.Вставить("ДлительностьПаузы", 0);
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти // ЗамерПроизводительностиНаКлиенте

// #Область СлужебныеМетодыМетрикНаКлиенте

&НаКлиенте
Функция НужноОтправитьМетрики(СтекМетрик)
	
	Если ЗначениеЗаполнено(СтекМетрик.ДатаПервогоСобытия) Тогда
		ПрошлоСекунд = ТекущаяДата() - СтекМетрик.ДатаПервогоСобытия;
	Иначе
		ПрошлоСекунд = 0;
	КонецЕсли;
	
	Если СтекМетрик.РазмерСтека >= СтекМетрик_МаксимальныйРазмер()
		Или ПрошлоСекунд >= ПериодОтправкиМетрик() Тогда
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПериодОтправкиМетрик()
	
	КлючКэш = "ПериодОтправкиМетрик";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ПериодОтправкиМетрикНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПериодОтправкиМетрикНаСервере()
	
	Возврат МодульОбъекта().ПериодОтправкиМетрик();
	
КонецФункции

&НаКлиенте
Процедура ОтправитьМетрики()
	
	СтекМетрик = СтекМетрик_Прочитать();
	
	ОтправитьМетрикиНаСервере(СтекМетрик);
	
	СтекМетрик.ДатаПоследнейОтправки = ТекущаяДата();
	
	СтекМетрик_Очистить(СтекМетрик);
	СтекМетрик_Поместить(СтекМетрик);
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьМетрикиНаСервере(Знач СтекМетрикКлиента)
	
	МодульОбъекта().СтекМетрик_ДобавитьМетрикиКлиента(СтекМетрикКлиента);
	МодульОбъекта().ОтправитьМетрики();
	
КонецПроцедуры

// #КонецОбласти // СлужебныеМетодыМетрикНаКлиенте

// #Область ЗамерыНаКлиенте

&НаКлиенте
Процедура Замер_ДлительностьСеанса_Начать()
	
	КлючКэш = "ДатаНачалаСеанса";
	Кэш_Поместить(КлючКэш, ТекущаяДата());
	
КонецПроцедуры

&НаКлиенте
Функция Замер_ДлительностьСеанса_Завершить()
	
	КлючКэш = "ДатаНачалаСеанса";
	ДатаНачалаСеанса = Кэш_Прочитать(КлючКэш);
	
	Если ЗначениеЗаполнено(ДатаНачалаСеанса) Тогда
		Результат = Окр((ТекущаяДата() - ДатаНачалаСеанса) / 60);
	Иначе
		Результат = 0;
	КонецЕсли;
	
	Кэш_Поместить(КлючКэш, ТекущаяДата());
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти // ЗамерыНаКлиенте

// #Область ОписаниеПеременныхМетрикНаКлиенте

&НаКлиенте
Функция КонтекстПриложения()
	
	КлючКэш = "КонтекстПриложения";
	Результат = Кэш_Прочитать(КлючКэш);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Новый Структура;
	
	// Заполним при отправке на сервере
	Результат.Вставить("AppVersion");
	Результат.Вставить("Platform");
	
	Результат.Вставить("OS", ОписаниеОС());
	Результат.Вставить("Hardware", ОписаниеАппаратногоОбеспечения());
	
	ОписаниеБраузера = ОписаниеБраузера();
	Если ЗначениеЗаполнено(ОписаниеБраузера) Тогда
		Результат.Вставить("Browser", ОписаниеБраузера);
	КонецЕсли;
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОписаниеКонтекстаНаКлиенте()
	
	СисИнфо = ИнформацияОСистеме();
	
	Результат = Новый Структура;
	Результат.Вставить("ИдентификаторПрофиляПользователя", СисИнфо.ИдентификаторКлиента);
	Результат.Вставить("Процессор", СисИнфо.Процессор);
	Результат.Вставить("ВерсияОС", СисИнфо.ВерсияОС);
	Результат.Вставить("ИмяКомпьютера", ИмяКомпьютера());
	Результат.Вставить("РазрешениеЭкрана", РазрешениеЭкрана());
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОписаниеКонтекстаОбновленияДляМетрики(КонтекстОбновления)
	
	Результат = Новый Структура;
	Результат.Вставить("НоваяВерсияМодуля", КонтекстОбновления.НоваяВерсияМодуля);
	Результат.Вставить("НоваяВерсияДанных", КонтекстОбновления.НоваяВерсияДанных);
	Результат.Вставить("ТекущаяВерсияМодуля", КонтекстОбновления.ТекущаяВерсияМодуля);
	Результат.Вставить("ТекущаяВерсияДанных", КонтекстОбновления.ТекущаяВерсияДанных);
	Результат.Вставить("ЕстьДоработкиМодуля", КонтекстОбновления.ЕстьДоработкиМодуля);
	Результат.Вставить("ЕстьОбновлениеПодсистемы", КонтекстОбновления.ЕстьОбновлениеПодсистемы);
	Результат.Вставить("ТребуетсяОбновлениеДанных", КонтекстОбновления.ТребуетсяОбновлениеДанных);
	Результат.Вставить("ОбновлениеПриОткрытии", КонтекстОбновления.ВыполняетсяОткрытиеМодуля);
	Результат.Вставить("НевозможноВыполнитьОбновление", КонтекстОбновления.НевозможноВыполнитьОбновление);
	Результат.Вставить("ПолученаОшибкаСервисаОбновлений", КонтекстОбновления.ПолученаОшибкаСервисаОбновлений);
	
	Если ТипЗнч(КонтекстОбновления.ОписаниеОшибки) = Тип("ИнформацияОбОшибке") Тогда
		ОписаниеОшибки = ПодробноеПредставлениеОшибки(КонтекстОбновления.ОписаниеОшибки);
	Иначе
		ОписаниеОшибки = КонтекстОбновления.ОписаниеОшибки;
	КонецЕсли;
	Результат.Вставить("ОписаниеОшибки", ОписаниеОшибки);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОписаниеОС()
	
	СисИнфо = ИнформацияОСистеме();
	ТипОС = НРег(СисИнфо.ТипПлатформы);
	
	Если Найти(ТипОС, НРег("Linux")) > 0 Тогда
		Name = "Linux";
	ИначеЕсли Найти(ТипОС, НРег("MacOS")) > 0 Тогда
		Name = "MacOS";
	ИначеЕсли Найти(ТипОС, НРег("Windows")) > 0 Тогда
		Name = "Windows";
	КонецЕсли;
	
	Если Найти(ТипОС, "64") > 0 Тогда
		BitSet = "x64";
	Иначе
		BitSet = "x86";
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Name", Name);
	Результат.Вставить("BitSet", BitSet);
	
	// Заполним при отправке на сервере
	Результат.Вставить("Version");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОписаниеБраузера()
	
	Результат = Новый Структура;
	СисИнфо = ИнформацияОСистеме();
	
	UserAgent = СисИнфо.ИнформацияПрограммыПросмотра;
	Если ЗначениеЗаполнено(UserAgent) Тогда
		Результат.Вставить("UserAgent", UserAgent);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОписаниеАппаратногоОбеспечения()
	
	МегабайтВГигабайте = 1024;
	
	TotalMemoryGb = Окр(ИнформацияОСистеме().ОперативнаяПамять / МегабайтВГигабайте);
	
	Возврат Новый Структура("TotalMemoryGb", TotalMemoryGb);
	
КонецФункции

&НаКлиенте
Функция РазрешениеЭкрана()
	
	Если ВерсияПлатформыНиже("8.3.3.721") Тогда
		Возврат "";
	КонецЕсли;
	
	ОписаниеЭкранов = Вычислить("ПолучитьИнформациюЭкрановКлиента()");
	Если Не ЗначениеЗаполнено(ОписаниеЭкранов) Тогда
		Возврат "";
	КонецЕсли;
	
	ШиринаЭкрана = Формат(ОписаниеЭкранов[0].Ширина, "ЧГ=");
	ВысотаЭкрана = Формат(ОписаниеЭкранов[0].Высота, "ЧГ=");
	Результат = ПараметрыВСтроку("%1 x %2", ШиринаЭкрана, ВысотаЭкрана);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОписаниеСтатистикиСеансаНаКлиенте()
	
	ДлительностьСеанса = Замер_ДлительностьСеанса_Завершить();
	
	Результат = Новый Структура;
	Результат.Вставить("ДлительностьСеанса", ДлительностьСеанса);
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти // ОписаниеПеременныхМетрикНаКлиенте

// #Область КонтрактыМетрикНаКлиенте

&НаКлиенте
Функция Новый_ОписаниеМетрики(Категория, Действие, ДопСведения = Неопределено
	, Метка = Неопределено
	, Представление = Неопределено) Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("Метка", Метка);
	Результат.Вставить("Действие", Действие);
	Результат.Вставить("Категория", Категория);
	Результат.Вставить("ДопСведения", ДопСведения);
	Результат.Вставить("Представление", Представление);
	Результат.Вставить("ОтметкаВремени", ТекущаяУниверсальнаяДатаВМиллисекундах());
	
	Результат.Вставить("НаКлиенте", Истина);
	Результат.Вставить("ПервыйЗапускМодуля", Ложь);
	Результат.Вставить("Организация", ПредопределенноеЗначение("Справочник.КонтурМаркировка_Организации.ПустаяСсылка"));
	
	Результат.Вставить("Сертификат");
	Результат.Вставить("ДокументУчета");
	Результат.Вставить("ИдентификаторТрассировки");
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Новый_СтекМетрик()
	
	Возврат МодульОбъекта().Новый_СтекМетрик();
	
КонецФункции

// #КонецОбласти // КонтрактыМетрикНаКлиенте

// #КонецОбласти // МетрикиНаКлиенте

// Регламентные и фоновые задания

&НаКлиенте
Функция РегламентныеДействияВыполняются() Экспорт
	
	Возврат РегламентныеДействияВыполняютсяНаСервере();
	
КонецФункции

&НаСервере
Функция РегламентныеДействияВыполняютсяНаСервере()
	
	Возврат МодульОбъекта().РегламентныеДействияВыполняются();
	
КонецФункции

&НаКлиенте
Функция ОчисткаУстаревшихДанныхВыполняется() Экспорт
	
	Возврат ОчисткаУстаревшихДанныхВыполняетсяНаСервере();
	
КонецФункции

&НаСервере
Функция ОчисткаУстаревшихДанныхВыполняетсяНаСервере()
	
	Возврат МодульОбъекта().ОчисткаУстаревшихДанныхВыполняется();
	
КонецФункции

&НаКлиенте
Функция ОбновлениеСтатусовКодовДокументаВыполняется(ДокументУчета) Экспорт
	
	Возврат ОбновлениеСтатусовКодовДокументаВыполняетсяНаСервере(ДокументУчета);
	
КонецФункции

&НаСервере
Функция ОбновлениеСтатусовКодовДокументаВыполняетсяНаСервере(ДокументУчета)
	
	Возврат МодульОбъекта().ОбновлениеСтатусовКодовДокументаВыполняется(ДокументУчета);
	
КонецФункции

&НаКлиенте
Функция ПроверкаКодовДокументаВыполняется(ДокументУчета) Экспорт
	
	Возврат ПроверкаКодовДокументаВыполняетсяНаСервере(ДокументУчета);
	
КонецФункции

&НаСервере
Функция ПроверкаКодовДокументаВыполняетсяНаСервере(ДокументУчета)
	
	Возврат МодульОбъекта().ПроверкаКодовДокументаВыполняется(ДокументУчета);
	
КонецФункции

&НаКлиенте
Функция ОбменССервисомВыполняется(ОбъектОбмена = Неопределено) Экспорт
	
	Возврат ОбменССервисомВыполняетсяНаСервере(ОбъектОбмена);
	
КонецФункции

&НаСервере
Функция ОбменССервисомВыполняетсяНаСервере(ОбъектОбмена = Неопределено)
	
	Возврат МодульОбъекта().ОбменССервисомВыполняется(ОбъектОбмена);
	
КонецФункции

&НаКлиенте
Процедура ОбновитьПлагины() Экспорт
	
	Если НастройкиМодуля().ИспользоватьПлагины Тогда
		ОбновитьПлагиныНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПлагиныНаСервере()
	
	МодульОбъекта().ОбновитьПлагины();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьУдалениеУстаревшихДанных() Экспорт
	
	ЗапуститьУдалениеУстаревшихДанныхНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗапуститьУдалениеУстаревшихДанныхНаСервере()
	
	Настройки = МодульОбъекта().НастройкиМодуля();
	ПериодичностьЗаданий = МодульОбъекта().Перечисление_ПериодичностьВыполненияЗаданий();
	
	Если Настройки.ПериодичностьОчисткиУстаревшихДанных <> ПериодичностьЗаданий.ПриЗапускеМодуля Тогда
		Возврат;
	КонецЕсли;
	
	Если Не МодульОбъекта().МенеджерФоновыхЗаданийДоступен() Тогда
		Возврат;
	КонецЕсли;
	Если МодульОбъекта().ОчисткаУстаревшихДанныхВыполняется() Тогда
		Возврат;
	КонецЕсли;
	
	МодульОбъекта().ЗапуститьОчисткуУстаревшихДанных();
	
КонецПроцедуры

&НаСервере
Функция ТребуетсяОтложенноеОбновлениеДанных()
	
	Результат = Ложь;
	
	МассивОбработчиков = МодульОбъекта().ОбработчикиОбновления();
	ПоследнийОбработчик = МассивОбработчиков[МассивОбработчиков.ВГраница()];
	Если ЗначениеЗаполнено(ПоследнийОбработчик.МетодОтложенногоОбновления)
		И МодульОбъекта().ЕстьОбъектыДляОтложенногоОбновления(ПоследнийОбработчик.Версия) Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ЗапуститьОтложенноеОбновлениеДанных() Экспорт
	
	ЗапуститьОтложенноеОбновлениеДанныхНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗапуститьОтложенноеОбновлениеДанныхНаСервере()
	
	Если Не ТребуетсяОтложенноеОбновлениеДанных() Тогда
		Возврат;
	КонецЕсли;
	
	Если МодульОбъекта().МенеджерФоновыхЗаданийДоступен() Тогда
		МодульОбъекта().ЗапуститьОтложенноеОбновлениеДанных();
	Иначе
		Действие = НСтр("ru = 'Отложенное обновление данных'");
		ТекстСообщения = НСтр(
		"ru ='Не удалось запустить фоновое обновление данных для перехода на новую версию!
		|Запустите выполнение фоновых заданий, через меню Сервис.
		|Затем откройте еще одну программу 1С и запустите модуль Контур.Маркировка.'");
		МодульОбъекта().ОбработатьОшибку(Действие, , , ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьОбменПоОрганизации(ВызывающаяФорма, Организация, ДокументУчета = Неопределено) Экспорт
	
	КонтекстОбмена = КонтекстОбменаНаСервере(Организация);
	КонтекстОбмена.ДокументУчета = ДокументУчета;
	
	Если Авторизация_Выполнить(КонтекстОбмена)
		И КонтекстОбмена.ОбменВозможен Тогда
		ЗапуститьОбменССервисом(КонтекстОбмена);
	КонецЕсли;
	
	ПоказатьОшибкиСертификата(КонтекстОбмена, ВызывающаяФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьОбменПоВсемОрганизациям(ВызывающаяФорма) Экспорт
	
	ОтправитьМетрики();
	
	Для каждого КонтекстОбмена Из ВсеКонтекстыДляОбмена(ВызывающаяФорма) Цикл
		
		ЗапуститьОбменССервисом(КонтекстОбмена);
		
		ПоказатьОшибкиСертификата(КонтекстОбмена, ВызывающаяФорма);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьОбменССервисом(КонтекстОбмена) Экспорт
	
	ПодписатьФайлыОчередиОбменаНаКлиенте(КонтекстОбмена);
	
	ЗапуститьОбменССервисомНаСервере(КонтекстОбмена);
	
	ПредупредитьЧтоСрокДействияСертификатаИстекает(КонтекстОбмена);
	
КонецПроцедуры

&НаСервере
Процедура ЗапуститьОбменССервисомНаСервере(КонтекстОбмена)
	
	МодульОбъекта().ЗапуститьОбменССервисом(КонтекстОбмена);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОшибкиОбменаССервисом(ВызывающаяФорма, Организация = Неопределено, ДокументУчета = Неопределено) Экспорт
	
	ОбработатьОшибкиОбменаССервисомНаСервере(Организация, ДокументУчета, ВызывающаяФорма.УникальныйИдентификатор);
	
КонецПроцедуры 

&НаСервере
Процедура ОбработатьОшибкиОбменаССервисомНаСервере(Организация, ДокументУчета, ИдентификаторФормы)
	
	МодульОбъекта().ОбработатьОшибкиОбменаССервисом(Организация, ДокументУчета, ИдентификаторФормы);
	
КонецПроцедуры

// Дополнительные кнопки

// Вызывает события ПМ при нажатии дополнительной кнопки
//
// Параметры:
//  ПараметрыНажатия - Структура - см. Новый_ПараметрыНажатияДопКнопки();
//  Команда - КомандаФормы - команда формы;
//
&НаКлиенте
Процедура ПриНажатииДополнительнойКнопки(ПараметрыНажатия, Команда) Экспорт
	
	СтандартнаяОбработка = Истина;
	
	ПрефиксДопКнопки = ПрефиксДополнительнойКнопки();
	ПараметрыНажатия.ИмяКнопки = Сред(Команда.Имя, СтрДлина(ПрефиксДопКнопки) + 1);
	
	ПМ_ОбработатьСобытие("ПриНажатииДопКнопкиНаКлиенте", ПараметрыНажатия, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		ПродолжитьОбработкуНажатияДопКнопки(ПараметрыНажатия);
	КонецЕсли;
	
	Метрика_Функциональность_ДопКнопки();
	Метрика_НажатиеДополнительнойКнопки(ПараметрыНажатия);
	
КонецПроцедуры

&НаСервере
Функция ПрефиксДополнительнойКнопки()
	
	Возврат МодульОбъекта().ПрефиксДополнительнойКнопки();
	
КонецФункции

&НаКлиенте
Функция Новый_ПараметрыНажатияДопКнопки() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяКнопки");
	Результат.Вставить("Размещение");
	
	ДопСведения = Новый Структура;
	ДопСведения.Вставить("ВыбранныеДокументы", Новый Массив);
	ДопСведения.Вставить("ВыбранныеДокументы1С", Новый Массив);
	ДопСведения.Вставить("ДокументУчета");
	ДопСведения.Вставить("Документ1С");
	ДопСведения.Вставить("Операция");
	
	Результат.Вставить("ДопСведения", ДопСведения);
	Результат.Вставить("ДопПараметры", Новый Структура);
	Результат.Вставить("ВызывающаяФорма");
	
	Возврат Результат;
	
КонецФункции


// Служебные

// Считывает данные из строки json
//
// Параметры:
//  Строка                 - Строка - строка json, которую нужно прочитать;
//  ПрочитатьВСоответствие - Булево - Истина, если json нужно прочитать в соответствие;
// 
// Возвращаемое значение:
//  Массив       - если текст json начинается с массива;
//  Структура    - если текст json начинается с пары ключ-значение;
//  Соответствие - если текст json начинается с пары ключ-значение и ПрочитатьВСоответствие = Истина;
//
&НаКлиенте
Функция ЗначениеИзСтрокиJSON(Строка, ПрочитатьВСоответствие = Ложь)
	
	Возврат Модуль_Плагин().ЗначениеИзСтрокиJSON(Строка, ПрочитатьВСоответствие);
	
КонецФункции

// Записывает значение в строку json
//
// Параметры:
//  Значение - Произвольный - значение, которое надо записать в json
// 
// Возвращаемое значение:
//  Строка - строка в формате json
//
&НаКлиенте
Функция ЗначениеВСтрокуJSON(Значение)
	
	Возврат Модуль_Плагин().ЗначениеВСтрокуJSON(Значение);
	
КонецФункции

&НаКлиенте
Функция НаименованиеМодуля()
	
	КлючКэш = "НаименованиеМодуля";
	
	Результат = Кэш_Прочитать(КлючКэш);
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = НаименованиеМодуляНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция НаименованиеМодуляНаСервере()
	
	Возврат МодульОбъекта().НаименованиеМодуля();
	
КонецФункции

&НаКлиенте
Функция ВерсияПлатформы() Экспорт
	
	СисИнфо = ИнформацияОСистеме();
	Результат = СисИнфо.ВерсияПриложения;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ВерсияРежимаСовместимости()
	
	КлючКэш = "ВерсияРежимаСовместимости";
	Результат = Кэш_Прочитать(КлючКэш);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ВерсияРежимаСовместимостиНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ВерсияРежимаСовместимостиНаСервере()
	
	Возврат МодульОбъекта().ВерсияРежимаСовместимости();
	
КонецФункции

// Определяет файловый режим базы на клиенте и передает это значение на сервер
// Это нужно для того, чтобы в правильно определить файловый режим в режиме работы через веб-сервер
//
&НаКлиенте
Процедура ОпределитьФайловыйРежимИБ() Экспорт
	
	ФайловыйРежим = ФайловыйРежимИБ();
	УстановитьФайловыйРежимИБНаСервере(ФайловыйРежим);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФайловыйРежимИБНаСервере(ФайловыйРежим)
	
	МодульОбъекта().УстановитьФайловыйРежимИБ(ФайловыйРежим);
	
КонецПроцедуры

&НаКлиенте
Функция ФайловыйРежимИБ() Экспорт
	
	КлючКэш = "ФайловыйРежимИБ";
	Результат = Кэш_Прочитать(КлючКэш);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = (Найти(Врег(СтрокаСоединенияИнформационнойБазы()), "FILE=") > 0);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЗначенияРеквизитовОбъектаНаСервере(Ссылка, Реквизиты)
	
	Возврат МодульОбъекта().ЗначенияРеквизитовОбъекта_Марк(Ссылка, Реквизиты);
	
КонецФункции

&НаСервере
Функция ЗначениеРеквизитаОбъектаНаСервере(Ссылка, ИмяРеквизита)
	
	Возврат МодульОбъекта().ЗначениеРеквизитаОбъекта_Марк(Ссылка, ИмяРеквизита);
	
КонецФункции

&НаСервере
Функция ФайлШаблонаПМ() Экспорт
	
	ИмяМакета = "КонтурМаркировкаПМ_epf";
	
	Результат = МодульОбъекта().МакетОбработки(ИмяМакета);
	
	Возврат Результат;
	
КонецФункции

// Формирует канонический уникальный идентификатор из произвольной строки
//
// Параметры:
//  Строка - Строка - уникальный идентификатор разбитый произвольным образом на блоки
// 
// Возвращаемое значение:
//  Строка - уникальный идентификатор по формату XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX
//
&НаКлиенте
Функция КаноническийИдентификаторИзСтроки(Строка) Экспорт
	
	Результат = "00000000-0000-0000-0000-000000000000";
	
	Если Не ЗначениеЗаполнено(Строка)  Тогда
		Возврат Результат;
	КонецЕсли;
	
	ЗначимаяЧастьСтроки = СтрЗаменить(Строка, "-", "");
	ДлинаИдентификатора = 36;
	
	Блок1 = Сред(ЗначимаяЧастьСтроки, 1, 8);
	Блок2 = Сред(ЗначимаяЧастьСтроки, 9, 4);
	Блок3 = Сред(ЗначимаяЧастьСтроки, 13, 4);
	Блок4 = Сред(ЗначимаяЧастьСтроки, 17, 4);
	Блок5 = Сред(ЗначимаяЧастьСтроки, 21, 12);
	
	Результат = ПараметрыВСтроку("%1-%2-%3-%4-%5", Блок1, Блок2, Блок3, Блок4, Блок5);
	
	ЗначимаяЧастьРезультата = СтрЗаменить(Результат, "-", "");
	
	Если СтрДлина(Результат) < ДлинаИдентификатора Или ЗначимаяЧастьРезультата <> ЗначимаяЧастьСтроки Тогда
		ВызватьИсключение ПараметрыВСтроку(НСтр(
		"ru = 'Не удалось сформировать канонический идентификатор из строки: %1'"), Строка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СписокОбработокВСоставеКонфигурации() Экспорт
	
	Возврат СписокОбработокВСоставеКонфигурацииНаСервере();
	
КонецФункции

&НаСервере
Функция СписокОбработокВСоставеКонфигурацииНаСервере()
	
	Результат = Новый СписокЗначений;
	
	Для каждого Элемент Из Метаданные.Обработки Цикл
		Результат.Добавить(Элемент.Имя);
	КонецЦикла;
	
	Результат.СортироватьПоЗначению();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЭтоУправляемаяФормаВыбора(ПутьКФорме)
	
	КлючКэш = "ЭтоУправляемаяФормаВыбора";
	КэшРезультатов = Кэш_Прочитать(КлючКэш);
	Если КэшРезультатов <> Неопределено Тогда
		Результат = КэшРезультатов[ПутьКФорме];
		Если Результат <> Неопределено Тогда
			Возврат Результат;
		КонецЕсли;
	Иначе
		КэшРезультатов = Новый Соответствие;
	КонецЕсли;
	
	Результат = ЭтоУправляемаяФормаВыбораНаСервере(ПутьКФорме);
	
	КэшРезультатов.Вставить(ПутьКФорме, Результат);
	Кэш_Поместить(КлючКэш, КэшРезультатов);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЭтоУправляемаяФормаВыбораНаСервере(ПутьКФорме)
	
	Форма = Метаданные.НайтиПоПолномуИмени(ПутьКФорме);
	
	Если Форма = Неопределено Тогда
		
		// Попробуем найти основную форму выбора или основную форму списка
		Поз = Найти(ПутьКФорме, ".Форма");
		ИмяОбъекта = Лев(ПутьКФорме, Поз - 1);
		МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ИмяОбъекта);
		
		Форма = МетаданныеОбъекта.ОсновнаяФормаДляВыбора;
		Если Форма = Неопределено Тогда
			Форма = МетаданныеОбъекта.ОсновнаяФормаСписка;
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = (Форма.ТипФормы = Метаданные.СвойстваОбъектов.ТипФормы.Управляемая);
	
	Возврат Результат;
	
КонецФункции

// Сравнивает указанную версию с версией платформы
//
// Параметры:
//  Версия - Строка - версия, с которой нужно сравнить версию платформы;
// 
// Возвращаемое значение:
//  Булево - Истина, если версия платформы ниже указанной
//
&НаКлиенте
Функция ВерсияПлатформыНиже(Версия) Экспорт
	
	КлючКэш = "ВерсияПлатформыНиже: " + Версия;
	Результат = Кэш_Прочитать(КлючКэш);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = (СравнитьВерсии(ВерсияПлатформы(), Версия) < 0);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

// Сравнивает указанную версию с версией режима совместимости
//
// Параметры:
//  Версия - Строка - версия, с которой нужно сравнить версию платформы;
// 
// Возвращаемое значение:
//  Булево - Истина, если версия платформы ниже указанной
//
&НаКлиенте
Функция ВерсияРежимаСовместимостиНиже(Версия)
	
	КлючКэш = "ВерсияРежимаСовместимостиНиже: " + Версия;
	Результат = Кэш_Прочитать(КлючКэш);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = (СравнитьВерсии(ВерсияРежимаСовместимости(), Версия) < 0);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ВидПродукцииПоддерживаетВетКонтроль(ВидПродукции) Экспорт
	
	КлючКэш = "ВидПродукцииПоддерживаетВетКонтроль: " + ВидПродукции;
	Результат = Кэш_Прочитать(КлючКэш);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ВидПродукцииПоддерживаетВетКонтрольНаСервере(ВидПродукции);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ВидПродукцииПоддерживаетВетКонтрольНаСервере(ВидПродукции)
	
	Возврат МодульОбъекта().ВидПродукцииПоддерживаетВетКонтроль(ВидПродукции);
	
КонецФункции

&НаКлиенте
Функция ВидПродукцииДопускаетОСУ(ВидПродукции) Экспорт
	
	КлючКэш = "ВидПродукцииДопускаетОСУ: " + ВидПродукции;
	Результат = Кэш_Прочитать(КлючКэш);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ВидПродукцииДопускаетОСУНаСервере(ВидПродукции);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ВидПродукцииДопускаетОСУНаСервере(ВидПродукции)
	
	Возврат МодульОбъекта().ВидПродукцииДопускаетОСУ(ВидПродукции);
	
КонецФункции

&НаКлиенте
Функция ВидПродукцииПоддерживаетПартионныйУчет(ВидПродукции) Экспорт
	
	КлючКэш = "ВидПродукцииПоддерживаетПартионныйУчет: " + ВидПродукции;
	Результат = Кэш_Прочитать(КлючКэш);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ВидПродукцииПоддерживаетПартионныйУчетНаСервере(ВидПродукции);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ВидПродукцииПоддерживаетПартионныйУчетНаСервере(ВидПродукции)
	
	Возврат МодульОбъекта().ВидПродукцииПоддерживаетПартионныйУчет(ВидПродукции);
	
КонецФункции

// Заменяет различные варианты разделителя группы GS к символу ASCII 29
//
// Параметры:
//  Строка - Строка - строка с различными вариантами разделителя GS
// 
// Возвращаемое значение:
//  Строка - строка с разделителем GS (ASCII 29)
//
&НаКлиенте
Функция ВосстановитьРазделительGS1(Знач Строка)
	
	Пробел = " ";
	Эквивалент = ЭквивалентРазделителяGS1();
	ЭквивалентВРег = ВРег(Эквивалент);
	РазделительGS1 = РазделительGS1();
	
	Строка = СтрЗаменить(Строка, Пробел, РазделительGS1);
	Строка = СтрЗаменить(Строка, Эквивалент, РазделительGS1);
	Строка = СтрЗаменить(Строка, ЭквивалентВРег, РазделительGS1);
	
	Возврат Строка;
	
КонецФункции

&НаКлиенте
Функция ЗаменитьРазделительGS1(Строка) Экспорт
	
	Результат = СтрЗаменить(Строка, РазделительGS1(), ЭквивалентРазделителяGS1());
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция РазделительGS1() Экспорт
	
	Возврат Символ(29);
	
КонецФункции

&НаКлиенте
Функция ЭквивалентРазделителяGS1() Экспорт
	
	Возврат "\u001d";
	
КонецФункции

&НаКлиенте
Функция ЭквивалентыРазделителяGS1() Экспорт
	
	Возврат ЭквивалентыРазделителяGS1НаСервере();
	
КонецФункции

&НаСервере
Функция ЭквивалентыРазделителяGS1НаСервере()
	
	Возврат МодульОбъекта().ЭквивалентыРазделителяGS1();
	
КонецФункции

&НаКлиенте
Процедура ЭквивалентыРазделителяGS1_Записать(МассивЭквивалентовGS1) Экспорт
	
	ЭквивалентыРазделителяGS1_ЗаписатьНаСервере(МассивЭквивалентовGS1);
	
КонецПроцедуры

&НаСервере
Процедура ЭквивалентыРазделителяGS1_ЗаписатьНаСервере(МассивЭквивалентовGS1)
	
	МодульОбъекта().ЭквивалентыРазделителяGS1_Записать(МассивЭквивалентовGS1);
	
КонецПроцедуры

&НаКлиенте
Функция ДоступнаПечатьШтрихкодовНаКлиенте() Экспорт
	
	Результат = Не ФайловыйРежимИБ() И Плагин_ПечататьШтрихкодовЧерезПлагинДоступна();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьИнтернетСтраницу(АдресСтраницы) Экспорт
	
	// BSLLS:ExternalAppStarting-off
	ЗапуститьПриложение(АдресСтраницы);
	// BSLLS:ExternalAppStarting-on
	
КонецПроцедуры

// Определяет по длине ИНН является ли владелец индивидуальным предпринимателем
//
// Параметры:
//  ИНН - Строка - ИНН
// 
// Возвращаемое значение:
//  Булево - Истина, если владелец ИНН является ИП
//
&НаКлиенте
Функция ЭтоИП(ИНН) Экспорт
	
	Результат = (СтрДлина(ИНН) = 12);
	
	Возврат Результат;
	
КонецФункции

// Определяет доступен ли параметр завершения работы в событии формы ПередЗакрытием
// 
// Возвращаемое значение:
//  Булево - Истина, если параметр доступен
//
&НаКлиенте
Функция ДоступенПараметрЗавершенияРаботыПередЗакрытием()
	
	КлючКэш = "ДоступенПараметрЗавершенияРаботыПередЗакрытием";
	Результат = Кэш_Прочитать(КлючКэш);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	НачальнаяВерсия = "8.3.8";
	
	Результат = Не ВерсияПлатформыНиже(НачальнаяВерсия)
	И Не ВерсияРежимаСовместимостиНиже(НачальнаяВерсия);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

// Определяет завершается ли сейчас работа программы
// Вызывается перед закрытием формы
// 
// Возвращаемое значение:
//  Булево - Истина, если выполняется завершение работы программы
//
&НаКлиенте
Функция ЭтоЗавершениеРаботыПрограммы(ЗавершениеРаботы) Экспорт
	
	Возврат ДоступенПараметрЗавершенияРаботыПередЗакрытием() И ЗавершениеРаботы;
	
КонецФункции

&НаСервере
Функция СкачатьФайлИзИнтернета(СсылкаНаФайл) Экспорт
	
	Возврат СкачатьФайлИзИнтернетаНаСервере(СсылкаНаФайл);
	
КонецФункции

&НаСервере
Функция СкачатьФайлИзИнтернетаНаСервере(СсылкаНаФайл)
	
	Возврат МодульОбъекта().СкачатьФайлИзИнтернета(СсылкаНаФайл);
	
КонецФункции

&НаКлиенте
Функция ЦветГиперСсылки() Экспорт
	
	Возврат Новый Цвет(28, 85, 174);
	
КонецФункции

// Разбирает номер декларации на части
//
// Параметры:
//  НомерДекларации - Строка - номер декларации;
// 
// Возвращаемое значение:
//  Структура - содержит поля:
//   * КодТаможни - Строка - код таможни;
//   * ДатаДекларации - Дата - дата декларации;
//   * ПорядковыйНомер - Строка - порядковый номер декларации;
//
&НаКлиенте
Функция СтруктураТаможеннойДекларации(НомерДекларации) Экспорт
	
	Возврат СтруктураТаможеннойДекларацииНаСервере(НомерДекларации);
	
КонецФункции

&НаСервере
Функция СтруктураТаможеннойДекларацииНаСервере(НомерДекларации)
	
	Возврат МодульОбъекта().СтруктураТаможеннойДекларации(НомерДекларации);
	
КонецФункции

&НаКлиенте
Функция ВидПродукцииТребуетУказатьТипСрокаГодности(ВидПродукции) Экспорт
	
	КлючКэш = "ВидПродукцииТребуетУказатьТипСрокаГодности: " + ВидПродукции;
	Результат = Кэш_Прочитать(КлючКэш);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ВидПродукцииТребуетУказатьТипСрокаГодностиНаСервере(ВидПродукции);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ВидПродукцииТребуетУказатьТипСрокаГодностиНаСервере(ВидПродукции)
	
	Возврат МодульОбъекта().ВидПродукцииТребуетУказатьТипСрокаГодности(ВидПродукции);
	
КонецФункции

&НаКлиенте
Функция ВидПродукцииПоддерживаетОтчетОНанесении(ВидПродукции) Экспорт 
	
	КлючКэш = "ВидПродукцииПоддерживаетОтчетОНанесении: " + ВидПродукции;
	Результат = Кэш_Прочитать(КлючКэш);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ВидПродукцииПоддерживаетОтчетОНанесенииНаСервере(ВидПродукции);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ВидПродукцииПоддерживаетОтчетОНанесенииНаСервере(ВидПродукции)
	
	Возврат МодульОбъекта().ВидПродукцииПоддерживаетОтчетОНанесении(ВидПродукции);
	
КонецФункции

&НаКлиенте
Процедура НормализоватьНомераСкважин(НомераСкважин) Экспорт
	
	МассивСтрок = РазделитьСтроку(НомераСкважин, ",");
	НомераСкважин = СоединитьСтроку(МассивСтрок, ", ");
	
КонецПроцедуры

&НаКлиенте
Функция ЭтоФорма(Форма)
	
	ТипФормы = ТипЗнч(Форма);
	
	Если ТипФормы = ТипЗнч(ЭтаФорма) Тогда
		Результат = Истина;
	ИначеЕсли ЭтоТолстыйКлиентОбычноеПриложение()
		И ТипФормы = Тип("Форма") Тогда
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция МожноИспользоватьКриптографиюНаКлиенте() Экспорт
	
	Если НастройкиМодуля().РежимТестирования Тогда
		Возврат Истина; // По умолчанию в режиме тестирования проверяем подпись на клиенте
	КонецЕсли;
	
	Возврат Не ФайловыйРежимИБ();
	
КонецФункции

&НаКлиенте
Процедура ОткрытьСправкуФорматыКодов() Экспорт
	
	ОткрытьИнтернетСтраницу(ИнтернетАдреса().СправкаФорматыКодов);
	
	Функциональность = Перечисление_ФункциональностьМодуля().СтраницаФорматыКодов;
	СтекМетрик_ДобавитьФункциональность(Функциональность);
	
КонецПроцедуры

&НаКлиенте
Функция ПустойКлючНоменклатуры1С() Экспорт
	
	Возврат ПредопределенноеЗначение("Справочник.КонтурМаркировка_КлючиНоменклатуры1С.ПустаяСсылка");
	
КонецФункции

&НаКлиенте
Функция ПустойУникальныйИдентификатор() Экспорт
	
	Возврат Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	
КонецФункции

&НаКлиенте
Функция ЭтоОтчетОНанесении(ТипОперации) Экспорт
	
	КлючКэш = "ЭтоОтчетОНанесении: " + ТипОперации;
	Результат = Кэш_Прочитать(КлючКэш);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ЭтоОтчетОНанесенииНаСервере(ТипОперации);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЭтоОтчетОНанесенииНаСервере(ТипОперации)
	
	Возврат МодульОбъекта().ЭтоОтчетОНанесении(ТипОперации);
	
КонецФункции

&НаКлиенте
Функция ОткрытаяФормаОбработки(ПолноеИмяОткрытойФормы)
	
	ПараметрыФормы = Новый Структура("ЗапрещеноСозданиеНовойФормы", Истина);
	
	Попытка
		Результат = ОткрытьФорму(ПолноеИмяОткрытойФормы, ПараметрыФормы);
	Исключение
		Ошибка = ИнформацияОбОшибке();
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОткрытаяФормаРабочегоСтола()
	
	Возврат ОткрытаяФормаОбработки(ПутьКФормеРабочегоСтола());
	
КонецФункции

&НаКлиенте
Функция ОткрытаяФормаМодуля()
	
	Возврат ОткрытаяФормаОбработки(ПутьКФормеМодуля());
	
КонецФункции

&НаКлиенте
Функция ПутьКФормеРабочегоСтола()
	
	Возврат ИмяОбработки() + ".Форма.РабочийСтол";
	
КонецФункции

&НаКлиенте
Функция ПутьКФормеМодуля()
	
	Возврат ИмяОбработки() + ".Форма.ФормаМодуля";
	
КонецФункции

&НаКлиенте
Функция ДанныеВыбораЗначенияЗаполненияРеквизита(НастройкиРеквизита) Экспорт
	
	Результат = Новый СписокЗначений();
	
	РеквизитыОпераций = Перечисление_РеквизитыОперацийДляАвтозаполнения();
	
	Если НастройкиРеквизита.ИмяРеквизита = РеквизитыОпераций.ПричинаВыводаИзОборота Тогда
		СтруктураЗначений = Перечисление_ПричиныВыводаИзОборота();
		Результат = СписокЗначенийСтруктуры(СтруктураЗначений);
	КонецЕсли;
	
	Если НастройкиРеквизита.ИмяРеквизита = РеквизитыОпераций.ВидПервичногоДокумента Тогда
		СтруктураЗначений = Перечисление_ВидыПервичныхДокументов();
		Результат = СписокЗначенийСтруктуры(СтруктураЗначений);
	КонецЕсли;
	
	Если НастройкиРеквизита.ИмяРеквизита = РеквизитыОпераций.КодСтраныПолучателя Тогда
		Результат = СписокСтранЕАЭС();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура НастроитьЭлементЗначенияЗаполненияРеквизита(Элемент, НастройкиРеквизита, ЕстьСписокРеквизитов = Ложь) Экспорт
	
	Если НастройкиРеквизита.ПравилоЗаполнения = Перечисление_ПравилаЗаполненияРеквизитов().НеЗаполнять Тогда
		Возврат;
	КонецЕсли;
	
	ОграничениеТипа = ОграничениеТипаЗаполненияРеквизита(НастройкиРеквизита);
	ВыбиратьЗначение = РеквизитуДоступенВыборЗначения(НастройкиРеквизита, ЕстьСписокРеквизитов);
	
	Элемент.ОграничениеТипа = ОграничениеТипа;
	Элемент.РежимВыбораИзСписка = ВыбиратьЗначение;
	Элемент.РедактированиеТекста = Не ВыбиратьЗначение;
	
КонецПроцедуры

&НаКлиенте
Функция ОграничениеТипаЗаполненияРеквизита(НастройкиРеквизита) Экспорт
	
	Результат = НастройкиРеквизита.ТипЗначения;
	
	ПравилаЗаполнения = Перечисление_ПравилаЗаполненияРеквизитов();
	
	Если НастройкиРеквизита.ПравилоЗаполнения = ПравилаЗаполнения.РеквизитДокумента1С
		Или НастройкиРеквизита.ПравилоЗаполнения = ПравилаЗаполнения.Формула Тогда
		Результат = Новый ОписаниеТипов("Строка");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция РеквизитуДоступенВыборЗначения(НастройкиРеквизита, ЕстьСписокРеквизитов = Ложь) Экспорт
	
	Результат = Ложь;
	
	ПравилаЗаполнения = Перечисление_ПравилаЗаполненияРеквизитов();
	РеквизитыОпераций = Перечисление_РеквизитыОперацийДляАвтозаполнения();
	
	РеквизитыПеречислений = Новый Массив;
	РеквизитыПеречислений.Добавить(РеквизитыОпераций.ПричинаВыводаИзОборота);
	РеквизитыПеречислений.Добавить(РеквизитыОпераций.ВидПервичногоДокумента);
	РеквизитыПеречислений.Добавить(РеквизитыОпераций.КодСтраныПолучателя);
	
	Если НастройкиРеквизита.ПравилоЗаполнения = ПравилаЗаполнения.РеквизитДокумента1С
		И ЕстьСписокРеквизитов Тогда
		Результат = Истина;
	КонецЕсли;
	
	Если НастройкиРеквизита.ПравилоЗаполнения = ПравилаЗаполнения.ФиксированноеЗначение
		И РеквизитыПеречислений.Найти(НастройкиРеквизита.ИмяРеквизита) <> Неопределено
		И НастройкиРеквизита.ТипЗначения.СодержитТип(Тип("Строка")) Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ВыборЗначенияИзСправочника(Элемент, ТекущиеДанные, СтандартнаяОбработка) Экспорт
	
	Результат = Ложь;
	
	ПравилаЗаполнения = Перечисление_ПравилаЗаполненияРеквизитов();
	Реквизиты = Перечисление_РеквизитыОперацийДляАвтозаполнения();
	
	Если ТекущиеДанные.ПравилоЗаполнения = ПравилаЗаполнения.ФиксированноеЗначение Тогда
		
		Если ТекущиеДанные.ИмяРеквизита = Реквизиты.МобильноеУстройство Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("РежимВыбора", Истина);
			ПараметрыФормы.Вставить("ТекущееУстройство", ТекущиеДанные.Значение);
			
			ОткрытьФормуОбработки("Форма_МобильныеУстройства_Список", Элемент, ПараметрыФормы);
			
			СтандартнаяОбработка = Ложь;
			Результат = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// #Область КонтурИнтеграция

&НаКлиенте
Процедура КонтурИнтеграция_ПослеЗакрытияДокумента(Результат, ПослеВыполненияКоманды) Экспорт
	
	ОтправитьМетрики();
	
	ВызватьОбработчикОповещения(ПослеВыполненияКоманды, Результат);
	
КонецПроцедуры

&НаКлиенте
Функция КонтурИнтеграция_ТребуемоеДействиеПоКомандеФормы(КомандаФормы)
	
	ИндексКоманды = ЧислоИзСтроки(КомандаФормы.Имя);
	
	Возврат КонтурИнтеграция_ВсеКомандыДокументов1С().Получить(ИндексКоманды).Значение;
	
КонецФункции

&НаКлиенте
Функция КонтурИнтеграция_ВсеКомандыДокументов1С()
	
	КлючКэш = "ВсеКомандыДокументов1С";
	Результат = Кэш_Прочитать(КлючКэш);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = КонтурИнтеграция_ВсеКомандыДокументов1СНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция КонтурИнтеграция_ВсеКомандыДокументов1СНаСервере()
	
	Возврат МодульОбъекта().КонтурИнтеграция_ВсеКомандыДокументов1С();
	
КонецФункции

// #КонецОбласти // КонтурИнтеграция

// Модуль клиента для обычных форм

&НаКлиенте
Функция МодульКлиента_Обычная()
	
	КлючКэш = "МодульКлиента_Обычная";
	Результат = Кэш_Прочитать(КлючКэш);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	ПутьКФорме = ПутьКФормеМодуляКлиента_Обычная();
	
	Результат = ОткрытьФорму(ПутьКФорме, , ЭтаФорма);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента_Обычная()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента_Обычная();
	
КонецФункции


// Общего назначения

&НаКлиенте
Функция ВСтрокеТолькоЦифры(Строка) Экспорт
	
	Результат = Истина;
	
	КодСимвола0 = КодСимвола("0");
	КодСимвола9 = КодСимвола("9");
	
	ДлинаСтроки = СтрДлина(Строка);
	
	Для Сч = 1 По ДлинаСтроки Цикл
		
		КодСимвола = КодСимвола(Строка, Сч);
		
		Если КодСимвола < КодСимвола0
			Или КодСимвола > КодСимвола9 Тогда
			Результат = Ложь;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат
	
КонецФункции

// Возвращает массив переданных параметров в порядке их расположения
// 
// Возвращаемое значение:
//  Массив
//
&НаКлиенте
Функция НовыйМассив(Знач1, Знач2 = Null, Знач3 = Null, Знач4 = Null) Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить(Знач1);
	
	Если Знач2 <> Null Тогда
		Результат.Добавить(Знач2);
	КонецЕсли;
	Если Знач3 <> Null Тогда
		Результат.Добавить(Знач3);
	КонецЕсли;
	Если Знач4 <> Null Тогда
		Результат.Добавить(Знач4);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция НовыйСоответствие(Ключ1, Знач1
	, Ключ2 = NULL, Знач2 = NULL
	, Ключ3 = NULL, Знач3 = NULL) Экспорт
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(Ключ1, Знач1);
	
	Если Ключ2 <> NULL И Знач2 <> NULL Тогда
		Результат.Вставить(Ключ2, Знач2);
	КонецЕсли;
	
	Если Ключ3 <> NULL И Знач3 <> NULL Тогда
		Результат.Вставить(Ключ3, Знач3);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Добавляет значение в массив
//
// Параметры:
//	Значение - Произвольный - преобразуемое значение
//
// Возвращаемое значение:
//	Массив
&НаКлиенте
Функция ЗначениеВМассиве(Значение) Экспорт
	
	Если ТипЗнч(Значение) = Тип("Массив") Тогда
		
		Результат = Значение;
		
	Иначе
		
		Результат = Новый Массив;
		Результат.Добавить(Значение);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Дополняет массив значениями из другого массива
//
// Параметры:
//  МассивПриемник - Массив - массив, в который необходимо добавить значения;
//  МассивИсточник - Массив - массив, из которого нужно взять значения;
//  ТолькоНовыеЗначения - Булево - (необязательный) Истина, если в приемник
//					нужно добавить только те значения, которых там еще нет;
//
&НаКлиенте
Процедура ДополнитьМассив(МассивПриемник, МассивИсточник, ТолькоНовыеЗначения = Ложь, ДобавлятьПустыеЗначения = Истина)
	
	Если ТолькоНовыеЗначения Тогда
		
		ЗначенияПриемника = Новый Соответствие;
		Для Каждого Значение Из МассивПриемник Цикл
			ЗначенияПриемника.Вставить(Значение, Истина);
		КонецЦикла;
		
		Для Каждого Значение Из МассивИсточник Цикл
			Если Не ДобавлятьПустыеЗначения
				И Не ЗначениеЗаполнено(Значение) Тогда
				Продолжить;
			КонецЕсли;
			Если ЗначенияПриемника[Значение] = Неопределено Тогда
				МассивПриемник.Добавить(Значение);
				ЗначенияПриемника.Вставить(Значение, Истина);
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		Для Каждого Значение Из МассивИсточник Цикл
			МассивПриемник.Добавить(Значение);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Сворачивает массив
//
// Параметры:
//  Массив - Массив
//
&НаКлиенте
Процедура СвернутьМассив_Марк(Массив, УдалитьПустыеЗначения = Ложь) Экспорт
	
	Результат = Новый Массив;
	
	ДополнитьМассив(Результат, Массив, Истина, Не УдалитьПустыеЗначения);
	
	Массив = Результат;
	
КонецПроцедуры

// Выгружает значения структуры в массив
//
// Параметры:
//  Структура - Структура - структура
// 
// Возвращаемое значение:
//  Массив
//
&НаКлиенте
Функция МассивЗначенийИзСтруктуры(Структура) Экспорт
	
	Результат = Новый Массив;
	
	Для каждого Элемент Из Структура Цикл
		Результат.Добавить(Элемент.Значение);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает список ,состоящий из значений передаваемой структуры
//
// Параметры:
//  Структура - Структура - структура
// 
// Возвращаемое значение:
//  СписокЗначений - содержит значения структуры
//
Функция СписокЗначенийСтруктуры(Структура) Экспорт
	
	Результат = Новый СписокЗначений;
	
	Для Каждого Элемент Из Структура Цикл
		Результат.Добавить(Элемент.Значение);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Проверяет что значение есть в массиве
//
// Параметры:
//  Массив - Массив - массив, в котором нужно найти значение;
//  Значение - Произвольный - значение, которое нужно найти в массиве;
// 
// Возвращаемое значение:
//  Булево - Истина, если значение есть в массиве
//
&НаКлиенте
Функция МассивСодержитЗначение(Массив, Значение) Экспорт
	
	Результат = Массив.Найти(Значение) <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

// Сравнивает версии между собой
// значения после дефиса или слэша не учитываются
//
// Параметры:
//  Версия1 - Строка - номер версии в формате РР.{П|ПП}.ЗЗ.СС;
//  Версия2 - Строка - второй сравниваемый номер версии;
//
// Возвращаемое значение:
//  Число - возможные значения:
//   * больше 0 - если Версия1 > Версия2;
//   * меньше 0 - если Версия1 < Версия2;
//   * 0 - если версии равны;
//
&НаКлиенте
Функция СравнитьВерсии(Версия1, Версия2)
	
	// Для составных номеров версий берем только первую часть
	Строка1 = Сред(Версия1, 1, Найти(Версия1, "-") - 1);
	Строка2 = Сред(Версия2, 1, Найти(Версия2, "-") - 1);
	Строка1 = Сред(Строка1, 1, Найти(Строка1, "/") - 1);
	Строка2 = Сред(Строка2, 1, Найти(Строка2, "/") - 1);
	
	ОписаниеЧисла = Новый ОписаниеТипов("Число");
	
	Результат = 0;
	
	Пока ЗначениеЗаполнено(Строка1)
		Или ЗначениеЗаполнено(Строка2) Цикл
		
		Поз = Найти(Строка1, ".");
		Если Поз = 0 Тогда
			Подстрока1 = СокрЛП(Строка1);
			Строка1 = "";
		Иначе
			Подстрока1 = СокрЛП(Лев(Строка1, Поз - 1));
			Строка1 = Сред(Строка1, Поз + 1);
		КонецЕсли;
		
		Поз = Найти(Строка2, ".");
		Если Поз = 0 Тогда
			Подстрока2 = СокрЛП(Строка2);
			Строка2 = "";
		Иначе
			Подстрока2 = СокрЛП(Лев(Строка2, Поз - 1));
			Строка2 = Сред(Строка2, Поз + 1);
		КонецЕсли;
		
		НомерВерсии1 = ОписаниеЧисла.ПривестиЗначение(Подстрока1);
		НомерВерсии2 = ОписаниеЧисла.ПривестиЗначение(Подстрока2);
		
		Результат = НомерВерсии1 - НомерВерсии2;
		
		Если Результат <> 0 Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Соединяет массив переданных строк в одну строку с указанным разделителем
// По аналогии с глобальным методом СтрСоединить
// 
// Параметры:
//  Строки - Массив, ФиксированныйМассив - массив, содержащий объединяемые строки;
//  Разделитель - Строка - строка, которая будет вставлена между объединяемыми строками;
//
// Возвращаемое значение:
//  Строка
//
&НаКлиенте
Функция СоединитьСтроку(Строки, Разделитель = "") Экспорт
	
	Если Не ВерсияПлатформыНиже("8.3.6") И Не ВерсияРежимаСовместимостиНиже("8.3.6") Тогда
		Результат = Вычислить("СтрСоединить(Строки, Разделитель)");
		Возврат Результат;
	КонецЕсли;
	
	Результат = "";
	ТекРазделитель = "";
	
	Если ЗначениеЗаполнено(Строки) Тогда
		Для Каждого Строка Из Строки Цикл
			Если ЗначениеЗаполнено(Строка) Тогда
				Результат = Результат + ТекРазделитель + Строка;
				ТекРазделитель = Разделитель;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Подставляет параметры в строку, максимальное число параметров - 5
//
// Параметры:
//  ШаблонСтроки - Строка - шаблон с маркерами подстановки: "%1..%N";
//  Параметр<n>  - Строка - параметры, которые нужно подставить;
//
// Возвращаемое значение:
//   Строка - строка шаблона с подставленными параметрами.
//
&НаКлиенте
Функция ПараметрыВСтроку(ШаблонСтроки, Параметр1
	, Параметр2 = Неопределено
	, Параметр3 = Неопределено
	, Параметр4 = Неопределено
	, Параметр5 = Неопределено) Экспорт
	
	ЕстьПараметрыСПроцентом =
	Найти(Параметр1, "%") > 0
	Или Найти(Параметр2, "%") > 0
	Или Найти(Параметр3, "%") > 0
	Или Найти(Параметр4, "%") > 0
	Или Найти(Параметр5, "%") > 0;
	
	Если ЕстьПараметрыСПроцентом Тогда
		Возврат ПараметрыСПроцентомВСтроку(ШаблонСтроки
		, Параметр1, Параметр2, Параметр3, Параметр4, Параметр5);
	КонецЕсли;
	
	Результат = СтрЗаменить(ШаблонСтроки, "%1", Параметр1);
	Результат = СтрЗаменить(Результат	, "%2", Параметр2);
	Результат = СтрЗаменить(Результат	, "%3", Параметр3);
	Результат = СтрЗаменить(Результат	, "%4", Параметр4);
	Результат = СтрЗаменить(Результат	, "%5", Параметр5);
	
	Возврат Результат;
	
КонецФункции

// Вставляет параметры в строку, с учетом того что в параметрах
// могут использоваться подстановочные слова %1, %2, %3, %4, %5
//
&НаКлиенте
Функция ПараметрыСПроцентомВСтроку(Знач ШаблонСтроки
	, Параметр1 = Неопределено
	, Параметр2 = Неопределено
	, Параметр3 = Неопределено
	, Параметр4 = Неопределено
	, Параметр5 = Неопределено)
	
	Результат = "";
	
	Пока Истина Цикл
		
		Поз = Найти(ШаблонСтроки, "%");
		
		Если Поз = 0 Тогда
			Прервать;
		КонецЕсли;
		
		Результат = Результат + Лев(ШаблонСтроки, Поз - 1);
		
		НомерПараметра = Сред(ШаблонСтроки, Поз + 1, 1);
		
		Если НомерПараметра = "1" Тогда
			ЗначениеПараметра = Параметр1;
		ИначеЕсли НомерПараметра = "2" Тогда
			ЗначениеПараметра = Параметр2;
		ИначеЕсли НомерПараметра = "3" Тогда
			ЗначениеПараметра = Параметр3;
		ИначеЕсли НомерПараметра = "4" Тогда
			ЗначениеПараметра = Параметр4;
		ИначеЕсли НомерПараметра = "5" Тогда
			ЗначениеПараметра = Параметр5;
		Иначе
			ЗначениеПараметра = Неопределено;
		КонецЕсли;
		
		Если ЗначениеПараметра = Неопределено Тогда
			Результат = Результат + "%";
			ШаблонСтроки = Сред(ШаблонСтроки, Поз + 1);
		Иначе
			Результат = Результат + ЗначениеПараметра;
			ШаблонСтроки = Сред(ШаблонСтроки, Поз + 2);
		КонецЕсли;
		
	КонецЦикла;
	
	Результат = Результат + ШаблонСтроки;
	
	Возврат Результат;
	
КонецФункции

// Безопасно читает свойство объекта, даже если объект не определен
//
// Параметры:
//  Объект - Произвольное - любой объект;
//  ИмяПоля - Строка - имя поля;
//  ЗначениеПоУмолчанию - Произвольный - (необязательный) возвращается,
//            если у объекта нет такого поля или значение Неопределено;
// 
// Возвращаемое значение:
//  Произвольное - значение поля
//
&НаКлиенте
Функция СвойствоОбъекта(Объект, ИмяПоля, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Попытка
		
		Результат = Объект[ИмяПоля];
		
		Если Результат = Неопределено Тогда
			Результат = ЗначениеПоУмолчанию;
		КонецЕсли;
		
	Исключение
		Результат = ЗначениеПоУмолчанию;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Безопасно читает свойство структуры
// 
// Параметры:
//  Структура - Структура - структура;
//  Ключ      - Строка  - ключ;
//  ЗначениеПоУмолчанию - Произвольный - (необязательный) возвращается,
//                                   если в структуре нет такого ключа;
// 
// Возвращаемое значение:
//   Произвольный - значение свойства
//
&НаКлиенте
Функция СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Возврат СвойствоОбъекта(Структура, Ключ, ЗначениеПоУмолчанию);
	
КонецФункции

// Возвращает значение по ключу соответствия или значение по умолчанию,
// если в соответствии нет такого ключа
// 
// Параметры:
//  Соответствие        - Соответствие - соответствие источник;
//  Ключ                - Произвольный - ключ соответствия;
//  ЗначениеПоУмолчанию - Произвольный - (необязательный) возвращается в случае,
//                                       если в соответствии нет указанного ключа;
// 
// Возвращаемое значение:
//  Произвольный - значение из соответствия или ЗначениеПоУмолчанию
//
&НаКлиенте
Функция ЗначениеСоответствия(Соответствие, Ключ, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Попытка
		Результат = Соответствие[Ключ];
	Исключение
		Результат = Неопределено;
	КонецПопытки;
	
	Если Результат = Неопределено Тогда
		Результат = ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Определяет, является ли переданное значение структурой
// или фиксированной структурой
// 
// Параметры:
//  Значение - Произвольный - значение, которое нужно проверить
// 
// Возвращаемое значение:
//  Булево - Истина, если переданое значение является структрой или фиксированной структурой
//
&НаКлиенте
Функция ЭтоСтруктура(Значение)
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ТипЗначения = Тип("Структура")
		Или ТипЗначения = Тип("ФиксированнаяСтруктура") Тогда
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Определяет, является ли переданное значение соответствием
// или фиксированным соответствием
// 
// Параметры:
//  Значение - Произвольный - значение, которое нужно проверить
// 
// Возвращаемое значение:
//  Булево - Истина, если переданое значение является соответствием или фиксированным соответствием
//
&НаКлиенте
Функция ЭтоСоответствие(Значение)
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ТипЗначения = Тип("Соответствие")
		Или ТипЗначения = Тип("ФиксированноеСоответствие") Тогда
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Определяет, является ли переданное значение массивом
// или фиксированным массивом
// 
// Параметры:
//  Значение - Произвольный - значение, которое нужно проверить
// 
// Возвращаемое значение:
//  Булево - Истина, если переданое значение является структрой или фиксированной структурой
//
&НаКлиенте
Функция ЭтоМассив(Значение)
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ТипЗначения = Тип("Массив")
		Или ТипЗначения = Тип("ФиксированныйМассив") Тогда
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЭтоСписокЗначений(Значение)
	
	Возврат ТипЗнч(Значение) = Тип("СписокЗначений");
	
КонецФункции

// Безопасно заполняет поля структуры значениями из другой структуры
// Пустые значения источника при этом игнорируются
//
// Параметры:
//  Приемник - Структура - структура, которую надо заполнить;
//  Источник - Структура, ФиксированнаяСтруктура - структура, из которой надо взять значения;
//
&НаКлиенте
Процедура ЗаполнитьПоляСтруктуры(Приемник, Источник)
	
	Если Не ЭтоСтруктура(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Элемент Из Источник Цикл
		
		Ключ	 = Элемент.Ключ;
		Значение = Элемент.Значение;
		
		Если ЗначениеЗаполнено(Значение) И Приемник.Свойство(Ключ) Тогда
			Приемник[Ключ] = Значение;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Записывает строку в двоичные данные
//
// Параметры:
//  Строка - Строка - строка, которую нужно записать в двоичные данные
// 
// Возвращаемое значение:
//  ДвоичныеДанные
//
&НаКлиенте
Функция ДвоичныеДанныеИзСтроки(Строка, Кодировка = "UTF-8") Экспорт
	
	Если ВерсияПлатформыНиже("8.3.10") Тогда
		
		#Если Не ВебКлиент Тогда
			
			ИмяФайла = ПолучитьИмяВременногоФайла();
			Текст = Новый ТекстовыйДокумент;
			Текст.УстановитьТекст(Строка);
			Текст.Записать(ИмяФайла, "UTF-8");
			
			// BSLLS:FileSystemAccess-off
			Результат = Новый ДвоичныеДанные(ИмяФайла);
			УдалитьФайлы(ИмяФайла);
			// BSLLS:FileSystemAccess-on
			
		#КонецЕсли
		
	Иначе
		Результат = Вычислить("ПолучитьДвоичныеДанныеИзСтроки(Строка, Кодировка)");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает строку из двоичных данных
//
// Параметры:
//  ДвоичныеДанные - ДвоичныеДанные - двоичные данные, в которых содержится строка;
//  Кодировка - КодировкаТекста, Строка - (необязательный) кодировка текста;
// 
// Возвращаемое значение:
//  Строка
//
&НаКлиенте
Функция СтрокаИзДвоичныхДанных(ДвоичныеДанные, Кодировка = "UTF-8")
	
	Если Не ЗначениеЗаполнено(ДвоичныеДанные) Тогда
		Возврат "";
	КонецЕсли;
	
	Если ВерсияПлатформыНиже("8.3.10") Тогда
		
		#Если Не ВебКлиент Тогда
			
			ИмяФайла = ПолучитьИмяВременногоФайла();
			ДвоичныеДанные.Записать(ИмяФайла);
			Текст = Новый ТекстовыйДокумент;
			Текст.Прочитать(ИмяФайла, Кодировка);
			Результат = Текст.ПолучитьТекст();
			
			// BSLLS:FileSystemAccess-off
			УдалитьФайлы(ИмяФайла);
			// BSLLS:FileSystemAccess-on
			
		#КонецЕсли
		
	Иначе
		Результат = Вычислить("ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанные, Кодировка)");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Дополняет структуру или соответсвие приемник из данных источника
//
// Параметры:
//  Приемник - Структура, Соответствие
//  Источник - Структура, Соответствие
//
&НаКлиенте
Процедура ДополнитьСтруктуру(Приемник, Источник) Экспорт
	
	Для Каждого КлючИЗначение Из Источник Цикл
		Приемник.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
КонецПроцедуры

// Ищет подходящие строки в массиве структур
//
// Параметры:
//  МассивСтруктур  - Массив	 - содержит структуры с одинаковым набором свойств;
//  ПараметрыОтбора - Структура	 - условия поиска, где:
//   * Ключ		 - имя свойства в структурах массива;
//   * Значение	 - подходящее значение;
//
// Возвращаемое значение:
//  Массив - содержит подходящие структуры
//
&НаКлиенте
Функция МассивСтруктур_НайтиСтроки(МассивСтруктур, ПараметрыОтбора) Экспорт
	
	Результат = Новый Массив;
	
	Если ЗначениеЗаполнено(МассивСтруктур) Тогда
		
		Для Каждого Структура Из МассивСтруктур Цикл
			
			СтруктураСоответствуетОтбору = Истина;
			
			Для Каждого ЭлементОтбора Из ПараметрыОтбора Цикл
				
				Если Структура[ЭлементОтбора.Ключ] <> ЭлементОтбора.Значение Тогда
					СтруктураСоответствуетОтбору = Ложь;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Если СтруктураСоответствуетОтбору Тогда
				Результат.Добавить(Структура);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Находит в массиве структур первую строку с нужным значением
//
// Параметры:
//  МассивСтруктур - Массив - содержит структуры с одинаковым набором полей;
//  Значение - Произвольный - значение, которое нужно найти;
//  ИмяПоля - Строка - имя поля в котором нужно искать;
// 
// Возвращаемое значение:
//  Структура - структура из массива;
//  Неопределено - если не удалось найти подходящую строку;
//
&НаКлиенте
Функция МассивСтруктур_Найти(МассивСтруктур, Значение, ИмяПоля) Экспорт
	
	Если Не ЗначениеЗаполнено(МассивСтруктур) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отбор = Новый Структура(ИмяПоля, Значение);
	
	НайденныеСтроки = МассивСтруктур_НайтиСтроки(МассивСтруктур, Отбор);
	
	Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
		Результат = НайденныеСтроки[0];
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Выгружает значения поля из массива структур в новый массив
//
// Параметры:
//  МассивСтруктур - Массив - массив содержит структуры;
//  ИмяПоля - Строка - поле, значения которого нужно выгрузить;
// 
// Возвращаемое значение:
//  Массив - массив значений из структур
//
&НаКлиенте
Функция МассивСтруктур_Выгрузить(МассивСтруктур, ИмяПоля)
	
	Результат = Новый Массив;
	
	Для каждого Элемент Из МассивСтруктур Цикл
		Результат.Добавить(Элемент[ИмяПоля]);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Разбивает массив структур на части по значению поля
// и помещяет эти части в соответствие
//
// Параметры:
//  МассивСтруктур - Массив - массив содержит структуры;
//  ИмяПоля        - Строка - имя поля, по которому нужно разбить массив;
// 
// Возвращаемое значение:
//  Соответствие - содержит:
//   Ключ     - Произвольное - значение поля;
//   Значение - Массив       - часть массива, с указанным значением;
//
&НаКлиенте
Функция МассивСтруктур_Разбить(МассивСтруктур, ИмяПоля)
	
	Результат = Новый Соответствие;
	
	Для каждого Элемент Из МассивСтруктур Цикл
		
		ЗначениеПоля = Элемент[ИмяПоля];
		ЧастьМассива = Результат[ЗначениеПоля];
		
		Если ЧастьМассива = Неопределено Тогда
			ЧастьМассива = Новый Массив;
			Результат.Вставить(ЗначениеПоля, ЧастьМассива);
		КонецЕсли;
		
		ЧастьМассива.Добавить(Элемент);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Очищает список и заполняет новыми значениями
// Из структуры добавляет только значения
//
// Параметры:
//  СписокВыбора - СписокЗначений - список, который нужно заполнить;
//  ЗначенияСписка - СписокЗначений, Массив, Структура - новые значения;
//
&НаКлиенте
Процедура ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка) Экспорт
	
	СписокВыбора.Очистить();
	
	Если ЭтоМассив(ЗначенияСписка) Тогда
		Для Каждого Значение Из ЗначенияСписка Цикл
			СписокВыбора.Добавить(Значение);
		КонецЦикла;
	ИначеЕсли ЭтоСтруктура(ЗначенияСписка) Тогда
		Для Каждого Элемент Из ЗначенияСписка Цикл
			СписокВыбора.Добавить(Элемент.Значение, Элемент.Значение);
		КонецЦикла;
	ИначеЕсли ЭтоСписокЗначений(ЗначенияСписка) Тогда
		Для Каждого Элемент Из ЗначенияСписка Цикл
			СписокВыбора.Добавить(Элемент.Значение, Элемент.Представление);
		КонецЦикла;
	Иначе
		СписокВыбора.Добавить(ЗначенияСписка);
	КонецЕсли;
	
КонецПроцедуры

// Объединяет части пути через разделитель
//
&НаКлиенте
Функция ОбъединитьПути(Часть1, Часть2, Часть3 = Неопределено, Часть4 = Неопределено) Экспорт
	
	Результат = "";
	РазделительПути = РазделительПути();
	ЧастиПути = НовыйМассив(Часть1, Часть2, Часть3, Часть4);
	
	Для Каждого Элемент Из ЧастиПути Цикл
		
		Если Не ЗначениеЗаполнено(Элемент) Тогда
			Прервать;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Результат) Тогда
			Результат = Элемент;
			Продолжить;
		КонецЕсли;
		
		Если Прав(Результат, 1) <> РазделительПути Тогда
			Результат = Результат + РазделительПути;
		КонецЕсли;
		
		Результат = Результат + Элемент;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает разделитель пути, используемого в операционной системе
// 
// Возвращаемое значение:
//  Строка
//
&НаКлиенте
Функция РазделительПути()
	
	СисИнфо = ИнформацияОСистеме();
	
	Если Найти(СисИнфо.ТипПлатформы, "Linux") > 0 Тогда
		Результат = "/";
	Иначе
		Результат = "\";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает имя текущего компьютера,
// для вэб-клиента возвращает пустую строку
// 
// Возвращаемое значение:
//  Строка - имя компьютера
//
&НаКлиенте
Функция ИмяТекущегоКомпьютера()
	
	Результат = "";
	
	#Если Не ВебКлиент Тогда
		Результат = ИмяКомпьютера();
	#КонецЕсли
	
	Возврат Результат;
	
КонецФункции

// Возвращает ссылку на общий модуль по его имени
//
// Параметры:
//  ИмяОбщегоМодуля - Строка - имя общего модуля
//
// Возвращаемое значение:
//  ОбщийМодуль - общий модуль
//
&НаКлиенте
Функция ОбщийМодуль(ИмяОбщегоМодуля) Экспорт
	
	КлючКэш = "ОбщийМодуль " + ИмяОбщегоМодуля;
	Результат = Кэш_Прочитать(КлючКэш);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	МодульСуществует = ЕстьНеобходимыеМетаданные("ОбщиеМодули." + ИмяОбщегоМодуля);
	
	Если Не МодульСуществует Тогда
		ВызватьИсключение ПараметрыВСтроку(
		НСтр("ru = 'Общий модуль ""%1"" не найден.'"), ИмяОбщегоМодуля);
	КонецЕсли;
	
	Результат = Вычислить(ИмяОбщегоМодуля);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЕстьНеобходимыеМетаданные(СтрокаМетаданных)
	
	Результат = МодульОбъекта().ЕстьНеобходимыеМетаданные(СтрокаМетаданных);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЕстьЗначениеВСтруктуре(Структура, Значение)
	
	Для Каждого КлючИЗначение Из Структура Цикл
		Если КлючИЗначение.Значение = Значение Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Функция ТекущийTimestamp()
	
	НачалоВремениUNIX = 62135596800000;
	
	МоментВремени = (ТекущаяУниверсальнаяДатаВМиллисекундах() - НачалоВремениUNIX) / МиллисекундВСекунде();
	
	Возврат МоментВремени;
	
КонецФункции

&НаКлиенте
Функция МиллисекундВСекунде()
	
	Возврат 1000;
	
КонецФункции

&НаКлиенте
Функция УниверсальнаяДатаXML(Значение)
	
	УниверсальнаяДата = УниверсальноеВремя(Значение);
	Результат = Формат(УниверсальнаяДата, "ДФ=yyyy-MM-ddTHH:mm:ssZ");
	
	Возврат Результат;
	
КонецФункции

// Разделяет текст на части по указанному разделителю
//
// Параметры:
//  Строка - Строка - разделяемый текст;
//  Разделитель - Строка - (необязательный) значение разделителя;
//  ВключатьПустые - Булево - Истина, если пустые части нужно включить в результат;
// 
// Возвращаемое значение:
//  Массив - содержит части текста
//
&НаКлиенте
Функция РазделитьСтроку(Знач Строка, Разделитель = ",", ВключатьПустые = Ложь) Экспорт
	
	ДлинаРазделителя = СтрДлина(Разделитель);
	
	Если ДлинаРазделителя = 1
		И Не ВерсияПлатформыНиже("8.3.6")
		И Не ВерсияРежимаСовместимостиНиже("8.3.6") Тогда
		
		Результат = Вычислить("СтрРазделить(Строка, Разделитель, ВключатьПустые)");
		
		Для Сч = 0 По Результат.ВГРаница() Цикл
			Результат[Сч] = СокрЛП(Результат[Сч]);
		КонецЦикла;
		
		Возврат Результат;
		
	КонецЕсли;
	
	Результат = Новый Массив;
	
	Пока Истина Цикл
		
		Поз = Найти(Строка, Разделитель);
		
		Если Поз = 0 Тогда
			ЧастьСтроки = СокрЛП(Строка);
			Строка = "";
		Иначе
			ЧастьСтроки = СокрЛП(Лев(Строка, Поз - 1));
			Строка = Сред(Строка, Поз + ДлинаРазделителя);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЧастьСтроки) Или ВключатьПустые Тогда
			Результат.Добавить(ЧастьСтроки);
		КонецЕсли;
		
		Если Поз = 0 Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Безопасно получает значение из массива по его индексу
//
// Параметры:
//  Массив              - Массив       - массив, из которого нужно получить значение
//  ИндексЗначения      - Число        - индекс значения
//  ЗначениеПоУмолчанию - Произвольный - значение, которое нужно вернуть
//                                       если указанный индекс выходит за границу массива
// 
// Возвращаемое значение:
//  Произвольный - значение из массива. ЗначениеПоУмолчанию если индекс выходит за границы массива
//
&НаКлиенте
Функция ЗначениеИзМассива(Массив, ИндексЗначения, ЗначениеПоУмолчанию = Неопределено)
	
	Результат = ЗначениеПоУмолчанию;
	
	Если ИндексЗначения <= Массив.ВГраница() Тогда
		Результат = Массив[ИндексЗначения];
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПустаяВерсия()
	
	Возврат "0.0.0";
	
КонецФункции

// Проверяет что файл существует
// 
// Возвращаемое значение:
//  Булево - Истина, если файл существует
//
&НаКлиенте
Функция ФайлСуществует(ПутьКФайлу)
	
	Файл = НовыйФайл(ПутьКФайлу);
	
	Результат = Файл.Существует();
	
	Возврат Результат;
	
КонецФункции

// Получает описания переданных файлов
//
// Параметры:
//  Файлы - Массив из Строка - полные имена файлов;
// 
// Возвращаемое значение:
//  Массив из Структура - см. функцию Новый_ОписаниеФайла();
//
&НаКлиенте
Функция ОписанияФайлов(Файлы) Экспорт
	
	Результат = Новый Массив;
	
	Для Каждого ПолноеИмя Из Файлы Цикл
		
		Файл = НовыйФайл(ПолноеИмя);
		ОписаниеФайла = Новый_ОписаниеФайла();
		ЗаполнитьЗначенияСвойств(ОписаниеФайла, Файл);
		// BSLLS:FileSystemAccess-off
		ОписаниеФайла.ДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмя);
		// BSLLS:FileSystemAccess-on
		
		Результат.Добавить(ОписаниеФайла);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру с описанием файла.
// Пример значений полей для файла "c:\temp\test.txt" в описании полей.
// 
// Возвращаемое значение:
//  Структура - описание файла:
//   * Имя - Строка - имя файла (test.txt);
//   * ИмяБезРасширения - Строка - имя файла без расширения (test);
//   * ПолноеИмя - Строка - полное имя файла (c:\temp\test.txt);
//   * Путь - Строка - путь к файлу (c:\temp\);
//   * Расширение - Строка - расширение (.txt);
//   * ДвоичныеДанные - ДвоичныеДанные - двоичные данные файла;
//
&НаКлиенте
Функция Новый_ОписаниеФайла()
	
	Результат = Новый Структура;
	Результат.Вставить("Имя");
	Результат.Вставить("ИмяБезРасширения");
	Результат.Вставить("ПолноеИмя");
	Результат.Вставить("Путь");
	Результат.Вставить("Расширение");
	Результат.Вставить("ДвоичныеДанные");
	
	Возврат Результат;
	
КонецФункции

// Опеределяет доступность PATCH-запроса на текущей версии платформы
//
// Параметры:
//  Действие - Строка - текст ошибки, который будет показан если запрос не доступен;
// 
// Возвращаемое значение:
//  Булево - Истина, если PATCH-запрос доступен;
//
&НаКлиенте
Функция ДоступенPATCHЗапрос(Действие) Экспорт
	
	Результат = Истина;
	
	ДопустимаяВерсияПлатформы = "8.3.6";
	ТекущаяВерсияПлатформы = ВерсияПлатформы();
	
	ШаблонОшибки = НСтр("ru = '%1 можно только в платформе версии %2 и выше.
	|Текущая версия платформы %3, обновите версию платформы.'");
	
	Если ВерсияПлатформыНиже(ДопустимаяВерсияПлатформы) Тогда
		ТекстОшибки = ПараметрыВСтроку(ШаблонОшибки, Действие, ДопустимаяВерсияПлатформы, ТекущаяВерсияПлатформы);
		СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор);
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЧислоИзСтроки(Строка)
	
	Если Не ЗначениеЗаполнено(Строка) Тогда
		Возврат 0;
	КонецЕсли;
	
	КодСимвола0 = КодСимвола("0");
	КодСимвола9 = КодСимвола("9");
	ДлинаСтроки = СтрДлина(Строка);
	ЧислоСтрокой = "";
	
	Для Сч = 1 По ДлинаСтроки Цикл
		Символ = Сред(Строка, Сч, 1);
		Если Символ = "," Или Символ = "." Тогда
			ЧислоСтрокой = ЧислоСтрокой + Символ;
			Продолжить;
		КонецЕсли;
		КодСимвола = КодСимвола(Символ);
		Если КодСимвола >= КодСимвола0
			И КодСимвола <= КодСимвола9 Тогда
			ЧислоСтрокой = ЧислоСтрокой + Символ;
		КонецЕсли;
	КонецЦикла;
	
	ОписаниеЧисла = Новый ОписаниеТипов("Число");
	Результат = ОписаниеЧисла.ПривестиЗначение(ЧислоСтрокой);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЧислоСЕдиницейИзмерения(Число, ПараметрыИсчисленияЕдиницы) Экспорт
	
	РодИсчисления = "";
	ЧастиПараметров = РазделитьСтроку(ПараметрыИсчисленияЕдиницы, , Истина);
	ИндексРодаИсчисления = 3;
	Если ЧастиПараметров.ВГраница() >= ИндексРодаИсчисления Тогда
		РодИсчисления = ЧастиПараметров[ИндексРодаИсчисления];
	КонецЕсли;
	
	ПараметрыИсчисленияЧисла = ",,,%1,,,,,0";
	ПараметрыИсчисленияЧисла = ПараметрыВСтроку(ПараметрыИсчисленияЧисла, РодИсчисления);
	
	СтрокаЧислоСЕдиницей = ЧислоПрописью(Число, , ПараметрыИсчисленияЕдиницы);
	СтрокаТолькоЧисло = ЧислоПрописью(Число, , ПараметрыИсчисленияЧисла);
	СтрокаТолькоЕдиница = СокрЛП(СтрЗаменить(СтрокаЧислоСЕдиницей, СтрокаТолькоЧисло, ""));
	
	Результат = ПараметрыВСтроку("%1 %2", Число, СтрокаТолькоЕдиница);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СтрокаСодержитТолькоДопустимыеСимволы(Строка, ДопустимыеСимволы) Экспорт
	
	Для Позиция = 1 По СтрДлина(Строка) Цикл
		ТекущийСимвол = НРег(Сред(Строка, Позиция, 1));
		Если Найти(ДопустимыеСимволы, ТекущийСимвол) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция ОбъектСодержитНедопустимыеСимволыXML(Значение)
	
	Результат = Ложь;
	
	Если ЭтоСтруктура(Значение) Или ЭтоСоответствие(Значение) Тогда
		
		Для Каждого КлючЗначение Из Значение Цикл
			Если ОбъектСодержитНедопустимыеСимволыXML(КлючЗначение.Значение) Тогда
				Результат = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ЭтоМассив(Значение) Тогда
		
		Для Каждого Элемент Из Значение Цикл
			Если ОбъектСодержитНедопустимыеСимволыXML(Элемент) Тогда
				Результат = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Значение) = Тип("Строка") Тогда
		
		Результат = НайтиНедопустимыеСимволыXML(Значение) > 0;
		
	Иначе
		
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ВсеЦифры() Экспорт
	
	Возврат "0123456789";
	
КонецФункции

&НаКлиенте
Функция ВсеБуквыКириллицы() Экспорт
	
	Возврат "абвгдеёжзийклмнопрстуфхцчшщъыьэюя";
	
КонецФункции

&НаКлиенте
Функция ВсеБуквыЛатиницы() Экспорт
	
	Возврат "abcdefghijklmnopqrstuvwxyz";
	
КонецФункции

&НаКлиенте
Функция ИнформацияОСистеме() Экспорт
	
	// BSLLS:UseSystemInformation-off
	Возврат Новый СистемнаяИнформация;
	// BSLLS:UseSystemInformation-on
	
КонецФункции

&НаКлиенте
Функция НовыйФайл(ПутьКФайлу) Экспорт
	
	// BSLLS:FileSystemAccess-off
	Возврат Новый Файл(ПутьКФайлу);
	// BSLLS:FileSystemAccess-on
	
КонецФункции

&НаКлиенте
Функция НовыйЗаписьТекста(ПутьКФайлу) Экспорт
	
	// BSLLS:FileSystemAccess-off
	Возврат Новый ЗаписьТекста(ПутьКФайлу);
	// BSLLS:FileSystemAccess-on
	
КонецФункции

&НаКлиенте
Функция УдаляемыеСтатусыОпераций() Экспорт
	
	КлючКэш = "УдаляемыеСтатусыОпераций";
	Результат = Кэш_Прочитать(КлючКэш);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = УдаляемыеСтатусыОперацийНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция УдаляемыеСтатусыОперацийНаСервере()
	
	Возврат МодульОбъекта().УдаляемыеСтатусыОпераций();
	
КонецФункции


// Подключаемый модуль

&НаКлиенте
Функция Модуль_ПМ()
	
	ПутьКФорме = ПМ_ПутьКФормеМодуляКлиента();
	
	Если ПутьКФорме = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = ОткрытьФорму(ПутьКФорме);
	
	Возврат Результат;
	
КонецФункции

// Возвращает полный путь к форме МодульКлиента обработки КонтурМаркировкаПМ
// 
// Возвращаемое значение:
//  Строка - полный путь к форме
//
&НаСервере
Функция ПМ_ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПМ_ПутьКФормеМодуляКлиента();
	
КонецФункции

&НаКлиенте
Процедура ПМ_ОбработатьСобытие(ИмяСобытия, ПараметрыСобытия, СтандартнаяОбработка = Ложь)
	
	Настройки = НастройкиМодуля();
	ПараметрыСобытия.Вставить("ДопПараметрыПМ", Настройки.ПМ_ДопПараметры);
	
	ВариантыРасположения = Перечисление_ВариантыРасположенияОбработки();
	ЭтоТолстыйКлиент = ЭтоТолстыйКлиентОбычноеПриложение();
	
	Если ЭтоТолстыйКлиент Тогда
		МодульКлиента_Обычная().КонтурПлагины_ОбработатьСобытие_ОФ(ИмяСобытия, ПараметрыСобытия, СтандартнаяОбработка);
	Иначе
		КонтурПлагины_ОбработатьСобытие_УФ(ИмяСобытия, ПараметрыСобытия, СтандартнаяОбработка);
	КонецЕсли;
	
	Если ЭтоТолстыйКлиент И Настройки.ПМ_Расположение <> ВариантыРасположения.ВКонфигурации Тогда
		МодульКлиента_Обычная().ПМ_ОбработатьСобытие_ОФ(ИмяСобытия, ПараметрыСобытия, СтандартнаяОбработка);
	Иначе
		ПМ_ОбработатьСобытие_УФ(ИмяСобытия, ПараметрыСобытия, СтандартнаяОбработка);
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПМ_ОбработатьСобытие_УФ(ИмяСобытия, ПараметрыСобытия, СтандартнаяОбработка = Ложь)
	
	МодульПМ = Модуль_ПМ();
	Если МодульПМ = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	МодульПМ.ОсновнойМодуль = ЭтаФорма;
	МодульПМ.ОбработатьСобытие(ИмяСобытия, ПараметрыСобытия, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ПМ_ОбработатьСобытиеНаСервере(ИмяСобытия, ПараметрыСобытия, СтандартнаяОбработка = Ложь)
	
	МодульОбъекта().ПМ_ОбработатьСобытие(ИмяСобытия, ПараметрыСобытия, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Функция ЭтоВебКлиент()
	
	#Если ВебКлиент Тогда
		Результат = Истина;
	#Иначе
		Результат = Ложь;
	#КонецЕсли
	
	Возврат Результат;
	
КонецФункции

// Удаляет из строки кавычки
//
// Параметры:
//  Строка - Строка - строка, которую надо обернуть в кавычки
// 
// Возвращаемое значение:
//  Строка
//
&НаКлиенте
Функция СократитьКавычки(Строка)
	
	Возврат СтрЗаменить(Строка, """", "");
	
КонецФункции

// Оборачивает строку в кавычки
//
// Параметры:
//  Строка - Строка - строка, которую надо обернуть в кавычки
// 
// Возвращаемое значение:
//  Строка
//
&НаКлиенте
Функция СтрокаВКавычках(Строка)
	
	Кавычка = Символ(34);
	
	Возврат Кавычка + Строка + Кавычка;
	
КонецФункции

// Получает строку в Base64 из двоичных данных,
// удаляя при этом символы переноса строк
// 
// Параметры:
//  ДвоичныеДанные - ДвоичныеДанные - Двоичные данные
// 
// Возвращаемое значение:
//  Строка - Строка в Base64
//
&НаКлиенте
Функция Base64ИзДвоичныхДанных(ДвоичныеДанные)
	
	Результат = Base64Строка(ДвоичныеДанные);
	Результат = СтрЗаменить(Результат, Символы.ПС, "");
	Результат = СтрЗаменить(Результат, Символы.ВК, "");
	
	Возврат Результат;
	
КонецФункции

// Записывает текст в строку base64
//
// Параметры:
//  Строка - Строка - текст, который нужно записать;
//  Кодировка - КодировкаТекста, Строка - (необязательный) кодировка текста;
// 
// Возвращаемое значение:
//  Строка - строка закодированная по алгоритму base64
//
&НаКлиенте
Функция Base64ИзСтроки(Строка, Кодировка = "UTF-8") Экспорт
	
	ДвоичныеДанные = ДвоичныеДанныеИзСтроки(Строка, Кодировка);
	Результат = Base64ИзДвоичныхДанных(ДвоичныеДанные);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЭтоТолстыйКлиентОбычноеПриложение()
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Результат = Истина;
	#Иначе
		Результат = Ложь;
	#КонецЕсли
	
	Возврат Результат;
	
КонецФункции

// КонтурПлагины

&НаКлиенте
Процедура ОткрытьФормуСпискаПлагинов(Владелец) Экспорт
	
	Обработчик = ОписаниеОбработчикаОповещения("ПослеЗакрытияФормыСпискаПлагинов", ЭтаФорма);
	
	ОткрытьФормуОбработки("Форма_СписокПлагинов", Владелец, , Обработчик);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыСпискаПлагинов(РезультатЗакрытия, ДопПараметры = Неопределено) Экспорт
	
	Кэш_Поместить(КлючКэш_СписокПлагинов(), Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуБиблиотекиПлагинов(Владелец) Экспорт
	
	ОткрытьФормуОбработкиМодально("Форма_БиблиотекаПлагинов", Владелец);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиПлагина(ИдентификаторПлагина, Владелец) Экспорт
	
	Если ЭтоТолстыйКлиентОбычноеПриложение() Тогда
		МодульКлиента_Обычная().ОткрытьНастройкиПлагина(ИдентификаторПлагина, Владелец);
		Возврат;
	КонецЕсли;
	
	Плагин = КонтурПлагин_СоздатьОбъект(ИдентификаторПлагина, Владелец);
	
	Плагин.ОткрытьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтурПлагины_ОбработатьСобытие_УФ(ИмяСобытия, ПараметрыСобытия, СтандартнаяОбработка = Ложь)
	
	Если Не ИспользоватьПлагины() Тогда
		Возврат;
	КонецЕсли;
	
	СостоянияПлагина = Перечисление_СостоянияПлагина();
	
	МассивПлагинов = КонтурПлагины_СписокПлагинов();
	Если Не ЗначениеЗаполнено(МассивПлагинов) Тогда
		Возврат;
	КонецЕсли;
	
	Если СтандартнаяОбработка Тогда
		ПараметрыСобытия.Вставить("СтандартнаяОбработка", СтандартнаяОбработка);
	КонецЕсли;
	
	Для Каждого ОписаниеПлагина Из МассивПлагинов Цикл
		Если ОписаниеПлагина.Состояние = СостоянияПлагина.Включен
			И ОписаниеПлагина.События.Найти(ИмяСобытия) <> Неопределено Тогда
			КонтурПлагин_ОбработатьСобытие(ОписаниеПлагина, ИмяСобытия, ПараметрыСобытия);
		КонецЕсли;
	КонецЦикла;
	
	Если СтандартнаяОбработка Тогда
		СтандартнаяОбработка = ПараметрыСобытия.СтандартнаяОбработка;
		ПараметрыСобытия.Удалить("СтандартнаяОбработка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция КонтурПлагины_СписокПлагинов()
	
	КлючКэш = КлючКэш_СписокПлагинов();
	Результат = Кэш_Прочитать(КлючКэш);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	СлужебныеКоманды = Перечисление_СлужебныеКомандыБиблиотекиПлагинов();
	
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия.Вставить("Результат");
	
	КонтурПлагины_ОбработатьСлужебнуюКоманду(
		СлужебныеКоманды.ПолучитьСписокПлагинов,
		ПараметрыСобытия
	);
	
	Результат = ПараметрыСобытия.Результат;
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура КонтурПлагин_ОбработатьСобытие(ОписаниеПлагина, ИмяСобытия, ПараметрыСобытия)
	
	СлужебныеКоманды = Перечисление_СлужебныеКомандыБиблиотекиПлагинов();
	ИдентификаторПлагина = ОписаниеПлагина.Идентификатор;
	
	ПараметрыКоманды = Новый Структура;
	ПараметрыКоманды.Вставить("Результат");
	ПараметрыКоманды.Вставить("Идентификатор", ИдентификаторПлагина);
	
	КонтурПлагины_ОбработатьСлужебнуюКоманду(
		СлужебныеКоманды.ПолучитьНастройкиПлагина,
		ПараметрыКоманды
	);
	
	Если ПараметрыКоманды.Результат.Успешно Тогда
		НастройкиПлагина = ПараметрыКоманды.Результат.Данные;
	Иначе
		НастройкиПлагина = Неопределено;
	КонецЕсли;
	
	МодульПлагина = КонтурПлагин_СоздатьОбъект(ИдентификаторПлагина);
	Если МодульПлагина = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		
		МодульПлагина.ОбработатьСобытие(ИмяСобытия, ПараметрыСобытия, НастройкиПлагина);
		
	Исключение
		
		Ошибка = ИнформацияОбОшибке();
		Действие = НСтр("ru = 'Обработка события в плагине'");
		ТекстСообщения = НСтр("ru = 'Не удалось обработать событие ""%1"" в плагине ""%2""'");
		ТекстСообщения = ПараметрыВСтроку(ТекстСообщения, ИдентификаторПлагина);
		
		ДопИнформация = Новый СписокЗначений;
		ДопИнформация.Добавить(ИдентификаторПлагина, "Имя обработки");
		ДопИнформация.Добавить(ИмяСобытия, "Имя события");
		
		ОбработатьОшибку(Действие, Ошибка, ДопИнформация, ТекстСообщения);
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Функция КонтурПлагин_СоздатьОбъект(ИдентификаторПлагина, Владелец = Неопределено)
	
	Если Владелец = Неопределено Тогда
		Владелец = ЭтаФорма;
	КонецЕсли;
	
	ПутьКФорме = "ВнешняяОбработка." + ИдентификаторПлагина + ".Форма.КлиентскиеВызовы";
	
	Попытка
		
		Результат = ПолучитьФорму(ПутьКФорме, , Владелец);
		
	Исключение
		
		Ошибка = ИнформацияОбОшибке();
		Действие = НСтр("ru = 'Создание плагина'");
		ТекстСообщения = НСтр("ru = 'Не удалось создать плагин: %1'");
		ТекстСообщения = ПараметрыВСтроку(ТекстСообщения, ИдентификаторПлагина);
		
		ДопИнформация = Новый СписокЗначений;
		ДопИнформация.Добавить(ИдентификаторПлагина, "Имя обработки");
		ДопИнформация.Добавить(ПутьКФорме, "Путь к форме");
		
		ОбработатьОшибку(Действие, Ошибка, ДопИнформация, ТекстСообщения);
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Перечисление_СлужебныеКомандыБиблиотекиПлагинов() Экспорт
	
	КлючКэш = "СлужебныеКомандыБиблиотекиПлагинов";
	Результат = Кэш_Прочитать(КлючКэш);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_СлужебныеКомандыБиблиотекиПлагиновНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_СлужебныеКомандыБиблиотекиПлагиновНаСервере()
	
	Возврат МодульОбъекта().Перечисление_СлужебныеКомандыБиблиотекиПлагинов();
	
КонецФункции

&НаКлиенте
Функция Перечисление_СостоянияПлагина() Экспорт
	
	КлючКэш = "СостоянияПлагина";
	Результат = Кэш_Прочитать(КлючКэш);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_СостоянияПлагинаНаСвервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_СостоянияПлагинаНаСвервере()
	
	Возврат МодульОбъекта().Перечисление_СостоянияПлагина();
	
КонецФункции

&НаКлиенте
Функция ИспользоватьПлагины()
	
	Возврат НастройкиМодуля().ИспользоватьПлагины = Истина;
	
КонецФункции

&НаКлиенте
Функция КлючКэш_СписокПлагинов()
	
	Возврат "СписокПлагинов";
	
КонецФункции

// Пользователи

&НаКлиенте
Функция Пользователи_ТекущийПользователь() Экспорт
	
	КлючКэш = "ТекущийПользователь";
	Результат = Кэш_Прочитать(КлючКэш);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Пользователи_ТекущийПользовательНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Пользователи_ТекущийПользовательНаСервере()
	
	Возврат МодульОбъекта().Пользователи_ТекущийПользователь();
	
КонецФункции

// Опросы пользователей

&НаКлиенте
Функция ОпросПользователяПоСценарию(КлючСценария) Экспорт
	
	ВсеОпросы = ОпросыПользователей();
	
	Результат = МассивСтруктур_Найти(ВсеОпросы, КлючСценария, "КлючСценария");
	
	Если Не ЗначениеЗаполнено(Результат)
		ИЛИ ОпросПользователяПройден(Результат) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОпросПользователяПройден(ОписаниеОпроса)
	
	КлючКэшПройденныхОпросов = КлючКэш_ИдентификаторыПройденныхОпросов();
	ИдентификаторыПройденныхОпросов = Кэш_Прочитать(КлючКэшПройденныхОпросов);
	Если ЗначениеЗаполнено(ИдентификаторыПройденныхОпросов)
		И ИдентификаторыПройденныхОпросов.Найти(ОписаниеОпроса.ИдентификаторОпроса) <> Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	// На случай если опрос пройден в другом сеансе или кэш еще пустой
	ИдентификаторыПройденныхОпросов = ИдентификаторыПройденныхОпросовПользователяНаСервере();
	Кэш_Поместить(КлючКэшПройденныхОпросов, ИдентификаторыПройденныхОпросов);
	
	Если ЗначениеЗаполнено(ИдентификаторыПройденныхОпросов)
		И ИдентификаторыПройденныхОпросов.Найти(ОписаниеОпроса.ИдентификаторОпроса) <> Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Функция ОпросПодходитПоВидуПродукции(ОписаниеОпроса, ВидПродукции) Экспорт
	
	Если Не ЗначениеЗаполнено(ВидПродукции) Тогда
		Возврат Истина;
	КонецЕсли;
	
	ВидыПродукцииОпроса = ОписаниеОпроса.ВидыПродукции;
	
	Если Не ЗначениеЗаполнено(ВидыПродукцииОпроса) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат ВидыПродукцииОпроса.Найти(ВидПродукции) <> Неопределено;
	
КонецФункции

&НаКлиенте
Функция ОпросыПользователей()
	
	КлючКэш = "ОпросыПользователей";
	Результат = Кэш_Прочитать(КлючКэш);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ОпросыПользователейНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ОпросыПользователейНаСервере()
	
	Возврат МодульОбъекта().ОпросыПользователей();
	
КонецФункции

&НаСервере
Функция ИдентификаторыПройденныхОпросовПользователяНаСервере()
	
	Возврат МодульОбъекта().ИдентификаторыПройденныхОпросовПользователя();
	
КонецФункции

&НаКлиенте
Функция КлючКэш_ИдентификаторыПройденныхОпросов()
	
	Возврат "ИдентификаторыПройденныхОпросов";
	
КонецФункции
