// Copyright (C) 2012-2024 Engineer Mareev Enterprises
// Функции для обработки статусов документов и заказов

// #AMP Попов 06.12.204 Возвращает Истина, если документ закрыт
Функция ДокументЗакрыт(ERPData) Экспорт
	СтатусДокумента = ПолучитьСтатусДокумента(ERPData.header.doc_status_no);
	Возврат СтатусДокумента = Перечисления.EmeWmsСтатусыДокументов.Closed; 
КонецФункции

// #AMP Попов 06.12.204 Возвращает Истина, если заказ закрыт или подтвержден
Функция ЗаказЗакрыт(ERPData) Экспорт
	СтатусЗаказа = ПолучитьСтатусЗаказа(ERPData.header.order_status_no);
	Возврат СтатусЗаказа = Перечисления.EmeWmsСтатусыЗаказов.Finished Или СтатусЗаказа = Перечисления.EmeWmsСтатусыЗаказов.Confirmed;
КонецФункции

// #AMP Попов 06.12.204 Возвращает Истина, если заказ подобран
Функция ЗаказПодобран(ERPData) Экспорт
	СтатусЗаказа = ПолучитьСтатусЗаказа(ERPData.header.order_status_no);
	Возврат СтатусЗаказа = Перечисления.EmeWmsСтатусыЗаказов.Assembled;
КонецФункции

// #AMP Попов 06.12.2024 Возвращает перечисление EmeWmsСтатусыДокументов
Функция ПолучитьСтатусДокумента(СтатусДокументаКакЧисло) Экспорт
	// Статус Closed проверяем первым (чтобы не выполнять лишнюю работу), так как он и будет прибегать
	Если СтатусДокументаКакЧисло = 5 Тогда
		// Обработка завершена (5) 
		Возврат Перечисления.EmeWmsСтатусыДокументов.Closed;
	ИначеЕсли СтатусДокументаКакЧисло = 0 Тогда
		// Новый (0)
		Возврат Перечисления.EmeWmsСтатусыДокументов.New;
	ИначеЕсли СтатусДокументаКакЧисло = 1 Тогда
		// Присвоен номер (1)
		Возврат Перечисления.EmeWmsСтатусыДокументов.Created;
	ИначеЕсли СтатусДокументаКакЧисло = 2 Тогда               
		// Заполняется (2)
		Возврат Перечисления.EmeWmsСтатусыДокументов.Filled;
	ИначеЕсли СтатусДокументаКакЧисло = 3 Тогда
		// Обрабатывается (3)
		Возврат Перечисления.EmeWmsСтатусыДокументов.Loading;
	ИначеЕсли СтатусДокументаКакЧисло = 4 Тогда
		// Все строки обработаны (4)
		Возврат Перечисления.EmeWmsСтатусыДокументов.Loaded;
	ИначеЕсли СтатусДокументаКакЧисло = 6 Тогда
		// Экспортируется (6)
		Возврат Перечисления.EmeWmsСтатусыДокументов.Exporting;
	ИначеЕсли СтатусДокументаКакЧисло = 7 Тогда                  
		// Экспорт отложен (7) 
		Возврат Перечисления.EmeWmsСтатусыДокументов.ExportPutOff;
	ИначеЕсли СтатусДокументаКакЧисло = 8 Тогда
		// Размещается (8) 
		Возврат Перечисления.EmeWmsСтатусыДокументов.PutAwayed;
	КонецЕсли;
	// Неопределен
	Возврат Перечисления.EmeWmsСтатусыДокументов.Undefined;
КонецФункции

// #AMP Попов 06.12.2024 Возвращает перечисление EmeWmsСтатусыЗаказов
Функция ПолучитьСтатусЗаказа(СтатусЗаказаКакЧисло) Экспорт
	// Статус Finished, Confirmed и Assmebled проверяем первыми (чтобы не выполнять лишнюю работу), так как они и будут прибегать
	Если СтатусЗаказаКакЧисло = 1400 Тогда
		// Закрыт (1400)
		Возврат Перечисления.EmeWmsСтатусыЗаказов.Finished;
	ИначеЕсли СтатусЗаказаКакЧисло = 1200 Тогда
		// Подтвержден (1200)
		Возврат Перечисления.EmeWmsСтатусыЗаказов.Confirmed;
	ИначеЕсли СтатусЗаказаКакЧисло = 500 Тогда
		// Подобран (500) 
		Возврат Перечисления.EmeWmsСтатусыЗаказов.Assembled;
	ИначеЕсли СтатусЗаказаКакЧисло = 0 Тогда
		// Новый (0)
		Возврат Перечисления.EmeWmsСтатусыЗаказов.New;
	ИначеЕсли СтатусЗаказаКакЧисло = 25 Тогда
		// Редактируется (25)
		Возврат Перечисления.EmeWmsСтатусыЗаказов.Edited;
	ИначеЕсли СтатусЗаказаКакЧисло = 37 Тогда
		// Консолидирован (37)
		Возврат Перечисления.EmeWmsСтатусыЗаказов.Consolidated;
	ИначеЕсли СтатусЗаказаКакЧисло = 50 Тогда
		// Введен (50)
		Возврат Перечисления.EmeWmsСтатусыЗаказов.Introduced;
	ИначеЕсли СтатусЗаказаКакЧисло = 100 Тогда
		// В пачке (100)
		Возврат Перечисления.EmeWmsСтатусыЗаказов.Created;
	ИначеЕсли СтатусЗаказаКакЧисло = 200 Тогда
		// Просчитан (200) 
		Возврат Перечисления.EmeWmsСтатусыЗаказов.Calculated;
	ИначеЕсли СтатусЗаказаКакЧисло = 300 Тогда
		// Перемещается в пикинг/OA (300) 
		Возврат Перечисления.EmeWmsСтатусыЗаказов.MovingToPicking;
	ИначеЕсли СтатусЗаказаКакЧисло = 400 Тогда
		// В подборке (400)
		Возврат Перечисления.EmeWmsСтатусыЗаказов.InAssembling;
	ИначеЕсли СтатусЗаказаКакЧисло = 450 Тогда
		// Частично подобран (450)
		Возврат Перечисления.EmeWmsСтатусыЗаказов.PartlyAssembled;
	ИначеЕсли СтатусЗаказаКакЧисло = 525 Тогда
		// Упакован (525)
		Возврат Перечисления.EmeWmsСтатусыЗаказов.Packed;
	ИначеЕсли СтатусЗаказаКакЧисло = 550 Тогда
		// Частично отгружен (550)
		Возврат Перечисления.EmeWmsСтатусыЗаказов.PartlyShipped;
	ИначеЕсли СтатусЗаказаКакЧисло = 600 Тогда
		// Ушел со склада (600)
		Возврат Перечисления.EmeWmsСтатусыЗаказов.HasLeftWarehouse;
	ИначеЕсли СтатусЗаказаКакЧисло = 700 Тогда
		// Отклонен (700)
		Возврат Перечисления.EmeWmsСтатусыЗаказов.Declined;
	ИначеЕсли СтатусЗаказаКакЧисло = 800 Тогда
		// Экспортируется (800)
		Возврат Перечисления.EmeWmsСтатусыЗаказов.Exporting;
	ИначеЕсли СтатусЗаказаКакЧисло = 900 Тогда
		// Экспорт отложен (900)
		Возврат Перечисления.EmeWmsСтатусыЗаказов.ExportPutOff;
	ИначеЕсли СтатусЗаказаКакЧисло = 1000 Тогда
		// Резерв (1000)
		Возврат Перечисления.EmeWmsСтатусыЗаказов.Preserved;
	ИначеЕсли СтатусЗаказаКакЧисло = 1100 Тогда
		// Резерв закрыт (1100)
		Возврат Перечисления.EmeWmsСтатусыЗаказов.PreserveClosed;
	КонецЕсли;
	// Неопределен
	Возврат Перечисления.EmeWmsСтатусыЗаказов.Undefined;
КонецФункции

//	#IBS Ширяев 31.03.2025 Преобразование специальных кодов статусов товара в основные обрабатывамые в интеграции 1С (при импорте)
Функция ИспользоватьКакСтатус(СтоковыйСтатусWMS) Экспорт
	Если СтоковыйСтатусWMS = "Q" Тогда
		Возврат "B";
	ИначеЕсли СтоковыйСтатусWMS = "E" Тогда
		Возврат "B";
	Иначе
		Возврат СтоковыйСтатусWMS;
	КонецЕсли;
КонецФункции