// 	Copyright (C) 2012-2025 Engineer Mareev Enterprises
//	Модуль для УТ10.3 не ордерная схема

//  $Списание товаров (по инициативе WMS)
// 	Импорт сообщений OFFWRITE:
//	- Оператор EME.WMS (руч.) создает и оформляет документ списания товаров (опционально списание с оприходованием), закрывает его.
//	- После закрытия документа списания EME.WMS (авт.) экспортирует сообщение OFFWRITE.
//	- 1C (авт.) импортирует сообщение OFFWRITE. 
//	Если это списание без оприходования,
// 	- 1C (авт.) Создает документ Списание товаров, проводит его.
//	В комментарий документа записывается номер документа списания WMS.
//	Если это списание с оприходованием и причина списания - пересорт,
//	- 1C (авт.) создает документ Пересортица товаров, проводит его.
//	В комментарий документа записывается номер документа списания WMS.
//	Если это списание с оприходованием и причина списания не пересорт,
//	- 1C (авт.) создает документ Порча товаров, проводит его.
//	В комментарий документа записывается номер документа списания WMS.   

#Область ПрограммныйИнтерфейс

//	Функция ПолучитьИмяСообщения возвращает имя сообщения
Функция ПолучитьИмяСообщения() Экспорт
	Возврат "offwrite";
КонецФункции

//	Функция ПолучитьМетаданные возвращает метаданные сообщения
Функция ПолучитьМетаданные() Экспорт
	Возврат Метаданные.Документы.СписаниеТоваров;
КонецФункции

// Импортирует offwrite в разные документы: списание товаров, оприходование товаров, СС_документ_пересорт?
Процедура Импортировать(ERPData, Трассировка, ТемаСообщения) Экспорт
	// Это списание по инициативе 1С, не обрабатываем
	Если ЗначениеЗаполнено(ERPData.header.erp_doc_type) Тогда
		Возврат;
	КонецЕсли;

	// Номер документа EME для комментариев
	НомерЕМЕ = ERPData.header.offwrite_reg_no;
	
	//	Соберем товары и количества
	ТаблицаСкладов = РазметитьТаблицуСкладов();
	ПолучитьКоличестваТоваров(ERPData, ТаблицаСкладов);	
	// Если не было списания по складам WMS
	Если ТаблицаСкладов.Количество() = 0 Тогда
		EmeWmsERPEngine.ErrorHeader(ERPData, "LNSNUL");
		ERPData.header.error_more = НСтр("ru='Списание не импортировано, нулевое количество строк'");
		Возврат;
	КонецЕсли;
	
	КодОрганизации = ERPData.header.vendor_code;
	// Получим Организацию по коду EME
	ОрганизацияСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаОрганизациюПоКодуEME(КодОрганизации);
	Если ОрганизацияСсылка.Пустая() Тогда
		EmeWmsERPEngine.ErrorHeader(ERPData, "VNDBAD");
		Возврат;
	КонецЕсли;

	//	Если были ошибки
	Если EmeWmsERPEngine.HasErrors(ERPData) Тогда
		Возврат;
	КонецЕсли;

	// Если несколько складов (основной и неликвид), для каждого создадим свои документы
	Для каждого СтрокаСкладов из ТаблицаСкладов Цикл
		// Идентификатор док-та EME для записи в регистры импорта (декорированный статусом товара, может быть два ордера на сообщение).
		ИдЕМЕ 	 = ERPData.header.offwrite_id + "/" + СтрокаСкладов.СтатусТовара;
	    СкладСсылка = СтрокаСкладов.Склад;
		КартаТоваровСписания = СтрокаСкладов.КартаТоваровСписания;
		КартаТоваровОприходования = СтрокаСкладов.КартаТоваровОприходования;
		ТаблицаПересорта = СтрокаСкладов.ТаблицаПересорта;
		
		Параметры = Новый Структура;
		Параметры.Вставить("ERPData", 					ERPData);    
		Параметры.Вставить("ИдЕМЕ", 					ИдЕМЕ);
		Параметры.Вставить("НомерЕМЕ", 					НомерЕМЕ);
		Параметры.Вставить("ОрганизацияСсылка", 		ОрганизацияСсылка);
		Параметры.Вставить("СкладСсылка", 				СтрокаСкладов.Склад);
		Параметры.Вставить("ПересчетТоваровСсылка", 	Неопределено);
		Параметры.Вставить("ИспользоватьОрдернуюСхему", Ложь);
		Параметры.Вставить("ИмпортироватьМаркиЧЗ", 		Константы.EmeWmsИмпортироватьМаркиЧЗ.Получить());

		//*** Проверки сделали, пишем в базу данных 1C ***
		
		// Для строк без оприходования создадим документы на отражение недостач
		Если КартаТоваровСписания.Количество() > 0 Тогда  
			
			Параметры.Вставить("КартаТоваровСписания", КартаТоваровСписания);
			СоздатьИзменитьДокументСписанияНедостачТоваров(Параметры);
			
			//Если Параметры.ИмпортироватьМаркиЧЗ Тогда
			//	СоздатьИзменитьДокументВыводИзОборотаИСМП(Параметры);	
			//КонецЕсли;		
		КонецЕсли;   

		// Для строк без списания создадим документы на отражение излишков
		Если КартаТоваровОприходования.Количество() > 0 Тогда
			
			Параметры.Вставить("КартаТоваровОприходования", КартаТоваровОприходования);
			
			СоздатьИзменитьДокументОприходованияТоваров(Параметры);
		КонецЕсли;   

	КонецЦикла;
	
	EmeWmsERPEngine.Success(ERPData);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//	Процедура ОтменитьЭкспорт отменяет экспорт документа.
Процедура ОтменитьЭкспортСписанияТоваров(Документ)
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуСписанийТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.СписаниеТоваров.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Ложь;
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
КонецПроцедуры

//	Получить список складов с картами товаров для списания, оприходования и пересорта
// 	Карта товаров: ключ = UID товара + UID серии + UID характеристики, значение = количество в ед.хранения
Процедура ПолучитьКоличестваТоваров(ERPData, ТаблицаСкладов)	

	//	Использование серий в интеграции
	ИспользоватьСерии = Константы.EmeWmsИспользоватьСерии.Получить();	
	
	КлючиТоваров = Новый Соответствие();
	КодСклада = ERPData.header.whs_code;
	КодОрганизации = ERPData.header.vendor_code;
	
	// Весь товар в сообщении
	EmeWmsERPEngine.SelectChild(ERPData, "lines");
	Пока EmeWmsERPEngine.NextChildLine(ERPData) Цикл
		КодЗоны = ERPData.lines.zone_code;
		СтатусТовара = ERPData.lines.stock_status;
		СкладСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаСкладПоКодуEME(КодСклада, КодЗоны, КодОрганизации, СтатусТовара);
		Если СкладСсылка.Пустая() Тогда
			EmeWmsERPEngine.ErrorHeader(ERPData, "WHSBAD");
			Возврат;
		КонецЕсли;
		
		// Теперь найдем склад в таблице складов
		КартаТоваровСписания = Неопределено;
		Для Каждого СтрокаСкладов из ТаблицаСкладов Цикл
			Если СтрокаСкладов.Склад = СкладСсылка Тогда
				КартаТоваровСписания = СтрокаСкладов.КартаТоваровСписания;
				КартаТоваровОприходования = СтрокаСкладов.КартаТоваровОприходования;
				ТаблицаПересорта = СтрокаСкладов.ТаблицаПересорта;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		// Если нет такой, создадим строку складов
		Если КартаТоваровСписания = Неопределено Тогда     
			КартаТоваровСписания = Новый Соответствие;                                                                           
			КартаТоваровОприходования = Новый Соответствие;                                                                           
			ТаблицаПересорта = РазметитьТаблицуПересорта();
			
			СтрокаСкладов = ТаблицаСкладов.Добавить();
			СтрокаСкладов.Склад = СкладСсылка;
			СтрокаСкладов.СтатусТовара = СтатусТовара;
			СтрокаСкладов.КартаТоваровСписания = КартаТоваровСписания;                                                                           
			СтрокаСкладов.КартаТоваровОприходования = КартаТоваровОприходования;                                                                           
			СтрокаСкладов.ТаблицаПересорта = ТаблицаПересорта; 
		Иначе			
		КонецЕсли;
		
		Если ERPData.lines.quantity > 0.0 Тогда //	Выберем строки со спиcанием
			УИДТовара = ERPData.lines.goods_id;
			УИДЕдиницы = ERPData.lines.pack_id;
			Если УИДТовара = "" Тогда
				EmeWmsERPEngine.ErrorChild(ERPData, "GDSNUL");
				Продолжить
			КонецЕсли;
		
			ТоварСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаТовар(УИДТовара);
			Если ТоварСсылка.Пустая() Тогда
				EmeWmsERPEngine.ErrorChild(ERPData, "GDSBAD");
				Продолжить
			КонецЕсли;
		
			ЕдиницаИзмерения = EmeWmsУтилиты.ПолучитьСсылкуНаЕдиницуИзмерения(УИДЕдиницы);
			Если ЕдиницаИзмерения.Пустая() Тогда
				EmeWmsERPEngine.ErrorChild(ERPData, "PCKBAD");
				Продолжить
			КонецЕсли;
		
			РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТоварСсылка, "ВестиУчетПоСериям, ВестиУчетПоХарактеристикам"); 
			
			Если Не ИспользоватьСерии Тогда
				РеквизитыНоменклатуры.ВестиУчетПоСериям = Ложь;
			КонецЕсли;

			СерияНоменклатуры 		   	= Неопределено;
			ХарактеристикаНоменклатуры 	= Неопределено;
			
			Если РеквизитыНоменклатуры.ВестиУчетПоСериям Тогда   
				// Серии, если их нет при списании - создавать.
				СерияНоменклатуры = EmeWmsУтилиты.ПолучитьСериюПоНаименованию(ERPData.lines.lot_no, ТоварСсылка, Истина);
			ИначеЕсли РеквизитыНоменклатуры.ВестиУчетПоХарактеристикам Тогда
				ХарактеристикаНоменклатуры = EmeWmsУтилиты.ПолучитьХарактеристикуПоНаименованию(ERPData.lines.lot_no, ТоварСсылка);
			КонецЕсли;
			
			КлючиТоваров.Вставить(ERPData.lines.id, ТоварСсылка);
			КодЗоны = ERPData.lines.zone_code;
			КлючТовара = EmeWmsУтилиты.СоздатьКлючТовара(ТоварСсылка, СерияНоменклатуры, ХарактеристикаНоменклатуры);
			КоличествоВБазовой = EmeWmsУтилиты.ПересчетВДругуюЕдиницу(ERPData.lines.quantity, ЕдиницаИзмерения, ТоварСсылка.ЕдиницаХраненияОстатков);
			КоличествоПоКарте = ?(КартаТоваровСписания.Получить(КлючТовара) = неопределено, 0.0, КартаТоваровСписания.Получить(КлючТовара));
			КартаТоваровСписания.Вставить(КлючТовара, КоличествоПоКарте + КоличествоВБазовой);
			
		КонецЕсли;
		
		Если ERPData.lines.new_quantity > 0.0 Тогда //	Выберем строки с оприходованием
			УИДТовара = ERPData.lines.new_goods_id;
			УИДЕдиницы = ERPData.lines.new_pack_id;
			Если УИДТовара = "" Тогда
				EmeWmsERPEngine.ErrorChild(ERPData, "GDSNUL");
				Продолжить
			КонецЕсли;
		
			ТоварСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаТовар(УИДТовара);
			Если ТоварСсылка.Пустая() Тогда
				EmeWmsERPEngine.ErrorChild(ERPData, "GDSBAD");
				Продолжить
			КонецЕсли;
		
			ЕдиницаИзмерения = EmeWmsУтилиты.ПолучитьСсылкуНаЕдиницуИзмерения(УИДЕдиницы);
			Если ЕдиницаИзмерения.Пустая() Тогда
				EmeWmsERPEngine.ErrorChild(ERPData, "PCKBAD");
				Продолжить
			КонецЕсли;
		
			РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТоварСсылка, "ВестиУчетПоСериям, ВестиУчетПоХарактеристикам"); 

			Если Не ИспользоватьСерии Тогда
				РеквизитыНоменклатуры.ВестиУчетПоСериям = Ложь;
			КонецЕсли;

			СерияНоменклатуры 		   	= Неопределено;
			ХарактеристикаНоменклатуры 	= Неопределено;
			
			Если РеквизитыНоменклатуры.ВестиУчетПоСериям Тогда   
				// Серии, если их нет при списании - создавать.
				СерияНоменклатуры = EmeWmsУтилиты.ПолучитьСериюПоНаименованию(ERPData.lines.new_lot_no, ТоварСсылка, Истина);
			ИначеЕсли РеквизитыНоменклатуры.ВестиУчетПоХарактеристикам Тогда
				ХарактеристикаНоменклатуры = EmeWmsУтилиты.ПолучитьХарактеристикуПоНаименованию(ERPData.lines.new_lot_no, ТоварСсылка);
			КонецЕсли;

			КлючиТоваров.Вставить(ERPData.lines.id, ТоварСсылка);
			КодЗоны = ERPData.lines.zone_code;
			КлючТовара = EmeWmsУтилиты.СоздатьКлючТовара(ТоварСсылка, СерияНоменклатуры, ХарактеристикаНоменклатуры);
			КоличествоВБазовой = EmeWmsУтилиты.ПересчетВДругуюЕдиницу(ERPData.lines.new_quantity, ЕдиницаИзмерения, ТоварСсылка.ЕдиницаХраненияОстатков);
			КоличествоПоКарте = ?(КартаТоваровОприходования.Получить(КлючТовара) = неопределено, 0.0, КартаТоваровОприходования.Получить(КлючТовара));
			КартаТоваровОприходования.Вставить(КлючТовара, КоличествоПоКарте + КоличествоВБазовой);
			
		КонецЕсли;   
	КонецЦикла;
	
КонецПроцедуры

//	Получить коэф. пересчета (сколько упак 2 содержится в упак 1)
Функция ПолучитьКоэффициентПересчетаЕдиниц(Упаковка1, Упаковка2)
	Если Упаковка1 <> Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка() И
		Упаковка2 <> Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка() Тогда
		Если Упаковка1.Числитель <> 0 И Упаковка2.Числитель <> 0 Тогда
			КоэффициентПересчета = Упаковка1.Числитель / Упаковка2.Числитель;
		Иначе
			КоэффициентПересчета = 1;
		КонецЕсли;
	Иначе 
		КоэффициентПересчета = 1;
	КонецЕсли;
	
	Возврат КоэффициентПересчета;
КонецФункции

//	Заполняет таблицу пересчета
Функция ПолучитьТаблицуПересчета(ТаблицаПересчета, КартаТоваровСписания, КартаТоваровОприходования, ТаблицаПересорта) 
	Перем ТоварСсылка, СерияСсылка, ХарактеристикаСсылка;
	
	Для каждого Строка Из КартаТоваровСписания Цикл    
		EmeWmsУтилиты.РазобратьКлючНаСсылки(Строка.Ключ, ТоварСсылка, СерияСсылка, ХарактеристикаСсылка);
		
		СтрокаПересчета 				= ТаблицаПересчета.Добавить();
		СтрокаПересчета.Номенклатура 	= ТоварСсылка;
		СтрокаПересчета.Характеристика 	= ХарактеристикаСсылка;
		СтрокаПересчета.Серия 			= СерияСсылка;
		СтрокаПересчета.Упаковка 		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТоварСсылка, "ЕдиницаИзмерения");
		СтрокаПересчета.КоличествоСтарое= Строка.Значение;
		СтрокаПересчета.КоличествоНовое = 0.0;		
	КонецЦикла;
	
	Для каждого Строка Из КартаТоваровОприходования Цикл    
		EmeWmsУтилиты.РазобратьКлючНаСсылки(Строка.Ключ, ТоварСсылка, СерияСсылка, ХарактеристикаСсылка);
		
		СтрокаПересчета 				= ТаблицаПересчета.Добавить();
		СтрокаПересчета.Номенклатура 	= ТоварСсылка;
		СтрокаПересчета.Характеристика 	= ХарактеристикаСсылка;
		СтрокаПересчета.Серия 			= СерияСсылка;
		СтрокаПересчета.Упаковка 		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТоварСсылка, "ЕдиницаИзмерения");
		СтрокаПересчета.КоличествоСтарое= 0.0;
		СтрокаПересчета.КоличествоНовое = Строка.Значение;		
	КонецЦикла;
	
	Для каждого Строка Из ТаблицаПересорта Цикл    
		СтрокаПересчета 				= ТаблицаПересчета.Добавить();
		СтрокаПересчета.Номенклатура 	= Строка.ТоварСписания;
		СтрокаПересчета.Характеристика 	= Строка.ХарактеристикаСписания;
		СтрокаПересчета.Серия 			= Строка.СерияСписания;
		СтрокаПересчета.Упаковка 		= Строка.ЕдиницаИзмеренияСписания;
		СтрокаПересчета.КоличествоСтарое= Строка.КоличествоСписания;
		СтрокаПересчета.КоличествоНовое = 0.0;	
		
		СтрокаПересчета 				= ТаблицаПересчета.Добавить();
		СтрокаПересчета.Номенклатура 	= Строка.ТоварОприходования;
		СтрокаПересчета.Характеристика 	= Строка.ХарактеристикаОприходования;
		СтрокаПересчета.Серия 			= Строка.СерияОприходования;
		СтрокаПересчета.Упаковка 		= Строка.ЕдиницаИзмеренияОприходования;
		СтрокаПересчета.КоличествоСтарое= 0.0;
		СтрокаПересчета.КоличествоНовое = Строка.КоличествоОприходования;			
	КонецЦикла;
	
	ТаблицаПересчета.Свернуть("Номенклатура,Характеристика,Серия,Упаковка", "КоличествоСтарое,КоличествоНовое");
	ТаблицаПересчета.Сортировать("Номенклатура,Характеристика,Серия");
	
КонецФункции

//	Получить серию товара по номеру или создать новую
Функция ПолучитьСериюПоНомеру(СерийныйНомер, Товар, ВидНоменклатуры)
	Если НЕ ЗначениеЗаполнено(СерийныйНомер) Тогда
		Возврат Справочники.СерииНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	СерияСсылка = Справочники.СерииНоменклатуры.НайтиПоРеквизиту("Номер", СерийныйНомер,, ВидНоменклатуры);
	Если СерияСсылка.Пустая() Тогда
		Серия = Справочники.СерииНоменклатуры.СоздатьЭлемент();
		Серия.ВидНоменклатуры 	= ВидНоменклатуры;
		Серия.Наименование 		= СерийныйНомер;
		Серия.Номер 			= СерийныйНомер;
		Серия.Записать();
		СерияСсылка = Серия.Ссылка;
	КонецЕсли;
	
	Возврат СерияСсылка;
КонецФункции

// #IBS 04.12.2024 Таблица для складов по сообщению
Функция РазметитьТаблицуСкладов()
	ТаблицаСкладов = Новый ТаблицаЗначений;
	ТаблицаСкладов.Колонки.Добавить("Склад");
	ТаблицаСкладов.Колонки.Добавить("СтатусТовара");
	ТаблицаСкладов.Колонки.Добавить("КартаТоваровСписания");
	ТаблицаСкладов.Колонки.Добавить("КартаТоваровОприходования");
	ТаблицаСкладов.Колонки.Добавить("ТаблицаПересорта");
	
	Возврат ТаблицаСкладов;
КонецФункции

//	Таблица для данных пересорта
Функция РазметитьТаблицуПересорта()
	ТаблицаПересорта = Новый ТаблицаЗначений;
	ТаблицаПересорта.Колонки.Добавить("ТоварСписания");
	ТаблицаПересорта.Колонки.Добавить("ЕдиницаИзмеренияСписания");
	ТаблицаПересорта.Колонки.Добавить("СерияСписания");
	ТаблицаПересорта.Колонки.Добавить("ХарактеристикаСписания");
	ТаблицаПересорта.Колонки.Добавить("КоличествоСписания");
	ТаблицаПересорта.Колонки.Добавить("ТоварОприходования");
	ТаблицаПересорта.Колонки.Добавить("ЕдиницаИзмеренияОприходования");
	ТаблицаПересорта.Колонки.Добавить("СерияОприходования");
	ТаблицаПересорта.Колонки.Добавить("ХарактеристикаОприходования");
	ТаблицаПересорта.Колонки.Добавить("КоличествоОприходования");
	
	Возврат ТаблицаПересорта;
КонецФункции

//	Таблица для данных пересчета
Функция РазметитьТаблицуПересчета()
	ТаблицаПересорта = Новый ТаблицаЗначений;
	ТаблицаПересорта.Колонки.Добавить("Номенклатура");
	ТаблицаПересорта.Колонки.Добавить("Упаковка");
	ТаблицаПересорта.Колонки.Добавить("Характеристика");
	ТаблицаПересорта.Колонки.Добавить("Серия");
	ТаблицаПересорта.Колонки.Добавить("РазностьКоличеств");
	ТаблицаПересорта.Колонки.Добавить("КоличествоСтарое");
	ТаблицаПересорта.Колонки.Добавить("КоличествоНовое");
	
	Возврат ТаблицаПересорта;
КонецФункции

#КонецОбласти 

#Область ПоискСсылокНаОбъектыПоКодуEME

//	Найти ссылку на Вывод из оборота ИС МП по номеру импортированного документа EME
Функция НайтиДокументВыводИзОборотаИСМП(ИдЕМЕ)
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	EmeWmsОтметкиОбИмпорте.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрСведений.EmeWmsОтметкиОбИмпортеВыводИзОборотаИСМП КАК EmeWmsОтметкиОбИмпорте
		|ГДЕ
		|	EmeWmsОтметкиОбИмпорте.ID = &ИдЕМЕ";
	Запрос.УстановитьПараметр("ИдЕМЕ", ИдЕМЕ);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Документы.ВыводИзОборотаИСМП.ПустаяСсылка();
КонецФункции

//	Найти ссылку на пересчет товаров по номеру импортированного документа EME
Функция НайтиДокументПересчетТоваров(ИдЕМЕ)
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	EmeWmsОтметкиОбИмпорте.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрСведений.EmeWmsОтметкиОбИмпортеПересчетовТоваров КАК EmeWmsОтметкиОбИмпорте
		|ГДЕ
		|	EmeWmsОтметкиОбИмпорте.ID = &ИдЕМЕ";
	Запрос.УстановитьПараметр("ИдЕМЕ", ИдЕМЕ);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Документы.ПересчетТоваров.ПустаяСсылка();
КонецФункции

//	Найти ссылку на списание товаров по номеру импортированного документа EME
Функция НайтиДокументСписанияТоваров(ИдЕМЕ)
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	EmeWmsОтметкиОрдера.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрСведений.EmeWmsОтметкиОбИмпортеСписанийТоваров КАК EmeWmsОтметкиОрдера
		|ГДЕ
		|	EmeWmsОтметкиОрдера.ID = &ИдЕМЕ";
	Запрос.УстановитьПараметр("ИдЕМЕ", ИдЕМЕ);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Документы.СписаниеТоваров.ПустаяСсылка();
КонецФункции

//	Найти ссылку на оприходование излишков товаров по номеру импортированного документа EME
Функция НайтиДокументОприходованияТоваров(ИдЕМЕ)
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	EmeWmsОтметкиОрдера.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрСведений.EmeWmsОтметкиОбИмпортеОприходованийТоваров КАК EmeWmsОтметкиОрдера
		|ГДЕ
		|	EmeWmsОтметкиОрдера.ID = &ИдЕМЕ";
	Запрос.УстановитьПараметр("ИдЕМЕ", ИдЕМЕ);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Документы.ОприходованиеТоваров.ПустаяСсылка();
КонецФункции

//	Найти ссылку на пересортица товаров по номеру импортированного документа EME
Функция НайтиДокументПересортицаТоваров(ИдЕМЕ)
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	EmeWmsОтметкиОрдера.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрСведений.EmeWmsОтметкиОбИмпортеПересортицаТоваров КАК EmeWmsОтметкиОрдера
		|ГДЕ
		|	EmeWmsОтметкиОрдера.ID = &ИдЕМЕ";
	Запрос.УстановитьПараметр("ИдЕМЕ", ИдЕМЕ);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Документы.ПересортицаТоваров.ПустаяСсылка();
КонецФункции

//	Найти ссылку на порча товаров по номеру импортированного документа EME
Функция НайтиДокументПорчаТоваров(ИдЕМЕ)
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	EmeWmsОтметкиОрдера.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрСведений.EmeWmsОтметкиОбИмпортеПорчаТоваров КАК EmeWmsОтметкиОрдера
		|ГДЕ
		|	EmeWmsОтметкиОрдера.ID = &ИдЕМЕ";
	Запрос.УстановитьПараметр("ИдЕМЕ", ИдЕМЕ);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Документы.ПорчаТоваров.ПустаяСсылка();
КонецФункции

#КонецОбласти

#Область СозданиеДокументов

//	Создать или изменить документ списания недостач товаров
Процедура СоздатьИзменитьДокументСписанияНедостачТоваров(Параметры)  
	
	СписаниеСсылка = НайтиДокументСписанияТоваров(Параметры.ИдЕМЕ);
	Если СписаниеСсылка.Пустая() Тогда
		Списание = Документы.СписаниеТоваров.СоздатьДокумент();
		Списание.Дата 			   = ТекущаяДата();
		Списание.Склад 			   = Параметры.СкладСсылка;
		Списание.Организация 	   = Параметры.ОрганизацияСсылка;
		Списание.Подразделение 	   = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.СкладСсылка, "Подразделение");
		Списание.Комментарий 	   = "Создан на основании документа списания EME: " +
			Параметры.НомерЕМЕ + " (" + Параметры.ERPData.header.comment + ")";
		Списание.ОтражатьВБухгалтерскомУчете = Истина;
		Списание.ОтражатьВУправленческомУчете = Истина;
		
		// Вид деятельности	
		//EmeWmsДрайвер.ЗаполнитьВидДеятельностиНДС(Списание);
	Иначе
		Списание = СписаниеСсылка.ПолучитьОбъект();
		Списание.Комментарий = "Документ скорректирован на основании документа списания EME: " +
			Параметры.НомерЕМЕ + " (" + Параметры.ERPData.header.comment + ")";
	КонецЕсли;    
	
	EmeWmsУтилиты.СкорректироватьТабличнуюЧасть(Списание, Параметры.КартаТоваровСписания, Истина);	  
	EmeWmsДрайвер.ЗаполнитьСтатусыУказанияСерий(Списание, Документы.СписаниеТоваров);
	
	//	Валюта регламентированного учета
	мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	мВалютаУпрУчета    		= глЗначениеПеременной("ВалютаУправленческогоУчета");
	СтруктураКурса     		= МодульВалютногоУчета.ПолучитьКурсВалюты(мВалютаУпрУчета, Списание.Дата);
	мКурсУпрУчета      		= СтруктураКурса.Курс;
	мКратностьУпрУчета 		= СтруктураКурса.Кратность;
	мТекущийСтатусПартии 	= Перечисления.СтатусыПартийТоваров.Купленный;
	Качество 		   		= Справочники.Качество.Новый;
	СпособЗаполненияЦен 	= Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатуры;
	УчитыватьНДС 		    = Списание.ОтражатьВБухгалтерскомУчете;

	// 	Установим цены в документе по виду цены
	ТипЦен = Справочники.ТипыЦенНоменклатуры.НайтиПоНаименованию("Плановая цена"); 
	ВалютаЦены			 = ТипЦен.ВалютаЦены;
	ЦенаВключаетНДС		 = ТипЦен.ЦенаВключаетНДС;
	
	// Если есть цена и тип цен, но нет валюты, тогда в качестве валюты документа возьмем валюту регламентированного учета.
	ВалютаДокумента    = мВалютаРегламентированногоУчета;
	КурсДокумента      = 1;
	КратностьДокумента = 1;

	//	Рассчитываем реквизиты табличной части.
	Для каждого СтрокаТовара из Списание.Товары Цикл
		СтрокаТовара.Качество = Качество;

		Цена = Ценообразование.ПолучитьЦенуНоменклатуры(СтрокаТовара.Номенклатура, СтрокаТовара.ХарактеристикаНоменклатуры,
										ТипЦен, Списание.Дата, СтрокаТовара.ЕдиницаИзмерения,
										ВалютаДокумента, КурсДокумента, КратностьДокумента, , Неопределено, Неопределено);

		//	Пересчитаем цену в валюту документа.
		Цена = Ценообразование.ПересчитатьЦенуПриИзмененииВалюты(Цена, ВалютаЦены, мВалютаУпрУчета, мКурсУпрУчета, мКратностьУпрУчета, Списание.Дата);

		//	В документе цена со всеми налогами
		СуммаВключаетНДС = Истина;

		//	Получим ставки из справочника.
		СтавкаНДС = УчетНДС.ПолучитьСтавкуНДС(СтрокаТовара.Номенклатура.СтавкаНДС);

		СтрокаТовара.Цена = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(Цена,
		                                                 СпособЗаполненияЦен,
		                                                 ЦенаВключаетНДС,
		                                                 УчитыватьНДС,
		                                                 СуммаВключаетНДС,
		                                                 СтавкаНДС);

		// 	Отладка: Установим цена = 1 руб., при нулевой цене документ не проводится
		Если СтрокаТовара.Цена = 0 Тогда			
			СтрокаТовара.Цена = 1;			
		КонецЕсли;   
		
		//	Рассчитываем реквизиты табличной части.
		ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуМестТабЧасти(СтрокаТовара, Списание, Ложь);
		СтрокаТовара.Коэффициент = СтрокаТовара.ЕдиницаИзмерения.Коэффициент;
		
		ОбработкаТабличныхЧастей.ЗаполнитьПроцентРозничнойНаценкиТабЧасти(СтрокаТовара, Списание);
		ОбработкаТабличныхЧастей.РассчитатьРозничнуюЦенуТабЧасти(СтрокаТовара, Списание, мВалютаРегламентированногоУчета);
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТовара, Списание);
		
		СтрокаТовара.Сумма	   = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТовара.Сумма, мВалютаУпрУчета, 
													 мВалютаРегламентированногоУчета, мКурсУпрУчета, 1, мКратностьУпрУчета, 1);
								
		Если НЕ ЗначениеЗаполнено(СтрокаТовара.Качество) Тогда
			ОбработкаТабличныхЧастей.ЗаполнитьКачествоНоменклатурыТабЧасти(СтрокаТовара, Списание);
		КонецЕсли;
	КонецЦикла;	
	
	Списание.Записать(РежимЗаписиДокумента.Запись);  

	Если Параметры.ИмпортироватьМаркиЧЗ Тогда
		//	Добавляем марки в ТЧ ШтрихкодыУпаковок документа списание товаров
		ПараметрыМарок = Новый Структура;
		ПараметрыМарок.Вставить("ERPData",		Параметры.ERPData);
		ПараметрыМарок.Вставить("ЗаказОбъект",	Списание);
		ПолучитьТаблицуМарокСписанных(ПараметрыМарок);
		
		Списание.ШтрихкодыУпаковок.Очистить(); 
		ДобавитьМаркиВТЧШтрихкодыУпаковок(Списание.ШтрихкодыУпаковок, ПараметрыМарок.ТаблицаМарок);
		Списание.Записать(РежимЗаписиДокумента.Запись); 
	КонецЕсли;        	
	
	ОтменитьЭкспортСписанияТоваров(Списание.Ссылка);
	СоздатьОтметкуОбИмпортеДокументаСписанияТоваров(Списание.Ссылка, Параметры.ИдЕМЕ);
	EmeWmsПроведениеДокументов.ПометитьДокументКПроведению(Списание.Ссылка);  
	
КонецПроцедуры

// Создает новый или корректирует найденный по ID EME документ Оприходования излищков товаров
Функция СоздатьИзменитьДокументОприходованияТоваров(Параметры)
	
	ОприходованиеСсылка = НайтиДокументОприходованияТоваров(Параметры.ИдЕМЕ);
	Если ОприходованиеСсылка.Пустая() Тогда
		Оприходование 			      = Документы.ОприходованиеТоваров.СоздатьДокумент();
		Оприходование.Дата 		      = ТекущаяДата();
		Оприходование.Склад 	      = Параметры.СкладСсылка;
		Оприходование.Организация     = Параметры.ОрганизацияСсылка;
		Оприходование.Подразделение   = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.СкладСсылка, "Подразделение");
		Оприходование.ОтражатьВУправленческомУчете = Истина;
		Оприходование.ОтражатьВБухгалтерскомУчете  = Истина;
		Оприходование.ВидОперации	  = Перечисления.ВидыОперацийОприходованиеТоваров.ОприходованиеТоваров;
		Оприходование.Излишек		  = 1;
		Оприходование.КоррСчет   	  = ПланыСчетов.Хозрасчетный.ПрочиеДоходы;  
    	Оприходование.Субконто1		  = Справочники.ПрочиеДоходыИРасходы.НайтиПоКоду("0360"); //Меркурий
		Оприходование.КоррСчетНУ 	  = ПланыСчетов.Налоговый.ВнереализационныеДоходы;
		Оприходование.Комментарий     = "Создан на основании документа списания/оприходования EME: " +
			Параметры.НомерЕМЕ + " (" + Параметры.ИдЕМЕ + ")" + " (" + Параметры.ERPData.header.comment + ")"; 		
		//Оприходование.СтатьяДоходов = ПланыВидовХарактеристик.СтатьиДоходов.НайтиПоНаименованию("Внереализационные доходы");
		//Оприходование.АналитикаДоходов = ОрганизацияСсылка;
	Иначе
		Оприходование = ОприходованиеСсылка.ПолучитьОбъект();
		Оприходование.Комментарий = "Документ скорректирован на основании документа списания/оприходования EME: " +
			Параметры.НомерЕМЕ + " (" + Параметры.ИдЕМЕ + ")" + " (" + Параметры.ERPData.header.comment + ")";
	КонецЕсли;

	//	Корерктировка табличной части
	EmeWmsУтилиты.СкорректироватьТабличнуюЧасть(Оприходование, Параметры.КартаТоваровОприходования, Истина);

	//	Валюта регламентированного учета
	мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	мВалютаУпрУчета    		= глЗначениеПеременной("ВалютаУправленческогоУчета");
	СтруктураКурса     		= МодульВалютногоУчета.ПолучитьКурсВалюты(мВалютаУпрУчета, Оприходование.Дата);
	мКурсУпрУчета      		= СтруктураКурса.Курс;
	мКратностьУпрУчета 		= СтруктураКурса.Кратность;
	мТекущийСтатусПартии 	= Перечисления.СтатусыПартийТоваров.Купленный;
	Качество 		   		= Справочники.Качество.Новый;
	СпособЗаполненияЦен 	= Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатуры;
	УчитыватьНДС 		    = Оприходование.ОтражатьВБухгалтерскомУчете;

	// 	Установим цены в документе по виду цены
	ТипЦен = Справочники.ТипыЦенНоменклатуры.НайтиПоНаименованию("Плановая цена"); 
	Оприходование.ТипЦен = ТипЦен; 
	ВалютаЦены			 = ТипЦен.ВалютаЦены;
	ЦенаВключаетНДС		 = ТипЦен.ЦенаВключаетНДС;
	
	// Если есть цена и тип цен, но нет валюты, тогда в качестве валюты документа возьмем валюту регламентированного учета.
	ВалютаДокумента    = мВалютаРегламентированногоУчета;
	КурсДокумента      = 1;
	КратностьДокумента = 1;

	//	Рассчитываем реквизиты табличной части.
	Для каждого СтрокаТовара из Оприходование.Товары Цикл
		СтрокаТовара.Качество = Качество;

		Цена = Ценообразование.ПолучитьЦенуНоменклатуры(СтрокаТовара.Номенклатура, СтрокаТовара.ХарактеристикаНоменклатуры,
										ТипЦен, Оприходование.Дата, СтрокаТовара.ЕдиницаИзмерения,
										ВалютаДокумента, КурсДокумента, КратностьДокумента, , Неопределено, Неопределено);

		//	Пересчитаем цену в валюту документа.
		Цена = Ценообразование.ПересчитатьЦенуПриИзмененииВалюты(Цена, ВалютаЦены, мВалютаУпрУчета, мКурсУпрУчета, мКратностьУпрУчета, Оприходование.Дата);

		//	В документе цена со всеми налогами
		СуммаВключаетНДС = Истина;

		//	Получим ставки из справочника.
		СтавкаНДС = УчетНДС.ПолучитьСтавкуНДС(СтрокаТовара.Номенклатура.СтавкаНДС);

		СтрокаТовара.Цена = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(Цена,
		                                                 СпособЗаполненияЦен,
		                                                 ЦенаВключаетНДС,
		                                                 УчитыватьНДС,
		                                                 СуммаВключаетНДС,
		                                                 СтавкаНДС);

		// 	Отладка: Установим цена = 1 руб., при нулевой цене документ не проводится
		Если СтрокаТовара.Цена = 0 Тогда			
			СтрокаТовара.Цена = 1;			
		КонецЕсли;   
		
		//	Рассчитываем реквизиты табличной части.
		ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуМестТабЧасти(СтрокаТовара, Оприходование, Ложь);
		СтрокаТовара.Коэффициент = СтрокаТовара.ЕдиницаИзмерения.Коэффициент;
		
		ОбработкаТабличныхЧастей.ЗаполнитьПроцентРозничнойНаценкиТабЧасти(СтрокаТовара, Оприходование);
		ОбработкаТабличныхЧастей.РассчитатьРозничнуюЦенуТабЧасти(СтрокаТовара, Оприходование, мВалютаРегламентированногоУчета);
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТовара, Оприходование);
		
		СтрокаТовара.СуммаРегл    = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТовара.Сумма, мВалютаУпрУчета, 
													 мВалютаРегламентированногоУчета, мКурсУпрУчета, 1, мКратностьУпрУчета, 1);
								
		СтрокаТовара.СуммаНУ 	  = СтрокаТовара.СуммаРегл;
		СтрокаТовара.СуммаВР 	  = 0;
		СтрокаТовара.СуммаПР 	  = 0;
		СтрокаТовара.СтатусПартии = мТекущийСтатусПартии;

		Если НЕ ЗначениеЗаполнено(СтрокаТовара.Качество) Тогда
			ОбработкаТабличныхЧастей.ЗаполнитьКачествоНоменклатурыТабЧасти(СтрокаТовара, Оприходование);
		КонецЕсли;
	КонецЦикла;	
	
	Оприходование.Записать(РежимЗаписиДокумента.Запись);
	
	СоздатьОтметкуОбИмпортеДокументаОприходованияИзлишковТоваров(Оприходование.Ссылка, Параметры.ИдЕМЕ);
	EmeWmsПроведениеДокументов.ПометитьДокументКПроведению(Оприходование.Ссылка);         
	
	Возврат Оприходование.Ссылка;
КонецФункции


//	Создать или изменить документ пересортица товаров
Процедура СоздатьИзменитьДокументПересортицаТоваров(Параметры)
	
	ПересортицаТоваровСсылка = НайтиДокументПересортицаТоваров(Параметры.ИдЕМЕ);
	Если ПересортицаТоваровСсылка.Пустая() Тогда
		РеквизитыДокумента = Новый Структура;
		РеквизитыДокумента.Вставить("Дата", 				 ТекущаяДата());
		РеквизитыДокумента.Вставить("Склад", 				 Параметры.СкладСсылка);
		РеквизитыДокумента.Вставить("Организация", 			 Параметры.ОрганизацияСсылка);
		РеквизитыДокумента.Вставить("ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ПересортицаТоваров);
		РеквизитыДокумента.Вставить("Подразделение", 
										ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.СкладСсылка,"Подразделение"));
		РеквизитыДокумента.Вставить("СтатьяДоходов",  ПланыВидовХарактеристик.СтатьиДоходов.НайтиПоНаименованию("Излишки"));
		//РеквизитыДокумента.Вставить("АналитикаДоходов", Пересортица.Подразделение);
		РеквизитыДокумента.Вставить("СтатьяРасходов", ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоНаименованию("АкТ Списания"));
		//РеквизитыДокумента.Вставить("АналитикаРасходов", Пересортица.Подразделение);
		РеквизитыДокумента.Вставить("ПриходоватьТоварыПоСебестоимостиСписания", Истина);

		РеквизитыДокумента.Вставить("Комментарий", "Создан на основании документа списания EME " + Параметры.НомерЕМЕ);
		
		Пересортица = Документы.ПересортицаТоваров.СоздатьДокумент();
		ЗаполнитьЗначенияСвойств(Пересортица, РеквизитыДокумента);
		
		// Вид деятельности	
		EmeWmsДрайвер.ЗаполнитьВидДеятельностиНДС(Пересортица);
	Иначе
		Пересортица = ПересортицаТоваровСсылка.ПолучитьОбъект();
		
		Комментарий = НСтр("ru='Документ скорректирован на основании Ордера на отражение пересортицы по списанию EME: %1 (%2)'");				
		Пересортица.Комментарий = "Скорректирован на основании документа EME " + Параметры.НомерЕМЕ;
		
		Пересортица.Товары.Очистить();		
	КонецЕсли;
	
	Если НЕ Параметры.ИспользоватьОрдернуюСхему Тогда
		Пересортица.ПересчетТоваров = Параметры.ПересчетТоваровСсылка; 
	КонецЕсли;

	Для каждого Строка из Параметры.ТаблицаПересорта Цикл
		НоваяСтрока = Пересортица.Товары.Добавить();  
		
		НоваяСтрока.Номенклатура 			  = Строка.ТоварСписания;
		НоваяСтрока.Серия 					  = Строка.СерияСписания;
		НоваяСтрока.Характеристика 			  = Строка.ХарактеристикаСписания;
		НоваяСтрока.Количество 				  = Строка.КоличествоСписания;
		
		НоваяСтрока.НоменклатураОприходование = Строка.ТоварОприходования;
		НоваяСтрока.СерияОприходование 		  = Строка.СерияОприходования;
		НоваяСтрока.ХарактеристикаОприходование = Строка.ХарактеристикаОприходования;
	КонецЦикла;
		
	// Цены в документе по виду цены
	Пересортица.ВидЦены = Справочники.ВидыЦен.НайтиПоНаименованию("!Закупочные");
	// Валюта
	Пересортица.Валюта  = EmeWmsДрайвер.ПолучитьВалютуУправленческогоУчета(Пересортица.ВидЦены);
	EmeWmsДрайвер.ЗаполнитьЦеныПоВидуЦен(Пересортица);
	
	// Отладка: Установим цена = 1 руб., при нулевой цене документ не проводится
	Для каждого Строка из Пересортица.Товары Цикл
		Если Строка.Цена = 0 Тогда
			Строка.Цена = 1;
		КонецЕсли;
	КонецЦикла;
		
	EmeWmsДрайвер.ЗаполнитьСтатусыУказанияСерий(Пересортица, Документы.ПересортицаТоваров);	
	
	Пересортица.Записать(РежимЗаписиДокумента.Запись);
	
	СоздатьОтметкуОбИмпортеДокументаПересортицаТоваров(Пересортица.Ссылка, Параметры.ИдЕМЕ);
	EmeWmsПроведениеДокументов.ПометитьДокументКПроведению(Пересортица.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область СозданиеОтметокОбИмпорте

//	Создает в регистре пометку об импорте документа Вывод из оборота ИС МП с номером в EME
Процедура СоздатьОтметкуОбИмпортеДокументаВыводИзОборотаИСМП(Документ, ИдЕМЕ)
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеВыводИзОборотаИСМП.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.ДатаИмпорта = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsОтметкиОбИмпортеВыводИзОборотаИСМП.СоздатьМенеджерЗаписи();
	НоваяЗапись.ID = ИдЕМЕ;
	НоваяЗапись.Ссылка = Документ.Ссылка;
	НоваяЗапись.ДатаИмпорта = ТекущаяДата();
    НоваяЗапись.Записать();   
	
 КонецПроцедуры

//	Создает в регистре отметку об импорте документа Списание товаров с номером EME
Процедура СоздатьОтметкуОбИмпортеДокументаСписанияТоваров(Документ, ИдЕМЕ)
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеСписанийТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.ДатаИмпорта = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsОтметкиОбИмпортеСписанийТоваров.СоздатьМенеджерЗаписи();
	НоваяЗапись.ID = ИдЕМЕ;
	НоваяЗапись.Ссылка = Документ.Ссылка;
	НоваяЗапись.ДатаИмпорта = ТекущаяДата();
    НоваяЗапись.Записать(); 
 КонецПроцедуры

//	Создает в регистре отметку об импорте документа Оприходование излишков товаров с номером EME 
Процедура СоздатьОтметкуОбИмпортеДокументаОприходованияИзлишковТоваров(Документ, ИдЕМЕ)
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеОприходованийТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.ДатаИмпорта = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsОтметкиОбИмпортеОприходованийТоваров.СоздатьМенеджерЗаписи();
	НоваяЗапись.ID = ИдЕМЕ;
	НоваяЗапись.Ссылка = Документ.Ссылка;
	НоваяЗапись.ДатаИмпорта = ТекущаяДата();
    НоваяЗапись.Записать(); 
КонецПроцедуры

//	Создает в регистре отметку об импорте документа Пересортица товаров с номером EME 
Процедура СоздатьОтметкуОбИмпортеДокументаПересортицаТоваров(Документ, ИдЕМЕ)
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеПересортицаТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.ДатаИмпорта = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsОтметкиОбИмпортеПересортицаТоваров.СоздатьМенеджерЗаписи();
	НоваяЗапись.ID = ИдЕМЕ;
	НоваяЗапись.Ссылка = Документ.Ссылка;
	НоваяЗапись.ДатаИмпорта = ТекущаяДата();
    НоваяЗапись.Записать(); 
 КонецПроцедуры

#КонецОбласти

 #Область МаркиЧЗ 

//	Добавляет марки в ТЧ ШтрихкодыУпаковок документа
Процедура ДобавитьМаркиВТЧШтрихкодыУпаковок(ТЧШтрихкодыУпаковок, ТаблицаМарок)  
	
	Для Каждого СтрокаМарок Из ТаблицаМарок Цикл
		//	Штрихкод марки
		ШтрихкодУпаковки = НайтиСоздатьШтрихкодУпаковки(СтрокаМарок);
		
		//  Штрихкод упаковки
		Если ЗначениеЗаполнено(СтрокаМарок.ШтрихкодКороба) Тогда
			ШтрихкодУпаковки = НайтиСоздатьШтрихкодМонотоварнойУпаковки(СтрокаМарок, СтрокаМарок.ШтрихкодКороба, ШтрихкодУпаковки);
			
			//	Штрихкод паллеты
			Если ЗначениеЗаполнено(СтрокаМарок.ШтрихкодПаллеты) Тогда
				ШтрихкодУпаковки = НайтиСоздатьШтрихкодМонотоварнойУпаковки(СтрокаМарок, СтрокаМарок.ШтрихкодПаллеты, ШтрихкодУпаковки);				
			КонецЕсли;
		КонецЕсли;
		
		//	Поиск Штрихкода в Штрихкодах упаковки проверяемого документа
		Отбор = Новый Структура();
		Отбор.Вставить("ШтрихкодУпаковки", ШтрихкодУпаковки);
		
		МассивСтрок = ТЧШтрихкодыУпаковок.НайтиСтроки(Отбор);
		Если МассивСтрок.Количество() > 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		СтрокаШтрихкода = ТЧШтрихкодыУпаковок.Добавить();
		СтрокаШтрихкода.ШтрихкодУпаковки = ШтрихкодУпаковки;
	КонецЦикла;
	
КонецПроцедуры   

//	Находит или создает новую строку в справочнике ШтрикодыУпаковокТовара
Функция НайтиСоздатьШтрихкодМонотоварнойУпаковки(СтрокаМарок, ЗначениеШтрихкода, ВложенныйШтрихкод)
	
	Штрихкод = Справочники.ШтрихкодыУпаковокТоваров.НайтиПоРеквизиту("ЗначениеШтрихкода", ЗначениеШтрихкода);
	Если Штрихкод.Пустая() Тогда
		ШтрихкодОбъект = Справочники.ШтрихкодыУпаковокТоваров.СоздатьЭлемент();
		ШтрихкодОбъект.ЗначениеШтрихкода  = ЗначениеШтрихкода;
		ШтрихкодОбъект.ТипШтрихкода 	  = Перечисления.ТипыШтрихкодов.GS1_DataMatrix;
		ШтрихкодОбъект.ТипУпаковки 		  = Перечисления.ТипыУпаковок.МонотоварнаяУпаковка;
		ШтрихкодОбъект.Количество	   	  = 1;
		ШтрихкодОбъект.ДатаУпаковки 	  = ТекущаяДата();
	Иначе
		ШтрихкодОбъект = Штрихкод.ПолучитьОбъект();
		
		//	Поиск Штрихкода в Штрихкодах упаковки проверяемого документа
		Отбор = Новый Структура();
		Отбор.Вставить("Штрихкод", ВложенныйШтрихкод);
			
		МассивСтрок = ШтрихкодОбъект.ВложенныеШтрихкоды.НайтиСтроки(Отбор);
		Если МассивСтрок.Количество() > 0 Тогда 
			Возврат ШтрихкодОбъект.Ссылка;
		КонецЕсли;		
	КонецЕсли;
			
	НоваяСтрока = ШтрихкодОбъект.ВложенныеШтрихкоды.Добавить();
	НоваяСтрока.Штрихкод = ВложенныйШтрихкод;
	
	ШтрихкодОбъект.Записать();
	
	Возврат ШтрихкодОбъект.Ссылка;   	
	
КонецФункции

//	Находит или создает новую строку в справочнике ШтрикодыУпаковокТовара
Функция НайтиСоздатьШтрихкодУпаковки(СтрокаМарок)
	
	Штрихкод = Справочники.ШтрихкодыУпаковокТоваров.НайтиПоРеквизиту("ЗначениеШтрихкода", СтрокаМарок.ЗначениеШтрихкода);
	Если Не Штрихкод.Пустая() Тогда
		Возврат Штрихкод;
	КонецЕсли;
	
	Штрихкод = Справочники.ШтрихкодыУпаковокТоваров.СоздатьЭлемент(); 
	ЗаполнитьЗначенияСвойств(Штрихкод, СтрокаМарок, , "Количество");
	
	Штрихкод.ТипШтрихкода 	= Перечисления.ТипыШтрихкодов.GS1_DataMatrix;
	Штрихкод.ТипУпаковки 	= Перечисления.ТипыУпаковок.МаркированныйТовар;
	Штрихкод.Количество	    = 1;
	Штрихкод.ДатаУпаковки 	= ТекущаяДата();
	
	Штрихкод.Записать(); 
	
	Возврат Штрихкод.Ссылка;   	
	
КонецФункции

//  Получить таблицу марок
Процедура ПолучитьТаблицуМарокСписанных(Параметры)
	
	ERPData		 = Параметры.ERPData;
	ТаблицаМарок = РазметитьТаблицуМарок();
	НаименованияРеквизитов = "ВестиУчетПоСериям, ВестиУчетПоХарактеристикам";
	
	EmeWmsERPEngine.SelectChild(ERPData, "sscc");
	Пока EmeWmsERPEngine.NextChildLine(ERPData) Цикл  
		ТоварСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаТовар(ERPData.sscc.goods_id);
		Если ТоварСсылка.Пустая() Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "GDSBAD");
			Продолжить
		КонецЕсли;            
		
		РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТоварСсылка, НаименованияРеквизитов);
		
		Если НЕ EmeWmsУтилиты.ПродукцияМаркируемаяДляГИСМ(ТоварСсылка) Тогда 
			Продолжить;
		КонецЕсли;
		
		СерияНоменклатуры 		   	= Неопределено;
		ХарактеристикаНоменклатуры 	= Неопределено;
		
		// Серия или Характеристика			
		Если РеквизитыНоменклатуры.ВестиУчетПоСериям Тогда   
			СерияНоменклатуры = EmeWmsУтилиты.ПолучитьСериюПоНомеру(ERPData.sscc.lot_no, ТоварСсылка);
		Иначе                  
			Если РеквизитыНоменклатуры.ВестиУчетПоХарактеристикам Тогда      
				ХарактеристикаНоменклатуры = EmeWmsУтилиты.ПолучитьХарактеристикуПоНаименованию(ERPData.sscc.lot_no, ТоварСсылка);
			КонецЕсли;                           
		КонецЕсли;                           
					
		КодМарки = ERPData.sscc.true_sign;
		Если ЗначениеЗаполнено(КодМарки) Тогда
			СтрокаМарки = ТаблицаМарок.Добавить();
			СтрокаМарки.Номенклатура 	  = ТоварСсылка;
			СтрокаМарки.Характеристика 	  = ХарактеристикаНоменклатуры;
			СтрокаМарки.Серия 			  = СерияНоменклатуры;
			СтрокаМарки.Упаковка 		  = EmeWmsУтилиты.ПолучитьБазовуюЕдиницуИзмерения(ТоварСсылка);
			СтрокаМарки.Количество		  = ERPData.sscc.quantity;
			СтрокаМарки.ЗначениеШтрихкода = EmeWmsУтилиты.КодМаркиВЗначениеСоСкобками(КодМарки);
			СтрокаМарки.ШтрихкодКороба	  = EmeWmsУтилиты.КодМаркиВЗначениеСоСкобками(ERPData.sscc.box_sscc);
			СтрокаМарки.ШтрихкодПаллеты   = EmeWmsУтилиты.КодМаркиВЗначениеСоСкобками(ERPData.sscc.pallet_sscc);			
		КонецЕсли;
	КонецЦикла;	
		
	Параметры.Вставить("ТаблицаМарок", ТаблицаМарок);

	// Тестирование Интеграции марок, подберем случайным образом необходиоме количество марок по Номенклатуре
	// ТестированиеИмпортаМарок(Параметры);
	
КонецПроцедуры

//	Создает таблицу для отгруженных марок ЧЗ из sscc сообщения despatch
Функция РазметитьТаблицуМарок()
	ТаблицаМарок = Новый ТаблицаЗначений;
	ТаблицаМарок.Колонки.Добавить("Номенклатура");
	ТаблицаМарок.Колонки.Добавить("Характеристика");
	ТаблицаМарок.Колонки.Добавить("Упаковка");
	ТаблицаМарок.Колонки.Добавить("Серия");
	ТаблицаМарок.Колонки.Добавить("Количество");
	ТаблицаМарок.Колонки.Добавить("ЗначениеШтрихкода");
	ТаблицаМарок.Колонки.Добавить("ШтрихкодКороба");
	ТаблицаМарок.Колонки.Добавить("ШтрихкодПаллеты");
	
	Возврат ТаблицаМарок;
КонецФункции

#КонецОбласти

#Область ТестированиеМарокЧЗ 

//	Сгенерировать штрихкоды упаковок
Процедура СгенерироватьШтрихкодыУпаковкок(Параметры)         
	
	ГСЧ = Новый ГенераторСлучайныхЧисел(День(ТекущаяДата())*84600 + Час(ТекущаяДата())*3600 + Минута(ТекущаяДата())*60 + Секунда(ТекущаяДата()));	
	
	//	Минимальное количество генерируемых марок
	Количество  = ?(Параметры.СтрокаТовара.Количество > 10, 10, Параметры.СтрокаТовара.Количество * Параметры.СтрокаТовара.Коэффициент);
		
	//	Значение штрихкода короба должно быть уникальным (15 попыток получить уникальный ШК)
	Для н = 1 По 15 Цикл
		ШККороба = СоздатьРандомныйШК(ГСЧ);				
		ШКСсылка = Справочники.ШтрихкодыУпаковокТоваров.НайтиПоРеквизиту("ЗначениеШтрихкода", ШККороба);
		
		Если НЕ ЗначениеЗаполнено(ШКСсылка) Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла; 

	
	Для МаркаПоТовару = 1 По Количество Цикл
		
		Если Не EmeWmsУтилиты.ПродукцияМаркируемаяДляГИСМ(Параметры.СтрокаТовара.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		//	Значение штрихкода должно быть уникальным (15 попыток получить уникальный ШК)
		Для н = 1 По 15 Цикл
			ШКМарки  = СоздатьРандомныйШК(ГСЧ);				
			ШКСсылка = Справочники.ШтрихкодыУпаковокТоваров.НайтиПоРеквизиту("ЗначениеШтрихкода", ШКМарки);
			
			Если НЕ ЗначениеЗаполнено(ШКСсылка) Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла; 
		
		Если ЗначениеЗаполнено(ШКСсылка) Тогда
			ТекстСообщения = НСтр("ru='Штрихкоды упаковок не заполнены, дублируются номера Штрихкода'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		Параметры.Вставить("ЗначениеШтрихкода", ШКМарки);
		
		//	Пераые три марки упакуем в короб
		Если МаркаПоТовару < 4 Тогда
			Параметры.Вставить("ШтрихкодКороба", ШККороба);
		Иначе
			Параметры.Вставить("ШтрихкодКороба", "");
		КонецЕсли;
		
		СоздатьНовыйШКВСправочнике(Параметры);		
		
	КонецЦикла;
	
	Параметры.Удалить("ЗначениеШтрихкода");
	Параметры.Удалить("ШтрихкодКороба");
		
КонецПроцедуры

//	Записать в справочник новый штрихкод упаковки
Процедура СоздатьНовыйШКВСправочнике(Параметры)
	
	НовыйЭлемент = Справочники.ШтрихкодыУпаковокТоваров.СоздатьЭлемент(); 

	ЗаполнитьЗначенияСвойств(НовыйЭлемент, Параметры.СтрокаТовара);
	
	Если ЗначениеЗаполнено(Параметры.СтрокаТовара.ЕдиницаИзмерения) Тогда
		НовыйЭлемент.Упаковка = Параметры.СтрокаТовара.ЕдиницаИзмерения;
	Иначе
		НовыйЭлемент.Упаковка = EmeWmsУтилиты.ПолучитьБазовуюЕдиницуИзмерения(Параметры.СтрокаТовара.Номенклатура);
	КонецЕсли;

	НовыйЭлемент.ЗначениеШтрихкода	= Параметры.ЗначениеШтрихкода;
	НовыйЭлемент.ТипШтрихкода		= Перечисления.ТипыШтрихкодов.GS1_DataMatrix;
	НовыйЭлемент.ТипУпаковки        = Перечисления.ТипыУпаковок.МаркированныйТовар;
	НовыйЭлемент.Количество			= 1;
	НовыйЭлемент.ДатаУпаковки 	 	= ТекущаяДата();
	НовыйЭлемент.Записать();	

	СтрокаМарки = Параметры.ТаблицаМарок.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаМарки, НовыйЭлемент);
	СтрокаМарки.ШтрихкодКороба = Параметры.ШтрихкодКороба; 
	
КонецПроцедуры

//	Сгенерировать случайный штрихкод
Функция СоздатьРандомныйШК(ГСЧ)
	
	СтрокаЦифр = "0123456789";
	СтрокаБукв = "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWYZ,-.!?%></;*'_+=()";
	
	// (01)04602443466045(21)P=uxqUQfzw'Ut
	СтрокаШК = "(01)";
	Для инд1 = 1 По 14 Цикл                         
		Позиция1 = ГСЧ.СлучайноеЧисло(1,10);
		СтрокаШК = СтрокаШК + Сред(СтрокаЦифр, Позиция1, 1);
	КонецЦикла;
	СтрокаШК = СтрокаШК + "(21)";
	Для инд1 = 1 По 13 Цикл
		Позиция1 = ГСЧ.СлучайноеЧисло(1, СтрДлина(СтрокаБукв));
		СтрокаШК = СтрокаШК + Сред(СтрокаБукв, Позиция1, 1);
	КонецЦикла; 
	
	Возврат СтрокаШК;
	
КонецФункции    

//	Тестирование Интеграции марок, подберем случайным образом необходиоме количество марок по Номенклатуре
Процедура ТестированиеИмпортаМарок(Параметры)
	
	Если ЗначениеЗаполнено(Параметры.ТаблицаМарок) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТовара Из Параметры.ЗаказОбъект.Товары Цикл
		Если Не EmeWmsУтилиты.ПродукцияМаркируемаяДляГИСМ(СтрокаТовара.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;  
		
		Если ЗначениеЗаполнено(СтрокаТовара.ЕдиницаИзмерения) Тогда
			Упаковка = СтрокаТовара.ЕдиницаИзмерения;
		Иначе
			Упаковка = EmeWmsУтилиты.ПолучитьБазовуюЕдиницуИзмерения(СтрокаТовара.Номенклатура);
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписаниеТоваровШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки
		|ПОМЕСТИТЬ ВТ_ШтрихкодыУпаковок
		|ИЗ
		|	Документ.СписаниеТоваров.ШтрихкодыУпаковок КАК СписаниеТоваровШтрихкодыУпаковок
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ШтрихкодУпаковки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ &КоличествоМарок
		|	ШтрихкодыУпаковокТоваров.Номенклатура КАК Номенклатура,
		|	ШтрихкодыУпаковокТоваров.Характеристика КАК Характеристика,
		|	ШтрихкодыУпаковокТоваров.Упаковка КАК Упаковка,
		|	ШтрихкодыУпаковокТоваров.Серия КАК Серия,
		|	ШтрихкодыУпаковокТоваров.Количество КАК Количество,
		|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода КАК ЗначениеШтрихкода
		|ИЗ
		|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ШтрихкодыУпаковок КАК ВТ_ШтрихкодыУпаковок
		|		ПО ШтрихкодыУпаковокТоваров.Ссылка = ВТ_ШтрихкодыУпаковок.ШтрихкодУпаковки
		|ГДЕ
		|	ВТ_ШтрихкодыУпаковок.ШтрихкодУпаковки ЕСТЬ NULL
		|	И НЕ ШтрихкодыУпаковокТоваров.ПометкаУдаления
		|	И ШтрихкодыУпаковокТоваров.Номенклатура = &Номенклатура
		|	И ШтрихкодыУпаковокТоваров.Характеристика = &Характеристика
		|	И ШтрихкодыУпаковокТоваров.Упаковка = &Упаковка
		|	И ШтрихкодыУпаковокТоваров.Серия = &Серия
		|	И ШтрихкодыУпаковокТоваров.ТипУпаковки = &ТипУпаковки
		|	И ШтрихкодыУпаковокТоваров.ТипШтрихкода = &ТипШтрихкода";
				
		КоличествоМарок = ?(СтрокаТовара.Количество > 10, 10, СтрокаТовара.Количество * СтрокаТовара.Коэффициент);                		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&КоличествоМарок", СтрЗаменить(Строка(КоличествоМарок), Символы.НПП, "")); 
		
		Запрос.УстановитьПараметр("Номенклатура", 	 СтрокаТовара.Номенклатура);
		Запрос.УстановитьПараметр("Характеристика",  СтрокаТовара.ХарактеристикаНоменклатуры);
		Запрос.УстановитьПараметр("Упаковка", 		 Упаковка);
		Запрос.УстановитьПараметр("Серия", 			 СтрокаТовара.СерияНоменклатуры);
		Запрос.УстановитьПараметр("ТипУпаковки", 	 Перечисления.ТипыУпаковок.МаркированныйТовар);
		Запрос.УстановитьПараметр("ТипШтрихкода", 	 Перечисления.ТипыШтрихкодов.GS1_DataMatrix);
	
		РезультатЗапроса = Запрос.Выполнить();   
		
		Если РезультатЗапроса.Пустой() Тогда         
			Параметры.Вставить("СтрокаТовара", СтрокаТовара);
			СгенерироватьШтрихкодыУпаковкок(Параметры);
			Продолжить;
		КонецЕсли;
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтрокаМарки = Параметры.ТаблицаМарок.Добавить();
            ЗаполнитьЗначенияСвойств(СтрокаМарки, ВыборкаДетальныеЗаписи);
		КонецЦикла;
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти



