
// #Область СлужебныеПеременныеИМетодыФормы

&НаКлиенте
Перем КэшМодуляКлиента;

&НаКлиенте
Перем РезультатЗапроса;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		Результат = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		Результат = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

// #КонецОбласти

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Сервис = Параметры.Сервис;
	ТипОперации = Параметры.ТипОперации;
	Организация = Параметры.Организация;
	
	Если Не ЗначениеЗаполнено(Сервис) Тогда
		Сервис = МодульОбъекта().СервисПодпискиПоТипуОперации(ТипОперации);
	КонецЕсли;
	
	МодульОбъекта().Метрика_ОграничениеТарифа(Организация, Сервис, ТипОперации);
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПодробнееНажатие(Элемент)
	
	МодульКлиента().ОткрытьИнформациюОТарифах();
	
КонецПроцедуры

// #КонецОбласти
