
// #Область СлужебныеПеременныеИМетодыФормы

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		Результат = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		Результат = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

// #КонецОбласти

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Ссылка", Ссылка);
	Параметры.Свойство("ПримерЭтикетки", ПримерЭтикетки);
	Параметры.Свойство("СсылкаДляКопирования", СсылкаДляКопирования);
	
	ЗаполнитьДанныеФормы();
	УстановитьЗаголовокФормы();
	ОбновитьДеревоПараметров();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	МодульКлиента().СохранитьИзмененияНаФорме("ЗаписатьИЗакрыть", ЭтаФорма, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьШаблон(Команда)
	
	Если Не МодульКлиента().ПроверитьУстановленнуюВерсиюМодуля() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	Если Не МодульКлиента().ПроверитьУстановленнуюВерсиюМодуля() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Записать();
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиПараметров(Команда)
	
	МодульКлиента().ОткрытьФормуНастроекМодуля(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПараметры(Команда)
	
	ОбновитьДеревоПараметров();
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТипЭтикеткиПриИзменении(Элемент)
	
	ОбновитьДеревоПараметров();
	
КонецПроцедуры

&НаКлиенте
Процедура МакетЭтикеткиПередЗаписью(Элемент, Копирование, Отказ)
	
	Отказ = Истина;
	
	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПараметровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	ТекущаяОбласть = МакетЭтикетки.ТекущаяОбласть;
	
	Если ТипЗнч(ТекущаяОбласть)<> Тип("ОбластьЯчеекТабличногоДокумента") Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущаяОбласть.Верх = 0
		И ТекущаяОбласть.Низ = 0
		И ТекущаяОбласть.Лево = 0
		И ТекущаяОбласть.Право = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ВидЗначения = "Картинка" Тогда
		ВставитьКартинку(ТекущаяОбласть, ТекущиеДанные.Имя);
	Иначе
		ТекущаяОбласть.Объединить();
		ТекущаяОбласть.Текст = ТекущиеДанные.Имя;
		ТекущаяОбласть.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Параметр;
		ТекущаяОбласть.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МакетЭтикеткиВыбор(Элемент, Область, СтандартнаяОбработка)
	
	Если ТипЗнч(Область) <> Тип("РисунокТабличногоДокумента") Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКартинки = Область.Имя;
	ПараметрыШтрихкода = ПараметрыШтрихкода(ИмяКартинки);
	ЗаголовокРедактора = НСтр("ru = 'Параметры штрихкода'");
	РазрешитьРедактирование = Истина;
	
	Если Не ЗначениеЗаполнено(ПараметрыШтрихкода) Тогда
		Возврат;
	КонецЕсли;
	
	Обработчик = МодульКлиента().ОписаниеОбработчикаОповещения(
	"ПослеРедактированияПараметровШтрихкода", ЭтаФорма, ИмяКартинки);
	
	МодульКлиента().ОткрытьФормуПросмотраСтруктуры(ЭтаФорма
	, ПараметрыШтрихкода
	, ЗаголовокРедактора
	, РазрешитьРедактирование
	, Обработчик);
	
КонецПроцедуры

&НаКлиенте
Процедура ШиринаСтраницыПриИзменении(Элемент)
	
	УстановитьРазмерЭтикетки();
	
КонецПроцедуры

&НаКлиенте
Процедура ВысотаСтраницыПриИзменении(Элемент)
	
	УстановитьРазмерЭтикетки();
	
КонецПроцедуры

&НаКлиенте
Процедура РазмерЯчейкиПриИзменении(Элемент)
	
	УстановитьРазмерЭтикетки();
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеРедактированияПараметровШтрихкода(НовыеПараметры, ИмяКартинки) Экспорт
	
	Если Не ЗначениеЗаполнено(НовыеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	ТипКартинки = ТипКартинки(ИмяКартинки);
	ПараметрыШтрихкода = ПараметрыШтрихкодов[ТипКартинки];
	
	ЗаполнитьЗначенияСвойств(ПараметрыШтрихкодов[ТипКартинки], НовыеПараметры);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокФормы()
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		СтрокаЗаголовка = СокрЛП(Ссылка);
	ИначеЕсли ЗначениеЗаполнено(СсылкаДляКопирования) Тогда
		СтрокаЗаголовка = НСтр("ru = 'Копирование'");
	ИначеЕсли ЗначениеЗаполнено(ПримерЭтикетки) Тогда
		СтрокаЗаголовка = НСтр("ru = 'Создание из примера'");
	Иначе
		СтрокаЗаголовка = НСтр("ru = 'Создание'");
	КонецЕсли;
	
	Заголовок = МодульОбъекта().ПараметрыВСтроку(НСтр(
	"ru = 'Шаблон этикетки: %1'"), СтрокаЗаголовка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормы()
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		
		ОписаниеШаблона = МодульОбъекта().ШаблонЭтикетки_Прочитать(Ссылка);
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ОписаниеШаблона);
		УстановитьОбластьПечати(МакетЭтикетки.ШиринаТаблицы, МакетЭтикетки.ВысотаТаблицы);
		
	ИначеЕсли ЗначениеЗаполнено(СсылкаДляКопирования) Тогда
		
		ОписаниеШаблона = МодульОбъекта().ШаблонЭтикетки_Прочитать(СсылкаДляКопирования);
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ОписаниеШаблона, , "Ссылка");
		УстановитьОбластьПечати(МакетЭтикетки.ШиринаТаблицы, МакетЭтикетки.ВысотаТаблицы);
		
	ИначеЕсли ЗначениеЗаполнено(ПримерЭтикетки) Тогда
		
		ОписаниеШаблона = МодульОбъекта().ШаблонЭтикетки_ПрочитатьПример(ПримерЭтикетки);
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ОписаниеШаблона);
		УстановитьОбластьПечати(МакетЭтикетки.ШиринаТаблицы, МакетЭтикетки.ВысотаТаблицы);
		
	Иначе
		
		ПараметрыШтрихкодов = МодульОбъекта().Новый_ПараметрыШтрихкодовЭтикетки();
		РазмерыЭтикетки = МодульОбъекта().ШаблонЭтикетки_РазмерыЭтикеткиПоУмолчанию();
		ЗаполнитьЗначенияСвойств(ЭтаФорма, РазмерыЭтикетки);
		ЗаполнитьЗначенияСвойств(МакетЭтикетки, РазмерыЭтикетки);
		УстановитьРазмерЭтикетки();
		
	КонецЕсли;
	
	Если РазмерЯчейки = 0 Тогда
		РазмерЯчейки = 2;
	КонецЕсли;
	
	Если ШиринаСтраницы = 0 Тогда
		ШиринаСтраницы = МакетЭтикетки.ШиринаСтраницы;
		ВысотаСтраницы = МакетЭтикетки.ВысотаСтраницы;
	Иначе
		МакетЭтикетки.ШиринаСтраницы = ШиринаСтраницы;
		МакетЭтикетки.ВысотаСтраницы = ВысотаСтраницы;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Записать()
	
	ЗаписатьНаСервере();
	
	Оповестить("КонтурМаркировка_ШаблонЭтикетки_Изменен", Ссылка);
	
	ОповеститьОбИзменении(Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	ОписаниеШаблона = МодульОбъекта().Новый_ШаблонЭтикетки();
	ЗаполнитьЗначенияСвойств(ОписаниеШаблона, ЭтаФорма, , "МакетЭтикетки");
	ОписаниеШаблона.МакетЭтикетки = МакетЭтикеткиДляХранения();
	
	Ссылка = МодульОбъекта().ШаблонЭтикетки_Записать(ОписаниеШаблона);
	
	Модифицированность = Ложь;
	
	ЗаполнитьДанныеФормы();
	УстановитьЗаголовокФормы();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьРазмерЭтикетки()
	
	Если ШиринаСтраницы < 0
		Или ВысотаСтраницы < 0
		Или РазмерЯчейки < 0 Тогда
		Возврат;
	КонецЕсли;
	
	МакетЭтикетки.Очистить();
	
	МакетЭтикетки.РазмерСтраницы = "Custom";
	МакетЭтикетки.ШиринаСтраницы = ШиринаСтраницы;
	МакетЭтикетки.ВысотаСтраницы = ВысотаСтраницы;
	
	РазмерЭталоннойЯчейки = МодульОбъекта().Этикетки_РазмерЭталоннойЯчейкиВМиллиметрах();
	
	МинимальныйШагВысоты = 0.25;
	МинимальныйШагШирины = 0.125;
	
	ШаговПоШиринеВМиллиметре = 0;
	Пока ШаговПоШиринеВМиллиметре * РазмерЭталоннойЯчейки.ШиринаЯчейки0125мм < 1 Цикл
		ШаговПоШиринеВМиллиметре = ШаговПоШиринеВМиллиметре + 1;
	КонецЦикла;
	ШаговПоШиринеВМиллиметре = ШаговПоШиринеВМиллиметре - 1;
	ШагПоШиринеНаМиллиметр = МинимальныйШагШирины * ШаговПоШиринеВМиллиметре;
	РасчетнаяШиринаКолонки = ШагПоШиринеНаМиллиметр * РазмерЯчейки;
	
	ШаговПоВысотеВМиллиметре = 0;
	Пока ШаговПоВысотеВМиллиметре * РазмерЭталоннойЯчейки.ВысотаЯчейки025мм < 1 Цикл
		ШаговПоВысотеВМиллиметре = ШаговПоВысотеВМиллиметре + 1;
	КонецЦикла;
	ШаговПоВысотеВМиллиметре = ШаговПоВысотеВМиллиметре - 1;
	ШагПоВысотеНаМиллиметр = МинимальныйШагВысоты * ШаговПоВысотеВМиллиметре;
	РасчетнаяВысотаСтроки = ШагПоВысотеНаМиллиметр * РазмерЯчейки;
	
	ГенераторСлучайныхЧисел = Новый ГенераторСлучайныхЧисел;
	
	ШиринаСтраницыДляРасчета = ШиринаСтраницы;
	ВысотаСтраницыДляРасчета = ВысотаСтраницы - 0.5;
	
	ВсегоКолонок = Цел(ШиринаСтраницыДляРасчета / РазмерЯчейки);
	ВсегоСтрок = Цел(ВысотаСтраницыДляРасчета / РазмерЯчейки);
	
	Для НомерКолонки = 1 По ВсегоКолонок Цикл
		ОбластьКолонки = МакетЭтикетки.Область(, НомерКолонки, , НомерКолонки);
		ОбластьКолонки.ШиринаКолонки = РасчетнаяШиринаКолонки;
	КонецЦикла;
	
	Для НомерСтроки = 1 По ВсегоСтрок Цикл
		ОбластьСтроки = МакетЭтикетки.Область(НомерСтроки, , НомерСтроки);
		ОбластьСтроки.АвтоВысотаСтроки = Ложь;
		ОбластьСтроки.ВысотаСтроки = РасчетнаяВысотаСтроки;
	КонецЦикла;
	
	УстановитьОбластьПечати(ВсегоКолонок, ВсегоСтрок);
	МакетЭтикетки.ОбластьПечати.ЦветФона = Новый Цвет;
	МакетЭтикетки.ОбластьПечати.АвтоВысотаСтроки = Ложь;
	
	КартинкаПодгон = МакетЭтикетки.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
	КартинкаПодгон.Расположить(МакетЭтикетки.Область(МакетЭтикетки.ОбластьПечати.Имя));
	КартинкаПодгон.РазмерКартинки = РазмерКартинки.РеальныйРазмер;
	ФактическаяШиринаВмм = КартинкаПодгон.Ширина;
	ФактическаяВысотаВмм = КартинкаПодгон.Высота;
	МакетЭтикетки.Рисунки.Удалить(КартинкаПодгон);
	
	// Подогнать ширину для более точного соответствия реальным размерам
	НедостающаяШиринаВмм = ШиринаСтраницыДляРасчета - ФактическаяШиринаВмм;
	КоличествоКолонокДляИзменения = Цел(НедостающаяШиринаВмм
	/ ((ФактическаяШиринаВмм / ШиринаСтраницыДляРасчета) / ШаговПоШиринеВМиллиметре));
	
	Коэффициент = 1;
	КоличествоИзмененныхКолонок = 0;
	Пока КоличествоКолонокДляИзменения > 1 Цикл
		
		НомерКолонки = ГенераторСлучайныхЧисел.СлучайноеЧисло(1, ВсегоКолонок);
		ОбластьКолонки = МакетЭтикетки.Область(, НомерКолонки, , НомерКолонки);
		
		Если ОбластьКолонки.ШиринаКолонки = РасчетнаяШиринаКолонки + МинимальныйШагШирины * (Коэффициент - 1) Тогда
			ОбластьКолонки.ШиринаКолонки = РасчетнаяШиринаКолонки + МинимальныйШагШирины * Коэффициент;
			КоличествоКолонокДляИзменения = КоличествоКолонокДляИзменения - 1;
			КоличествоИзмененныхКолонок = КоличествоИзмененныхКолонок + 1;
		КонецЕсли;
		
		Если КоличествоИзмененныхКолонок = ВсегоКолонок Тогда
			КоличествоИзмененныхКолонок = 0;
			Коэффициент = Коэффициент + 1;
		КонецЕсли;
		
		Если КоличествоКолонокДляИзменения = 0 Тогда
			
			ФактическаяШиринаВмм = КартинкаПодгон.Ширина;
			НедостающаяШиринаВмм = ШиринаСтраницыДляРасчета - ФактическаяШиринаВмм;
			КоличествоКолонокДляИзменения = Цел(НедостающаяШиринаВмм
			/ ((ФактическаяШиринаВмм / ШиринаСтраницыДляРасчета) / ШаговПоШиринеВМиллиметре));
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Подогнать высоту для более точного соответствия реальным размерам
	НедостающаяВысотаВмм = ВысотаСтраницыДляРасчета - ФактическаяВысотаВмм;
	КоличествоСтрокДляИзменения = Цел(НедостающаяВысотаВмм
	/ ((ФактическаяВысотаВмм / ВысотаСтраницыДляРасчета) / ШаговПоВысотеВМиллиметре));
	
	Коэффициент = 1;
	КоличествоИзмененныхСтрок = 0;
	Пока КоличествоСтрокДляИзменения > 1 Цикл // -1 для того что бы не превысить реальные требуемые значения
		
		НомерСтроки = ГенераторСлучайныхЧисел.СлучайноеЧисло(1, ВсегоСтрок);
		ОбластьСтроки = МакетЭтикетки.Область(НомерСтроки, , НомерСтроки);
		
		Если ОбластьСтроки.ВысотаСтроки = РасчетнаяВысотаСтроки + МинимальныйШагВысоты * (Коэффициент - 1) Тогда
			ОбластьСтроки.ВысотаСтроки = РасчетнаяВысотаСтроки + МинимальныйШагВысоты * Коэффициент;
			КоличествоСтрокДляИзменения = КоличествоСтрокДляИзменения - 1;
			КоличествоИзмененныхСтрок = КоличествоИзмененныхСтрок + 1;
		КонецЕсли;
		
		Если КоличествоИзмененныхСтрок = ВсегоСтрок Тогда
			КоличествоИзмененныхСтрок = 0;
			Коэффициент = Коэффициент + 1;
		КонецЕсли;
		
		Если КоличествоСтрокДляИзменения = 0 Тогда
			
			ФактическаяВысотаВмм = КартинкаПодгон.Высота;
			НедостающаяВысотаВмм = ВысотаСтраницыДляРасчета - ФактическаяВысотаВмм;
			КоличествоСтрокДляИзменения = Цел(НедостающаяВысотаВмм
			/ ((ФактическаяВысотаВмм/ВысотаСтраницыДляРасчета) / ШаговПоВысотеВМиллиметре));
			
		КонецЕсли;
		
	КонецЦикла;
	
	МакетЭтикетки.Рисунки.Удалить(КартинкаПодгон);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДеревоПараметров()
	
	Дерево = РеквизитФормыВЗначение("ДеревоПараметров");
	
	Дерево.Строки.Очистить();
	
	Если Не ЗначениеЗаполнено(ТипЭтикетки) Тогда
		ЗначениеВРеквизитФормы(Дерево, "ДеревоПараметров");
		Возврат;
	КонецЕсли;
	
	МассивПараметров = МодульОбъекта().ШаблонЭтикетки_НастройкиПараметров(ТипЭтикетки);
	
	Для Каждого ПараметрШаблона ИЗ МассивПараметров Цикл
		
		Если ЗначениеЗаполнено(ПараметрШаблона.ИмяГруппы) Тогда
			
			СтрокаГруппы = Дерево.Строки.Найти(ПараметрШаблона.ИмяГруппы,"Имя");
			
			Если СтрокаГруппы = Неопределено Тогда
				СтрокаГруппы = Дерево.Строки.Добавить();
				СтрокаГруппы.Имя = ПараметрШаблона.ИмяГруппы;
				СтрокаГруппы.Представление = ПараметрШаблона.ИмяГруппы;
				СтрокаГруппы.ИндексКартинки = 0;
			КонецЕсли;
			
		Иначе
			
			СтрокаГруппы = Дерево;
			
		КонецЕсли;
		
		НоваяСтрока = СтрокаГруппы.Строки.Добавить();
		НоваяСтрока.Имя = ПараметрШаблона.Имя;
		НоваяСтрока.Представление = ПараметрШаблона.Представление;
		НоваяСтрока.ВидЗначения = ПараметрШаблона.ВидЗначения;
		НоваяСтрока.Перенести = "Разместить";
		
		Если ПараметрШаблона.ВидЗначения = "Картинка" Тогда
			Если ПараметрШаблона.Имя = "DataMatrix_Картинка" Тогда
				НоваяСтрока.ИндексКартинки = 1;
			ИначеЕсли ПараметрШаблона.Имя = "GTIN_Картинка" Тогда
				НоваяСтрока.ИндексКартинки = 2;
			Иначе
				НоваяСтрока.ИндексКартинки = 3;
			КонецЕсли;
		Иначе
			НоваяСтрока.ИндексКартинки = 5;
		КонецЕсли;
		
	КонецЦикла;
	
	НоваяСтрока = Дерево.Строки.Добавить();
	НоваяСтрока.Имя = "ПроизвольнаяКартинка";
	НоваяСтрока.Представление = "Произвольная картинка";
	НоваяСтрока.ИндексКартинки = 4;
	НоваяСтрока.ВидЗначения = "Картинка";
	НоваяСтрока.Перенести = "Разместить";
	
	ЗначениеВРеквизитФормы(Дерево, "ДеревоПараметров");
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьКартинку(Область, ИмяКартинки)
	
	НоваяКартинка = МакетЭтикетки.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
	НоваяКартинка.Картинка = Элементы[ИмяКартинки].Картинка;
	НоваяКартинка.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
	НоваяКартинка.РазмерКартинки = РазмерКартинки.Пропорционально;
	НоваяКартинка.ЦветФона = WebЦвета.Белый;
	
	Если ИмяКартинки <> "ПроизвольнаяКартинка" Тогда
		НоваяКартинка.Имя = ДобавитьНомерДубликатаКартинки(ИмяКартинки);
	КонецЕсли;
	
	НоваяКартинка.Расположить(Область);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОбластьПечати(Ширина, Высота)
	
	ОбластьПечати = МакетЭтикетки.Область(1, 1, Высота, Ширина);
	ОбластьСправа = МакетЭтикетки.Область(1, Ширина + 1, Высота, 200);
	ОбластьСнизу = МакетЭтикетки.Область(Высота + 1, 1, 200, 200);
	
	МакетЭтикетки.ОбластьПечати = ОбластьПечати;
	
	ОбластьСправа.ЦветФона = WebЦвета.Серый;
	ОбластьСнизу.ЦветФона = WebЦвета.Серый;
	
КонецПроцедуры

&НаСервере
Функция МакетЭтикеткиДляХранения()
	
	Результат = МакетЭтикетки.ПолучитьОбласть(МакетЭтикетки.ОбластьПечати.Имя);
	ЗаполнитьЗначенияСвойств(Результат, МакетЭтикетки);
	Результат.КлючПараметровПечати = Неопределено;
	Результат.ОбластьПечати = Неопределено;
	
	Если НРег(Результат.РазмерСтраницы) = "letter" Тогда
		// Letter - размер бумаги по умолчанию = А4
		// возникает, если вариант размера страницы неизвестен
		Результат.РазмерСтраницы = "Custom";
	КонецЕсли;
	
	Результат.ШиринаСтраницы = ШиринаСтраницы;
	Результат.ВысотаСтраницы = ВысотаСтраницы;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ДобавитьНомерДубликатаКартинки(ИмяКартинки)
	
	Результат = ИмяКартинки;
	
	Сч = 0;
	Пока НайтиРисунокМакетаЭтикетки(Результат) <> Неопределено Цикл
		Сч = Сч + 1;
		Результат = ИмяКартинки + "_Дубликат" + Формат(Сч, "ЧГ=0");
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция НайтиРисунокМакетаЭтикетки(ИмяКартинки)
	
	Результат = Неопределено;
	
	Для каждого Рисунок Из МакетЭтикетки.Рисунки Цикл
		Если Рисунок.Имя = ИмяКартинки Тогда
			Результат = Рисунок;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПараметрыШтрихкода(ИмяКартинки)
	
	ТипКартинки = ТипКартинки(ИмяКартинки);
	
	Результат = Неопределено;
	Если ЗначениеЗаполнено(ТипКартинки) Тогда
		Результат = ПараметрыШтрихкодов[ТипКартинки];
	КонецЕсли;
	
	Возврат Результат
	
КонецФункции

&НаКлиенте
Функция ТипКартинки(Знач ИмяКартинки)
	
	Поз = Найти(ИмяКартинки, "_");
	Если ЗначениеЗаполнено(Поз) Тогда
		ИмяКартинки = Лев(ИмяКартинки, Поз - 1);
	КонецЕсли;
	
	ТипыКартинок = Новый Соответствие;
	ТипыКартинок.Вставить("DataMatrix", "DataMatrix");
	ТипыКартинок.Вставить("GTIN", "GTIN");
	ТипыКартинок.Вставить("Агрегат", "Агрегат");
	ТипыКартинок.Вставить("GS1_128", "Агрегат");
	ТипыКартинок.Вставить("Code128", "Агрегат");
	ТипыКартинок.Вставить("SSCC", "Агрегат");
	
	Возврат ТипыКартинок[ИмяКартинки];
	
КонецФункции

// #КонецОбласти
