// #Область ОписаниеПеременных

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Попытка
		Результат = ВладелецФормы.МодульКлиента();
	Исключение
		Результат = ВзаимодействиеКонтурМаркировкаКлиент.МодульКонтурМаркировкаКлиент();
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СоздатьТаблицуТоваров();
	ЗаполнитьСпискиВыбора();
	
	Если Параметры.Свойство("Операция") И ЗначениеЗаполнено(Параметры.Операция) Тогда
		Ссылка = Параметры.Операция;
		ПрочитатьИнформациюПоОперации();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьЭлементыФормы();
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СсылкаПриИзменении(Элемент)
	
	ПрочитатьИнформациюПоОперации();
	НастроитьЭлементыФормы();
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьСкрытыеПоляПриИзменении(Элемент)
	
	НастроитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ТребуемоеДействиеПриИзменении(Элемент)
	
	ОбновленаОчередьОбмена = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредыдущееДействиеПриИзменении(Элемент)
	
	ОбновленаОчередьОбмена = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторДокументаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДлинаУИД = 36;
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПослеВводаИдентификатораДокументаВСервисе", ЭтаФорма, Элемент);
	МодульКлиента().ПоказатьДиалогВводаСтроки(ОписаниеОбработчика, Строка(ИдентификаторДокумента), "Введите идентификатор документа", ДлинаУИД);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаИдентификатораДокументаВСервисе(Результат, Элемент = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Или Строка(ИдентификаторДокумента) = Результат  Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма[Элемент.Имя] = Новый УникальныйИдентификатор(Результат);
	ОбновленаОчередьОбмена = Истина;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КлючСтрокиОперацииОснованияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(Ссылка)
		Или Не ЗначениеЗаполнено(ОперацияОснование) Тогда
		Возврат;
	КонецЕсли;
	
	ДлинаУИД = 36;
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ИзменитьКлючСтрокиОперацииОснованияПослеВвода", ЭтаФорма);
	МодульКлиента().ПоказатьДиалогВводаСтроки(ОписаниеОбработчика, Строка(КлючСтрокиОперацииОснования) , "Введите ключ строки основания", ДлинаУИД);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьКлючСтрокиОперацииОснованияПослеВвода(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат <> Строка(КлючСтрокиОперацииОснования) Тогда
		КлючСтрокиОперацииОснования = Новый УникальныйИдентификатор(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаВСервисеПриИзменении(Элемент)
	
	ОбновленаОчередьОбмена = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаОткрытие(Элемент, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		СтандартнаяОбработка = Ложь;
		МодульКлиента().ОткрытьФормуОперации(Ссылка, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументУчетаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(ДокументУчета) Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
	"ПослеВыбораСпособаОткрытияОбъекта"
	, ЭтаФорма
	, ДокументУчета);
	
	СпособыОткрытия = МодульКлиента().СписокСпособовОткрытияЗначения();
	МодульКлиента().ПоказатьДиалогВыбораИзМеню(ЭтаФорма, ОписаниеОбработчика, СпособыОткрытия, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОперацияОснованиеОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(ОперацияОснование) Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
	"ПослеВыбораСпособаОткрытияОбъекта"
	, ЭтаФорма
	, ОперацияОснование);
	
	СпособыОткрытия = МодульКлиента().СписокСпособовОткрытияЗначения();
	МодульКлиента().ПоказатьДиалогВыбораИзМеню(ЭтаФорма, ОписаниеОбработчика, СпособыОткрытия, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораСпособаОткрытияОбъекта(Результат, ДокументИлиОперация = Неопределено) Экспорт
	
	СпособыОткрытияЗначения = МодульКлиента().Перечисление_СпособыОткрытияЗначения();
	ТипДокументИлиОперация = ТипЗнч(ДокументИлиОперация);
	
	Если Результат.Представление = СпособыОткрытияЗначения.ВФормеОбъекта Тогда
		
		Если ТипДокументИлиОперация = Тип("СправочникСсылка.КонтурМаркировка_ДокументыУчета") Тогда
			МодульКлиента().ОткрытьФормуДокументаУчета(ДокументИлиОперация, ЭтаФорма);
		ИначеЕсли ТипДокументИлиОперация = Тип("СправочникСсылка.КонтурМаркировка_Операции") Тогда
			МодульКлиента().ОткрытьФормуОперации(ДокументИлиОперация, ЭтаФорма);
		Иначе
			Возврат;
		КонецЕсли;
		
	Иначе
		
		Если ТипДокументИлиОперация = Тип("СправочникСсылка.КонтурМаркировка_ДокументыУчета") Тогда
			МодульКлиента().ОткрытьФормуРедактораДокументаУчета(ДокументИлиОперация, ЭтаФорма);
		ИначеЕсли ТипДокументИлиОперация = Тип("СправочникСсылка.КонтурМаркировка_Операции") Тогда
			МодульКлиента().ОткрытьФормуРедактораОперации(ДокументИлиОперация, ЭтаФорма);
		Иначе
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьДанные(Команда)
	
	Если Модифицированность Тогда
		
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("СохранитьИзмененияПослеСогласия", ЭтаФорма);
		МодульКлиента().ПодтвердитьДействияТехническогоСпециалиста(ОписаниеОбработчика);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИзмененияПослеСогласия(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьДанныеНаСервере();
	НастроитьЭлементыФормы();
	
	Модифицированность = Ложь;
	ОбновленыДопРеквизиты = Ложь;
	ОбновленаОчередьОбмена = Ложь;
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнформациюИзИБ(Команда)
	
	ПрочитатьИнформациюПоОперации();
	НастроитьЭлементыФормы();
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьПодчиненныеОперацииИзИБ(Команда)
	
	ЗаполнитьПодчиненныеОперации(Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПредыдущееДействие(Команда)
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПроверитьМодифицированность() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПредыдущееДействие) Тогда
		
		ТекстОшибки = НСтр("ru = 'Не найдено предыдущее действие!'");
		МодульКлиента().СообщитьПользователюЛок(ТекстОшибки);
		Возврат;
		
	КонецЕсли;
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("УстановитьПредыдущееДействиеПослеСогласия", ЭтаФорма, Ссылка);
	МодульКлиента().ПодтвердитьДействияТехническогоСпециалиста(ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПредыдущееДействиеПослеСогласия(Результат, Операция = Неопределено) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьТребуемоеДействиеОперацийНаСервере(Операция);
	ЗаполнитьДанныеОчередиОбмена(Операция);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОсновнуюФорму(Команда)
	
	МодульКлиента().ОткрытьФормуАдминистратораМаркировки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНовоеСвязанноеОкно(Команда)
	
	МодульКлиента().ОткрытьФормуРедактораОперации(, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПредыдущееДействиеОпераций(Команда)
	
	ВыделенныеОперации = ВыделенныеПодчиненныеОперации();
	Если Не ЗначениеЗаполнено(ВыделенныеОперации) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьТребуемоеДействиеОперацийНаСервере(ВыделенныеОперации);
	ЗаполнитьПодчиненныеОперации(Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТребуемоеДействиеОпераций(Команда)
	
	ВыделенныеОперации = ВыделенныеПодчиненныеОперации();
	Если Не ЗначениеЗаполнено(ВыделенныеОперации) Тогда
		Возврат;
	КонецЕсли;
	
	ТребуемыеДействия = МодульКлиента().Перечисление_ТребуемыеДействия();
	
	СписокВыбора = Новый СписокЗначений;
	МодульКлиента().ЗаполнитьСписокВыбора(СписокВыбора, ТребуемыеДействия);
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("УстановитьТребуемоеДействиеПослеВыбора", ЭтаФорма, ВыделенныеОперации);
	
	МодульКлиента().ПоказатьДиалогВыбораЗначенияВСписке(ОписаниеОбработчика
	, СписокВыбора
	, НСтр("ru = 'Выберите требуемое действие'"));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТребуемоеДействиеПослеВыбора(Результат, ВыделенныеОперации = Неопределено) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьТребуемоеДействиеОперацийНаСервере(ВыделенныеОперации, Результат.Значение);
	ЗаполнитьПодчиненныеОперации(Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьИзОчередиОбмена(Команда)
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПроверитьМодифицированность() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТребуемоеДействие) Тогда
		ТекстОшибки = НСтр("ru = 'Не найдена задача в очереди обмена.'");
		МодульКлиента().СообщитьПользователюЛок(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("УдалитьОперацииИзОчередиОбменаПослеСогласия", ЭтаФорма, Ссылка);
	МодульКлиента().ПодтвердитьДействияТехническогоСпециалиста(ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьОперацииИзОчередиОбмена(Команда)
	
	ВыделенныеОперации = ВыделенныеПодчиненныеОперации();
	Если Не ЗначениеЗаполнено(ВыделенныеОперации) Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("УдалитьОперацииИзОчередиОбменаПослеСогласия", ЭтаФорма, ВыделенныеОперации);
	МодульКлиента().ПодтвердитьДействияТехническогоСпециалиста(ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьОперацииИзОчередиОбменаПослеСогласия(Результат, Операции = Неопределено)
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьОперацииИзОчередиОбменаНаСервере(Операции);
	
	Если ТипЗнч(Операции) = Тип("Массив") Тогда
		ЗаполнитьПодчиненныеОперации(Ссылка);
	Иначе
		ЗаполнитьДанныеОчередиОбмена(Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтатусыОпераций(Команда)
	
	ВыделенныеОперации = ВыделенныеПодчиненныеОперации();
	Если Не ЗначениеЗаполнено(ВыделенныеОперации) Тогда
		Возврат;
	КонецЕсли;
	
	СтатусыОпераций = МодульКлиента().Перечисление_СтатусыОпераций();
	
	СписокВыбора = Новый СписокЗначений;
	МодульКлиента().ЗаполнитьСписокВыбора(СписокВыбора, СтатусыОпераций);
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ИзменитьСтатусыОперацийПослеВыбораСтатуса", ЭтаФорма, ВыделенныеОперации);
	
	МодульКлиента().ПоказатьДиалогВыбораЗначенияВСписке(ОписаниеОбработчика
	, СписокВыбора
	, НСтр("ru = 'Выберите статус операций'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтатусыОперацийПослеВыбораСтатуса(Результат, Операции = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИзменитьСтатусыОперацийНаСервере(Операции, Результат.Значение);
	ЗаполнитьПодчиненныеОперации(Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотретьКодыОшибки(Команда)
	
	АдресТаблицы = ПоместитьКодыМаркировкиОшибкиВХранилище();
	
	Если ЗначениеЗаполнено(АдресТаблицы) Тогда
		МодульКлиента().ОткрытьФормуПросмотраТаблицы(ЭтаФорма, АдресТаблицы, Истина);
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовТаблицыФормыДопРеквизиты

&НаКлиенте
Процедура ДопРеквизитыПриИзменении(Элемент)
	
	ОбновленыДопРеквизиты = Истина;
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	
	ОбновленыТовары = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Стр = Элемент.ДанныеСтроки(ВыбраннаяСтрока);
	
	Если Поле = Элементы.ТоварыАльтернативныеСрокиГодности Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Товар", Стр.Товар);
		ПараметрыФормы.Вставить("ДатаПроизводства", Стр.ДатаПроизводства);
		ПараметрыФормы.Вставить("АльтернативныеСрокиГодности", Стр.АльтернативныеСрокиГодности);
		ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
		
		МодульКлиента().ОткрытьАльтернативныеСрокиГодности(ЭтаФорма, ПараметрыФормы);
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ПодчиненныеОперацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеСтроки = ПодчиненныеОперации.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
	"ПослеВыбораСпособаОткрытияПодчиненнойОперации"
	, ЭтаФорма
	, ДанныеСтроки.Операция);
	
	СпособыОткрытия = МодульКлиента().СписокСпособовОткрытияЗначения();
	МодульКлиента().ПоказатьДиалогВыбораИзМеню(ЭтаФорма, ОписаниеОбработчика, СпособыОткрытия, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораСпособаОткрытияПодчиненнойОперации(Результат, Операция = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СпособыОткрытияЗначения = МодульКлиента().Перечисление_СпособыОткрытияЗначения();
	
	Если Результат.Представление = СпособыОткрытияЗначения.ВФормеОбъекта Тогда
		МодульКлиента().ОткрытьФормуОперации(Операция, ЭтаФорма);
	Иначе
		МодульКлиента().ОткрытьФормуРедактораОперации(Операция, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

// ПриСозданииНаСервере

&НаСервере
Процедура ЗаполнитьСпискиВыбора()
	
	СтатусыОпераций = МодульОбъекта().Перечисление_СтатусыОпераций();
	МодульОбъекта().ЗаполнитьСписокВыбора(Элементы.ОсновнойСтатус.СписокВыбора, СтатусыОпераций);
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	МодульОбъекта().ЗаполнитьСписокВыбора(Элементы.ТипОперации.СписокВыбора, ТипыОпераций);
	
	ТребуемыеДействия = МодульОбъекта().Перечисление_ТребуемыеДействия();
	МодульОбъекта().ЗаполнитьСписокВыбора(Элементы.ТребуемоеДействие.СписокВыбора, ТребуемыеДействия);
	МодульОбъекта().ЗаполнитьСписокВыбора(Элементы.ПредыдущееДействие.СписокВыбора, ТребуемыеДействия);
	
КонецПроцедуры

// При Открытии

&НаКлиенте
Процедура НастроитьЭлементыФормы()
	
	НастроитьВидимость();
	УстановитьЗаголовок();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимость()
	
	Элементы.ПодменюОбновитьДанные.Доступность = ЗначениеЗаполнено(Ссылка);
	
	НастроитьВидимость_ОписаниеОшибки();
	НастроитьВидимость_Товары();
	
	НастроитьОтбор_ДопРеквизиты();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовок()
	
	ШаблонЗаголовка = НСтр("ru='Контур.Маркировка (Администратор) Редактор операции: %1'");
	ЭтаФорма.Заголовок = МодульКлиента().ПараметрыВСтроку(ШаблонЗаголовка, Ссылка);
	
КонецПроцедуры

// Команды

&НаСервере
Функция ПоместитьКодыМаркировкиОшибкиВХранилище()
	
	Результат = Неопределено;
	
	КодыОшибки = Новый Массив;
	
	ПустойУИД = МодульОбъекта().НовыйПустойУникальныйИдентификатор();
	ТаблицаКодов = МодульОбъекта().КодыОпераций_Прочитать(Ссылка);
	
	СтрКлючКода = ДопРеквизиты.Выгрузить().Найти("КлючКода", "Ключ");
	Если ЗначениеЗаполнено(СтрКлючКода.Значение)
		И СтрКлючКода.Значение <> ПустойУИД
		И ТаблицаКодов.Найти(СтрКлючКода.Значение, "КлючКода") = Неопределено Тогда
		ТаблицаКодов.Добавить()["КлючКода"] = СтрКлючКода.Значение;
	КонецЕсли;
	
	МодульОбъекта().ТаблицаКодов_ДобавитьКлючиВсехВложенныхКодов(ТаблицаКодов);
	МодульОбъекта().КодыМаркировки_Прочитать(ТаблицаКодов);
	
	Для Каждого Стр Из ТаблицаКодов Цикл
		
		Если Найти(ОписаниеОшибки, Стр.КодМаркировки) <> 0 Тогда
			КодыОшибки.Добавить(Стр);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(КодыОшибки) Тогда
		
		ТаблицаКодовОшибки = ТаблицаКодов.Скопировать(КодыОшибки);
		Результат = ПоместитьВоВременноеХранилище(ТаблицаКодовОшибки, ЭтаФорма.УникальныйИдентификатор);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура УстановитьТребуемоеДействиеОперацийНаСервере(Операции, ТребуемоеДействие = Неопределено) Экспорт
	
	Для Каждого Операция Из МодульОбъекта().ЗначениеВМассиве(Операции) Цикл
		
		ОписаниеЗадачи = МодульОбъекта().Задача_Прочитать(Операция);
		
		Если Не ЗначениеЗаполнено(ОписаниеЗадачи) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТребуемоеДействие = Неопределено Тогда
			НовоеДействие = ОписаниеЗадачи.ПредыдущееДействие;
		Иначе
			НовоеДействие = ТребуемоеДействие;
		КонецЕсли;
		
		ОписаниеЗадачи.ТребуемоеДействие = НовоеДействие;
		
		МодульОбъекта().Задача_Записать(ОписаниеЗадачи);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьОперацииИзОчередиОбменаНаСервере(Операции) Экспорт
	
	Для Каждого Операция Из МодульОбъекта().ЗначениеВМассиве(Операции) Цикл
		МодульОбъекта().Задача_Удалить(Операция);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьСтатусыОперацийНаСервере(Операции, НовыйСтатус) Экспорт
	
	Для Каждого Операция Из МодульОбъекта().ЗначениеВМассиве(Операции) Цикл
		МодульОбъекта().СтатусыОперации_ЗаписатьОсновнойСтатус(Операция, НовыйСтатус);
	КонецЦикла;
	
КонецПроцедуры

// ЗаполнитьКонтекстФормы

&НаСервере
Процедура ПрочитатьИнформациюПоОперации()
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		ОписаниеОперации = МодульОбъекта().Операция_ПрочитатьОперацию(Ссылка);
	Иначе
		ОписаниеОперации = МодульОбъекта().Новый_Операция();
	КонецЕсли;
	
	ЗаполнитьОсновнуюИнформацию(ОписаниеОперации);
	ЗаполнитьДопРеквизиты(ОписаниеОперации);
	ЗаполнитьДанныеОчередиОбмена(ОписаниеОперации.Ссылка);
	ЗаполнитьПодчиненныеОперации(ОписаниеОперации.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОсновнуюИнформацию(ОписаниеОперации)
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ОписаниеОперации,, "Товары, ДопРеквизиты");
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ОписаниеОперации.Статусы);
	
	Товары.Очистить();
	Товары.Загрузить(ОписаниеОперации.Товары);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДопРеквизиты(ОписаниеОперации)
	
	ДопРеквизиты.Очистить();
	
	Для Каждого КлючЗначение Из ОписаниеОперации.ДопРеквизиты Цикл
		
		НоваяСтр = ДопРеквизиты.Добавить();
		НоваяСтр.ВидимостьСтроки = ЗначениеЗаполнено(КлючЗначение.Значение) И КлючЗначение.Значение <> Ложь;
		
		ЗаполнитьЗначенияСвойств(НоваяСтр, КлючЗначение, "Ключ, Значение");
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеОчередиОбмена(Операция)
	
	ОчиститьДанныеФормыОчередьОбмена();
	
	ПоляДляЗаполнения = "ТребуемоеДействие, ПредыдущееДействие, СтатусДокументаВСервисе";
	
	ОписаниеЗадачи = МодульОбъекта().Задача_Прочитать(Операция);
	Если ЗначениеЗаполнено(ОписаниеЗадачи) Тогда
		
		ОписаниеОшибки = ОписаниеЗадачи.ДопРеквизиты.КраткоеОписаниеОшибки;
		Если Не ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			ОписаниеОшибки = ОписаниеЗадачи.ОписаниеОшибки;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОписаниеЗадачи.ИдентификаторДокумента) Тогда
			ИдентификаторДокумента = Новый УникальныйИдентификатор(ОписаниеЗадачи.ИдентификаторДокумента);
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ОписаниеЗадачи, ПоляДляЗаполнения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодчиненныеОперации(Операция)
	
	Дерево = РеквизитФормыВЗначение("ПодчиненныеОперации");
	Дерево.Строки.Очистить();
	
	Если ЗначениеЗаполнено(Операция) Тогда
		
		ВсеОперации = Новый Массив;
		
		ДобавитьПодчиненныеОперации(Дерево.Строки, Операция);
		ДополнитьИнформациюПодчиненныхОпераций(Дерево.Строки);
		
	КонецЕсли;
	
	КоличествоПодчиненныхОпераций = Дерево.Строки.Количество();
	
	ЗначениеВРеквизитФормы(Дерево, "ПодчиненныеОперации");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПодчиненныеОперации(СтрокиДерева, Операция)
	
	Операции = МодульОбъекта().Операция_НайтиПодчиненныеОперации(Операция);
	Для Каждого ПодчиненнаяОперация Из Операции Цикл
		
		НоваяСтрокаДерева = СтрокиДерева.Добавить();
		НоваяСтрокаДерева.Операция = ПодчиненнаяОперация;
		НоваяСтрокаДерева.СтатусОперации = МодульОбъекта().Операция_ОсновнойСтатус(ПодчиненнаяОперация);
		
		ДобавитьПодчиненныеОперации(НоваяСтрокаДерева.Строки, ПодчиненнаяОперация);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьИнформациюПодчиненныхОпераций(СтрокиДерева)
	
	Операции = СтрокиДерева.ВыгрузитьКолонку("Операция");
	ОписанияЗадач = МодульОбъекта().Задачи_Прочитать(Операции);
	
	Для Каждого ОписаниеЗадачи Из ОписанияЗадач Цикл
		
		СтрокаДерева = СтрокиДерева.Найти(ОписаниеЗадачи.Операция, "Операция");
		
		СтрокаДерева.ИдентификаторДокумента = ОписаниеЗадачи.ИдентификаторДокумента;
		СтрокаДерева.ТребуемоеДействие = ОписаниеЗадачи.ТребуемоеДействие;
		СтрокаДерева.ПредыдущееДействие = ОписаниеЗадачи.ПредыдущееДействие;
		
		ДополнитьИнформациюПодчиненныхОпераций(СтрокаДерева.Строки);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьДанныеФормыОчередьОбмена()

	ТребуемоеДействие = Неопределено;
	ПредыдущееДействие = Неопределено;
	ИдентификаторДокумента = Неопределено;
	СтатусДокументаВСервисе = Неопределено;
	ОписаниеОшибки = "";
	
КонецПроцедуры

// ЗаписатьДанныеФормы

&НаСервере
Процедура ЗаписатьДанныеНаСервере()

	ОписаниеОперации = МодульОбъекта().Операция_ПрочитатьОперацию(Ссылка);
	
	ЗаполнитьЗначенияСвойств(ОписаниеОперации, ЭтаФорма,, "Товары, ДопРеквизиты");
	ЗаполнитьЗначенияСвойств(ОписаниеОперации.Статусы, ЭтаФорма);
	
	Если ОбновленыДопРеквизиты Тогда
		ЗаполнитьДопРеквизитыПоКонтекстуФормы(ОписаниеОперации);
	КонецЕсли;
	
	Если ОбновленыТовары Тогда
		
		ОписаниеОперации.Товары.Очистить();
		Для Каждого Стр Из Товары Цикл
			ЗаполнитьЗначенияСвойств(ОписаниеОперации.Товары.Добавить(), Стр,, "КлючНоменклатуры1С");
		КонецЦикла;
		
	КонецЕсли;
	
	МодульОбъекта().ЗаписатьОперацию(ОписаниеОперации);
	
	Если ОбновленаОчередьОбмена Тогда
		ЗаписатьЗадачуВОчередьОбмена();
	КонецЕсли;
	
	ПрочитатьИнформациюПоОперации();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДопРеквизитыПоКонтекстуФормы(ОписаниеОперации)
	
	ДопРеквизитыОперации = ОписаниеОперации.ДопРеквизиты;
	
	Для Каждого Стр Из ДопРеквизиты Цикл
		ДопРеквизитыОперации[Стр.Ключ] = Стр.Значение;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЗадачуВОчередьОбмена()
	
	ПоляДляЗаполнения = "ТребуемоеДействие, ПредыдущееДействие, ИдентификаторДокумента, СтатусДокументаВСервисе";
	
	ОписаниеЗадачи = МодульОбъекта().Задача_Прочитать(Ссылка);
	
	Если Не ЗначениеЗаполнено(ОписаниеЗадачи) Тогда
		МодульОбъекта().ДобавитьОперациюВОчередьОбмена(Ссылка);
		ОписаниеЗадачи = МодульОбъекта().Задача_Прочитать(Ссылка);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ОписаниеЗадачи, ЭтаФорма, ПоляДляЗаполнения);
	МодульОбъекта().Задача_Записать(ОписаниеЗадачи);
	
КонецПроцедуры

// Прочее

&НаКлиенте
Функция ПроверитьМодифицированность()
	
	Результат = Ложь;
	Если Модифицированность Тогда
		
		ТекстОшибки = НСтр("ru = 'Операция модифицирована. Перечитайте информацию из ИБ!'");
		МодульКлиента().СообщитьПользователюЛок(ТекстОшибки);
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ВыделенныеПодчиненныеОперации()
	
	Результат = Новый Массив;
	
	Для Каждого НомерСтроки Из Элементы.ПодчиненныеОперации.ВыделенныеСтроки Цикл
		Стр = Элементы.ПодчиненныеОперации.ДанныеСтроки(НомерСтроки);
		Результат.Добавить(Стр.Операция);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура НастроитьВидимость_Товары()
	
	Для Каждого ИмяКолонки Из МодульКлиента().Перечисление_СкрываемыеПоляТоваровОперации() Цикл 
		Элементы["Товары" + ИмяКолонки].Видимость = ОтображатьСкрытыеПоля;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Товары) И Не ОтображатьСкрытыеПоля Тогда
		Для Каждого ПодчиненныйЭлемент Из Элементы.Товары.ПодчиненныеЭлементы Цикл
			УстановитьВидимостьКолонкиТоваров(ПодчиненныйЭлемент.Имя);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьКолонкиТоваров(ИмяЭлемента)
	
	ЕстьЗначения = Ложь;
	
	Для Каждого Стр Из Товары Цикл
		
		ИмяКолонки = СтрЗаменить(ИмяЭлемента, "Товары", "");
		ДанныеКолонки = Неопределено;
		
		Если Стр.Свойство(ИмяКолонки, ДанныеКолонки) Тогда
			
			Если ЗначениеЗаполнено(ДанныеКолонки) И ДанныеКолонки <> Ложь Тогда
				ЕстьЗначения = Истина;
				Прервать;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы[ИмяЭлемента].Видимость = ЕстьЗначения;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОтбор_ДопРеквизиты()
	
	Если ОтображатьСкрытыеПоля Тогда
		Элементы.ДопРеквизиты.ОтборСтрок = Неопределено;
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый ФиксированнаяСтруктура("ВидимостьСтроки", Истина);
	Элементы.ДопРеквизиты.ОтборСтрок = ПараметрыОтбора;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимость_ОписаниеОшибки()
	
	Элементы.ГруппаОшибка.Видимость = ЗначениеЗаполнено(ОписаниеОшибки);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьТаблицуТоваров()
	
	Новый_Операция = МодульОбъекта().Новый_Операция();
	СоздатьТаблицуФормы("Товары", "Товары", Новый_Операция.Товары);
	
	НастроитьТаблицуТоваров("Товары");
	
КонецПроцедуры

&НаСервере
Процедура НастроитьТаблицуТоваров(ИмяПоляТаблицыФормы)
	
	НастроитьКолонкуНомерСтроки();
	НастроитьКолонкиРазрешительнойДокументации(ИмяПоляТаблицыФормы);
	НастроитьКолонкуАльтернативныйСрокГодности(ИмяПоляТаблицыФормы);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьКолонкуНомерСтроки()
	
	ЗаголовокКолонки = "№";
	
	ЭлементНомер = Элементы.ТоварыНомерСтроки;
	ЭлементНомер.Заголовок = ЗаголовокКолонки;
	ЭлементНомер.Ширина = 3;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьКолонкиРазрешительнойДокументации(ИмяПоляТаблицыФормы)
	
	ИмяГруппы = "ГруппаДокументаСертификации";
	ЗаголовокГруппы = НСтр("ru='Разрешительный документ'");
	
	ПоляРД = "ВидДокументаСертификации, НомерДокументаСертификации, ДатаДокументаСертификации";
	
	ТаблицаФормыСоздатьГруппуКолонок(ИмяПоляТаблицыФормы, ИмяГруппы, ЗаголовокГруппы, ПоляРД);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьКолонкуАльтернативныйСрокГодности(ИмяПоляТаблицыФормы)
	
	ИмяКолонки = "АльтернативныеСрокиГодности";
	ЭлементКолонки = Элементы.Найти(ИмяПоляТаблицыФормы + ИмяКолонки);
	
	Если ЭлементКолонки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементКолонки.ГиперссылкаЯчейки = Истина;
	ЭлементКолонки.ТолькоПросмотр = Истина;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьТаблицуФормы(Знач ИмяПоляТаблицыФормы, Знач ИмяРеквизитаДанныеФормыКоллекция, Знач ТаблицаЗначений)
	
	УдаляемыеРеквизиты = Новый Массив;
	РеквизитыДляУдаления = ПолучитьРеквизиты(ИмяРеквизитаДанныеФормыКоллекция);
	Для Каждого РеквизитУдаления Из РеквизитыДляУдаления Цикл
		УдаляемыеРеквизиты.Добавить(ИмяРеквизитаДанныеФормыКоллекция + "." + РеквизитУдаления.Имя);
		// Удаляем элементы формы
		Элементы.Удалить(Элементы[ИмяПоляТаблицыФормы + РеквизитУдаления.Имя]);
	КонецЦикла;
	
	// Добавление реквизитов в таблицу формы
	ДобавляемыеРеквизиты = Новый Массив;
	Для каждого Колонка Из ТаблицаЗначений.Колонки Цикл
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, ИмяРеквизитаДанныеФормыКоллекция, Колонка.Заголовок));
	КонецЦикла;
	ИзменитьРеквизиты(ДобавляемыеРеквизиты, УдаляемыеРеквизиты);
	
	// Добавление элементов форму
	Для каждого Колонка Из ТаблицаЗначений.Колонки Цикл
		ЭлементРеквизита = Элементы.Добавить(ИмяПоляТаблицыФормы + Колонка.Имя, Тип("ПолеФормы"), Элементы[ИмяПоляТаблицыФормы]);
		ЭлементРеквизита.ПутьКДанным = ИмяРеквизитаДанныеФормыКоллекция + "." + Колонка.Имя;
		ЭлементРеквизита.Вид = ВидПоляФормы.ПолеВвода;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ТаблицаЗначений, ИмяРеквизитаДанныеФормыКоллекция);
	
КонецПроцедуры

&НаСервере
Процедура ТаблицаФормыСоздатьГруппуКолонок(ИмяПоляТаблицыФормы, ИмяГруппы, ЗаголовокГруппы, ПоляГруппы)
	
	ИменаКолонок = МодульОбъекта().РазделитьСтроку(ПоляГруппы);
	
	НоваяГруппа = Элементы.Добавить(ИмяПоляТаблицыФормы + ИмяГруппы, Тип("ГруппаФормы"), Элементы[ИмяПоляТаблицыФормы]);
	НоваяГруппа.Заголовок = ЗаголовокГруппы;
	НоваяГруппа.Вид = ВидГруппыФормы.ГруппаКолонок;
	НоваяГруппа.ОтображатьВШапке = Истина;
	НоваяГруппа.Группировка = ГруппировкаКолонок.Горизонтальная;
	НоваяГруппа.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
	НоваяГруппа.Видимость = Истина;
	
	Элементы.Переместить(НоваяГруппа, Элементы[ИмяПоляТаблицыФормы], Элементы.Найти(ИмяПоляТаблицыФормы + ИменаКолонок[0]));
	Для Каждого ИмяКолонки Из ИменаКолонок Цикл
		
		ЭлементКолонки = Элементы.Найти(ИмяПоляТаблицыФормы + ИмяКолонки);
		
		Если ЭлементКолонки <> Неопределено Тогда
			Элементы.Переместить(ЭлементКолонки, НоваяГруппа);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// #КонецОбласти