// Copyright (C) 2012 - 2025 Engineer Mareev Enterprises
// Модуль для УТ10.3

//	$Номенклатура
//	Выгрузка данных о номенклатурах
//	- В 1C при записи номенклатура помечается к экспорту.
//	- 1С (авт.) экспортирует сообщение GOODS.
//	- EME.WMS (авт.) импортирует сообщение GOODS.
//	- EME.WMS (руч.) изменяет ВГХ товаров.

#Область ПрограммныйИнтерфейс  

//	Процедура Экспортировать экспортирует один товар (новая, нужна отладка)
Процедура Экспортировать(ERPData, Товар) Экспорт
	
	КодыЕдиниц = Новый Массив;    
	РеквизитыТовара = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Товар, 
			"ВидНоменклатуры,Артикул,Код,Наименование,НаименованиеПолное,Родитель,БазоваяЕдиницаИзмерения,
			|ЦеноваяГруппа,Услуга,Весовой,ВесовойКоэффициентВхождения,ОсновнойПоставщик,ВестиПартионныйУчетПоСериям,
			|ВестиУчетПоСериям, ВестиСерийныеНомера, ЕдиницаХраненияОстатков");
	
	Если Не ЗначениеЗаполнено(РеквизитыТовара.ЕдиницаХраненияОстатков) Тогда
		Возврат;		
	КонецЕсли;
	
	//	Услуги, работы не эскпортировать в WMS
	РеквизитыВидаНоменкатуры = Новый Структура("Наименование, ТипНоменклатуры");
	Если ЗначениеЗаполнено(РеквизитыТовара.ВидНоменклатуры) Тогда
		РеквизитыВидаНоменкатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РеквизитыТовара.ВидНоменклатуры, 
																				"Наименование, ТипНоменклатуры");
	КонецЕсли;

	Если РеквизитыТовара.Услуга 
		ИЛИ РеквизитыВидаНоменкатуры.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга") Тогда
		Возврат;
	КонецЕсли;
	
	//	Заголовок товарной единицы
	EmeWmsERPEngine.AppendHeaderLine(ERPData);
	ERPData.header.goods_id		= Товар.УникальныйИдентификатор();
	Если Константы.EmeWmsСоздаватьУникальныеСообщения.Получить() Тогда
		ERPData.header.id	  	= Новый УникальныйИдентификатор;
	Иначе
		ERPData.header.id	  	= ERPData.header.goods_id;		
	КонецЕсли;

	АртикулТовара 	= СокрЛП(РеквизитыТовара.Артикул);
	КодТовара 		= СокрЛП(РеквизитыТовара.Код);      
	
	//	Postgres на линукс плохо реагирует на символ бэкслеш \, заменяю на нижнее подчеркивание. 
	//	Есть один такой товар (Reciprocating Compressor / Поршневой Компрессор\), дает ошибку выполнения запроса записи в базу sql.
	НаименованиеТовара = СтрЗаменить(Лев(РеквизитыТовара.Наименование, 255), "\", "_");
	НаименованиеПолное = СтрЗаменить(Лев(РеквизитыТовара.НаименованиеПолное, 255), "\", "_");

	ERPData.header.goods_code		= КодТовара;
	//	В этом проекте не типовое решение. В артикул будем выгружать только артикул. Если пусто - тогда выгружать код в скобках
	// ERPData.header.article          = СокрЛП(Товар.Код) + ?(ЗначениеЗаполнено(СокрЛП(Товар.Артикул)), "(" + СокрЛП(Товар.Артикул)+ ")", ""); 
	ERPData.header.article          = ?(ЗначениеЗаполнено(АртикулТовара), АртикулТовара, "(" + КодТовара + ")"); 
	ERPData.header.name				= НаименованиеТовара;
	ERPData.header.full_name		= НаименованиеПолное;
	ERPData.header.classifier		= ПолучитьПолныйПутьГруппыНоменклатуры(Товар, Ложь);
	Если ERPData.header.classifier = "" Тогда
		ERPData.header.classifier = "Прочее";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РеквизитыТовара.Родитель) Тогда
		ERPData.header.classifier_id = РеквизитыТовара.Родитель.УникальныйИдентификатор();
		
		//	В поле производитель выгружается наименование группы номенклатуры
		РеквизитыГруппы = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РеквизитыТовара.Родитель, "Код, Наименование");
		ERPData.header.producer_id 	 = ERPData.header.classifier_id;
		ERPData.header.producer_code = РеквизитыГруппы.Код;
		ERPData.header.producer_name = РеквизитыГруппы.Наименование;		
	КонецЕсли; 
	
	// Товар с марками ЧЗ               
	//Если ERPData.header.Владелец().Колонки.Найти("is_use_true_sign") <> Неопределено Тогда
	//	ERPData.header.is_use_true_sign	= ?(ЗначениеЗаполнено(РеквизитыТовара.Ссылка_медидиан), 1, 0);
	//КонецЕсли;
	Если ERPData.header.Владелец().Колонки.Найти("is_use_true_sign") <> Неопределено Тогда //09122025
		Если ЗначениеЗаполнено(Товар.КодТНВЭД) Тогда
			ERPData.header.is_use_true_sign = ?(Товар.КодТНВЭД.МаркированныйТовар,1,0);
		КонецЕсли;
	КОнецЕсли;
	Если ЗначениеЗаполнено(Товар.НомерГТД) Тогда
		//	ERPData.header.is_gtd_used = 1;
	КонецЕсли;
	
	// #IBS 11.03.2025 основная единица с ВГХ выделена жирным шрифтом - это ссылка на единицу хранения остатков.
	ОсновнаяЕдиница = РеквизитыТовара.ЕдиницаХраненияОстатков;
	
	ERPData.header.code_status	= "STD"; 
	//	Срок годности по умолчанию 7999
	ERPData.header.shelf_life	= 7999;
	ERPData.header.stackability = 1;  
	
	//	Простейшее определения типа номенклатуры WMS по типу номенклатуры 1С и наимнованию вида номенклатуры (настроить под справочник клиента).
	// Тип продукта (1 - 'Готовая продукция', 2 - 'Полуфабрикат', 3 - 'Упаковка', 4 - 'Сырье', '5 - Рекламная продукция',
	// 6 - 'Service&Material', 7 - 'Trade assets', 8 - 'Rework', 9 - 'Составной', 10 - 'Тара')
	//Если ТипНоменклатуры = Перечисления.ТипыНоменклатуры.МногооборотнаяТара Тогда
	//	ERPData.header.product_type = 10;  
	//Иначе
	Если РеквизитыВидаНоменкатуры.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Набор") Тогда
		ERPData.header.product_type = 9;  
	ИначеЕсли Найти(НРег(РеквизитыВидаНоменкатуры.Наименование), "материал") Тогда
		ERPData.header.product_type = 4;  
	ИначеЕсли Найти(НРег(РеквизитыВидаНоменкатуры.Наименование), "полуфабрикат") Тогда
		ERPData.header.product_type = 2;  
	Иначе
		ERPData.header.product_type = 0;  
	КонецЕсли;		
	
	//Если Не РеквизитыТовара.ОсновнойПоставщик.Пустая() Тогда
	//	ERPData.header.producer_id 	 = РеквизитыТовара.ОсновнойПоставщик.УникальныйИдентификатор();
	//	ERPData.header.producer_code = РеквизитыТовара.ОсновнойПоставщик.Код;
	//	ERPData.header.producer_name = РеквизитыТовара.ОсновнойПоставщик.Наименование;
	//КонецЕсли;
	
	//	Запись признака использования серийных номеров номенклатуры
	Если РеквизитыТовара.ВестиСерийныеНомера Тогда
		ERPData.header.is_use_serial_no = 1;
	Иначе
		ERPData.header.is_use_serial_no = 0;
	КонецЕсли;
	
	//	Учетная ЕИ (по-умолчанию при вводе в документы)
	Если Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыТовара.ЕдиницаХраненияОстатков, "ПометкаУдаления") Тогда
		ERPData.header.stock_pack_id = РеквизитыТовара.ЕдиницаХраненияОстатков.УникальныйИдентификатор(); 
	КонецЕсли;
	
	// Упаковки товара
	EmeWmsERPEngine.SelectChild(ERPData, "packs");
	
	КодОсновнойЕдиницы 	= ПолучитьКодЕдиницыИзмерения(ОсновнаяЕдиница.ЕдиницаПоКлассификатору);
	
	EmeWmsERPEngine.AppendChildLine(ERPData);
	ERPData.packs.id 		= ОсновнаяЕдиница.УникальныйИдентификатор();
	ERPData.packs.pack_code = ОсновнаяЕдиница.Наименование;
		
	ERPData.packs.contains_id 	= "";
	ERPData.packs.contains_code = "";
	ERPData.packs.factor 		= 1;
	ERPData.packs.is_sscc 		= 1;
	
	ERPData.packs.mu_code 	= КодОсновнойЕдиницы;
	Если Нрег(СокрЛП(ОсновнаяЕдиница.Наименование)) = "кг" Тогда
		ERPData.packs.precision = 3; // точность для килограммов 3 знака после запятой. 
	КонецЕсли;
	ERPData.packs.mu_name 	= ОсновнаяЕдиница.Наименование;
	
	//	ВГХ
	ERPData.packs.brutto 	= ОсновнаяЕдиница.Вес; // вес в кг
	ERPData.packs.netto 	= ERPData.packs.brutto;
	ERPData.packs.volume 	= ОсновнаяЕдиница.Объем * 1000000; // Из м^3 в см^3

	ERPData.packs.width 	= ?(ОсновнаяЕдиница.Ширина > 0.0, ОсновнаяЕдиница.Ширина * 0.1, 0.01); // из миллиметров в сантиметры;
	ERPData.packs.length 	= ?(ОсновнаяЕдиница.Длина > 0.0, ОсновнаяЕдиница.Длина * 0.1, 0.01); 
	ERPData.packs.height 	= ?(ОсновнаяЕдиница.Высота > 0.0, ОсновнаяЕдиница.Высота * 0.1, 0.01); 
		
	Выборка = Справочники.ЕдиницыИзмерения.Выбрать(,Товар);
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ПометкаУдаления Тогда
			Продолжить
		КонецЕсли;
		
		// Не должно быть две минимальных упаковки
		Если ОсновнаяЕдиница.Коэффициент = Выборка.Коэффициент Тогда
			Продолжить
		КонецЕсли;
		
		КодЕдиницыИзмерения = ПолучитьКодЕдиницыИзмерения(Выборка.ЕдиницаПоКлассификатору);
		
		EmeWmsERPEngine.AppendChildLine(ERPData);
		ERPData.packs.id 		= Выборка.Ссылка.УникальныйИдентификатор();
		ERPData.packs.pack_code = Выборка.Наименование;
		Ссылка1 = ПолучитьВложеннуюУпаковку(Товар, Выборка.Ссылка);
		
		Если Ссылка1 = Неопределено ИЛИ Ссылка1.Наименование = ОсновнаяЕдиница.Наименование Тогда  // Если вложение - основная единица измерения
			ERPData.packs.contains_id 	= ОсновнаяЕдиница.УникальныйИдентификатор();
			ERPData.packs.contains_code = ОсновнаяЕдиница.Наименование;
			ERPData.packs.factor 		= Выборка.Коэффициент; // Если упаковка состоит из единиц по классификатору
		Иначе
			ERPData.packs.contains_id 	= Ссылка1.УникальныйИдентификатор();
			ERPData.packs.contains_code = Ссылка1.Наименование;
			ERPData.packs.factor 		= Выборка.Коэффициент;
		КонецЕсли;
		
		ЕдиницаПоКлассификаторуНаименование = СокрЛП(Нрег(Выборка.ЕдиницаПоКлассификатору.Наименование));
		Если ЕдиницаПоКлассификаторуНаименование = "паллет"
			ИЛИ ЕдиницаПоКлассификаторуНаименование = "пл" Тогда	// Определение числа слоев
			ERPData.packs.layers = 1; // Число слоев
		КонецЕсли;
		
		ERPData.packs.is_sscc = 1;
		ERPData.packs.mu_code = КодЕдиницыИзмерения;
		ERPData.packs.mu_name = Выборка.ЕдиницаПоКлассификатору.Наименование;
		
		Если Нрег(СокрЛП(Выборка.ЕдиницаПоКлассификатору.Наименование)) = "кг" Тогда
			ERPData.packs.precision = 3; // точность для килограммов 3 знака после запятой. 
		КонецЕсли;
		
		// ВГХ
		ERPData.packs.brutto 	= ?(Выборка.Вес > 0, Выборка.Вес, 0.01);
		ERPData.packs.netto 	= ERPData.packs.brutto;
		ERPData.packs.volume 	= Выборка.Объем * 1000000; // Из м^3 в см^3

		ERPData.packs.width 	= Выборка.Ширина * 0.1; 
		ERPData.packs.length 	= Выборка.Длина * 0.1; 
		ERPData.packs.height 	= Выборка.Высота * 0.1; 
	КонецЦикла;
			
	// Типовая схема экспорта ШК
	МассивШтрихкодов = ПолучитьШтрихкодыНоменклатуры(Товар);
	
	EmeWmsERPEngine.SelectChild(ERPData, "bar_codes");  
	НомерШК = 0;
	Для Каждого Запись Из МассивШтрихкодов Цикл 
		
		НомерШК = НомерШК + 1;
		EmeWmsERPEngine.AppendChildLine(ERPData);
		ERPData.bar_codes.id				= НомерШК;
		// Это нужно для того, чтобы при дублях единицы (штука) перенести ШК на основную ед.
		Если ОсновнаяЕдиница.Коэффициент 	= Запись.Упаковка.Коэффициент Тогда
			ERPData.bar_codes.pack_id 		= ОсновнаяЕдиница.УникальныйИдентификатор();
			ERPData.bar_codes.pack_code 	= ОсновнаяЕдиница.Наименование;
		Иначе
			ERPData.bar_codes.pack_id 		= Запись.Упаковка.УникальныйИдентификатор();
			ERPData.bar_codes.pack_code 	= Запись.Упаковка.Наименование;
		КонецЕсли;
		ERPData.bar_codes.bar_code			= Запись.ШтрихКод;
		ERPData.bar_codes.bar_code_type 	= Запись.ТипШтрихКода;	
		
	КонецЦикла;    
	
	//Комплектация номенклатуры		
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	Комплектующие.Номенклатура КАК Номенклатура,
	//	|	Комплектующие.Количество КАК Количество,
	//	|	Комплектующие.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	//	|ИЗ
	//	|	РегистрСведений.КомплектующиеНоменклатуры КАК Комплектующие
	//	|ГДЕ
	//	|	Комплектующие.Номенклатура = &ТоварСсылка";
	//Запрос.УстановитьПараметр("ТоварСсылка", Товар.Ссылка);
	//
	//РезультатЗапросаКомплектующих = Запрос.Выполнить();

	//Если Не РезультатЗапросаКомплектующих.Пустой() Тогда

	//	EmeWmsERPEngine.SelectChild(ERPData, "kit_items");
	//	ЕстьКомплектация = ложь;
	//	НомерВарианта = 0;
	//	НомерСтроки = 0;

	//	ТЧКомп = РезультатЗапросаКомплектующих.Выгрузить();
	//	НомерВарианта = НомерВарианта + 1;
	//		
	//	Для каждого стр1 из ТЧКомп Цикл  
	//		// Есть в комплектации пустые данные
	//		Если ЗначениеЗаполнено(стр1.Номенклатура) И стр1.Количество > 0.0 Тогда
	//			// Чтобы не было рекурсии, такие данные не импортируются в WMS
	//			Если стр1.Номенклатура <> Товар.Ссылка Тогда
	//				EmeWmsERPEngine.AppendChildLine(ERPData);
	//					НомерСтроки = НомерСтроки + 1;
	//				
	//					ERPData.kit_items.id			= Строка(НомерСтроки);
	//					ERPData.kit_items.variant_no	= НомерВарианта;
	//					ERPData.kit_items.goods_id    	= стр1.Номенклатура.УникальныйИдентификатор();
	//		   			ERPData.kit_items.goods_code    = СокрЛП(стр1.Номенклатура.Код);
	//					
	//					ERPData.kit_items.quantity 		= стр1.Количество;
	//		     		ERPData.kit_items.pack_id   	= стр1.ЕдиницаИзмерения.УникальныйИдентификатор();
	//		      		ERPData.kit_items.pack_code 	= стр1.ЕдиницаИзмерения.Наименование;
	//					
	//					ERPData.kit_items.kit_quantity  = 1.0;
	//		   			ERPData.kit_items.kit_pack_id   = ОсновнаяЕдиница.УникальныйИдентификатор();
	//		   			ERPData.kit_items.kit_pack_code	= ОсновнаяЕдиница.Наименование;
	//					
	//					ПометитьКЭкспорту(стр1.Номенклатура);                              
	//					ЕстьКомплектация = истина;
	//				КонецЕсли;
	//			КонецЕсли;
	//		КонецЦикла;
	//		
	//	Если ЕстьКомплектация Тогда
	//		// Если есть комплектация, тип должен быть "составной"
	//		ERPData.header.product_type = 9;  
	//	КонецЕсли;
	//	
	//КонецЕсли;

КонецПроцедуры      

#КонецОбласти

#Область ЭкспортныеСлужебныеПроцедурыИФункции

//	Функция ПолучитьИмяСообщения возвращает имя сообщения
Функция ПолучитьИмяСообщения() Экспорт
	Возврат "goods";
КонецФункции

//	Функция ПолучитьМетаданные возвращает метаданные сообщения
Функция ПолучитьМетаданные() Экспорт
	Возврат Метаданные.Справочники.Номенклатура;
КонецФункции

//	Функция ПолучитьВыборкуСсылок возвращает выборку ссылок для экспорта
Функция ПолучитьВыборкуСсылок() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	EmeWmsПометкиКЭкспортуНоменклатуры.Номенклатура КАК Ссылка
		|ИЗ
		|	РегистрСведений.EmeWmsПометкиКЭкспортуНоменклатуры КАК EmeWmsПометкиКЭкспортуНоменклатуры
		|ГДЕ
		|	EmeWmsПометкиКЭкспортуНоменклатуры.КЭкспорту";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выбрать();
КонецФункции

//	Функция РазрешенКЭкспорту возвращает Истина, если товар разрешен к экспорту
Функция РазрешенКЭкспорту(Товар) Экспорт
	Если Товар.Ссылка.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Товар.ЭтоГруппа Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Товар.ВидНоменклатуры) Тогда
		ОтменитьЭкспорт(Товар);
		Возврат Ложь;
	КонецЕсли;
	
	// Без основной единицы-упаковки не выгружать
	Если Не ЗначениеЗаполнено(Товар.ЕдиницаХраненияОстатков) Тогда
		ОтменитьЭкспорт(Товар);
		Возврат Ложь;
	КонецЕсли;
	
	//	Услуги и работы не выгружать
	ТипНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Товар.ВидНоменклатуры, "ТипНоменклатуры");
	Если ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
		ОтменитьЭкспорт(Товар);
		Возврат Ложь;
	КонецЕсли;
	
	// Поиск родительской группы, разрешенной к экспорту
	ГруппаСсылка = Товар.Родитель;   
	Если ГруппаСсылка <> Справочники.Номенклатура.ПустаяСсылка() Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	EmeWmsПометкиКЭкспортуНоменклатуры.РазрешенКЭкспорту КАК РазрешенКЭкспорту
			|ИЗ
			|	РегистрСведений.EmeWmsПометкиКЭкспортуНоменклатуры КАК EmeWmsПометкиКЭкспортуНоменклатуры
			|ГДЕ
			|	EmeWmsПометкиКЭкспортуНоменклатуры.Номенклатура = &ТоварСсылка";
		Запрос.УстановитьПараметр("ТоварСсылка", ГруппаСсылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.РазрешенКЭкспорту Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	Иначе            
		// Товары без группы не нужны
		ОтменитьЭкспорт(Товар);		
		Возврат Ложь;
	КонецЕсли;
	
	ОтменитьЭкспорт(Товар);	
	Возврат Ложь;
КонецФункции

//	Устанавливает признак РазрешенКЭкспорту в ложь регистре сведений
Процедура ЗапретитьЭкспорт(Товар) Экспорт
	
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Номенклатура.Установить(Товар.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл 
		Запись.РазрешенКЭкспорту = Ложь;
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
КонецПроцедуры
	
//	Устанавливает признак РазрешенКЭкспорту в истину в регистре сведений
Процедура РазрешитьЭкспорт(Товар) Экспорт
	Перем Запрос, Выборка, Результат;

	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Номенклатура.Установить(Товар.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		//Если Запись.РазрешенКЭкспорту Тогда
		//	Возврат;
		//Иначе
			Запись.РазрешенКЭкспорту = Истина;
			Запись.КЭкспорту = Истина;
			НаборЗаписей.Записать();
			Возврат;
		//КонецЕсли;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsПометкиКЭкспортуНоменклатуры.СоздатьМенеджерЗаписи();
	НоваяЗапись.Номенклатура = Товар.Ссылка;
	НоваяЗапись.РазрешенКЭкспорту = Истина;
	НоваяЗапись.КЭкспорту = Истина;
    НоваяЗапись.Записать(); 
	
КонецПроцедуры

//	Устанавливает признак РазрешенКЭкспорту для товара (ссылка) и родительских элементов
Процедура РазрешитьЭкспортСГруппами(Товар) Экспорт

	Товар1 = Товар.Ссылка;
	Пока Товар1 <> Справочники.Номенклатура.ПустаяСсылка() Цикл
		Если Товар1.ЭтоГруппа Тогда
			EmeWmsЭкспортГруппНоменклатуры.РазрешитьЭкспорт(Товар1);
		Иначе
			РазрешитьЭкспорт(Товар1);
		КонецЕсли;
		Товар1 = Товар1.Родитель;
	КонецЦикла;
КонецПроцедуры

//	Процедура ПометитьКЭкспорту помечает товар к экспорту.
Процедура ПометитьКЭкспорту(Товар) Экспорт
	Если Не РазрешенКЭкспорту(Товар) Тогда
        Возврат;
    КонецЕсли;	
	
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Номенклатура.Установить(Товар.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Истина;
		Запись.Дата = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsПометкиКЭкспортуНоменклатуры.СоздатьМенеджерЗаписи();
	НоваяЗапись.Номенклатура = Товар.Ссылка;
	НоваяЗапись.КЭкспорту = Истина;
	НоваяЗапись.Дата = ТекущаяДата();
    НоваяЗапись.Записать(); 
	
КонецПроцедуры

//	Процедура помечает товар к экспорту в любом случае
Процедура ПометитьКЭкспортуБезусловно(Товар) Экспорт
	EmeWmsЭкспортГруппНоменклатуры.ПометитьКЭкспорту(Товар);
	
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Номенклатура.Установить(Товар.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Истина;
		Запись.Дата = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsПометкиКЭкспортуНоменклатуры.СоздатьМенеджерЗаписи();
	НоваяЗапись.Номенклатура = Товар.Ссылка;
	НоваяЗапись.КЭкспорту = Истина;
	НоваяЗапись.Дата = ТекущаяДата();
    НоваяЗапись.Записать(); 
	
КонецПроцедуры

//	Функция ПомеченКЭкспорту возвращает Истина, если товар помечен к экспорту.
Функция ПомеченКЭкспорту(Товар) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	EmeWmsПометкиКЭкспортуНоменклатуры.КЭкспорту КАК КЭкспорту
		|ИЗ
		|	РегистрСведений.EmeWmsПометкиКЭкспортуНоменклатуры КАК EmeWmsПометкиКЭкспортуНоменклатуры
		|ГДЕ
		|	EmeWmsПометкиКЭкспортуНоменклатуры.Номенклатура = &ТоварСсылка";
	Запрос.УстановитьПараметр("ТоварСсылка", Товар.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.КЭкспорту;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

//	Процедура ОтменитьЭкспорт отменяет экспорт документа.
Процедура ОтменитьЭкспорт(Товар) Экспорт

	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Номенклатура.Установить(Товар.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Ложь;
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
КонецПроцедуры

//	Функция Экспортирован возвращает Истина, если товар был экспортирован или помечен к экспорту
Функция Экспортирован(Товар) Экспорт
	
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Номенклатура.Установить(Товар.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Если ЗначениеЗаполнено(Запись.ДатаЭкспорта) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

//	Процедура ПодтвердитьЭкспорт подтверждает экспорт товара.
Процедура ПодтвердитьЭкспорт(Товар) Экспорт

	Попытка
		НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуНоменклатуры.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Номенклатура.Установить(Товар.Ссылка);
		НаборЗаписей.Прочитать();
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат
	КонецПопытки;

	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Ложь;
		Запись.ДатаЭкспорта = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
 
КонецПроцедуры

//	Процедура ПометитьКЭкспорту помечает товар к экспорту на событии при записи номеклатуры.
Процедура ПометитьКЭкспортуПриЗаписиНоменклатуры(Источник, Отказ) Экспорт
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	//	Помечать, если включен режим пометок к экспорту
	Если Константы.EmeWmsПометкаВключена.Получить() Тогда
		Если Источник.ЭтоГруппа Тогда
	 		EmeWmsЭкспортГруппНоменклатуры.ПометитьКЭкспортуПриЗаписиНоменклатуры(Источник, Отказ);
		Иначе    			
			ПометитьКЭкспорту(Источник);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

//	Процедура ПометитьКЭкспорту помечает товар к экспорту на событии при записи упаковки.
Процедура ПометитьКЭкспортуПриЗаписиУпаковки(Источник, Отказ) Экспорт

	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Источник.Владелец.Метаданные().Имя = "Номенклатура" Тогда
		ПометитьКЭкспорту(Источник.Владелец.ПолучитьОбъект());
	КонецЕсли;	
 	
КонецПроцедуры

//	Процедура ПометитьКЭкспорту помечает товар к экспорту на событии при записи штрихкода.
Процедура ПометитьКЭкспортуПриЗаписиШтрихкода(Источник, Отказ, Замещение) Экспорт

	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Запись Из Источник Цикл 
		Товар = Запись.Владелец;
		ПометитьКЭкспорту(Товар.ПолучитьОбъект());
	КонецЦикла
	
КонецПроцедуры

//	#IBS Ширяев 21.11.2024 Функция проверяет, является ли товар материальным
//	Не услуга и не работа - это не хранится на складе WMS
Функция ЭтоМатериальныйТовар(ТоварСсылка) Экспорт
	
	ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТоварСсылка, "ВидНоменклатуры");
	ТипНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидНоменклатуры, "ТипНоменклатуры");
	Если ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Услуга Тогда
		Возврат Истина;
	Иначе
		Возврат ложь;
	КонецЕсли;
	
КонецФункции      

#КонецОбласти

#Область ЛокальныеСлужебныеПроцедурыИФункции

//	Получить ВГХ из свойств товара
Функция ПолучитьВГХИзСвойств(Товар)
	
	ВГХ = новый Структура;
	ВГХ.Вставить("Длина", неопределено);
	ВГХ.Вставить("Ширина", неопределено);
	ВГХ.Вставить("Высота", неопределено);
	
	Габариты = "";
	Для каждого стрСвойств из Товар.ДополнительныеРеквизиты Цикл
		Если Строка(стрСвойств.Свойство) = "Габариты упакованного товара (ДхШхВ)" Тогда
			Габариты = стрСвойств.Значение;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если Габариты <> "" Тогда
	    // Пример реквизита ДхШхВ: 24,5 х 14 х 3,5 см
		// Далее парсим    Глобальный контекст
		МассивСтр =  СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Габариты, "хx");
		Попытка         
			СтрокаДлины = СокрЛП(МассивСтр[0]);
			Если СтрокаДлины <> "" Тогда
				ВГХ.Вставить("Длина", Число(СтрокаДлины));
			КонецЕсли;

			СтрокаШирины = СокрЛП(МассивСтр[1]);
			Если СтрокаШирины <> "" Тогда
				ВГХ.Вставить("Ширина", Число(СтрокаШирины));
			КонецЕсли;

			СтрокаВысоты = СокрЛП(МассивСтр[2]);
			СтрокаВысоты = Лев(СтрокаВысоты, СтрДлина(СтрокаВысоты) - 2);
			Если СтрокаВысоты <> "" Тогда
				ВГХ.Вставить("Высота", Число(СтрокаВысоты));
			КонецЕсли;
		Исключение
			Сообщить("Габариты: " + Габариты);
		КонецПопытки;
	КонецЕсли;
	Возврат ВГХ;
КонецФункции

//	Получить код единицы по ссылке, даже если не заполнен
Функция ПолучитьКодЕдиницыИзмерения(ЕдиницаСсылка)
	
	Если ЗначениеЗаполнено(СокрЛП(ЕдиницаСсылка.Код)) Тогда
		КодЕдиницы = СокрЛП(ЕдиницаСсылка.Код);
	ИначеЕсли Лев(СокрЛП(ЕдиницаСсылка.Наименование),2) = "шт" Тогда
		КодЕдиницы = "796"; // Есть в данных штуки без кода
	ИначеЕсли Лев(СокрЛП(ЕдиницаСсылка.Наименование),4) = "упак" Тогда
		КодЕдиницы = "778"; 
	КонецЕсли;
	
	Возврат КодЕдиницы;
	
КонецФункции

//	Возвращает точность единицы измерения (для WMS) в зависимости от физического типа единицы
Функция ПолучитьТочностьЕдиницыИзмерения(ЕдиницаСсылка)
	Если НЕ ЗначениеЗаполнено(ЕдиницаСсылка) Тогда
		возврат 0;
	КонецЕсли;
	Если ЕдиницаСсылка.ТипИзмеряемойВеличины = Перечисления.ТипыИзмеряемыхВеличин.Вес Тогда
		возврат 3; // Точность для кг 3 знака
	ИначеЕсли ЕдиницаСсылка.ТипИзмеряемойВеличины = Перечисления.ТипыИзмеряемыхВеличин.Длина Тогда
		возврат 2; // Точность для см 2 знака
	ИначеЕсли ЕдиницаСсылка.ТипИзмеряемойВеличины = Перечисления.ТипыИзмеряемыхВеличин.Объем Тогда
		возврат 3; // Точность для литра 3 знака
	ИначеЕсли ЕдиницаСсылка.ТипИзмеряемойВеличины = Перечисления.ТипыИзмеряемыхВеличин.КоличествоШтук Тогда
		Если ЕдиницаСсылка.Наименование = "рул" Тогда
			возврат 3; // Есть использование дробного числа рулонов
		Иначе
			возврат 0;
		КонецЕсли;
	КонецЕсли;

	возврат 0;
КонецФункции

//	Возвращает множитель для преобразования единицы размера в единицу WMS
Функция ПолучитьКоэффициентРазмера(ЕдиницаИзмеренияДлины)

	ЕдиницаWMS = Константы.EmeWmsЕдиницаИзмеренияДлины.Получить();
	
	Если ЗначениеЗаполнено(ЕдиницаИзмеренияДлины) И ЗначениеЗаполнено(ЕдиницаWMS) Тогда
		Если ЕдиницаИзмеренияДлины.Знаменатель * ЕдиницаWMS.Числитель > 0 Тогда
			Возврат (ЕдиницаИзмеренияДлины.Числитель * ЕдиницаWMS.Знаменатель)/(ЕдиницаИзмеренияДлины.Знаменатель * ЕдиницаWMS.Числитель);
		Иначе
			Возврат 100.0;
		КонецЕсли;
	Иначе
		Возврат 100.0; // По умолчанию размер в метрах
	КонецЕсли;
	
КонецФункции

//	Возвращает множитель для преобразования единиц веса в единицу WMS
Функция ПолучитьКоэффициентВеса(ЕдиницаИзмеренияВеса)

	ЕдиницаWMS = Константы.EmeWmsЕдиницаИзмеренияВеса.Получить();
	
	Если ЗначениеЗаполнено(ЕдиницаИзмеренияВеса) И ЗначениеЗаполнено(ЕдиницаWMS) Тогда
		Если ЕдиницаИзмеренияВеса.Знаменатель * ЕдиницаWMS.Числитель > 0 Тогда
			Возврат (ЕдиницаИзмеренияВеса.Числитель * ЕдиницаWMS.Знаменатель)/(ЕдиницаИзмеренияВеса.Знаменатель * ЕдиницаWMS.Числитель);
		Иначе
			Возврат 1.0;
		КонецЕсли;
	Иначе
		Возврат 1.0; // По умолчанию вес в кг
	КонецЕсли;
КонецФункции

//	Возвращает множитель для преобразования единиц объема в единицу WMS
Функция ПолучитьКоэффициентОбъема(ЕдиницаИзмеренияОбъема)

	ЕдиницаWMS = Константы.EmeWmsЕдиницаИзмеренияОбъема.Получить();
	
	Если ЗначениеЗаполнено(ЕдиницаИзмеренияОбъема) И ЗначениеЗаполнено(ЕдиницаWMS) Тогда
		Если ЕдиницаИзмеренияОбъема.Знаменатель * ЕдиницаWMS.Числитель > 0 Тогда
			Возврат (ЕдиницаИзмеренияОбъема.Числитель * ЕдиницаWMS.Знаменатель)/(ЕдиницаИзмеренияОбъема.Знаменатель * ЕдиницаWMS.Числитель);
		Иначе
			Возврат 1000.0;
		КонецЕсли;
	Иначе
		Возврат 1000.0; // По умолчанию объем в литрах
	КонецЕсли;
КонецФункции

//	Возвращает множитель для преобразования срока годности в дни
Функция ПолучитьКоэффициентСрокаГодности(ЕдиницаИзмеренияВремени)
	Если НЕ ЗначениеЗаполнено(ЕдиницаИзмеренияВремени) Тогда
		возврат 365.0; // По умолчанию год
	КонецЕсли;

	Если ЕдиницаИзмеренияВремени = Перечисления.ЕдиницыИзмеренияВремени.Сутки Тогда
		возврат 1.0;
	ИначеЕсли ЕдиницаИзмеренияВремени = Перечисления.ЕдиницыИзмеренияВремени.День Тогда
		возврат 1.0;
	ИначеЕсли ЕдиницаИзмеренияВремени = Перечисления.ЕдиницыИзмеренияВремени.Месяц Тогда
		возврат 30.0;
	ИначеЕсли ЕдиницаИзмеренияВремени = Перечисления.ЕдиницыИзмеренияВремени.Год Тогда
		возврат 365.0;
	ИначеЕсли ЕдиницаИзмеренияВремени = Перечисления.ЕдиницыИзмеренияВремени.Час Тогда
		возврат 1.0/24.0;
	Иначе
		возврат 365.0; // По умолчанию год
	КонецЕсли	
КонецФункции

//	Справочник УпаковкиЕдиницыИзмерения иерархический по элементам
//	родителем является вложенная упаковка
//	функция возвращает дочерний элемент упаковки.
Функция ПолучитьВложеннуюУпаковку(Товар, Упаковка1)
	Перем Выборка1;
	
	Выборка1 = Справочники.ЕдиницыИзмерения.Выбрать(,Товар);
	Пока Выборка1.Следующий() Цикл
		Если Выборка1.ПометкаУдаления Тогда
			Продолжить
		ИначеЕсли Упаковка1.Родитель = Выборка1.Ссылка Тогда 
			Возврат Выборка1.Ссылка;
		КонецЕсли;
	КонецЦикла;		
	
	Возврат неопределено;
КонецФункции
	
//	Получить штрихкоды товара из регистра ШтрихкодыНоменклатуры
//	Возвращает массив структур с потребной информацией
Функция ПолучитьШтрихкодыНоменклатуры(Знач Номенклатура)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
	|	ШтрихкодыНоменклатуры.ЕдиницаИзмерения КАК Упаковка
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Владелец = &Номенклатура
	|";

	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);

	Выборка = Запрос.Выполнить().Выбрать();
	
	ВозвращаемоеЗначение = Новый Массив;
	Пока Выборка.Следующий() Цикл
		//	Упаковки, помеченные на удаление - не выгружаются, и штрихкоды тоже
		Описание1 = ПолучитьТипШтрихкода(Выборка.Штрихкод);
		Элемент1 = Новый Структура("Штрихкод, ТипШтрихкода, Упаковка, ЕдиницаИзмерения");
		Элемент1.Вставить("Штрихкод", Выборка.Штрихкод);
		ШКДобавлен = Ложь;
		Если ЗначениеЗаполнено(Выборка.Упаковка) Тогда
			//Если ОбщегоНазначения.СсылкаСуществует(Выборка.Упаковка) Тогда
				Если НЕ Выборка.Упаковка.ПометкаУдаления Тогда
					Элемент1.Вставить("Упаковка", Выборка.Упаковка);
					Элемент1.Вставить("ЕдиницаИзмерения", Выборка.Упаковка.ЕдиницаПоКлассификатору);
					ШКДобавлен = Истина;
				КонецЕсли;
			//КонецЕсли;
		Иначе	//	Тогда это штрихкод не упаковки, а основной единицы товара
			//Если ОбщегоНазначения.СсылкаСуществует(Номенклатура.ЕдиницаХраненияОстатков) Тогда
				Элемент1.Вставить("Упаковка", Номенклатура.ЕдиницаХраненияОстатков);
				Элемент1.Вставить("ЕдиницаИзмерения", Номенклатура.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору);
				ШКДобавлен = Истина;
			//КонецЕсли;
		КонецЕсли;
		Если ШКДобавлен Тогда
			Если Описание1 <> Неопределено Тогда 
				Элемент1.Вставить("ТипШтрихкода", Описание1);
			КонецЕсли;
			ВозвращаемоеЗначение.Добавить(Элемент1);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

//	Возврашает тип штрихкода по длине
Функция ПолучитьТипШтрихкода(Знач Штрихкод)

	ДлинаЩтрихКода = стрДлина(Штрихкод); 
	Если ДлинаЩтрихКода = 8 Тогда
		ТипШтрихКода = "EAN8";
	ИначеЕсли ДлинаЩтрихКода = 13 Тогда
		ТипШтрихКода = "EAN13";
	ИначеЕсли ДлинаЩтрихКода = 14 Тогда
		ТипШтрихКода = "EAN14";
	Иначе
		ТипШтрихКода = "Code39";
	КонецЕсли;
	
	Возврат ТипШтрихКода; 
	
КонецФункции

//	Возвращает элемент справочника штрихкодов по реквизиту. Если элемент не найден, возвращает Неопределено.
Функция ПолучитьПоЗначениюШтрихкода(ЗначениеШтрихкода)
	Перем Запрос, Выборка, Результат;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ШтрихкодыУпаковокТоваров.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|ГДЕ
	|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода = &ЗначениеШтрихкода
	|УПОРЯДОЧИТЬ ПО
	|	ШтрихкодыУпаковокТоваров.ДатаУпаковки Убыв";
	Запрос.УстановитьПараметр("ЗначениеШтрихкода", ЗначениеШтрихкода);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Неопределено;
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//	Функция ПолучитьПолныйПуть возвращает полный путь классификатора товара.
Функция ПолучитьПолныйПутьГруппыНоменклатуры(Знач Товар, Знач Код)
	
	ПолныйПуть = "";
	
	Если ЗначениеЗаполнено(Товар.Родитель) Тогда
		Пока Истина Цикл
			Если Товар.ЭтоГруппа Тогда
				Если ПолныйПуть <> "" Тогда
					ПолныйПуть = "#" + ПолныйПуть;
				КонецЕсли;
				Если Код Тогда
					ПолныйПуть = СокрЛП(Товар.Код) + ПолныйПуть;
				Иначе
					ПолныйПуть = Товар.Наименование + ПолныйПуть;
				КонецЕсли;
			КонецЕсли;
			Если ЗначениеЗаполнено(Товар.Родитель) Тогда
				Товар = Товар.Родитель;
			Иначе
				Прервать;
			КонецЕсли
		КонецЦикла
	КонецЕсли;
	
	Возврат ПолныйПуть;
	
КонецФункции

//	Функция ПолучитьПолныйПуть возвращает полный путь классификатора по виду номенклатуры
Функция ПолучитьПолныйПутьВидаНоменклатуры(Знач Товар, Знач Код)
	
	ПолныйПуть = "";
	
	ВидНоменклатуры = Товар.ВидНоменклатуры;
	
	Если ЗначениеЗаполнено(ВидНоменклатуры) Тогда
		Пока Истина Цикл
			Если ПолныйПуть <> "" Тогда
				ПолныйПуть = "#" + ПолныйПуть;
			КонецЕсли;
			Если Код Тогда
				ПолныйПуть = СокрЛП(ВидНоменклатуры.Код) + ПолныйПуть;
			Иначе
				ПолныйПуть = ВидНоменклатуры.Наименование + ПолныйПуть;
			КонецЕсли;
			Если ЗначениеЗаполнено(ВидНоменклатуры.Родитель) Тогда
				ВидНоменклатуры = ВидНоменклатуры.Родитель;
			Иначе
				Прервать;
			КонецЕсли
		КонецЦикла
	КонецЕсли;
	
	Возврат ПолныйПуть;
	
КонецФункции

#КонецОбласти