// Copyright (C) 2012-2025 Engineer Mareev Enterprises
// Модуль для УТ 10.3

// 	$Приход товаров (ордерная схема)
//	Импорт сообщений RECEIPT:
//	 - Оператор EME.WMS (руч.) создает документ прихода на основе ASN.
//	 - После закрытия документа прихода EME.WMS (авт.) экспортирует сообщение RECEIPT.
//	 - 1C (авт.) импортирует сообщение RECEIPT.
//	 - 1С (авт.) При несовпадении данных документа 1С по товарам с фактически принятыми, корректируется документ "Приходный ордер на товары".
//	 - 1C (авт.) документ "Приходный ордер на товары" проводится в статусе «принят», в комментарий заносится информация о документе WMS, на основании которого документ принят (скорректирован).

#Область ПрограммныйИнтерфейс  

// #IBS 22.08.2024 Импорт ПриходногоОрдераНаТовары по receipt с сериями (или харакеристиками) и марками
// изменяет статус на отгружен и сравнивает количества отгруженного
Процедура Импортировать(ERPData, Трассировка, ТемаСообщения) Экспорт
	
	Если ERPData.header.erp_doc_type <> ПолучитьМетаданные().Имя Тогда
		Возврат;
	КонецЕсли;
	
	// #IBS 22.11.2024 Принимать только сообщение для закрытого или подтвержденного документа.
	Если Не EmeWmsСтатусы.ДокументЗакрыт(ERPData) Тогда
		Возврат;
	КонецЕсли;  

	Если ERPData.header.is_partly = 1 Тогда // Принимать только закрывающий receipt
		Возврат;
	КонецЕсли;  
	
	Если ERPData.header.asn_id = "" Тогда // Поступление импортируется только на основе ASN. Без ASN - ОприходованиеТоваров.
		Возврат;
	КонецЕсли;
	
	НомерЕМЕ	= ERPData.header.receipt_reg_no;
	ИдЕМЕ 		= ERPData.header.receipt_id;       
	
	//	Соберем товары и количества
	КодЗоны 		= Неопределено;
	КодЗоныБрака 	= неопределено;
	КартаТоваров 	= Новый Соответствие;
	КартаБрака 		= Новый Соответствие;     
	КартаОснований 	= Новый Соответствие;       
	ПолучитьКоличестваТоваровСБраком(ERPData, КодЗоны, КодЗоныБрака, КартаТоваров, КартаБрака, КартаОснований);
	
	// Получим склад по коду EME
	КодСклада = ERPData.header.whs_to_code;
	КодОрганизации = ERPData.header.vendor_to_code;
	
	ОрганизацияСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаОрганизациюПоКодуEME(КодОрганизации);
	Если ОрганизацияСсылка.Пустая() Тогда
		EmeWmsERPEngine.ErrorHeader(ERPData, "VNDBAD");
		Возврат;
	КонецЕсли;
	
	// Ссылка на документ-основание из ASN (Заказ  на перемещение)
	ПриходныйОрдерСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаПриходныйОрдерНаТовары(ERPData.header.asn_id);
	//ПриобретениеСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаПриобретениеТоваровУслуг(ERPData.header.asn_id);
	Если ПриходныйОрдерСсылка.Пустая() Тогда
		EmeWmsERPEngine.ErrorHeader(ERPData, "ASNBAD");
	КонецЕсли;
	
	//	Если были ошибки
	Если EmeWmsERPEngine.HasErrors(ERPData) Тогда
		Возврат;
	КонецЕсли;
	
	//*** Проверки сделали, пишем в базу данных 1C ***
	
	ПриходныйОрдер	= ПриходныйОрдерСсылка.ПолучитьОбъект();
	СкладСсылка 	= ПриходныйОрдер.Склад;	

	КартаТоваровДокумента = EmeWmsУтилиты.ПолучитьКартуТоваровДокумента(ПриходныйОрдерСсылка);
	ТаблицаРазличий = EmeWmsУтилиты.ПолучитьТаблицуРазличий(КартаТоваровДокумента, КартаТоваров);		
	Если ТаблицаРазличий.Количество() > 0 Тогда
		ТекстРасхождений = EmeWmsУтилиты.ПолучитьКраткоеОписаниеРазличий(ПриходныйОрдерСсылка, ERPData.header.asn_reg_no, ТаблицаРазличий);
		Если ERPData.header.state = "NEW" Тогда 
			Тема = "Расхождение данных по принятым товарам в исходном Приходном ордере и документе прихода wms";
			ТекстРасхождений = Тема + Символы.ПС + ТекстРасхождений;
			EmeWmsУтилиты.ДобавитьНапоминаниеИнтеграции(ТекстРасхождений, ПриходныйОрдерСсылка);
		КонецЕсли;                    

		//EmeWmsУтилиты.СкорректироватьТЧДокумента(ПриходныйОрдер.Товары, КартаТоваров, Истина);
		//ПересчитатьУпаковкиДокумента(ПриходныйОрдер);

		ПриходныйОрдер.Комментарий = "Документ принят с отличиями от документа прихода EME: " + ERPData.header.receipt_reg_no + " (" + ERPData.header.comment + ")";
	Иначе
		ПриходныйОрдер.Комментарий = "Документ принят без изменений на основании документа прихода EME: " + ERPData.header.receipt_reg_no + " (" + ERPData.header.comment + ")";
	КонецЕсли;
	
	// #IBS 28.12.2023 Записать в статусе Принят
	ПриходныйОрдер.Записать();

	// #IBS 03.04.2023 Асинхронное проведение.
	EmeWmsПроведениеДокументов.ПометитьДокументКПроведению(ПриходныйОрдер.Ссылка, 0);
	
	Если КартаБрака.Количество() > 0 Тогда  // Только проведенный документ может быть основанием для перемещения
		// СкладБрака = EmeWmsУтилиты.ПолучитьСсылкуНаСкладПоКодуEME(КодСклада,,КодОрганизации, "B");
		// #IBS 07.04.2025 Новая схема маппинга
		СкладБрака = EmeWmsУтилиты.ПолучитьСкладБракаДляСклада(ПриходныйОрдер.Склад);
		// #IBS 07.12.2023 Создавать перемещение на брак, если такой склад определен
		Если ЗначениеЗаполнено(СкладБрака) Тогда
			ПеремещениеСсылка = СоздатьИзменитьДокументПеремещенияНаСкладБрака(ERPData, ИдЕМЕ, НомерЕМЕ, ПриходныйОрдер, КартаБрака, СкладБрака, КартаОснований);
			Тема = "Создан документ перемещения на склад брака на основании прихода EME";
			Текст = "На основании " + ПриходныйОрдерСсылка + Символы.ПС + " и документа прихода EME " + ERPData.header.receipt_reg_no + Символы.ПС + 
					" создан документ перемещения на склад брака " + ПеремещениеСсылка;
			EmeWmsУтилиты.ДобавитьНапоминаниеИнтеграции(Текст, ПеремещениеСсылка);
		КонецЕсли;
	КонецЕсли;
		
	СоздатьОтметкуОбИмпортеПриходногоОрдера(ПриходныйОрдер.Ссылка, ИдЕМЕ);
	
	Трассировка = Трассировка + ПриходныйОрдер + Символы.ПС;
	ТемаСообщения = "Создан документ Приходный ордер на товары по приходу EME " + ERPData.header.receipt_reg_no;
	
	EmeWmsERPEngine.Success(ERPData); 
	
КонецПроцедуры

#КонецОбласти

#Область ЭкспортныеСлужебныеПроцедурыИФункции

// Функция ПолучитьИмяСообщения возвращает имя сообщения
Функция ПолучитьИмяСообщения() Экспорт
	Возврат "receipt";
КонецФункции

// Функция ПолучитьМетаданные возвращает метаданные сообщения
Функция ПолучитьМетаданные() Экспорт
	Возврат Метаданные.Документы.ПриходныйОрдерНаТовары;
КонецФункции

#КонецОбласти

#Область ЛокальныеСлужебныеПроцедурыИФункции

// #IBS 05.05.2023 В карте товаров - всё принятое, в карте брака - только брак
// Карта товаров: ключ = UID товара + UID серии + UID характеристики, значение = количество в ед.хранения
Процедура ПолучитьКоличестваТоваровСБраком(ERPData, КодЗоны, КодЗоныБрака, КартаТоваров, КартаБрака, КартаОснований)
	
	//	Использование серий в интеграции
	ИспользоватьСерии = Константы.EmeWmsИспользоватьСерии.Получить();	

	КлючиТоваров = Новый Соответствие();
	НомераСерий = Новый Соответствие;        
	СерийныеНомера = Новый Соответствие;
	НомераХарактеристик = Новый Соответствие;
	
	// Заполнить карту серийных номеров товара (строка номеров по номеру строки)
	EmeWmsERPEngine.SelectChild(ERPData, "numbers");
	Пока EmeWmsERPEngine.NextChildLine(ERPData) Цикл 
		// Номер серии: WMS "-" = 1С "Неизвестная серия"	
		СерийныйНомер = ?(ERPData.numbers.serial_no <> "-", ERPData.numbers.serial_no, "Неизвестная серия");
		
		КлючСтроки = ERPData.numbers.receipt_line_id;
		СтрокаНомеров = СерийныеНомера.Получить(КлючСтроки);
		СерийныеНомера.Вставить(КлючСтроки, ?(СтрокаНомеров = неопределено, СерийныйНомер, СтрокаНомеров + "," + СерийныйНомер));
	КонецЦикла;	

	// Весь товар в сообщении
	EmeWmsERPEngine.SelectChild(ERPData, "lines");
	Пока EmeWmsERPEngine.NextChildLine(ERPData) Цикл
		//	Проверим товар
		УИДТовара = ERPData.lines.goods_id;
		УИДЕдиницы = ERPData.lines.pack_id;
		Если УИДТовара = "" Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "GDSNUL");
			Продолжить
		КонецЕсли;
		
		ТоварСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаТовар(УИДТовара);
		Если ТоварСсылка.Пустая() Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "GDSBAD");
			Продолжить
		КонецЕсли;
		
		ЕдиницаИзмерения = EmeWmsУтилиты.ПолучитьСсылкуНаЕдиницуИзмерения(УИДЕдиницы);
		Если ЕдиницаИзмерения.Пустая() Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "PCKBAD");
			Продолжить
		КонецЕсли;
		
		РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТоварСсылка, "ВестиУчетПоСериям, ВестиУчетПоХарактеристикам"); 

		Если Не ИспользоватьСерии Тогда
			РеквизитыНоменклатуры.ВестиУчетПоСериям = Ложь;
		КонецЕсли;
		
		СерияНоменклатуры 		   	= Неопределено;
		ХарактеристикаНоменклатуры 	= Неопределено;
		
		Если РеквизитыНоменклатуры.ВестиУчетПоСериям Тогда   
			СерийныйНомер 	 = ERPData.lines.lot_no;
			ДатаГодности  	 = ERPData.lines.bbd;
			ДатаПроизводства = ERPData.lines.prd; 
			
			СерияНоменклатуры = EmeWmsУтилиты.ПолучитьСериюПоНаименованию(ERPData.lines.lot_no, ТоварСсылка);
		ИначеЕсли РеквизитыНоменклатуры.ВестиУчетПоХарактеристикам Тогда
			ХарактеристикаНоменклатуры = EmeWmsУтилиты.ПолучитьХарактеристикуПоНаименованию(ERPData.lines.lot_no, ТоварСсылка);
		КонецЕсли;
		
		// Номера серий по строкам
		НомераСерий.Вставить(ERPData.lines.id, СерияНоменклатуры);
		НомераХарактеристик.Вставить(ERPData.lines.id, ХарактеристикаНоменклатуры);
		
		КлючиТоваров.Вставить(ERPData.lines.id, ТоварСсылка);
		КодЗоны = ERPData.lines.zone_to_code;
		КлючТовара = EmeWmsУтилиты.СоздатьКлючТовара(ТоварСсылка, СерияНоменклатуры, ХарактеристикаНоменклатуры);
		КоличествоВБазовой = EmeWmsУтилиты.ПересчетВДругуюЕдиницу(ERPData.lines.receipt_qty, ЕдиницаИзмерения, ТоварСсылка.БазоваяЕдиницаИзмерения);
		КоличествоПоКарте = ?(КартаТоваров.Получить(КлючТовара) = неопределено, 0.0, КартаТоваров.Получить(КлючТовара));
		
		КартаТоваров.Вставить(КлючТовара, КоличествоПоКарте + КоличествоВБазовой);
		Если EmeWmsСтатусы.ИспользоватьКакСтатус(ERPData.lines.stock_status) = "B" Тогда // Добавим количество в карту брака
			КодЗоныБрака = ERPData.lines.zone_to_code;
			КоличествоПоКарте = ?(КартаБрака.Получить(КлючТовара) = неопределено, 0.0, КартаБрака.Получить(КлючТовара));
			КартаБрака.Вставить(КлючТовара, КоличествоПоКарте + КоличествоВБазовой);
			
			//	Маппинг кодов оснований EME.WMS и причин корректировки 1С
			//	E07	Поставщик - Поставщик
			//	E10	Пересорт - Пересорт
			//	E08	Брак - Брак
			//	E09	Недостача - Недостача
			//	E25	Нет маркировки – Нет маркировки											
			Если ЗначениеЗаполнено(ERPData.lines.reason_code) Тогда				
				Если ERPData.lines.reason_code = "E07" Тогда
					КартаОснований.Вставить(КлючТовара, Новый Структура("Причина, КомментарийКПричине", 
						ПредопределенноеЗначение("Перечисление.ПричиныКорректировки.Поставщик"), ERPData.lines.comment));	            
				ИначеЕсли ERPData.lines.reason_code = "E10" Тогда
					КартаОснований.Вставить(КлючТовара, Новый Структура("Причина, КомментарийКПричине", 
						ПредопределенноеЗначение("Перечисление.ПричиныКорректировки.Пересорт"), ERPData.lines.comment));	            					
				ИначеЕсли ERPData.lines.reason_code = "E08" Тогда
					КартаОснований.Вставить(КлючТовара, Новый Структура("Причина, КомментарийКПричине", 
						ПредопределенноеЗначение("Перечисление.ПричиныКорректировки.Брак"), ERPData.lines.comment));	            					
				ИначеЕсли ERPData.lines.reason_code = "E09" Тогда
					КартаОснований.Вставить(КлючТовара, Новый Структура("Причина, КомментарийКПричине", 
						ПредопределенноеЗначение("Перечисление.ПричиныКорректировки.Недостача"), ERPData.lines.comment));	            					
				ИначеЕсли ERPData.lines.reason_code = "E25" Тогда
					КартаОснований.Вставить(КлючТовара, Новый Структура("Причина, КомментарийКПричине", 
						ПредопределенноеЗначение("Перечисление.ПричиныКорректировки.НетМаркировки"), ERPData.lines.comment));	            					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(КодЗоныБрака) ИЛИ КодЗоны = КодЗоныБрака Тогда
		КодЗоныБрака = "BRAK"; // По умолчанию, если в строках не заполнено
	КонецЕсли;
	
КонецПроцедуры

//	Получить серию товара по номеру или создать новую
Функция ПолучитьСериюПоНомеру(СерийныйНомер, Товар, ВидНоменклатуры)
	Если НЕ ЗначениеЗаполнено(СерийныйНомер) Тогда
		Возврат Справочники.СерииНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	СерияСсылка = Справочники.СерииНоменклатуры.НайтиПоРеквизиту("Номер", СерийныйНомер,, ВидНоменклатуры);
	Если СерияСсылка.Пустая() Тогда
		Серия = Справочники.СерииНоменклатуры.СоздатьЭлемент();
		Серия.ВидНоменклатуры 	= ВидНоменклатуры;
		Серия.Наименование 		= СерийныйНомер;
		Серия.Номер 			= СерийныйНомер;
		Серия.Записать();
		СерияСсылка = Серия.Ссылка;
	КонецЕсли;
	
	Возврат СерияСсылка;
КонецФункции

// Функция создает документ перемещения на склад брака по карте товаров брака, возвращает ссылку на документ перемещения
Функция СоздатьИзменитьДокументПеремещенияНаСкладБрака(ERPData, ИдЕМЕ, НомерЕМЕ, Распоряжение, КартаБрака, СкладБрака, КартаОснований)
	//	Использование серий в интеграции
	ИспользоватьСерии = Константы.EmeWmsИспользоватьСерии.Получить();	

	ДокументСсылка = НайтиДокументПеремещенияТоваров(ИдЕМЕ);
	Если ДокументСсылка.Пустая() Тогда
		Документ = Документы.ПеремещениеТоваров.СоздатьДокумент();
		Документ.Заполнить(Распоряжение);
		Документ.Дата = ТекущаяДата();
		Документ.Организация = Распоряжение.Организация;
		Документ.СкладОтправитель = Распоряжение.Склад;
		Документ.СкладПолучатель =  СкладБрака;
		Документ.ОтражатьВБухгалтерскомУчете = Истина;
		Документ.ОтражатьВУправленческомУчете = Истина;
		Документ.ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.ТоварыПродукция;
		
		Документ.Комментарий = "Создан на основании документа прихода EME: " +
			НомерЕМЕ + " (" + ИдЕМЕ + ")" + " (" + ERPData.header.comment + ")";
	Иначе
		Документ = ДокументСсылка.ПолучитьОбъект();
		Документ.Товары.Очистить();		
		Документ.Комментарий = "Изменен на основании документа прихода EME: " +
			НомерЕМЕ + " (" + ИдЕМЕ + ")" + " (" + ERPData.header.comment + ")";
	КонецЕсли;
		
	EmeWmsУтилиты.СкорректироватьТЧДокумента(Документ.Товары, КартаБрака, Истина);
	EmeWmsУтилиты.ЗаполнитьСерииТоваровПоДокументуОснованию(Документ.Товары, Распоряжение);
	
	ПересчитатьУпаковкиДокумента(Документ);
	// EmeWmsДрайвер.ЗаполнитьСтатусыУказанияСерий(Документ, Документы.ПеремещениеТоваров);

   	//	Карта заказов
	КартаЗаказов = Новый Соответствие;	
	Для Каждого СтрокаТовара из Распоряжение.Товары Цикл
		ТоварСсылка			= СтрокаТовара.Номенклатура;
		ТоварСерия 			= Неопределено;
		ТоварХарактеристика = Неопределено;
		
		РеквизитыТовара = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТоварСсылка, "ВестиУчетПоСериям, ВестиУчетПоХарактеристикам");
		Если РеквизитыТовара.ВестиУчетПоСериям Тогда
			ТоварСерия = СтрокаТовара.СерияНоменклатуры;
		ИначеЕсли РеквизитыТовара.ВестиУчетПоХарактеристикам Тогда
			ТоварХарактеристика = СтрокаТовара.ХарактеристикаНоменклатуры;
		КонецЕсли;                                          
		
		КлючТовара = EmeWmsУтилиты.СоздатьКлючТовара(СтрокаТовара.Номенклатура, ТоварСерия, ТоварХарактеристика);
		КартаЗаказов.Вставить(КлючТовара, СтрокаТовара.Заказ);
	КонецЦикла;	

	//	Пересчет реквизитов ТЧ товары
	Для Каждого СтрокаТовара Из Документ.Товары Цикл
		//	Ключ товара
		ТоварСсылка			= СтрокаТовара.Номенклатура;
		ТоварСерия 			= Неопределено;
		ТоварХарактеристика = Неопределено;
		
		РеквизитыТовара = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТоварСсылка, "ВестиУчетПоСериям, ВестиУчетПоХарактеристикам");
		Если РеквизитыТовара.ВестиУчетПоСериям Тогда
			ТоварСерия = СтрокаТовара.СерияНоменклатуры;
		ИначеЕсли РеквизитыТовара.ВестиУчетПоХарактеристикам Тогда
			ТоварХарактеристика = СтрокаТовара.ХарактеристикаНоменклатуры;
		КонецЕсли;                                          
		
		КлючТовара = EmeWmsУтилиты.СоздатьКлючТовара(СтрокаТовара.Номенклатура, ТоварСерия, ТоварХарактеристика);

		//	Документ резерва
		Если ЗначениеЗаполнено(СтрокаТовара.ДокументРезерва) Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументРезерва = КартаЗаказов.Получить(КлючТовара);
		Если ЗначениеЗаполнено(ДокументРезерва) Тогда
			 СтрокаТовара.ДокументРезерва = ДокументРезерва;
		КонецЕсли;				

		Если Не ИспользоватьСерии Тогда
			КлючТовара = EmeWmsУтилиты.СоздатьКлючТовара(СтрокаТовара.Номенклатура, Неопределено, ТоварХарактеристика);
		КонецЕсли;

		//	Причины корректировки
		ПричиныКорректировки = КартаОснований.Получить(КлючТовара);
		Если ЗначениеЗаполнено(ПричиныКорректировки) Тогда
			КартаОснований.Удалить(КлючТовара);   
			 
			Если ТипЗнч(ПричиныКорректировки) = Тип("Структура") Тогда
				ЗаполнитьЗначенияСвойств(СтрокаТовара, ПричиныКорректировки); 
			КонецЕсли;
		Иначе			 
			 СтрокаТовара.Причина = ПредопределенноеЗначение("Перечисление.ПричиныКорректировки.Брак");
		КонецЕсли;

		Если Не ЗначениеЗаполнено(СтрокаТовара.КомментарийКПричине) Тогда
			СтрокаТовара.КомментарийКПричине = Строка(СтрокаТовара.Причина);
		КонецЕсли;
		
	КонецЦикла;
	
	Документ.Записать(РежимЗаписиДокумента.Запись);
	СоздатьОтметкуОбИмпортеПеремещенияТоваров(Документ, ИдЕМЕ);
	// #IBS 04.04.2023 Новый механизм проведения
	EmeWmsПроведениеДокументов.ПометитьДокументКПроведению(Документ.Ссылка, 1);
	
	Возврат Документ.Ссылка;
КонецФункции

// Пересчитывает количества упаковок товара в ТЧ Товары
Процедура ПересчитатьУпаковкиДокумента(Документ)
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоУпаковок");
	Для Каждого СтрокаТовара Из Документ.Товары Цикл
		СтрокаТовара.Коэффициент = СтрокаТовара.ЕдиницаИзмерения.Коэффициент;
		ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТовара, Документ);
	КонецЦикла;
КонецПроцедуры    


// #IBS 29.04.2023 Создает в регистре пометку об импорте приходного ордера с номером прихода в EME
Процедура СоздатьОтметкуОбИмпортеПриходногоОрдера(Документ, ИдEME)
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеПриходныхОрдеровНаТовары.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.ДатаИмпорта = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsОтметкиОбИмпортеПриходныхОрдеровНаТовары.СоздатьМенеджерЗаписи();
	НоваяЗапись.ID = ИдEME;
	НоваяЗапись.Ссылка = Документ.Ссылка;
	НоваяЗапись.ДатаИмпорта = ТекущаяДата();
    НоваяЗапись.Записать(); 
КонецПроцедуры

// Создает в регистре отметку об импорте Перемещения товаров с ID прихода EME
Процедура СоздатьОтметкуОбИмпортеПеремещенияТоваров(Документ, ИдЕМЕ)
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеПеремещенийТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.ДатаИмпорта = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsОтметкиОбИмпортеПеремещенийТоваров.СоздатьМенеджерЗаписи();
	НоваяЗапись.ID = ИдЕМЕ;
	НоваяЗапись.Ссылка = Документ.Ссылка;
	НоваяЗапись.ДатаИмпорта = ТекущаяДата();
    НоваяЗапись.Записать(); 
КонецПроцедуры

// Функция возвращает ссылку на документ Перемещение товаров по ИД EME
Функция НайтиДокументПеремещенияТоваров(ИдЕМЕ)
	Перем Запрос, док1;
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Перемещение.Ссылка КАК Ссылка
		|ИЗ
		|	
		|РегистрСведений.EmeWmsОтметкиОбИмпортеПеремещенийТоваров КАК Перемещение
		|ГДЕ
		|	Перемещение.ID = &ИдЕМЕ";
	Запрос.УстановитьПараметр("ИдЕМЕ", ИдЕМЕ);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		док1 = Выборка.Ссылка.ПолучитьОбъект();
		Если НЕ док1.ПометкаУдаления Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Документы.ПеремещениеТоваров.ПустаяСсылка();

КонецФункции

#КонецОбласти
