//	Copyright (C) 2012-2024 Engineer Mareev Enterprises
//  Модуль для ERP 2.5                                

// 	Изменение характеристик товара со сменой статуса (по инициативе WMS)
// 	Импорт сообщений СHANGE с изменением статуса товара:
//	- Оператор WMS (руч.) создает и оформляет документ изменения характеристик товара со сменой статуса, закрывает его.
//	- WMS (авт.) выгружает сообщение CHANGE (авт.).
//	- 1C (авт.) импортирует сообщение CHANGE.
// 	Если импортируется сообщение CHANGE c изменением статуса товара и, согласно маппингу, меняется склад 1С, то
//	- 1C (авт.) создает документы: Перемещение товаров, Приходный ордер, Расходный ордер.
//	Приходный ордер записывается до статуса "Отгружен", Расходный ордер записывается до статуса "Принят".
//  - 1С (авт.) помечает импортированные документы к автоматическому допроведению.
//	Если импортируется сообщение CHANGE c изменением статуса товара на "B", но склад 1С не меняется, то
// 	- 1С (авт.) Создает документ Ордер на отражение порчи товаров.
//	- 1С помечает импортированный документ к автоматическому допроведению.

// 	$Изменение характеристик товара со сменой партии (по инициативе WMS)
// 	Импорт сообщений СHANGE с изменением партии товара
//	- Оператор WMS (руч.) создает документ изменения характеристик товара со сменой партии товара, закрывает его.
//	- WMS (авт.) выгружает сообщение CHANGE.
//	- 1C (авт.) импортирует сообщение CHANGE.
//	- 1C (авт.) создает документы: Пересортица товаров и Ордер на отражение пересортицы товаров.
//	- 1C (авт.) помечает импортированные документы к автоматическому допроведению.

#Область ПрограммныйИнтерфейс 

// Импортирует сообщение change в документы разного типа
Процедура Импортировать(ERPData, Трассировка, ТемаСообщения) Экспорт
	// ?Тип документа-основания 1С во входящем сообщении
	Если ЗначениеЗаполнено(ERPData.header.erp_doc_type) Тогда // Принимаются сообщения по инициативе wms
		Возврат;
	КонецЕсли;

	// ?Идентификтор документа EME для регистров контроля
	ИдЕМЕ = ERPData.header.change_id;
	// ?Номер документа EME для комментариев
	НомерЕМЕ = ERPData.header.change_reg_no;
	
	// ?Код организации-владельца EME
	КодОрганизации = ERPData.header.vendor_code;
	ОрганизацияСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаОрганизациюПоКодуEME(КодОрганизации);
	Если ОрганизацияСсылка.Пустая() Тогда
		EmeWmsERPEngine.ErrorHeader(ERPData, "VNDBAD");
		Возврат;
	КонецЕсли;
	
	//	Если были ошибки
	Если EmeWmsERPEngine.HasErrors(ERPData) Тогда
		Возврат;
	КонецЕсли;    
	
	// ?Флаг изменения статусов товара. Он без причины устанавливается при экспорте для изменения партий, учтем в условии
	ИзменениеСтатусов = ?(ERPData.header.is_lot_no_change = 0 И ERPData.header.is_status_change = 1, истина, ложь);
	// ?Флаг изменения партий товара
	ИзменениеСерий = ?(ERPData.header.is_lot_no_change = 1, истина, ложь);
	ТаблицаСкладов = РазметитьТаблицуСкладов();

	// Если тип сообщения - изменения статусов, то создаем ордера с перемещением
	Если ИзменениеСтатусов Тогда
		ПолучитьКоличестваПеремещаемыхТоваров(ERPData, ТаблицаСкладов);
		Для каждого СтрокаСкладов Из ТаблицаСкладов Цикл
			СкладОтправитель =	СтрокаСкладов.СкладОтправитель;
			СкладПолучатель = 	СтрокаСкладов.СкладПолучатель;
			КартаТоваров = 		СтрокаСкладов.КартаТоваров;
			СтатусНачальный = 	СтрокаСкладов.СтатусНачальный;
			СтатусКонечный = 	СтрокаСкладов.СтатусКонечный;
			// Это ордерное перемещение по обычной схеме - со склада на склад
			Если СкладОтправитель <> СкладПолучатель Тогда 
				// Создадим новое перемещение, как основание для ордеров
				ПеремещениеСсылка = СоздатьИзменитьДокументПеремещения(ERPData, ИдЕМЕ, НомерЕМЕ, ОрганизацияСсылка, КартаТоваров, СкладОтправитель, СкладПолучатель);
				СоздатьОтметкуОбИмпортеПеремещенияТоваров(ПеремещениеСсылка, ИдЕМЕ);
				
				Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СкладОтправитель, "ИспользоватьОрдернуюСхемуПриОтгрузке") И
				ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СкладОтправитель, "ДатаНачалаОрдернойСхемыПриОтгрузке") <= Дата(ERPData.header.created_at)  Тогда
					РасходныйОрдерСсылка = СоздатьИзменитьДокументРасходныйОрдер(ERPData, ИдЕМЕ, НомерЕМЕ, КартаТоваров, СкладОтправитель, СкладПолучатель, ПеремещениеСсылка);
					СоздатьОтметкуОбИмпортеРасходногоОрдера(РасходныйОрдерСсылка, ИдЕМЕ);      
				КонецЕсли;
				
				Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СкладПолучатель, "ИспользоватьОрдернуюСхемуПриПоступлении") И
						ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СкладПолучатель, "ДатаНачалаОрдернойСхемыПриПоступлении") <= Дата(ERPData.header.created_at)  Тогда
					ПриходныйОрдерСсылка = СоздатьИзменитьДокументПриходныйОрдер(ERPData, ИдЕМЕ, НомерЕМЕ, КартаТоваров, СкладОтправитель, СкладПолучатель, ПеремещениеСсылка);
					СоздатьОтметкуОбИмпортеПриходногоОрдера(ПриходныйОрдерСсылка, ИдЕМЕ);      
				КонецЕсли;
			// Это особый случай списания брака по ордеру на отражение порчи товаров
			ИначеЕсли СтатусНачальный <> СтатусКонечный И СтатусКонечный = "B" Тогда     
				ОрдерСсылка = НайтиОрдерНаОтражениеПорчиТоваров(ИдЕМЕ);
				Если ОрдерСсылка.Пустая() Тогда
					Ордер = Документы.ОрдерНаОтражениеПорчиТоваров.СоздатьДокумент();
					Ордер.Дата = ТекущаяДата();
					Ордер.Склад = СкладОтправитель;
					Ордер.Комментарий = "Создан автоматом на основании документа изменения характеристик EME: " +
					НомерЕМЕ + " (" + ИдЕМЕ + ")" + " (" + ERPData.header.comment + ")";
				Иначе
					Ордер = ОрдерСсылка.ПолучитьОбъект();
				КонецЕсли;   

				EmeWmsУтилиты.СкорректироватьТЧДокумента(Ордер.Товары, КартаТоваров, Истина);
				Ордер.Записать(РежимЗаписиДокумента.Проведение);
				СоздатьОтметкуОбИмпортеОрдераНаОтражениеПорчиТоваров(Ордер.Ссылка, ИдЕМЕ);
				EmeWmsПроведениеДокументов.ПометитьДокументКПроведению(Ордер.Ссылка);

				Трассировка = Трассировка + Ордер + Символы.ПС;
				ТемаСообщения = "Создан документ Ордер на отражение порчи товаров на основании документа изменения характеристик EME " + НомерЕМЕ;
			КонецЕсли;
		КонецЦикла;     
	// Если тип сообщения - изменения серий, то создаем ордера на отражение пересортицы
	ИначеЕсли ИзменениеСерий Тогда
		ПолучитьКоличестваПересортицыТоваров(ERPData, ТаблицаСкладов);
		Для каждого СтрокаСкладов Из ТаблицаСкладов Цикл
			СкладОтправитель =	СтрокаСкладов.СкладОтправитель;
			КартаПересорта = 	СтрокаСкладов.КартаТоваров;

			Параметры = Новый Структура;
			Параметры.Вставить("ИспользоватьОрдернуюСхему", Ложь);
			Параметры.Вставить("ПересчетТоваровСсылка", 	Неопределено);
			Параметры.Вставить("СкладСсылка", 				СкладОтправитель);
			Параметры.Вставить("ОрганизацияСсылка", 		ОрганизацияСсылка);
			Параметры.Вставить("ИдЕМЕ", 					ИдЕМЕ);
			Параметры.Вставить("НомерЕМЕ", 					НомерЕМЕ);
			Параметры.Вставить("ERPData", 					ERPData);    
			Параметры.Вставить("ТаблицаПересорта", 			КартаПересорта);
			
			Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СкладОтправитель, "ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач")
				И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СкладОтправитель, "ДатаНачалаОрдернойСхемыПриОтраженииИзлишковНедостач")
				<= Дата(ERPData.header.created_at)  Тогда
			
				ОрдерПересортаСсылка = СоздатьИзменитьДокументОрдерНаОтражениеПересорта(ERPData, ИдЕМЕ, НомерЕМЕ, КартаПересорта, СкладОтправитель, Неопределено);
				СоздатьОтметкуОбИмпортеОрдераНаОтражениеПересортаТоваров(ОрдерПересортаСсылка, ИдЕМЕ);      
				EmeWmsПроведениеДокументов.ПометитьДокументКПроведению(ОрдерПересортаСсылка, 1);
			КонецЕсли;
		
			СоздатьИзменитьДокументПересортицаТоваров(Параметры);
		КонецЦикла;     
	Иначе     
		Возврат;
	КонецЕсли;

	EmeWmsERPEngine.Success(ERPData);
КонецПроцедуры

#КонецОбласти

#Область ЭкспортныеСлужебныеПроцедурыИФункции

//	Функция ПолучитьИмяСообщения возвращает имя сообщения
Функция ПолучитьИмяСообщения() Экспорт
	Возврат "change";
КонецФункции

//	Функция ПолучитьМетаданные возвращает метаданные сообщения
Функция ПолучитьМетаданные() Экспорт
	Возврат Метаданные.Документы.ПеремещениеТоваров;
КонецФункции

#КонецОбласти

#Область ЛокальныеСлужебныеПроцедурыИФункции

// #IBS 21.05.2023 Таблица для складов по сообщению
Функция РазметитьТаблицуСкладов()
	ТаблицаСкладов = Новый ТаблицаЗначений;
	ТаблицаСкладов.Колонки.Добавить("СкладОтправитель");
	ТаблицаСкладов.Колонки.Добавить("СкладПолучатель");
	ТаблицаСкладов.Колонки.Добавить("КартаТоваров");
	ТаблицаСкладов.Колонки.Добавить("СтатусНачальный");
	ТаблицаСкладов.Колонки.Добавить("СтатусКонечный");
	
	Возврат ТаблицаСкладов;
КонецФункции

// #IBS 16.05.2023 Таблица для данных пересорта
Функция РазметитьТаблицуПересорта()
	ТаблицаПересорта = Новый ТаблицаЗначений;
	ТаблицаПересорта.Колонки.Добавить("ТоварСписания");
	ТаблицаПересорта.Колонки.Добавить("ЕдиницаИзмеренияСписания");
	ТаблицаПересорта.Колонки.Добавить("СерияСписания");
	ТаблицаПересорта.Колонки.Добавить("ХарактеристикаСписания");
	ТаблицаПересорта.Колонки.Добавить("КоличествоСписания");
	ТаблицаПересорта.Колонки.Добавить("ТоварОприходования");
	ТаблицаПересорта.Колонки.Добавить("ЕдиницаИзмеренияОприходования");
	ТаблицаПересорта.Колонки.Добавить("СерияОприходования");
	ТаблицаПересорта.Колонки.Добавить("ХарактеристикаОприходования");
	ТаблицаПересорта.Колонки.Добавить("КоличествоОприходования");
	
	Возврат ТаблицаПересорта;
КонецФункции

// #IBS 05.12.2024 получить таблицу складов с картами товаров   
// Таблица складов: склад-отправитель, склад-получачель, карта товаров
// Карта товаров: ключ = UID товара + UID серии + UID характеристики, значение = количество в ед.хранения
Процедура ПолучитьКоличестваПеремещаемыхТоваров(ERPData, ТаблицаСкладов)
	// Для типа сообщения с изменения статуса организация и склад не меняются
	КодСкладаОтправителя = ERPData.header.whs_code;
	КодСкладаПолучателя = КодСкладаОтправителя;
	КодОрганизацииОтправителя = ERPData.header.vendor_code;
	КодОрганизацииПолучателя = КодОрганизацииОтправителя;
	
	// Весь товар в сообщении
	EmeWmsERPEngine.SelectChild(ERPData, "lines");
	Пока EmeWmsERPEngine.NextChildLine(ERPData) Цикл
		// ?Код зоны ЕМЕ
		КодЗоныОтправителя = ERPData.lines.zone_code;
		// ?Старый статус товара
		СтатусНачальный = ERPData.lines.old_stock_status;
		СкладОтправитель 	= EmeWmsУтилиты.ПолучитьСсылкуНаСкладПоКодуEME(КодСкладаОтправителя, КодЗоныОтправителя, КодОрганизацииОтправителя, СтатусНачальный);
		Если СкладОтправитель.Пустая() Тогда
			// #IBS Это не ошибка. Есть статусы вне маппинга
			//EmeWmsERPEngine.ErrorHeader(ERPData, "WHSBAD");
			Продолжить;
		КонецЕсли;

		// ?Код зоны ЕМЕ
		КодЗоныПолучателя = ERPData.lines.zone_code;
		// ?Новый статус товара
		СтатусКонечный = ERPData.lines.new_stock_status;
		СкладПолучатель 	= EmeWmsУтилиты.ПолучитьСсылкуНаСкладПоКодуEME(КодСкладаПолучателя, КодЗоныПолучателя, КодОрганизацииПолучателя, СтатусКонечный);
		Если СкладПолучатель.Пустая() Тогда
			// #IBS Это не ошибка. Есть статусы вне маппинга
			//EmeWmsERPEngine.ErrorHeader(ERPData, "WTOBAD");
			Продолжить;
		КонецЕсли;     
		
		// Затем найдем товары и единицы
		УИДТовара = ERPData.lines.goods_id;
		УИДЕдиницы = ERPData.lines.pack_id;
		Если УИДТовара = "" Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "GDSNUL");
			Продолжить
		КонецЕсли;  
		
		// Теперь найдем пару складов в таблице складов
		КартаТоваров = Неопределено;
		Для Каждого СтрокаСкладов из ТаблицаСкладов Цикл
			Если СтрокаСкладов.СкладОтправитель = СкладОтправитель И СтрокаСкладов.СкладПолучатель = СкладПолучатель И    
				СтрокаСкладов.СтатусНачальный = СтатусНачальный И СтрокаСкладов.СтатусКонечный = СтатусКонечный Тогда
				 КартаТоваров = СтрокаСкладов.КартаТоваров;
			КонецЕсли;
		КонецЦикла;
		// Если нет такой, создадим строку складов
		Если КартаТоваров = Неопределено Тогда     
			КартаТоваров = Новый Соответствие;;
			СтрокаСкладов = ТаблицаСкладов.Добавить();
			СтрокаСкладов.СкладОтправитель = СкладОтправитель;
			СтрокаСкладов.СкладПолучатель = СкладПолучатель;
			СтрокаСкладов.КартаТоваров = КартаТоваров;
			СтрокаСкладов.СтатусНачальный = СтатусНачальный;
			СтрокаСкладов.СтатусКонечный = СтатусКонечный;
		КонецЕсли;
		
		
		ТоварСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаТовар(УИДТовара);
		Если ТоварСсылка.Пустая() Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "GDSBAD");
			Продолжить
		КонецЕсли;
		
		ЕдиницаИзмерения = EmeWmsУтилиты.ПолучитьСсылкуНаЕдиницуИзмерения(УИДЕдиницы);
		Если ЕдиницаИзмерения.Пустая() Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "PCKBAD");
			Продолжить
		КонецЕсли;
		
		ВидНоменклатуры				= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТоварСсылка, 	 "ВидНоменклатуры");
		ИспользоватьСерии			= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидНоменклатуры, "ИспользоватьСерии");  
		
		СерияНоменклатуры 		   	= Неопределено;
		ХарактеристикаНоменклатуры 	= Неопределено;
			
		Если ИспользоватьСерии Тогда 
			
			Если ERPData.lines.old_lot_no <> "-" Тогда
				СерийныйНомер = ERPData.lines.old_lot_no;
			Иначе				
				СерийныйНомер = "Неизвестная серия";			
			КонецЕсли;
			// В данном проекте учет серии только по номеру
			СерияНоменклатуры = EmeWmsУтилиты.ПолучитьСериюПоНомеруИВидуНоменклатуры(СерийныйНомер, ВидНоменклатуры);
		Иначе                  
			ИспользованиеХарактеристик = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТоварСсылка,"ИспользованиеХарактеристик");  
			
			Если ИспользованиеХарактеристик <> Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать Тогда      
				ХарактеристикаНоменклатуры = EmeWmsУтилиты.ПолучитьХарактеристикуПоНаименованию(ERPData.lines.old_lot_no, ТоварСсылка, Истина);
			КонецЕсли;                           
		КонецЕсли;                           

		КлючТовара = EmeWmsУтилиты.СоздатьКлючТовара(ТоварСсылка, СерияНоменклатуры, ХарактеристикаНоменклатуры);
		КоличествоВБазовой = EmeWmsУтилиты.ПересчетВБазовуюЕдиницу(ERPData.lines.quantity, ЕдиницаИзмерения, ТоварСсылка.ЕдиницаИзмерения);
		КоличествоПоКарте = ?(КартаТоваров.Получить(КлючТовара) = неопределено, 0.0, КартаТоваров.Получить(КлючТовара));
		КартаТоваров.Вставить(КлючТовара, КоличествоПоКарте + КоличествоВБазовой);
	КонецЦикла;
	
КонецПроцедуры

// #IBS 05.12.2024 получить таблицу складов с картами пересорта товаров   
// Таблица складов: склад-отправитель, карта товаров
// Карта товаров: ключ = UID товара + UID серии + UID характеристики, значение = количество в ед.хранения
Процедура ПолучитьКоличестваПересортицыТоваров(ERPData, ТаблицаСкладов)
	КодСкладаОтправителя = ERPData.header.whs_code;
	КодОрганизацииОтправителя = ERPData.header.vendor_code;
	
	// Весь товар в сообщении
	EmeWmsERPEngine.SelectChild(ERPData, "lines");
	Пока EmeWmsERPEngine.NextChildLine(ERPData) Цикл
		КодЗоныОтправителя = ERPData.lines.zone_code;
		СтатусНачальный = ERPData.lines.old_stock_status;
		СкладОтправитель 	= EmeWmsУтилиты.ПолучитьСсылкуНаСкладПоКодуEME(КодСкладаОтправителя, КодЗоныОтправителя, КодОрганизацииОтправителя, СтатусНачальный);
		Если СкладОтправитель.Пустая() Тогда
			EmeWmsERPEngine.ErrorHeader(ERPData, "WHSBAD");
			Возврат;
		КонецЕсли;

		// Затем найдем товары и единицы
		УИДТовара = ERPData.lines.goods_id;
		УИДЕдиницы = ERPData.lines.pack_id;
		Если УИДТовара = "" Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "GDSNUL");
			Продолжить
		КонецЕсли;  
		
		// Теперь найдем пару складов в таблице складов
		ТаблицаПересорта = Неопределено;
		Для Каждого СтрокаСкладов из ТаблицаСкладов Цикл
			Если СтрокаСкладов.СкладОтправитель = СкладОтправитель Тогда
				ТаблицаПересорта = СтрокаСкладов.КартаТоваров;
			КонецЕсли;
		КонецЦикла;
		// Если нет такой, создадим строку складов
		Если ТаблицаПересорта = Неопределено Тогда     
			ТаблицаПересорта = РазметитьТаблицуПересорта();
			СтрокаСкладов = ТаблицаСкладов.Добавить();
			СтрокаСкладов.СкладОтправитель = СкладОтправитель;
			СтрокаСкладов.КартаТоваров = ТаблицаПересорта;
			СтрокаСкладов.СтатусНачальный = СтатусНачальный;
		КонецЕсли;
		
		ТоварСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаТовар(УИДТовара);
		Если ТоварСсылка.Пустая() Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "GDSBAD");
			Продолжить
		КонецЕсли;
		
		ЕдиницаИзмерения = EmeWmsУтилиты.ПолучитьСсылкуНаЕдиницуИзмерения(УИДЕдиницы);
		Если ЕдиницаИзмерения.Пустая() Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "PCKBAD");
			Продолжить
		КонецЕсли;
		
		ВидНоменклатуры				= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТоварСсылка, 	 "ВидНоменклатуры");
		ИспользоватьСерии			= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидНоменклатуры, "ИспользоватьСерии");  
		
		СерияНачальная	 		   	= Неопределено;
		СерияКонечная	 		   	= Неопределено;
		ХарактеристикаНачальная 	= Неопределено;
		ХарактеристикаКонечная 		= Неопределено;
			
		Если ИспользоватьСерии Тогда 
			
			Если ERPData.lines.old_lot_no <> "-" Тогда
				СерийныйНомерНачальный = ERPData.lines.old_lot_no;
			Иначе				
				СерийныйНомерНачальный = "Неизвестная серия";			
			КонецЕсли;
			Если ERPData.lines.new_lot_no <> "-" Тогда
				СерийныйНомерКонечный = ERPData.lines.new_lot_no;
			Иначе				
				СерийныйНомерКонечный = "Неизвестная серия";			
			КонецЕсли;
			// В данном проекте учет серии только по номеру
			СерияНачальная = EmeWmsУтилиты.ПолучитьСериюПоНомеруИВидуНоменклатуры(СерийныйНомерНачальный, ВидНоменклатуры);
			СерияКонечная = EmeWmsУтилиты.ПолучитьСериюПоНомеруИВидуНоменклатуры(СерийныйНомерКонечный, ВидНоменклатуры);
		Иначе                  
			ИспользованиеХарактеристик = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТоварСсылка,"ИспользованиеХарактеристик");  
			
			Если ИспользованиеХарактеристик <> Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать Тогда      
				ХарактеристикаНачальная = EmeWmsУтилиты.ПолучитьХарактеристикуПоНаименованию(ERPData.lines.old_lot_no, ТоварСсылка, Истина);
				ХарактеристикаКонечная  = EmeWmsУтилиты.ПолучитьХарактеристикуПоНаименованию(ERPData.lines.new_lot_no, ТоварСсылка, Истина);
			КонецЕсли;                           
		КонецЕсли;                           


		КоличествоВБазовой = EmeWmsУтилиты.ПересчетВБазовуюЕдиницу(ERPData.lines.quantity, ЕдиницаИзмерения, ТоварСсылка.ЕдиницаИзмерения);
		
		СтрокаПересорта = ТаблицаПересорта.Добавить();
		СтрокаПересорта.ТоварСписания = ТоварСсылка;
		СтрокаПересорта.ЕдиницаИзмеренияСписания = ТоварСсылка.ЕдиницаИзмерения;
		СтрокаПересорта.СерияСписания = СерияНачальная;
		СтрокаПересорта.ХарактеристикаСписания = ХарактеристикаНачальная;
		СтрокаПересорта.КоличествоСписания = КоличествоВБазовой;
		СтрокаПересорта.ТоварОприходования = ТоварСсылка;
		СтрокаПересорта.ЕдиницаИзмеренияОприходования = ТоварСсылка.ЕдиницаИзмерения;
		СтрокаПересорта.СерияОприходования = СерияКонечная;
		СтрокаПересорта.ХарактеристикаОприходования = ХарактеристикаКонечная;
		СтрокаПересорта.КоличествоОприходования = КоличествоВБазовой;
	КонецЦикла;
	
КонецПроцедуры

// 	#IBS 05.12.2024 Создает или корректирует документ Перемещения товаров
Функция СоздатьИзменитьДокументПеремещения(ERPData, ИдЕМЕ, НомерЕМЕ, ОрганизацияСсылка, КартаТоваров, СкладОтправитель, СкладПолучатель)

	ДокументСсылка = НайтиДокументПеремещенияТоваров(ИдЕМЕ);
	Если ДокументСсылка.Пустая() Тогда
		Документ = Документы.ПеремещениеТоваров.СоздатьДокумент();
		// Документ.Заполнить(Распоряжение); // Заполнение по основанию: приобретение товаров.
		Документ.Дата = ТекущаяДата();
		Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
		Документ.Организация = ОрганизацияСсылка;
		Документ.СкладОтправитель = СкладОтправитель;
		Документ.СкладПолучатель =  СкладПолучатель;
		Документ.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз;
		// #IBS Это важная для проведения опция. В этом случае документом-основанием в регистрах ставится само перемещение
		Документ.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
		Документ.Комментарий = "Создан на основании документа изменения характеристик EME: " +
			НомерЕМЕ + " (" + ИдЕМЕ + ")" + " (" + ERPData.header.comment + ")";
	Иначе
		Документ = ДокументСсылка.ПолучитьОбъект();
		Документ.Комментарий = "Изменен на основании документа изменения характеристик EME: " +
			НомерЕМЕ + " (" + ИдЕМЕ + ")" + " (" + ERPData.header.comment + ")";
	КонецЕсли;

	EmeWmsУтилиты.СкорректироватьТЧДокумента(Документ.Товары, КартаТоваров, Истина);		
	EmeWmsДрайвер.ЗаполнитьСтатусыУказанияСерий(Документ, Документы.ПеремещениеТоваров);
	ПересчитатьУпаковкиДокумента(Документ);
	Документ.Статус = Перечисления.СтатусыПеремещенийТоваров.Отгружено;
	Документ.Записать(РежимЗаписиДокумента.Запись);             
	// #IBS Иначе не формирует только движение ухода со склада
	Документ.Статус = Перечисления.СтатусыПеремещенийТоваров.Принято;

	Документ.Записать(РежимЗаписиДокумента.Запись);
	EmeWmsПроведениеДокументов.ПометитьДокументКПроведению(Документ.Ссылка);
	
	Возврат Документ.Ссылка;
КонецФункции

// #IBS 30.11.2023 Пересчет количества упаковок и сумм документа
Процедура ПересчитатьУпаковкиДокумента(Документ)
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоУпаковок");
	Для Каждого СтрокаТовара Из Документ.Товары Цикл
        EmeWmsДрайвер.ОбработатьСтрокуТЧ(СтрокаТовара, СтруктураДействий, Неопределено); 
	КонецЦикла;
КонецПроцедуры    

// 	#IBS 05.12.2024 Создает или корректирует документ Расходный ордер
Функция СоздатьИзменитьДокументРасходныйОрдер(ERPData, ИдЕМЕ, НомерЕМЕ, КартаТоваров, СкладОтправитель, СкладПолучатель, ПеремещениеСсылка)
	ОрдерСсылка = НайтиРасходныйОрдерНаТовары(ИдЕМЕ);
	Если ОрдерСсылка.Пустая() Тогда
		Ордер = Документы.РасходныйОрдерНаТовары.СоздатьДокумент();
		Ордер.Дата = ТекущаяДата();
		Ордер.Склад = СкладОтправитель;
		Ордер.Получатель = СкладПолучатель;
		Ордер.Приоритет = Справочники.Приоритеты.НайтиПоНаименованию("Средний");
		Ордер.СкладскаяОперация = Перечисления.СкладскиеОперации.ОтгрузкаПоПеремещению;
		Ордер.Комментарий = "Документ создан на основании документа изменения характеристик EME: " + НомерЕМЕ + " (" + ИдЕМЕ + ")";
	Иначе
		Ордер = ОрдерСсылка.ПолучитьОбъект();
		Ордер.Комментарий = "Документ изменен на основании документа изменения характеристик EME: " + НомерЕМЕ + " (" + ИдЕМЕ + ")";
	КонецЕсли;                               
	
	EmeWmsУтилиты.СкорректироватьТЧДокумента(Ордер.ТоварыПоРаспоряжениям, КартаТоваров,, Ложь);
	ЗаполнитьРаспоряжениеНаОтгрузку(Ордер, ПеремещениеСсылка);
	// Особая коррекция ТЧ отгружаемые товары с изменением статуса строк при недогрузе
	EmeWmsУтилиты.СкорректироватьТЧОтгружаемыеТовары(Ордер.ОтгружаемыеТовары, КартаТоваров);
	ЗаполнитьСтатусыУказанияСерийРасходногоОрдера(Ордер);
	Ордер.Статус = Перечисления.СтатусыРасходныхОрдеров.КОтбору;
	Ордер.ДатаОтгрузки = ТекущаяДата(); 

	Ордер.Записать(РежимЗаписиДокумента.Запись);    
	
	// Для формирования движений отгрузки
	Ордер.Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен;
	Ордер.Записать(РежимЗаписиДокумента.Запись);    
	
	EmeWmsПроведениеДокументов.ПометитьДокументКПроведению(Ордер.Ссылка, 1);
	
	Возврат Ордер.Ссылка;
КонецФункции

// #IBS 01.12.2023 Очищает и перезаполняет статус указания серий в расходном ордере
Процедура ЗаполнитьСтатусыУказанияСерийРасходногоОрдера(Ордер)
	ПараметрыУказанияСерий = Документы.РасходныйОрдерНаТовары.ПараметрыУказанияСерий(Ордер);
	
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Ордер, ПараметрыУказанияСерий.ТоварыПоРаспоряжениям); 
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Ордер, ПараметрыУказанияСерий.ОтгружаемыеТовары); 
КонецПроцедуры

// #IBS 12.05.2023 Заполнить распоряжение на отгрузку по строкам
Процедура ЗаполнитьРаспоряжениеНаОтгрузку(РасходныйОрдер, РаспоряжениеНаОтгрузку)
	Для каждого стр1 из РасходныйОрдер.ТоварыПоРаспоряжениям Цикл
		стр1.Распоряжение = РаспоряжениеНаОтгрузку;
	КонецЦикла;
КонецПроцедуры

// 	#IBS 05.12.2024 Создает или корректирует документ Приходный ордер
Функция СоздатьИзменитьДокументПриходныйОрдер(ERPData, ИдЕМЕ, НомерЕМЕ, КартаТоваров, СкладОтправитель, СкладПолучатель, ПеремещениеСсылка)
	ОрдерСсылка = НайтиПриходныйОрдерНаТовары(ИдЕМЕ);
	Если ОрдерСсылка.Пустая() Тогда
		ПриходныйОрдер = Документы.ПриходныйОрдерНаТовары.СоздатьДокумент();
		ПриходныйОрдер.Дата = ТекущаяДата();
		ПриходныйОрдер.Склад = СкладПолучатель;         
		ПриходныйОрдер.Отправитель = СкладОтправитель;
		ПриходныйОрдер.Распоряжение = ПеремещениеСсылка;                    
		ПриходныйОрдер.СкладскаяОперация = Перечисления.СкладскиеОперации.ПриемкаПоПеремещению;
		ПриходныйОрдер.Статус = Перечисления.СтатусыПриходныхОрдеров.Принят;
		ПриходныйОрдер.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
		ПриходныйОрдер.Комментарий = "Документ создан на основании документа изменения характеристик EME: " + 
		НомерЕМЕ + " (" + ИдЕМЕ + ")" + " (" + ERPData.header.comment + ")";
	Иначе
		ПриходныйОрдер = ОрдерСсылка.ПолучитьОбъект();
		ПриходныйОрдер.Комментарий = "Документ скорректирован на основании документа изменения характеристик EME: " + 
		НомерЕМЕ + " (" + ИдЕМЕ + ")" + " (" + ERPData.header.comment + ")";
	КонецЕсли;
	
	EmeWmsУтилиты.СкорректироватьТЧДокумента(ПриходныйОрдер.Товары, КартаТоваров, Истина);
	EmeWmsДрайвер.ЗаполнитьСтатусыУказанияСерий(ПриходныйОрдер, Документы.ПриходныйОрдерНаТовары);
	ПриходныйОрдер.Записать(РежимЗаписиДокумента.Запись);

	ПриходныйОрдер.Статус = Перечисления.СтатусыПриходныхОрдеров.Принят;
	ПриходныйОрдер.Записать(РежимЗаписиДокумента.Запись);

	EmeWmsПроведениеДокументов.ПометитьДокументКПроведению(ПриходныйОрдер.Ссылка, 2);
	
	Возврат ПриходныйОрдер.Ссылка;
КонецФункции

// 	#IBS 06.12.2024 Создает или корректирует документ Ордер на отражение пересортицы
Функция СоздатьИзменитьДокументОрдерНаОтражениеПересорта(ERPData, ИдЕМЕ, НомерЕМЕ, ТаблицаПересорта, СкладСсылка, ОснованиеСсылка)
	ОрдерПересортаСсылка = НайтиОрдерНаОтражениеПересортаТоваров(ИдЕМЕ);
	Если ОрдерПересортаСсылка.Пустая() Тогда
		ОрдерПересорта = Документы.ОрдерНаОтражениеПересортицыТоваров.СоздатьДокумент();
		ОрдерПересорта.Дата = ТекущаяДата();
		ОрдерПересорта.Склад = СкладСсылка;                                                   
		ОрдерПересорта.Комментарий = "Создан автоматом на основании документа изменения характеристик EME: " +
		НомерЕМЕ + " (" + ИдЕМЕ + ")" + " (" + ERPData.header.comment + ")";
	Иначе
		ОрдерПересорта = ОрдерПересортаСсылка.ПолучитьОбъект();
	КонецЕсли;  

	ОрдерПересорта.Товары.Очистить();
	Для каждого стр1 Из ТаблицаПересорта Цикл
		стр2 = ОрдерПересорта.Товары.Добавить();
		стр2.Номенклатура = стр1.ТоварСписания;
		стр2.Серия = стр1.СерияСписания;
		стр2.Характеристика = стр1.ХарактеристикаСписания;
		стр2.Количество = стр1.КоличествоСписания;
		стр2.КоличествоУпаковок = стр1.КоличествоСписания;
		стр2.НоменклатураОприходование = стр1.ТоварОприходования;
		стр2.СерияОприходование = стр1.СерияОприходования;
		стр2.ХарактеристикаОприходование = стр1.ХарактеристикаОприходования;
		стр2.КоличествоОприходование = стр1.КоличествоОприходования;
	КонецЦикла;

	EmeWmsДрайвер.ЗаполнитьСтатусыУказанияСерий(ОрдерПересорта, Документы.ОрдерНаОтражениеПересортицыТоваров);
	ОрдерПересорта.Записать();
	
	Возврат ОрдерПересорта.Ссылка;
КонецФункции

// #COA 01.12.2023 Найти ссылку на пересортица товаров по номеру импортированного документа EME
Функция НайтиДокументПересортицаТоваров(ИдЕМЕ)
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	EmeWmsОтметкиОрдера.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрСведений.EmeWmsОтметкиОбИмпортеПересортицаТоваров КАК EmeWmsОтметкиОрдера
		|ГДЕ
		|	EmeWmsОтметкиОрдера.ID = &ИдЕМЕ";
	Запрос.УстановитьПараметр("ИдЕМЕ", ИдЕМЕ);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Документы.ПересортицаТоваров.ПустаяСсылка();
КонецФункции

// #COA 01.12.2023 Создает в регистре отметку об импорте документа Пересортица товаров с номером EME 
Процедура СоздатьОтметкуОбИмпортеДокументаПересортицаТоваров(Документ, ИдЕМЕ)
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеПересортицаТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.ДатаИмпорта = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsОтметкиОбИмпортеПересортицаТоваров.СоздатьМенеджерЗаписи();
	НоваяЗапись.ID = ИдЕМЕ;
	НоваяЗапись.Ссылка = Документ.Ссылка;
	НоваяЗапись.ДатаИмпорта = ТекущаяДата();
    НоваяЗапись.Записать(); 
 КонецПроцедуры

// #COA 01.12.2023 Создать или изменить документ пересортица товаров
Процедура СоздатьИзменитьДокументПересортицаТоваров(Параметры)
	
	ПересортицаТоваровСсылка = НайтиДокументПересортицаТоваров(Параметры.ИдЕМЕ);
	Если ПересортицаТоваровСсылка.Пустая() Тогда
		Пересортица 				  = Документы.ПересортицаТоваров.СоздатьДокумент();
		Пересортица.Дата 			  = ТекущаяДата();
		Пересортица.Склад 			  = Параметры.СкладСсылка;
		Пересортица.Организация 	  = Параметры.ОрганизацияСсылка; 
		Пересортица.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПересортицаТоваров;
		Пересортица.Подразделение 	  = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.СкладСсылка, "Подразделение");
		Пересортица.Комментарий 	  = "Документ создан на основании документа изменения характеристик EME: " +
			Параметры.НомерЕМЕ + " (" + Параметры.ИдЕМЕ + ")" + " (" + Параметры.ERPData.header.comment + ")";
		Пересортица.СтатьяДоходов 	  = ПланыВидовХарактеристик.СтатьиДоходов.НайтиПоНаименованию("Излишки товарно-материальных ценностей");
		Пересортица.АналитикаДоходов  = Пересортица.Подразделение;
		Пересортица.СтатьяРасходов 	  = ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоНаименованию("Инвентаризация Пересорт Принимаемый");
		Пересортица.АналитикаРасходов = Пересортица.Подразделение; 
		
		// Вид деятельности	
		EmeWmsДрайвер.ЗаполнитьВидДеятельностиНДС(Пересортица);
	Иначе
		Пересортица = ПересортицаТоваровСсылка.ПолучитьОбъект();
		Пересортица.Комментарий = "Документ скорректирован на основании документа изменения характеристик EME: " +
			Параметры.НомерЕМЕ + " (" + Параметры.ИдЕМЕ + ")" + " (" + Параметры.ERPData.header.comment + ")";
	КонецЕсли;
	
	Если НЕ Параметры.ИспользоватьОрдернуюСхему Тогда
		Пересортица.ПересчетТоваров = Параметры.ПересчетТоваровСсылка; 
	КонецЕсли;

	Пересортица.Товары.Очистить();
	Для каждого Строка из Параметры.ТаблицаПересорта Цикл
		НоваяСтрока = Пересортица.Товары.Добавить();  
		
		НоваяСтрока.Номенклатура 			  = Строка.ТоварСписания;
		НоваяСтрока.Серия 					  = Строка.СерияСписания;
		НоваяСтрока.Характеристика 			  = Строка.ХарактеристикаСписания;
		НоваяСтрока.Количество 				  = Строка.КоличествоСписания;    
		// Если учет по ГТД. В приниципе, надо заполнять также ссылку на ГТД
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяСтрока.Номенклатура, "ВестиУчетПоГТД") Тогда
			НоваяСтрока.КоличествоПоРНПТ	  = Строка.КоличествоСписания;    
		КонецЕсли;
		
		НоваяСтрока.НоменклатураОприходование = Строка.ТоварОприходования;
		НоваяСтрока.СерияОприходование 		  = Строка.СерияОприходования;
		НоваяСтрока.ХарактеристикаОприходование = Строка.ХарактеристикаОприходования;
	КонецЦикла;
	
	Пересортица.ВидЦены = Неопределено;
	Пересортица.ПриходоватьТоварыПоСебестоимостиСписания = Истина;
	
	// Цены в документе по виду цены
	//Пересортица.ВидЦены = Справочники.ВидыЦен.НайтиПоНаименованию("Прайс-лист");
	//EmeWmsДрайвер.ЗаполнитьЦеныПоВидуЦен(Пересортица);
	
	// Отладка: Установим цена = 1 руб., при нулевой цене документ не проводится
	//Для каждого Строка из Пересортица.Товары Цикл
	//	Если Строка.Цена = 0 Тогда
	//		Строка.Цена = 1;
	//	КонецЕсли;
	//КонецЦикла;
	
	// Валюта
	Пересортица.Валюта  = EmeWmsДрайвер.ПолучитьВалютуУправленческогоУчета(Пересортица.ВидЦены);
	
	EmeWmsДрайвер.ЗаполнитьСтатусыУказанияСерий(Пересортица, Документы.ПересортицаТоваров);	
	
	Пересортица.Записать(РежимЗаписиДокумента.Запись);
	
	СоздатьОтметкуОбИмпортеДокументаПересортицаТоваров(Пересортица.Ссылка, Параметры.ИдЕМЕ);
	EmeWmsПроведениеДокументов.ПометитьДокументКПроведению(Пересортица.Ссылка);
	
КонецПроцедуры

// Функция возвращает ссылку на Приходный ордер по ИД EME
Функция НайтиПриходныйОрдерНаТовары(ИдЕМЕ)
	Перем Запрос, док1;
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПриходныйОрдер.Ссылка КАК Ссылка
		|ИЗ
		|	
		|РегистрСведений.EmeWmsОтметкиОбИмпортеПриходныхОрдеровНаТовары КАК ПриходныйОрдер
		|ГДЕ
		|	ПриходныйОрдер.ID = &ИдЕМЕ";
	Запрос.УстановитьПараметр("ИдЕМЕ", ИдЕМЕ);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Ссылка) Тогда
			док1 = Выборка.Ссылка.ПолучитьОбъект();
			Если НЕ док1.ПометкаУдаления Тогда
				Возврат Выборка.Ссылка;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Документы.ПриходныйОрдерНаТовары.ПустаяСсылка();

КонецФункции

// Функция возвращает ссылку на Расходный ордер по ИД EME
Функция НайтиРасходныйОрдерНаТовары(ИдЕМЕ)
	Перем Запрос, док1;
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РасходныйОрдер.Ссылка КАК Ссылка
		|ИЗ
		|	
		|РегистрСведений.EmeWmsОтметкиОбИмпортеРасходныхОрдеровНаТовары КАК РасходныйОрдер
		|ГДЕ
		|	РасходныйОрдер.ID = &ИдЕМЕ";
	Запрос.УстановитьПараметр("ИдЕМЕ", ИдЕМЕ);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Ссылка) Тогда
			док1 = Выборка.Ссылка.ПолучитьОбъект();
			Если НЕ док1.ПометкаУдаления Тогда
				Возврат Выборка.Ссылка;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Документы.РасходныйОрдерНаТовары.ПустаяСсылка();

КонецФункции

// Функция возвращает ссылку на документ Перемещение товаров по ИД EME
Функция НайтиДокументПеремещенияТоваров(ИдЕМЕ)
	Перем Запрос, док1;
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Перемещение.Ссылка КАК Ссылка
		|ИЗ
		|	
		|РегистрСведений.EmeWmsОтметкиОбИмпортеПеремещенийТоваров КАК Перемещение
		|ГДЕ
		|	Перемещение.ID = &ИдЕМЕ";
	Запрос.УстановитьПараметр("ИдЕМЕ", ИдЕМЕ);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		док1 = Выборка.Ссылка.ПолучитьОбъект();
		Если НЕ док1.ПометкаУдаления Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Документы.ПеремещениеТоваров.ПустаяСсылка();

КонецФункции

// #IBS 21.06.2023 Найти ссылку на ордер по номеру импортированного документа EME
Функция НайтиОрдерНаОтражениеПорчиТоваров(ИдЕМЕ)
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	EmeWmsОтметкиОрдера.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрСведений.EmeWmsОтметкиОбИмпортеОрдераНаОтражениеПорчиТоваров КАК EmeWmsОтметкиОрдера
		|ГДЕ
		|	EmeWmsОтметкиОрдера.ID = &ИдЕМЕ";
	Запрос.УстановитьПараметр("ИдЕМЕ", ИдЕМЕ);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Документы.ОрдерНаОтражениеПорчиТоваров.ПустаяСсылка();
КонецФункции

// #IBS 17.05.2023 Найти ссылку на ордер по номеру импортированного документа EME
Функция НайтиОрдерНаОтражениеПересортаТоваров(ИдЕМЕ)
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	EmeWmsОтметкиОрдера.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрСведений.EmeWmsОтметкиОбИмпортеОрдераНаОтражениеПересортаТоваров КАК EmeWmsОтметкиОрдера
		|ГДЕ
		|	EmeWmsОтметкиОрдера.ID = &ИдЕМЕ";
	Запрос.УстановитьПараметр("ИдЕМЕ", ИдЕМЕ);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Документы.ОрдерНаОтражениеПересортицыТоваров.ПустаяСсылка();
КонецФункции

// #IBS 21.06.2023 Создает в регистре пометку об импорте документа перемещения с номером перемещения в EME
Процедура СоздатьОтметкуОбИмпортеПеремещенияТоваров(Документ, ИдЕМЕ)
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеПеремещенийТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.ДатаИмпорта = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsОтметкиОбИмпортеПеремещенийТоваров.СоздатьМенеджерЗаписи();
	НоваяЗапись.ID = ИдЕМЕ;
	НоваяЗапись.Ссылка = Документ.Ссылка;
	НоваяЗапись.ДатаИмпорта = ТекущаяДата();
    НоваяЗапись.Записать(); 
 
КонецПроцедуры   

// #IBS 21.06.2023 Создает в регистре пометку об импорте Расходного ордера
Процедура СоздатьОтметкуОбИмпортеРасходногоОрдера(Документ, ИдЕМЕ)
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеРасходныхОрдеровНаТовары.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.ДатаИмпорта = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsОтметкиОбИмпортеРасходныхОрдеровНаТовары.СоздатьМенеджерЗаписи();
	НоваяЗапись.ID = ИдЕМЕ;
	НоваяЗапись.Ссылка = Документ.Ссылка;
	НоваяЗапись.ДатаИмпорта = ТекущаяДата();
    НоваяЗапись.Записать(); 
 
КонецПроцедуры

// #IBS 21.06.2023 Создает в регистре пометку об импорте приходного ордера с номером прихода в EME
Процедура СоздатьОтметкуОбИмпортеПриходногоОрдера(Документ, ИдЕМЕ)
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеПриходныхОрдеровНаТовары.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.ДатаИмпорта = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsОтметкиОбИмпортеПриходныхОрдеровНаТовары.СоздатьМенеджерЗаписи();
	НоваяЗапись.ID = ИдЕМЕ;
	НоваяЗапись.Ссылка = Документ.Ссылка;
	НоваяЗапись.ДатаИмпорта = ТекущаяДата();
    НоваяЗапись.Записать(); 
КонецПроцедуры

 // #IBS 17.05.2023 Создает в регистре пометку об импорте документа Ордер на отражение пересорта товаров с номером EME
Процедура СоздатьОтметкуОбИмпортеОрдераНаОтражениеПересортаТоваров(Документ, ИдЕМЕ)
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеОрдераНаОтражениеПересортаТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.ДатаИмпорта = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsОтметкиОбИмпортеОрдераНаОтражениеПересортаТоваров.СоздатьМенеджерЗаписи();
	НоваяЗапись.ID = ИдЕМЕ;
	НоваяЗапись.Ссылка = Документ.Ссылка;
	НоваяЗапись.ДатаИмпорта = ТекущаяДата();
    НоваяЗапись.Записать(); 
 КонецПроцедуры

// #IBS 21.06.2023 Создает в регистре пометку об импорте документа Ордер на отражение порчи товаров с номером EME
Процедура СоздатьОтметкуОбИмпортеОрдераНаОтражениеПорчиТоваров(Документ, ИдЕМЕ)
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеОрдераНаОтражениеПорчиТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.ДатаИмпорта = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsОтметкиОбИмпортеОрдераНаОтражениеПорчиТоваров.СоздатьМенеджерЗаписи();
	НоваяЗапись.ID = ИдЕМЕ;
	НоваяЗапись.Ссылка = Документ.Ссылка;
	НоваяЗапись.ДатаИмпорта = ТекущаяДата();
    НоваяЗапись.Записать(); 
 КонецПроцедуры

#КонецОбласти

        