
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

//#Область Интерфейс

&НаКлиенте
Функция ВыполнитьДиагностики(МассивДиагностик) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Протокол", Новый Массив);
	Результат.Вставить("КоличествоОшибок", 0);
	Результат.Вставить("КоличествоПредупреждений", 0);
	
	Для Каждого Диагностика Из МассивДиагностик Цикл
		
		Если Диагностика.Тип = "Метаданные" Тогда
			Результат.Протокол.Добавить(ДиагностикаМетаданных(Диагностика));
		ИначеЕсли Диагностика.Тип = "СоединениеHTTP" Тогда
			Результат.Протокол.Добавить(ДиагностикаСоединенийHTTP(Диагностика));
		ИначеЕсли Диагностика.Тип = "МенеджерКриптографии" Тогда
			Результат.Протокол.Добавить(ДиагностикаМенеджераКриптографии(Диагностика));	
		Иначе
			Результат.Протокол.Добавить(ДиагностикаОтсутствует(Диагностика));
		КонецЕсли;
		
	КонецЦикла;
	
	Результат.КоличествоОшибок = КоличествоОшибокПротокола(Результат.Протокол);
	Результат.КоличествоПредупреждений = КоличествоПредупрежденийПротокола(Результат.Протокол);
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции // ВыполнитьДиагностики

&НаКлиенте
Функция ПраваМетаданных(Метаданные_, МассивПрав) Экспорт
	
 	Возврат ПраваМетаданныхНаСервере(Метаданные_ , МассивПрав);
	
КонецФункции // ПраваМетаданных

&НаКлиенте
Функция СформироватьОтчет(Диагностика, ВариантОтчета) Экспорт
	
	Если ВариантОтчета = "Текстовый" Тогда
		
		Результат = СформироватьОтчетДиагностики(Диагностика);
		
	ИначеЕсли ВариантОтчета = "НедоступныеМетаданные" Тогда
		
		Результат = _СформироватьОтчетНедоступныхМетаданных(Диагностика);
				
	Иначе
		
		ВызватьИсключение "Непредполагаемый вариант отчета";
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // СформироватьОтчет

//#КонецОбласти

//#Область Определения

&НаКлиенте
Функция ДиагностикаБазовая() Экспорт
	
	Модель = Новый Структура;
	Модель.Вставить("Тип");
	Модель.Вставить("Контекст");
	
	Возврат Модель;
	
КонецФункции // ДиагностикаБазовая

&НаКлиенте
Функция ДиагностикаМетаданные() Экспорт
	
	Модель = ДиагностикаБазовая();
	Модель.Тип = "Метаданные";
	Модель.Вставить("ПолныйПуть");
	Модель.Вставить("ПраваДоступа", Новый Массив);
	Модель.Вставить("Синонимы", Новый Массив);
	
	Возврат Модель;
	
КонецФункции // ДиагностикаМетаданные

&НаКлиенте
Функция ДиагностикаСоединениеHTTP() Экспорт
	
	Модель = ДиагностикаБазовая();
	Модель.Тип = "СоединениеHTTP";
	Модель.Вставить("Контекст", "Клиент");
	Модель.Вставить("Адрес");
	Модель.Вставить("Метод", "GET");
	Модель.Вставить("Таймаут", 1);
	Модель.Вставить("НастройкаПрокси", НастройкаПрокси());
	
	Модель.НастройкаПрокси.ПоУмолчанию = Истина;
	
	Возврат Модель;
	
КонецФункции // ДиагностикаСоединениеHTTP

&НаКлиенте
Функция ДиагностикаМодульКриптографии() Экспорт
	
	Модель = ДиагностикаБазовая();
	Модель.Тип = "МенеджерКриптографии";
	Модель.Вставить("Контекст", "Клиент");
	Модель.Вставить("ИмяМодуляКриптографии");
	Модель.Вставить("ПутьМодуляКриптографии", "");
	Модель.Вставить("ТипМодуляКриптографии");
	
	Возврат Модель;
	
КонецФункции // ДиагностикаМодульКриптографии

&НаКлиенте
Функция НастройкаПрокси() Экспорт
	
	Модель = Новый Структура;
	Модель.Вставить("ПоУмолчанию", Ложь);
	Модель.Вставить("НеИспользовать", Ложь);
	Модель.Вставить("АдресСервера");
	Модель.Вставить("Логин");
	Модель.Вставить("Пароль");
	
	Возврат Модель;
	
КонецФункции // НастройкаПрокси

&НаКлиенте
Функция РезультатДиагностики()
		
	Возврат РезультатДиагностикиКлиентСервер();
	
КонецФункции // РезультатДиагностики

&НаКлиентеНаСервереБезКонтекста
Функция РезультатДиагностикиКлиентСервер()
	
	Модель = Новый Структура;
	Модель.Вставить("Тип");
	Модель.Вставить("ОбъектПроверки");
	Модель.Вставить("РезультатПроверки");
	Модель.Вставить("Ошибка", Ложь);
	Модель.Вставить("Предупреждение", Ложь);
	Модель.Вставить("Примечание");
	
	Возврат Модель;
	
КонецФункции // РезультатДиагностикиКлиентСервер

&НаКлиентеНаСервереБезКонтекста
Функция РезультатПроверкиПрав(Имя = "")
	
	Модель = Новый Структура;
	Модель.Вставить("Имя", Имя);
	Модель.Вставить("Результат");
	
	Возврат Модель;
	
КонецФункции // РезультатПроверкиПрав

//#КонецОбласти

//#Область Диагностика

&НаСервере
Функция ДиагностикаМетаданных(Диагностика)
	
	Метаданные_ = Метаданные.НайтиПоПолномуИмени(Диагностика.ПолныйПуть);
	
	Если Метаданные_ = Неопределено Тогда
		Для Каждого Синоним Из Диагностика.Синонимы Цикл
			Метаданные_ = Метаданные.НайтиПоПолномуИмени(Синоним);	
			Если Метаданные_ <> Неопределено Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Результат = РезультатДиагностикиКлиентСервер();
	Результат.Вставить("ПраваДоступа", Новый Массив);
	Результат.Вставить("Роли", Новый Массив);
	
	Результат.Тип = "Метаданные";
	Результат.ОбъектПроверки = Диагностика.ПолныйПуть;	
	Результат.РезультатПроверки = Метаданные_ <> Неопределено;
	Результат.Ошибка = Метаданные_ = Неопределено; 
	
	Если Метаданные_ = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого Право Из Диагностика.ПраваДоступа Цикл
		РезультатПрава = РезультатПроверкиПрав(Право);
		Попытка
			РезультатПрава.Результат = ПравоДоступа(Право, Метаданные_);	 
		Исключение
			РезультатПрава.Результат = "Права не существует: """ + Право + """";
		КонецПопытки;
		Если РезультатПрава.Результат = Ложь Тогда
			Результат.Роли = ПраваМетаданныхНаСервере(Метаданные_, Диагностика.ПраваДоступа);
		КонецЕсли;
		Результат.ПраваДоступа.Добавить(РезультатПрава);
	КонецЦикла;	
	
	Возврат Результат;
	
КонецФункции // ДиагностикаМетаданных

&НаКлиенте
Функция ДиагностикаСоединенийHTTP(Диагностика)
	
	// TODO Сделать прокси
	Если Диагностика.Контекст = "Клиент" Тогда
		Результат = ДиагностикаСоединенийHTTPКлиент(Диагностика);
	ИначеЕсли Диагностика.Контекст = "Сервер" Тогда
		Результат = ДиагностикаСоединенийHTTPСервер(Диагностика);
	Иначе
		ВызватьИсключение "Не предполагаемый контекст диагностики: " + Диагностика.Контекст;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ДиагностикаСоединенийHTTP

&НаКлиенте
Функция ДиагностикаСоединенийHTTPКлиент(Диагностика)
	
	КодОшибкаСервере = 500;
	СтруктураURL = РазбитьURL(Диагностика.Адрес);
	
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL;
	Соединение = Новый HTTPСоединение(СтруктураURL.Сервер,,,,, Диагностика.Таймаут, 
		ЗащищенноеСоединение);
		
	HTTPЗапрос = Новый HTTPЗапрос(СтруктураURL.Путь);
	
	Результат = РезультатДиагностики();
	Результат.Вставить("Контекст", Диагностика.Контекст);
	Результат.Тип = "СоединениеHTTP";
	Результат.ОбъектПроверки = Диагностика.Адрес;
	
	Попытка
		Ответ = Соединение.ВызватьHTTPМетод(Диагностика.Метод, HTTPЗапрос);
		Результат.РезультатПроверки = "Успешно";
		Результат.Примечание = "Код: " + Ответ.КодСостояния;
		Если Ответ.КодСостояния >= КодОшибкаСервере Тогда
			Результат.РезультатПроверки = "Успешно. Сервер не доступен";
			Результат.Предупреждение = Истина;
		КонецЕсли;
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		Результат.РезультатПроверки = "Ошибка";
		результат.Ошибка = Истина;
		Результат.Примечание = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции // ДиагностикаСоединенийHTTPКлиент

&НаСервере
Функция ДиагностикаСоединенийHTTPСервер(Диагностика)
	
	КодОшибкаСервере = 500;
	СтруктураURL = РазбитьURL(Диагностика.Адрес);
	
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL;
	Соединение = Новый HTTPСоединение(СтруктураURL.Сервер,,,,, Диагностика.Таймаут, 
		ЗащищенноеСоединение);
		
	HTTPЗапрос = Новый HTTPЗапрос(СтруктураURL.Путь);
	
	Результат = РезультатДиагностикиКлиентСервер();
	Результат.Вставить("Контекст", Диагностика.Контекст);
	Результат.Тип = "СоединениеHTTP";
	Результат.ОбъектПроверки = Диагностика.Адрес;
	
	Попытка
		Ответ = Соединение.ВызватьHTTPМетод(Диагностика.Метод, HTTPЗапрос);
		Результат.РезультатПроверки = "Успешно";
		Результат.Примечание = "Код: " + Ответ.КодСостояния;
		Если Ответ.КодСостояния >= КодОшибкаСервере Тогда
			Результат.РезультатПроверки = "Успешно. Сервер не доступен";
			Результат.Предупреждение = Истина;
		КонецЕсли;
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		Результат.РезультатПроверки = "Ошибка";
		результат.Ошибка = Истина;
		Результат.Примечание = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции // ДиагностикаСоединенийHTTPСервер

&НаКлиенте
Функция ДиагностикаМенеджераКриптографии(Диагностика)
	
	Если Диагностика.Контекст = "Клиент" Тогда
		Результат = ДиагностикаМенеджераКриптографииКлиент(Диагностика);
	ИначеЕсли Диагностика.Контекст = "Сервер" Тогда
		Результат = ДиагностикаМенеджераКриптографииСервер(Диагностика);
	Иначе
		ВызватьИсключение "Не предполагаемый контекст диагностики: " + Диагностика.Контекст;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ДиагностикаМенеджераКриптографии

&НаКлиенте
Функция ДиагностикаМенеджераКриптографииКлиент(Диагностика)
	
	МенеджерКриптографии = Неопределено;
	Результат = РезультатДиагностикиКлиентСервер();
	Результат.Вставить("Контекст", Диагностика.Контекст);
	Результат.Вставить("ХранилищеСертификатов");
	
	Результат.Тип = "МенеджерКриптографии";
	Результат.ОбъектПроверки = Диагностика.ИмяМодуляКриптографии;
	
	Попытка
		МенеджерКриптографии = Новый МенеджерКриптографии(Диагностика.ИмяМодуляКриптографии, 
			Диагностика.ПутьМодуляКриптографии,
			Диагностика.ТипМодуляКриптографии);
		Результат.РезультатПроверки = Истина;
	Исключение
		Результат.РезультатПроверки = Ложь;
		Результат.Ошибка = Истина;
		Результат.Примечание = ОписаниеОшибки();
	КонецПопытки;
	
	Если МенеджерКриптографии = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	ТипХранилища 		  = ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты;	
	РасположениеХранилища = РасположениеХранилищаСертификатовКриптографии.ДанныеПользователяОС;
	
	Попытка
		ХранилищеСертификатов_ = МенеджерКриптографии.ПолучитьХранилищеСертификатов(ТипХранилища, РасположениеХранилища);
		Сертификаты = ХранилищеСертификатов_.ПолучитьВсе();
		Результат.ХранилищеСертификатов = Истина;
	Исключение
		Результат.ХранилищеСертификатов = Ложь;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции // ДиагностикаМенеджераКриптографииКлиент

&НаСервере
Функция ДиагностикаМенеджераКриптографииСервер(Диагностика)
	
	МенеджерКриптографии = Неопределено;
	Результат = РезультатДиагностикиКлиентСервер();
	Результат.Вставить("Контекст", Диагностика.Контекст);
	Результат.Вставить("ХранилищеСертификатов");
	
	Результат.Тип = "МенеджерКриптографии";
	Результат.ОбъектПроверки = Диагностика.ИмяМодуляКриптографии;
	
	Попытка
		МенеджерКриптографии = Новый МенеджерКриптографии(Диагностика.ИмяМодуляКриптографии, 
			Диагностика.ПутьМодуляКриптографии,
			Диагностика.ТипМодуляКриптографии);
		Результат.РезультатПроверки = Истина;
	Исключение
		Результат.РезультатПроверки = Ложь;
		Результат.Ошибка = Истина;
		Результат.Примечание = ОписаниеОшибки();
	КонецПопытки;
	
	Если МенеджерКриптографии = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	ТипХранилища 		  = ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты;	
	РасположениеХранилища = РасположениеХранилищаСертификатовКриптографии.ДанныеПользователяОС;
	
	Попытка
		ХранилищеСертификатов_ = МенеджерКриптографии.ПолучитьХранилищеСертификатов(ТипХранилища, РасположениеХранилища);
		Сертификаты = ХранилищеСертификатов_.ПолучитьВсе();
		Результат.ХранилищеСертификатов = Истина;
	Исключение
		Результат.ХранилищеСертификатов = Ложь;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции // ДиагностикаМенеджераКриптографииСервер

&НаКлиентеНаСервереБезКонтекста
Функция ДиагностикаОтсутствует(Диагностика)
	
	Результат = РезультатДиагностикиКлиентСервер();
	Результат.ОбъектПроверки = Диагностика.Тип;
	Результат.РезультатПроверки = "Неожидаемый тип диагностики: " + Диагностика.Тип;
	
	Возврат Результат;
	
КонецФункции // ДиагностикаОтсутствует

//#КонецОбласти

//#Область Отчет

&НаКлиенте
Функция СформироватьОтчетДиагностики(Диагностика)
	
	Результат = "";
	
	Результат = Результат + "Ошибок: " + Диагностика.КоличествоОшибок + Символы.ПС;
	Результат = Результат + "Предупреждений: " + Диагностика.КоличествоПредупреждений + Символы.ПС + Символы.ПС;
	
	// Метаданные
	
	Результат = Результат + "Метаданные:" + Символы.ПС + _ОтчетМетаданные(Диагностика);
	Результат = Результат + Символы.ПС + Символы.ПС;
	
	// Необходимые роли
	
	Результат = Результат + _СформироватьОтчетНедоступныхМетаданных(Диагностика);
	Результат = Результат + Символы.ПС + Символы.ПС;
	
	// СоединениеHTTP
	
	Результат = Результат + "СоединениеHTTP:" + Символы.ПС + _ОтчетСоединениеHTTP(Диагностика);
	Результат = Результат + Символы.ПС + Символы.ПС;
	
	// МенеджерКриптографии
	
	Результат = Результат + "МенеджерКриптографии:" + Символы.ПС + _ОтчетМенеджерКриптографии(Диагностика);
	Результат = Результат + Символы.ПС + Символы.ПС;
	
	Возврат Результат;
	
КонецФункции // СформироватьОтчетДиагностики

&НаКлиентеНаСервереБезКонтекста
Функция _СформироватьОтчетНедоступныхМетаданных(Диагностика)
	
	ЗаголовокОтчета = "Недостаточно прав для работы Контур.Экстерн" + Символы.ПС + Символы.ПС;
	ПодвалОтчета = "Обратитесь к администратору, для добавление прав";
	Отчет = "";
	
	Для Каждого Элемент Из Диагностика.Протокол Цикл
		
		Если Элемент.Тип <> "Метаданные" Или ПравДостаточно(Элемент) Тогда
			Продолжить;
		КонецЕсли;
		
		УведомлениеПоПравам = """" + Элемент.ОбъектПроверки + """" + Символы.ПС + УведомлениеПоНеобходимымРолям(Элемент);
		Отчет = Отчет + УведомлениеПоПравам;
		
	КонецЦикла;
	
	Если Отчет <> "" Тогда
		Отчет = ЗаголовокОтчета + Отчет + ПодвалОтчета;
	КонецЕсли;
	
	Возврат Отчет;
	
КонецФункции // _СформироватьОтчетНедоступныхМетаданных

&НаКлиентеНаСервереБезКонтекста
Функция ПравДостаточно(Диагностика)
	
	Результат = Ложь;
	
	Для Каждого Право Из Диагностика.ПраваДоступа Цикл
		Результат = Право.Результат = Истина;
		Если Результат = Ложь Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // ПравДостаточно

&НаКлиентеНаСервереБезКонтекста
Функция УведомлениеПоНеобходимымРолям(Диагностика)
	
	ПроверяемыеПраво = "";
	ЛишниеСимволы = 2;
	Для Каждого Право Из Диагностика.ПраваДоступа Цикл
		ПроверяемыеПраво = ПроверяемыеПраво + Право.Имя + ", ";
	КонецЦикла;
	ПроверяемыеПраво = Лев(ПроверяемыеПраво, СтрДлина(ПроверяемыеПраво) - ЛишниеСимволы);
	
	Результат =  "Роли с правами " + ПроверяемыеПраво + ":" + Символы.ПС;	
	НеобходимыеРоли = "";
	
	Для Каждого Роль Из Диагностика.Роли Цикл
		НеобходимыеРоли = НеобходимыеРоли + "- " + Роль + Символы.ПС;
	КонецЦикла;
	
	Результат = Результат + НеобходимыеРоли + Символы.ПС;
	
	Возврат Результат;
	
КонецФункции // УведомлениеПоНеобходимымРолям

//#КонецОбласти

//#Область Служебные

&НаКлиенте
Функция КоличествоОшибокПротокола(Протокол)
	
	Результат = 0;
	
	Для Каждого Элемент Из Протокол Цикл
		Если Элемент.Ошибка = Истина Тогда
			Результат = Результат + 1;
		КонецЕсли;
		Если Элемент.Тип = "Метаданные" Тогда
			Результат = Результат + Число(Не ПравДостаточно(Элемент));
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // КоличествоОшибокПротокола

&НаКлиенте
Функция КоличествоПредупрежденийПротокола(Протокол)
	
	Результат = 0;
	
	Для Каждого Элемент Из Протокол Цикл
		Если Элемент.Предупреждение = Истина Тогда
			Результат = Результат + 1;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // КоличествоПредупрежденийПротокола

&НаКлиентеНаСервереБезКонтекста
Функция РазбитьURL(URL)
	
	Результат = Новый Структура;
	Результат.Вставить("Сервер");
	Результат.Вставить("Путь", "");
	КоличествоСлеш = 2;
	
	Если Найти(URL, "://") > 0 Тогда
		Адрес = Прав(URL, СтрДлина(URL) - (Найти(URL, "://") + КоличествоСлеш));
	Иначе
		Адрес = URL;
	КонецЕсли;	
	
	Если Найти(Адрес, "/") > 0 Тогда
		Результат.Сервер = Лев(Адрес, Найти(Адрес, "/") - 1);
		Результат.Путь = Прав(Адрес, СтрДлина(Адрес) - Найти(Адрес, "/"));
	Иначе
		Результат.Сервер = Адрес;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // РазбитьURL

&НаКлиентеНаСервереБезКонтекста
Функция _ОтчетМетаданные(Диагностика)
	
	Результат = "";
	
	Для Каждого Элемент Из Диагностика.Протокол Цикл
		
		Если Элемент.Тип <> "Метаданные" Тогда
			Продолжить;
		КонецЕсли;
	
		Результат = Результат + (Строка(Элемент.ОбъектПроверки) + ": " + Элемент.РезультатПроверки) + Символы.ПС;
		
		Если ЗначениеЗаполнено(Элемент.Примечание) Тогда
			Результат = Результат + "Примечание: " + Элемент.Примечание + Символы.ПС;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // _ОтчетМетаданные

&НаКлиентеНаСервереБезКонтекста
Функция _ОтчетСоединениеHTTP(Диагностика)
	
	Результат = "";
	
	Для Каждого Элемент Из Диагностика.Протокол Цикл
		
		Если Элемент.Тип <> "СоединениеHTTP" Тогда
			Продолжить;
		КонецЕсли;
		
		Префикс = "";
		Если Элемент.РезультатПроверки = "Ошибка" Тогда
			Префикс = "---";
		КонецЕсли;
	
		Результат = Результат + Префикс + (Строка(Элемент.ОбъектПроверки) + ": " + Элемент.РезультатПроверки) + Символы.ПС;
		Результат = Результат + "Контекст: " + Элемент.Контекст + Символы.ПС;
		
		Если ЗначениеЗаполнено(Элемент.Примечание) Тогда
			Результат = Результат + "Примечание: " + Элемент.Примечание + Символы.ПС;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // _ОтчетСоединениеHTTP

&НаКлиентеНаСервереБезКонтекста
Функция _ОтчетМенеджерКриптографии(Диагностика)
	
	Результат = "";
	
	Для Каждого Элемент Из Диагностика.Протокол Цикл
		
		Если Элемент.Тип <> "МенеджерКриптографии" Тогда
			Продолжить;
		КонецЕсли;
	
		Результат = Результат + (Строка(Элемент.ОбъектПроверки) + ": " + Элемент.РезультатПроверки) + Символы.ПС;
		Результат = Результат + "Хранилище сертификатов: " + Строка(Элемент.ХранилищеСертификатов) + Символы.ПС;
		
		Если ЗначениеЗаполнено(Элемент.Примечание) Тогда
			Результат = Результат + "Примечание: " + Элемент.Примечание + Символы.ПС;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // _ОтчетМенеджерКриптографии

&НаСервереБезКонтекста
Функция ПраваМетаданныхНаСервере(Метаданные_, МассивПрав) Экспорт
	
	Результат = Новый Массив;
	
	Для Каждого Роль Из Метаданные.Роли Цикл
		ПравоДоступно = Истина;
		Для Каждого Право Из МассивПрав Цикл
			Попытка
				ПравоДоступно = ПравоДоступа(Право, Метаданные_, Роль);
			Исключение
				ПравоДоступа = Ложь;
			КонецПопытки;
			Если ПравоДоступно = Ложь Тогда 
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ПравоДоступно = Истина Тогда 
			Результат.Добавить(Роль.Представление());
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // ПраваМетаданныхНаСервере

//#КонецОбласти
