
// #Область СлужебныеПеременныеИМетодыФормы

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		КэшМодуляКлиента = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		КэшМодуляКлиента = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	Возврат КэшМодуляКлиента;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

// #КонецОбласти

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьКонтекстФормы();
	НастроитьЭлементыФормы();
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовФормы

// #КонецОбласти

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	
	Если ЭтоСписокЗначений Тогда
		ЭтаФорма.ОповеститьОВыборе(СписокЗначений);
	Иначе
		ЭтаФорма.ОповеститьОВыборе(СписокЗначений.ВыгрузитьЗначения());
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьКонтекстФормы()
	
	РазрешитьРедактирование = Параметры.РазрешитьРедактирование;
	
	Если ТипЗнч(Параметры.Список) = Тип("СписокЗначений") Тогда
		ЭтоСписокЗначений = Истина;
	КонецЕсли;
	
	Если ЭтоСписокЗначений Тогда
		СписокЗначений = Параметры.Список;
	Иначе
		СписокЗначений.ЗагрузитьЗначения(Параметры.Список);
	КонецЕсли;
	
	Если Параметры.Свойство("МассивТипов")
		И ЗначениеЗаполнено(Параметры.МассивТипов) Тогда
		СписокЗначений.ТипЗначения = Новый ОписаниеТипов(Параметры.МассивТипов);
	КонецЕсли;
	
	Если Параметры.Свойство("Заголовок") Тогда
		Заголовок = Параметры.Заголовок;
	КонецЕсли;
	
	Если Параметры.Свойство("ИспользоватьПометки") Тогда
		ИспользоватьПометки = Параметры.ИспользоватьПометки;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы()
	
	Если РазрешитьРедактирование Тогда
		Элементы.ФормаЗавершитьРедактирование.Видимость = Истина;
	Иначе
		Элементы.ФормаЗавершитьРедактирование.Видимость = Ложь;
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Элементы.СписокЗначенийПометка.Видимость = ИспользоватьПометки;
	Элементы.СписокЗначений.ИзменятьСоставСтрок = Не ИспользоватьПометки;
	
КонецПроцедуры

// #КонецОбласти
