//	Copyright (C) 2012-2025 Engineer Mareev Enterprises
//	Модуль для УТ 10.3
//	Импортирует RECEIPT в документ Корректировка реализации c характеристиками или сериями товара, меняет его статус

//	$Возврат товаров от покупателя по корректировке реализации
//	Импорт сообщений RECEIPT:
//	 - Оператор EME.WMS (руч.) формирует документ прихода, обрабатывает его, закрывает.
//	 - После закрытия приход EME.WMS (авт.) экспортирует сообщение RECEIPT.
//	 - 1C (авт.) импортирует сообщение RECEIPT  и меняет статус EmeWms документа Корректировка реализации.
//   - При несовпадении количеств товаров 1С (авт.) корректирует документ "Корректировка реализации", проводит его и посылает менеджеру, ответственному за документ, сообщение о несовпадениях по почте, указанной в контактах менеджера (пользователя ИБ). При отсутствии такового адреса, сообщения уйдут по списку рассылки, настроенному в обработке отладки.

#Область ПрограммныйИнтерфейс

//	Функция ПолучитьИмяСообщения возвращает имя сообщения
Функция ПолучитьИмяСообщения() Экспорт
	Возврат "receipt";
КонецФункции

//	Функция ПолучитьМетаданные возвращает метаданные сообщения
Функция ПолучитьМетаданные() Экспорт
	Возврат Метаданные.Документы.КорректировкаРеализации;
КонецФункции

//	Импорт Реализации товаров услуг
Процедура Импортировать(ERPData, Трассировка, ТемаСообщения) Экспорт
	
Если ERPData.header.erp_doc_type <> ПолучитьМетаданные().Имя Тогда
		Возврат;
	КонецЕсли;
	
	// #IBS 22.11.2024 Принимать только сообщение для закрытого или подтвержденного документа.
	Если Не EmeWmsСтатусы.ДокументЗакрыт(ERPData) Тогда
		возврат;
	КонецЕсли;  

	Если ERPData.header.is_partly = 1 Тогда // Принимать только закрывающий receipt
		возврат;
	КонецЕсли;  
	
	Если ERPData.header.asn_id = "" Тогда // Возврат импортируется только на основе ASN. Без ASN - ОприходованиеТоваров.
		Возврат;
	КонецЕсли;
	
	НомерЕМЕ	= ERPData.header.receipt_reg_no;
	ИдЕМЕ 		= ERPData.header.receipt_id;       
	
	//	Соберем товары и количества
	КодЗоны 		= Неопределено;
	КартаТоваров 	= Новый Соответствие;
	СерийныеНомера 	= Новый Соответствие;
	ПолучитьКоличестваТоваровПоУИДСтроки(ERPData, КодЗоны, КартаТоваров, СерийныеНомера);
	
	// Получим склад по коду EME
	КодСклада = ERPData.header.whs_to_code;
	КодОрганизации = ERPData.header.vendor_to_code;

	ОрганизацияСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаОрганизациюПоКодуEME(КодОрганизации);
	Если ОрганизацияСсылка.Пустая() Тогда
		EmeWmsERPEngine.ErrorHeader(ERPData, "VNDBAD");
		Возврат;
	КонецЕсли;
	
	// Ссылка на документ-основание из ASN (Возврат товаров от покупателя)
	КорректировкаРеализацииСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаКорректировкуРеализации(ERPData.header.asn_id);
	Если КорректировкаРеализацииСсылка.Пустая() Тогда
		EmeWmsERPEngine.ErrorHeader(ERPData, "ASNBAD");
	КонецЕсли;
	
	//	Если были ошибки
	Если EmeWmsERPEngine.HasErrors(ERPData) Тогда
		Возврат;
	КонецЕсли;	
	
	//*** Проверки сделали, пишем в базу данных 1C ***
	КорректировкаРеализации = КорректировкаРеализацииСсылка.ПолучитьОбъект(); // Обработать исходный документ  
	
	//Если Не КорректировкаРеализации.Проведен Тогда    		
	//	EmeWmsERPEngine.WarningHeader(ERPData, "NOTPST");
	//	СоздатьОтметкуОбИмпорте(КорректировкаРеализации.Ссылка, ИдЕМЕ);
	//	Возврат;                   		
	//КонецЕсли;
	
	Если КорректировкаРеализации.ПометкаУдаления Тогда
		EmeWmsERPEngine.WarningHeader(ERPData, "NOTPST");
		СоздатьОтметкуОбИмпорте(КорректировкаРеализации.Ссылка, ИдЕМЕ);
		Возврат;
	КонецЕсли;
	
	КорректировкаРеализации.EmeWmsСтатус = "К проведению";
	
	//	Коррекция табличной части товара по фактическому приходу
	ТекстРасхождений = "";
	Если ПроверитьТоварыКорректировкиНаСоответствие(КорректировкаРеализации, КартаТоваров, ТекстРасхождений) Тогда

		Если ERPData.header.state = "NEW" Тогда 
			Тема = "Расхождение данных по отгруженным товарам в Корректировке реализации и документе отгрузки WMS";
			EmeWmsУтилиты.ДобавитьНапоминаниеИнтеграции(ТекстРасхождений, КорректировкаРеализации.Ссылка);
		КонецЕсли;                    

		СкорректироватьТабличнуюЧастьКорректировкиРеализации(КорректировкаРеализации, КартаТоваров);	
		
		КорректировкаРеализации.Комментарий = ERPData.header.comment + "(Документ скорректирован на основании отгрузки EME:" + НомерЕМЕ + ")";
		
	Иначе
		//	Если документ не корректируется, добавить комментарий об импорте
		КорректировкаРеализации.Комментарий = ERPData.header.comment + "(Документ соответствует отгрузке EME:" + НомерЕМЕ + ")";
	КонецЕсли;  

	//	Пометить для асинхронного проведения 
	Если ERPData.header.doc_status = "Обработка завершена" ИЛИ КорректировкаРеализации.Проведен Тогда
		EmeWmsПроведениеДокументов.ПометитьДокументКПроведению(КорректировкаРеализации.Ссылка);
	КонецЕсли;		
	
	//	Добавляет марки в ТЧ ШтрихкодыУпаковок документа
	//Если Константы.EmeWmsИмпортироватьМаркиЧЗ.Получить() Тогда  
	//	Параметры = Новый Структура;
	//	Параметры.Вставить("ERPData",		ERPData);
	//	Параметры.Вставить("ЗаказОбъект",	КорректировкаРеализации);
	//	ПолучитьТаблицуМарок(Параметры);
	//	
	//	КорректировкаРеализации.ШтрихкодыУпаковок.Очистить(); 
	//	ДобавитьМаркиВТЧШтрихкодыУпаковок(КорректировкаРеализации.ШтрихкодыУпаковок, Параметры.ТаблицаМарок);
	//КонецЕсли;        	
	
	СоздатьОтметкуОбИмпорте(КорректировкаРеализации.Ссылка, ИдЕМЕ);
	КорректировкаРеализации.Записать(РежимЗаписиДокумента.Запись);
		
	EmeWmsERPEngine.Success(ERPData);
КонецПроцедуры

#КонецОбласти

#Область ЛокальныеСлужебныеПроцедурыИФункции

// Создает в регистре пометку об импорте документа реализации с номером EME
Процедура СоздатьОтметкуОбИмпорте(Документ, ИдЕМЕ)
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеКорректировокРеализаций.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.ДатаИмпорта = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsОтметкиОбИмпортеКорректировокРеализаций.СоздатьМенеджерЗаписи();
	НоваяЗапись.ID = ИдЕМЕ;
	НоваяЗапись.Ссылка = Документ.Ссылка;
	НоваяЗапись.ДатаИмпорта = ТекущаяДата();
    НоваяЗапись.Записать(); 
 
КонецПроцедуры

//	Карта товаров: ключ = UID товара + UID серии + UID характеристики, значение = количество в ед.хранения
Процедура ПолучитьКоличестваТоваров(ERPData, КодЗоны, КартаТоваров, СерийныеНомера)
	
	//	Использование серий в интеграции
	ИспользоватьСерии = Константы.EmeWmsИспользоватьСерии.Получить();	
	
	// Весь товар в сообщении 
	КартаКлючей = Новый Соответствие;
	EmeWmsERPEngine.SelectChild(ERPData, "lines");
	Пока EmeWmsERPEngine.NextChildLine(ERPData) Цикл
		//	Проверим товар
		УИДТовара = ERPData.lines.goods_id;
		УИДЕдиницы = ERPData.lines.pack_id;
		Если УИДТовара = "" Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "GDSNUL");
			Продолжить
		КонецЕсли;
		
		ТоварСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаТовар(УИДТовара);
		Если ТоварСсылка.Пустая() Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "GDSBAD");
			Продолжить
		КонецЕсли;
		
		ЕдиницаИзмерения = EmeWmsУтилиты.ПолучитьСсылкуНаЕдиницуИзмерения(УИДЕдиницы);
		Если ЕдиницаИзмерения.Пустая() Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "PCKBAD");
			Продолжить
		КонецЕсли;

		РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТоварСсылка, "БазоваяЕдиницаИзмерения, 
																				|ВестиУчетПоСериям, ВестиУчетПоХарактеристикам"); 
		Если Не ИспользоватьСерии Тогда
			РеквизитыНоменклатуры.ВестиУчетПоСериям = Ложь;
		КонецЕсли;
		
		СерияНоменклатуры 		   	= Неопределено;
		ХарактеристикаНоменклатуры 	= Неопределено;
		
		Если РеквизитыНоменклатуры.ВестиУчетПоСериям Тогда   
			СерияНоменклатуры = EmeWmsУтилиты.ПолучитьСериюПоНаименованию(ERPData.lines.lot_no, ТоварСсылка);
		ИначеЕсли РеквизитыНоменклатуры.ВестиУчетПоХарактеристикам Тогда
			ХарактеристикаНоменклатуры = EmeWmsУтилиты.ПолучитьХарактеристикуПоНаименованию(ERPData.lines.lot_no, ТоварСсылка);
		КонецЕсли;
		
		КодЗоны 			= ERPData.lines.zone_to_code;
		КлючТовара 			= EmeWmsУтилиты.СоздатьКлючТовара(ТоварСсылка, СерияНоменклатуры, ХарактеристикаНоменклатуры);
		КоличествоВБазовой 	= EmeWmsУтилиты.ПересчетВДругуюЕдиницу(ERPData.lines.receipt_qty, 
																   ЕдиницаИзмерения, 
																   РеквизитыНоменклатуры.БазоваяЕдиницаИзмерения); 
																   
		КоличествоПоКарте 	= ?(КартаТоваров.Получить(КлючТовара) = Неопределено, 0, КартаТоваров.Получить(КлючТовара));
		КартаТоваров.Вставить(КлючТовара, КоличествоПоКарте + КоличествоВБазовой);
		// Это для привязки серийных номеров к товару
		КартаКлючей.Вставить(ERPData.lines.id, КлючТовара);
	КонецЦикла;
	
	// Заполнить карту серийных номеров товара (строка номеров по ключам товара)
	EmeWmsERPEngine.SelectChild(ERPData, "numbers");
	Пока EmeWmsERPEngine.NextChildLine(ERPData) Цикл 
		УИДСтроки = ERPData.numbers.despatch_line_id;
		КлючТовара = КартаКлючей.Получить(УИДСтроки); 
		
		// Номер серии: WMS "-" = 1С "Неизвестная серия"	
		СерийныйНомер = ?(ERPData.numbers.serial_no <> "-", ERPData.numbers.serial_no, "Неизвестная серия");																
		
		СтрокаНомеров = СерийныеНомера.Получить(КлючТовара);
		СерийныеНомера.Вставить(КлючТовара, ?(СтрокаНомеров = Неопределено, СерийныйНомер, СтрокаНомеров + "," + СерийныйНомер));
	КонецЦикла;	

КонецПроцедуры

// Карта товаров: ключ = EmeWmsУИД строки, значение - структура: Номенклатура, Серия, Характеристика, Количество в ед.хранения
Процедура ПолучитьКоличестваТоваровПоУИДСтроки(ERPData, КодЗоны, КартаТоваров, СерийныеНомера)
	
	//	Использование серий в интеграции
	ИспользоватьСерии = Константы.EmeWmsИспользоватьСерии.Получить();	
	
	// Весь товар в сообщении 
	КартаКлючей = Новый Соответствие;
	EmeWmsERPEngine.SelectChild(ERPData, "lines");
	Пока EmeWmsERPEngine.NextChildLine(ERPData) Цикл
		//	Проверим товар
		УИДТовара = ERPData.lines.goods_id;
		УИДЕдиницы = ERPData.lines.pack_id;
		Если УИДТовара = "" Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "GDSNUL");
			Продолжить
		КонецЕсли;
		
		ТоварСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаТовар(УИДТовара);
		Если ТоварСсылка.Пустая() Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "GDSBAD");
			Продолжить
		КонецЕсли;
		
		ЕдиницаИзмерения = EmeWmsУтилиты.ПолучитьСсылкуНаЕдиницуИзмерения(УИДЕдиницы);
		Если ЕдиницаИзмерения.Пустая() Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "PCKBAD");
			Продолжить
		КонецЕсли;

		РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТоварСсылка, "БазоваяЕдиницаИзмерения, 
																				|ВестиУчетПоСериям, ВестиУчетПоХарактеристикам"); 
		Если Не ИспользоватьСерии Тогда
			РеквизитыНоменклатуры.ВестиУчетПоСериям = Ложь;
		КонецЕсли;
		
		СерияНоменклатуры 		   	= Неопределено;
		ХарактеристикаНоменклатуры 	= Неопределено;
		
		Если РеквизитыНоменклатуры.ВестиУчетПоСериям Тогда   
			СерияНоменклатуры = EmeWmsУтилиты.ПолучитьСериюПоНаименованию(ERPData.lines.lot_no, ТоварСсылка);
		ИначеЕсли РеквизитыНоменклатуры.ВестиУчетПоХарактеристикам Тогда
			ХарактеристикаНоменклатуры = EmeWmsУтилиты.ПолучитьХарактеристикуПоНаименованию(ERPData.lines.lot_no, ТоварСсылка);
		КонецЕсли;
		
		КодЗоны 			= ERPData.lines.zone_to_code;
		КлючТовара 			= EmeWmsУтилиты.СоздатьКлючТовара(ТоварСсылка, СерияНоменклатуры, ХарактеристикаНоменклатуры);
		КоличествоВБазовой 	= EmeWmsУтилиты.ПересчетВДругуюЕдиницу(ERPData.lines.receipt_qty, 
																   ЕдиницаИзмерения, 
																   РеквизитыНоменклатуры.БазоваяЕдиницаИзмерения); 
		ТоварСтроки = Новый Структура;
		ТоварСтроки.Вставить("Номенклатура", ТоварСсылка);
		ТоварСтроки.Вставить("Серия", СерияНоменклатуры);
		ТоварСтроки.Вставить("Характеристика", ХарактеристикаНоменклатуры);
		ТоварСтроки.Вставить("Количество", КоличествоВБазовой);
		
		// В карту разместим данные строк по их EmeWmsУИДСтроки
		КартаТоваров.Вставить(ERPData.lines.asn_line_id, ТоварСтроки);
																   
		// Это для привязки серийных номеров к товару
		КартаКлючей.Вставить(ERPData.lines.id, КлючТовара);
	КонецЦикла;
	
	// Заполнить карту серийных номеров товара (строка номеров по ключам товара)
	EmeWmsERPEngine.SelectChild(ERPData, "numbers");
	Пока EmeWmsERPEngine.NextChildLine(ERPData) Цикл 
		УИДСтроки = ERPData.numbers.receipt_line_id;
		КлючТовара = КартаКлючей.Получить(УИДСтроки); 
		
		// Номер серии: WMS "-" = 1С "Неизвестная серия"	
		СерийныйНомер = ?(ERPData.numbers.serial_no <> "-", ERPData.numbers.serial_no, "Неизвестная серия");																
		
		СтрокаНомеров = СерийныеНомера.Получить(КлючТовара);
		СерийныеНомера.Вставить(КлючТовара, ?(СтрокаНомеров = Неопределено, СерийныйНомер, СтрокаНомеров + "," + СерийныйНомер));
	КонецЦикла;	

КонецПроцедуры

// Проверяет строки корректировки с возвратом товаров поставщику на соответствие карте отгруженных товаров, при расхождении возвращает Истина
Функция ПроверитьТоварыКорректировкиНаСоответствие(КорректировкаРеализации, КартаТоваров, ТекстРасхождений)

	ЕстьРасхождение = Ложь;

	Для Каждого СтрокаТовара из КорректировкаРеализации.Товары Цикл
		Если Не ЗначениеЗаполнено(СтрокаТовара.Номенклатура)
			ИЛИ Не ЗначениеЗаполнено(СтрокаТовара.ЕдиницаИзмерения) Тогда

			Продолжить;
		КонецЕсли;  
		
		// Количество возвращаемого товара
		КоличествоТовара = СтрокаТовара.КоличествоДоИзменения - СтрокаТовара.Количество;
		Если КоличествоТовара <= 0.0 Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеСтроки = КартаТоваров.Получить(СтрокаТовара.EmeWmsУИДСтроки);
		Если ДанныеСтроки = Неопределено Тогда
			ТекстРасхождений = ТекстРасхождений + "Не отгружен товар " + СтрокаТовара.Номенклатура + Символы.ПС;
			ЕстьРасхождение = Истина;
		Иначе     
			Если ДанныеСтроки.Номенклатура <> СтрокаТовара.Номенклатура Тогда
				ТекстРасхождений = ТекстРасхождений + "Вместо " + ДанныеСтроки.Номенклатура + " отгружено " + СтрокаТовара.Номенклатура + Символы.ПС;
				ЕстьРасхождение = Истина;
			КонецЕсли;             
			Если ДанныеСтроки.Количество <> КоличествоТовара Тогда
				ТекстРасхождений = ТекстРасхождений + "По данным WMS отгружено  " + ДанныеСтроки.Количество + " по 1С " + КоличествоТовара + Символы.ПС;
				ЕстьРасхождение = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла; 
	
	Если ЕстьРасхождение Тогда
		ТекстРасхождений = "Есть расхождения при отгрузке товаров по документу " + КорректировкаРеализации + Символы.ПС + ТекстРасхождений;
	Иначе                   
		ТекстРасхождений = "";
	КонецЕсли;

	Возврат ЕстьРасхождение;
КонецФункции

// Корректирует ТЧ товары документа Корректировка реализации по карте отгрузки WMS (со связью по УИД строки)
Процедура СкорректироватьТабличнуюЧастьКорректировкиРеализации(КорректировкаРеализации, КартаТоваров)
	Для Каждого СтрокаТовара из КорректировкаРеализации.Товары Цикл
		Если Не ЗначениеЗаполнено(СтрокаТовара.Номенклатура)
			ИЛИ Не ЗначениеЗаполнено(СтрокаТовара.ЕдиницаИзмерения) Тогда

			Продолжить;
		КонецЕсли;  
		
		// Количество возвращаемого товара
		КоличествоТовара = СтрокаТовара.КоличествоДоИзменения - СтрокаТовара.Количество;
		Если КоличествоТовара <= 0.0 Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеСтроки = КартаТоваров.Получить(СтрокаТовара.EmeWmsУИДСтроки);
		
		Если ДанныеСтроки = Неопределено Тогда      
			// Строку оставим, но отражать не будем
			СтрокаТовара.ОтражатьТоварныйУчет = Ложь;
		Иначе     
			Если ДанныеСтроки.Номенклатура <> СтрокаТовара.Номенклатура Тогда
				// Строку оставим, но отражать не будем
				СтрокаТовара.ОтражатьТоварныйУчет = Ложь;
			КонецЕсли;
			
			Если ДанныеСтроки.Количество <> КоличествоТовара Тогда
				СтрокаТовара.Количество = СтрокаТовара.КоличествоДоИзменения - ДанныеСтроки.Количество;
				// Суммы тоже пересчитаем
				ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТовара, КорректировкаРеализации);
				ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТовара, КорректировкаРеализации);					
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры	

#КонецОбласти

#Область МаркиЧЗ 

//	Добавляет марки в ТЧ ШтрихкодыУпаковок документа
Процедура ДобавитьМаркиВТЧШтрихкодыУпаковок(ТЧШтрихкодыУпаковок, ТаблицаМарок)  
	
	Для Каждого СтрокаМарок Из ТаблицаМарок Цикл
		//	Штрихкод марки
		ШтрихкодУпаковки = НайтиСоздатьШтрихкодУпаковки(СтрокаМарок);
		
		//  Штрихкод упаковки
		Если ЗначениеЗаполнено(СтрокаМарок.ШтрихкодКороба) Тогда
			ШтрихкодУпаковки = НайтиСоздатьШтрихкодМонотоварнойУпаковки(СтрокаМарок, СтрокаМарок.ШтрихкодКороба, ШтрихкодУпаковки);
			
			//	Штрихкод паллеты
			Если ЗначениеЗаполнено(СтрокаМарок.ШтрихкодПаллеты) Тогда
				ШтрихкодУпаковки = НайтиСоздатьШтрихкодМонотоварнойУпаковки(СтрокаМарок, СтрокаМарок.ШтрихкодПаллеты, ШтрихкодУпаковки);				
			КонецЕсли;
		КонецЕсли;
		
		//	Поиск Штрихкода в Штрихкодах упаковки проверяемого документа
		Отбор = Новый Структура();
		Отбор.Вставить("ШтрихкодУпаковки", ШтрихкодУпаковки);
			
		МассивСтрок = ТЧШтрихкодыУпаковок.НайтиСтроки(Отбор);
		Если МассивСтрок.Количество() > 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		СтрокаШтрихкода = ТЧШтрихкодыУпаковок.Добавить();
		СтрокаШтрихкода.ШтрихкодУпаковки = ШтрихкодУпаковки;
	КонецЦикла;
	
КонецПроцедуры   

//	Находит или создает новую строку в справочнике ШтрикодыУпаковокТовара
Функция НайтиСоздатьШтрихкодМонотоварнойУпаковки(СтрокаМарок, ЗначениеШтрихкода, ВложенныйШтрихкод)
	
	Штрихкод = Справочники.ШтрихкодыУпаковокТоваров.НайтиПоРеквизиту("ЗначениеШтрихкода", ЗначениеШтрихкода);
	Если Штрихкод.Пустая() Тогда
		ШтрихкодОбъект = Справочники.ШтрихкодыУпаковокТоваров.СоздатьЭлемент();
		ШтрихкодОбъект.ЗначениеШтрихкода  = ЗначениеШтрихкода;
		ШтрихкодОбъект.ТипШтрихкода 	  = Перечисления.ТипыШтрихкодов.GS1_DataMatrix;
		ШтрихкодОбъект.ТипУпаковки 		  = Перечисления.ТипыУпаковок.МонотоварнаяУпаковка;
		ШтрихкодОбъект.Количество	   	  = 1;
		ШтрихкодОбъект.ДатаУпаковки 	  = ТекущаяДата();
	Иначе
		ШтрихкодОбъект = Штрихкод.ПолучитьОбъект();
		
		//	Поиск Штрихкода в Штрихкодах упаковки проверяемого документа
		Отбор = Новый Структура();
		Отбор.Вставить("Штрихкод", ВложенныйШтрихкод);
			
		МассивСтрок = ШтрихкодОбъект.ВложенныеШтрихкоды.НайтиСтроки(Отбор);
		Если МассивСтрок.Количество() > 0 Тогда 
			Возврат ШтрихкодОбъект.Ссылка;
		КонецЕсли;		
	КонецЕсли;
			
	НоваяСтрока = ШтрихкодОбъект.ВложенныеШтрихкоды.Добавить();
	НоваяСтрока.Штрихкод = ВложенныйШтрихкод;
	
	ШтрихкодОбъект.Записать();
	
	Возврат ШтрихкодОбъект.Ссылка;   	
	
КонецФункции

//	Находит или создает новую строку в справочнике ШтрикодыУпаковокТовара
Функция НайтиСоздатьШтрихкодУпаковки(СтрокаМарок)
	
	Штрихкод = Справочники.ШтрихкодыУпаковокТоваров.НайтиПоРеквизиту("ЗначениеШтрихкода", СтрокаМарок.ЗначениеШтрихкода);
	Если Не Штрихкод.Пустая() Тогда
		Возврат Штрихкод;
	КонецЕсли;
	
	Штрихкод = Справочники.ШтрихкодыУпаковокТоваров.СоздатьЭлемент(); 
	ЗаполнитьЗначенияСвойств(Штрихкод, СтрокаМарок, , "Количество");
	
	Штрихкод.ТипШтрихкода 	= Перечисления.ТипыШтрихкодов.GS1_DataMatrix;
	Штрихкод.ТипУпаковки 	= Перечисления.ТипыУпаковок.МаркированныйТовар;
	Штрихкод.Количество	    = 1;
	Штрихкод.ДатаУпаковки 	= ТекущаяДата();
	
	Штрихкод.Записать();
	
	Возврат Штрихкод.Ссылка;   	
	
КонецФункции

//  Получить таблицу марок
Процедура ПолучитьТаблицуМарок(Параметры)
	
	ERPData		 = Параметры.ERPData;
	ТаблицаМарок = РазметитьТаблицуМарок();
	НаименованияРеквизитов = "ВестиУчетПоСериям, ВестиУчетПоХарактеристикам";
	
	EmeWmsERPEngine.SelectChild(ERPData, "sscc");
	Пока EmeWmsERPEngine.NextChildLine(ERPData) Цикл  
		ТоварСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаТовар(ERPData.sscc.goods_id);
		Если ТоварСсылка.Пустая() Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "GDSBAD");
			Продолжить
		КонецЕсли;            
		
		РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТоварСсылка, НаименованияРеквизитов);
		
		Если НЕ EmeWmsУтилиты.ПродукцияМаркируемаяДляГИСМ(ТоварСсылка) Тогда 
			Продолжить;
		КонецЕсли;
		
		СерияНоменклатуры 		   	= Неопределено;
		ХарактеристикаНоменклатуры 	= Неопределено;
		
		// Серия или Характеристика			
		Если РеквизитыНоменклатуры.ВестиУчетПоСериям Тогда   
			СерияНоменклатуры = EmeWmsУтилиты.ПолучитьСериюПоНомеру(ERPData.sscc.lot_no, ТоварСсылка);
		Иначе                  
			Если РеквизитыНоменклатуры.ВестиУчетПоХарактеристикам Тогда      
				ХарактеристикаНоменклатуры = EmeWmsУтилиты.ПолучитьХарактеристикуПоНаименованию(ERPData.sscc.lot_no, ТоварСсылка);
			КонецЕсли;                           
		КонецЕсли;                           
					
		КодМарки = ERPData.sscc.true_sign;
		Если ЗначениеЗаполнено(КодМарки) Тогда
			СтрокаМарки = ТаблицаМарок.Добавить();
			СтрокаМарки.Номенклатура 	  = ТоварСсылка;
			СтрокаМарки.Характеристика 	  = ХарактеристикаНоменклатуры;
			СтрокаМарки.Серия 			  = СерияНоменклатуры;
			СтрокаМарки.Упаковка 		  = EmeWmsУтилиты.ПолучитьБазовуюЕдиницуИзмерения(ТоварСсылка);
			СтрокаМарки.Количество		  = ERPData.sscc.quantity;
			СтрокаМарки.ЗначениеШтрихкода = EmeWmsУтилиты.КодМаркиВЗначениеСоСкобками(КодМарки);
			СтрокаМарки.ШтрихкодКороба	  = EmeWmsУтилиты.КодМаркиВЗначениеСоСкобками(ERPData.sscc.box_sscc);
			СтрокаМарки.ШтрихкодПаллеты   = EmeWmsУтилиты.КодМаркиВЗначениеСоСкобками(ERPData.sscc.pallet_sscc);			
		КонецЕсли;
	КонецЦикла;	
		
	Параметры.Вставить("ТаблицаМарок", ТаблицаМарок);

	//	Тестирование Интеграции марок, подберем случайным образом необходиоме количество марок по Номенклатуре
	// ТестированиеИмпортаМарок(Параметры);
	
КонецПроцедуры

//	Создает таблицу для отгруженных марок ЧЗ из sscc сообщения despatch
Функция РазметитьТаблицуМарок()
	ТаблицаМарок = Новый ТаблицаЗначений;
	ТаблицаМарок.Колонки.Добавить("Номенклатура");
	ТаблицаМарок.Колонки.Добавить("Характеристика");
	ТаблицаМарок.Колонки.Добавить("Упаковка");
	ТаблицаМарок.Колонки.Добавить("Серия");
	ТаблицаМарок.Колонки.Добавить("Количество");
	ТаблицаМарок.Колонки.Добавить("ЗначениеШтрихкода");
	ТаблицаМарок.Колонки.Добавить("ШтрихкодКороба");
	ТаблицаМарок.Колонки.Добавить("ШтрихкодПаллеты");
	
	Возврат ТаблицаМарок;
КонецФункции

#КонецОбласти

#Область ТестированиеМарокЧЗ 

//	Сгенерировать штрихкоды упаковок
Процедура СгенерироватьШтрихкодыУпаковкок(Параметры)         
	
	ГСЧ = Новый ГенераторСлучайныхЧисел(День(ТекущаяДата())*84600 + Час(ТекущаяДата())*3600 + Минута(ТекущаяДата())*60 + Секунда(ТекущаяДата()));	
	
	//	Минимальное количество генерируемых марок
	Количество  = ?(Параметры.СтрокаТовара.Количество > 10, 10, Параметры.СтрокаТовара.Количество * Параметры.СтрокаТовара.Коэффициент);
		
	//	Значение штрихкода короба должно быть уникальным (15 попыток получить уникальный ШК)
	Для н = 1 По 15 Цикл
		ШККороба = СоздатьРандомныйШК(ГСЧ);				
		ШКСсылка = Справочники.ШтрихкодыУпаковокТоваров.НайтиПоРеквизиту("ЗначениеШтрихкода", ШККороба);
		
		Если НЕ ЗначениеЗаполнено(ШКСсылка) Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла; 

	
	Для МаркаПоТовару = 1 По Количество Цикл
		
		Если Не EmeWmsУтилиты.ПродукцияМаркируемаяДляГИСМ(Параметры.СтрокаТовара.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		//	Значение штрихкода должно быть уникальным (15 попыток получить уникальный ШК)
		Для н = 1 По 15 Цикл
			ШКМарки  = СоздатьРандомныйШК(ГСЧ);				
			ШКСсылка = Справочники.ШтрихкодыУпаковокТоваров.НайтиПоРеквизиту("ЗначениеШтрихкода", ШКМарки);
			
			Если НЕ ЗначениеЗаполнено(ШКСсылка) Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла; 
		
		Если ЗначениеЗаполнено(ШКСсылка) Тогда
			ТекстСообщения = НСтр("ru='Штрихкоды упаковок не заполнены, дублируются номера Штрихкода'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		Параметры.Вставить("ЗначениеШтрихкода", ШКМарки);
		
		//	Пераые три марки упакуем в короб
		Если МаркаПоТовару < 4 Тогда
			Параметры.Вставить("ШтрихкодКороба", ШККороба);
		Иначе
			Параметры.Вставить("ШтрихкодКороба", "");
		КонецЕсли;
		
		СоздатьНовыйШКВСправочнике(Параметры);		
		
	КонецЦикла;
	
	Параметры.Удалить("ЗначениеШтрихкода");
	Параметры.Удалить("ШтрихкодКороба");
		
КонецПроцедуры

//	Записать в справочник новый штрихкод упаковки
Процедура СоздатьНовыйШКВСправочнике(Параметры)
	
	НовыйЭлемент = Справочники.ШтрихкодыУпаковокТоваров.СоздатьЭлемент(); 

	ЗаполнитьЗначенияСвойств(НовыйЭлемент, Параметры.СтрокаТовара);
	
	Если ЗначениеЗаполнено(Параметры.СтрокаТовара.ЕдиницаИзмерения) Тогда
		НовыйЭлемент.Упаковка = Параметры.СтрокаТовара.ЕдиницаИзмерения;
	Иначе
		НовыйЭлемент.Упаковка = EmeWmsУтилиты.ПолучитьБазовуюЕдиницуИзмерения(Параметры.СтрокаТовара.Номенклатура);
	КонецЕсли;

	НовыйЭлемент.ЗначениеШтрихкода	= Параметры.ЗначениеШтрихкода;
	НовыйЭлемент.ТипШтрихкода		= Перечисления.ТипыШтрихкодов.GS1_DataMatrix;
	НовыйЭлемент.ТипУпаковки        = Перечисления.ТипыУпаковок.МаркированныйТовар;
	НовыйЭлемент.Количество			= 1;
	НовыйЭлемент.ДатаУпаковки 	 	= ТекущаяДата();
	НовыйЭлемент.Записать();	

	СтрокаМарки = Параметры.ТаблицаМарок.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаМарки, НовыйЭлемент);
	СтрокаМарки.ШтрихкодКороба = Параметры.ШтрихкодКороба; 
	
КонецПроцедуры

//	Сгенерировать случайный штрихкод
Функция СоздатьРандомныйШК(ГСЧ)
	
	СтрокаЦифр = "0123456789";
	СтрокаБукв = "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWYZ,-.!?%></;*'_+=()";
	
	// (01)04602443466045(21)P=uxqUQfzw'Ut
	СтрокаШК = "(01)";
	Для инд1 = 1 По 14 Цикл                         
		Позиция1 = ГСЧ.СлучайноеЧисло(1,10);
		СтрокаШК = СтрокаШК + Сред(СтрокаЦифр, Позиция1, 1);
	КонецЦикла;
	СтрокаШК = СтрокаШК + "(21)";
	Для инд1 = 1 По 13 Цикл
		Позиция1 = ГСЧ.СлучайноеЧисло(1, СтрДлина(СтрокаБукв));
		СтрокаШК = СтрокаШК + Сред(СтрокаБукв, Позиция1, 1);
	КонецЦикла; 
	
	Возврат СтрокаШК;
	
КонецФункции    

//	Тестирование Интеграции марок, подберем случайным образом необходиоме количество марок по Номенклатуре
Процедура ТестированиеИмпортаМарок(Параметры)

	Если ЗначениеЗаполнено(Параметры.ТаблицаМарок) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТовара Из Параметры.ЗаказОбъект.Товары Цикл
		Если Не EmeWmsУтилиты.ПродукцияМаркируемаяДляГИСМ(СтрокаТовара.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;  
		
		Если ЗначениеЗаполнено(СтрокаТовара.ЕдиницаИзмерения) Тогда
			Упаковка = СтрокаТовара.ЕдиницаИзмерения;
		Иначе
			Упаковка = EmeWmsУтилиты.ПолучитьБазовуюЕдиницуИзмерения(СтрокаТовара.Номенклатура);
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КорректировкаРеализацииТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки
		|ПОМЕСТИТЬ ВТ_ШтрихкодыУпаковок
		|ИЗ
		|	Документ.КорректировкаРеализацииТоваровУслуг.ШтрихкодыУпаковок КАК КорректировкаРеализацииТоваровУслугШтрихкодыУпаковок
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ШтрихкодУпаковки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ &КоличествоМарок
		|	ШтрихкодыУпаковокТоваров.Номенклатура КАК Номенклатура,
		|	ШтрихкодыУпаковокТоваров.Характеристика КАК Характеристика,
		|	ШтрихкодыУпаковокТоваров.Упаковка КАК Упаковка,
		|	ШтрихкодыУпаковокТоваров.Серия КАК Серия,
		|	ШтрихкодыУпаковокТоваров.Количество КАК Количество,
		|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода КАК ЗначениеШтрихкода
		|ИЗ
		|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ШтрихкодыУпаковок КАК ВТ_ШтрихкодыУпаковок
		|		ПО ШтрихкодыУпаковокТоваров.Ссылка = ВТ_ШтрихкодыУпаковок.ШтрихкодУпаковки
		|ГДЕ
		|	ВТ_ШтрихкодыУпаковок.ШтрихкодУпаковки ЕСТЬ NULL
		|	И НЕ ШтрихкодыУпаковокТоваров.ПометкаУдаления
		|	И ШтрихкодыУпаковокТоваров.Номенклатура = &Номенклатура
		|	И ШтрихкодыУпаковокТоваров.Характеристика = &Характеристика
		|	И ШтрихкодыУпаковокТоваров.Упаковка = &Упаковка
		|	И ШтрихкодыУпаковокТоваров.Серия = &Серия
		|	И ШтрихкодыУпаковокТоваров.ТипУпаковки = &ТипУпаковки
		|	И ШтрихкодыУпаковокТоваров.ТипШтрихкода = &ТипШтрихкода";
				
		КоличествоМарок = ?(СтрокаТовара.Количество > 10, 10, СтрокаТовара.Количество * СтрокаТовара.Коэффициент);                		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&КоличествоМарок", СтрЗаменить(Строка(КоличествоМарок), Символы.НПП, "")); 
		
		Запрос.УстановитьПараметр("Номенклатура", 	 СтрокаТовара.Номенклатура);
		Запрос.УстановитьПараметр("Характеристика",  СтрокаТовара.ХарактеристикаНоменклатуры);
		Запрос.УстановитьПараметр("Упаковка", 		 Упаковка);
		Запрос.УстановитьПараметр("Серия", 			 СтрокаТовара.СерияНоменклатуры);
		Запрос.УстановитьПараметр("ТипУпаковки", 	 Перечисления.ТипыУпаковок.МаркированныйТовар);
		Запрос.УстановитьПараметр("ТипШтрихкода", 	 Перечисления.ТипыШтрихкодов.GS1_DataMatrix);
	
		РезультатЗапроса = Запрос.Выполнить();   
		
		Если РезультатЗапроса.Пустой() Тогда         
			Параметры.Вставить("СтрокаТовара", СтрокаТовара);
			СгенерироватьШтрихкодыУпаковкок(Параметры);
			
			Продолжить;
		КонецЕсли;
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтрокаМарки = Параметры.ТаблицаМарок.Добавить();
            ЗаполнитьЗначенияСвойств(СтрокаМарки, ВыборкаДетальныеЗаписи);
		КонецЦикла;
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

