//	Copyright (C) 2012-2024 Engineer Mareev Enterprises
//	Модуль для ERP 2.5 ордерная схема

// 	Асинхронное проведение документов, импортированных из EME.WMS
//	Необходимо, чтобы ошибки проведения были вне основной транзакции импорта.
//	По этой причине, новые документы только записываются при импорте
Процедура ПровестиДокументы() Экспорт
	
	ВыборкаСсылок = ПолучитьВыборкуСсылокДляПроведения();
	Пока ВыборкаСсылок.Следующий() Цикл
		ДокументСсылка = ВыборкаСсылок.Ссылка;
		Если ЗначениеЗаполнено(ДокументСсылка) Тогда
			Документ = ДокументСсылка.ПолучитьОбъект();
			Если Документ <> Неопределено Тогда
				УстановитьПривилегированныйРежим(Истина);
				
				НачатьТранзакцию();
				Попытка
					//	#COA Чепиков 20.02.2025 Eme wms статус 'Закрыт' устанавливается только при успешном фоновом проведении
					ТипДокумента = ТипЗнч(Документ);
					Если ТипДокумента = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
						//	Дата отгрузки Заказа покупателя
						Если ЗначениеЗаполнено(Документ.Сделка)
							И Не ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ.Сделка, "ДатаОтгрузки")) Тогда
							
							ЗаказПокупателяОбъект = Документ.Сделка.ПолучитьОбъект();
							ЗаказПокупателяОбъект.ДатаОтгрузки = ТекущаяДата();
							ЗаказПокупателяОбъект.Записать();
						КонецЕсли;
					КонецЕсли;
					
					Если ТипДокумента = Тип("ДокументОбъект.РеализацияТоваровУслуг")
						ИЛИ ТипДокумента = Тип("ДокументОбъект.ПеремещениеТоваров") Тогда
						
						Документ.EmeWmsСтатус = "Закрыт";
					КонецЕсли;

					Документ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);					
					ЗафиксироватьТранзакцию();
					флПроведения = Истина;
				Исключение 
					ТекстОшибки = ОписаниеОшибки();
					ОтменитьТранзакцию();
					флПроведения = Ложь;
				КонецПопытки;                            
				
				УстановитьПривилегированныйРежим(Ложь);
				
				Если флПроведения Тогда
					СоздатьОтметкуОПроведенииДокумента(ДокументСсылка, Ложь, "");   
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Проведен " + ДокументСсылка; 
					
				    // Привязка объекта к реквизиту формы "вручную"
				    Сообщение.КлючДанных = ДокументСсылка;
				    Сообщение.ПутьКДанным = "Объект";	
					
					Сообщение.Сообщить();
				Иначе
					СоздатьОтметкуОПроведенииДокумента(ДокументСсылка, Истина, ТекстОшибки);
					Сообщить("Ошибка проведения " + ДокументСсылка);
					EmeWmsУтилиты.ДобавитьНапоминаниеИнтеграции(ТекстОшибки, ДокументСсылка);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

//	Получение из регистра выборки ссылок на документы, помеченные к проведению
Функция ПолучитьВыборкуСсылокДляПроведения()  
	
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	EmeWmsПроведениеДокументов.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрСведений.EmeWmsПроведениеДокументов КАК EmeWmsПроведениеДокументов
		|ГДЕ
		|	EmeWmsПроведениеДокументов.КПроведению
		|
		|УПОРЯДОЧИТЬ ПО
		|	EmeWmsПроведениеДокументов.ПорядокПроведения";
		
	Возврат Запрос.Выполнить().Выбрать(); 
	
КонецФункции

// Создает в регистре пометку документа к проведению
Процедура ПометитьДокументКПроведению(Документ, ПорядокПроведения = 0) Экспорт

	НаборЗаписей = РегистрыСведений.EmeWmsПроведениеДокументов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КПроведению 		  = Истина;
		Запись.ПорядокПроведения  = ПорядокПроведения;
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsПроведениеДокументов.СоздатьМенеджерЗаписи();
	НоваяЗапись.Ссылка 		      = Документ.Ссылка;
	НоваяЗапись.КПроведению 	  = Истина;
	НоваяЗапись.ПорядокПроведения = ПорядокПроведения;
    НоваяЗапись.Записать();
	
КонецПроцедуры

// Создает в регистре отметку о проведении документа
Процедура СоздатьОтметкуОПроведенииДокумента(Документ, СтатусОшибки, СообщениеОбОшибке)
	
	НаборЗаписей = РегистрыСведений.EmeWmsПроведениеДокументов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КПроведению  = ложь;
		Запись.ДатаПроведения = ТекущаяДата();
		Если СтатусОшибки = ложь Тогда
			Запись.Проведен = истина;
			Запись.Ошибка = "";
		Иначе
			Запись.Проведен = ложь;
			Запись.Ошибка = СообщениеОбОшибке;
		КонецЕсли;
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
КонецПроцедуры   
