// #Область СлужебныеПеременныеИМетодыФормы

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		Результат = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		Результат = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

// #КонецОбласти

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Товар", Товар);
	Параметры.Свойство("Операция", Операция);
	Параметры.Свойство("ДокументУчета", ДокументУчета);
	Параметры.Свойство("КлючНоменклатуры1С", КлючНоменклатуры1С);
	Параметры.Свойство("КлючСтрокиДокумента", КлючСтрокиДокумента);
	Параметры.Свойство("КлючСтрокиОперации", КлючСтрокиОперации);
	Параметры.Свойство("ТолькоПросмотр", ТолькоПросмотр);
	
	УстановитьЗаголовокФормы();
	ЗаполнитьТабличныйДокумент(ЗаводскиеСерийныеНомераИзБазы());
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Если Не ПроверитьЗаполнениеСерийныхНомеров() Тогда
		ТекстСообщения = НСтр("ru = 'Необходимо исправить ошибки'");
		МодульКлиента().СообщитьПользователюЛок(ТекстСообщения, УникальныйИдентификатор);
		Возврат;
	КонецЕсли;
	
	ЗаписатьЗаводскиеСерийныеНомера();
	Закрыть(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Проверить(Команда)
	
	ПроверитьЗаполнениеСерийныхНомеров();
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТабличныйДокументПриАктивизацииОбласти(Элемент)
	
	ИмяОбласти = Элемент.ТекущаяОбласть.Имя;
	
	Если Лев(ИмяОбласти, 3) = "R1C" Тогда
		Элементы.ТабличныйДокумент.Редактирование = Ложь;
	Иначе
		Элементы.ТабличныйДокумент.Редактирование = Истина;
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПроверитьЗаполнениеСерийныхНомеров()
	
	ТаблицаЗСН = ЗаводскиеСерийныеНомераИзТабличногоДокумента();
	
	ПроверитьТаблицуСерийныхНомеров(ТаблицаЗСН);
	ЗаполнитьТабличныйДокумент(ТаблицаЗСН);
	ПоказатьРезультатПроверки();
	
	Возврат Не ЕстьОшибки;
	
КонецФункции

&НаСервере
Процедура ПроверитьТаблицуСерийныхНомеров(ТаблицаЗСН)
	
	СтатусыКодов = МодульОбъекта().Перечисление_СтатусыКодов();
	ТаблицаКодов = МодульОбъекта().Новый_ТаблицаКодов();
	
	Для каждого СтрЗСН Из ТаблицаЗСН Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаКодов.Добавить(), СтрЗСН);
	КонецЦикла;
	
	МодульОбъекта().ТаблицаКодов_ЗаполнитьКлючиКодов(ТаблицаКодов);
	МодульОбъекта().ТаблицаКодов_ПрочитатьВсюИнформацию(ТаблицаКодов);
	
	КлючиКодов = МодульОбъекта().ТаблицаЗначений_ВыгрузитьКолонку(ТаблицаКодов, "КлючКода");
	
	КлючиКодовНетВДокументе = Новый Массив;
	Если ЗначениеЗаполнено(ДокументУчета) Тогда
		КлючиКодовНетВДокументе = МодульОбъекта().КодыДокументов_ПроверитьНаличиеКодов(КлючиКодов, ДокументУчета);
	КонецЕсли;
	
	КлючиКодовНетВОперации = Новый Массив;
	Если ЗначениеЗаполнено(Операция) Тогда
		КлючиКодовНетВОперации = МодульОбъекта().КодыОпераций_ПроверитьНаличиеКодов(КлючиКодов, Операция);
	КонецЕсли;
	
	ТаблицаЗСН.ЗаполнитьЗначения("", "РезультатПроверки");
	
	Для каждого СтрЗСН Из ТаблицаЗСН Цикл
		
		СтрКода = ТаблицаКодов.Найти(СтрЗСН.КодМаркировки, "КодМаркировки");
		
		Если СтрКода = Неопределено Тогда
			СтрЗСН.РезультатПроверки = ТекстОшибки_КодНеНайден();
			Продолжить;
		КонецЕсли;
		
		Если КлючиКодовНетВДокументе.Найти(СтрКода.КлючКода) <> Неопределено Тогда
			СтрЗСН.РезультатПроверки = ТекстОшибки_КодНеНайденВДокументе();
			Продолжить;
		КонецЕсли;
		
		Если КлючиКодовНетВОперации.Найти(СтрКода.КлючКода) <> Неопределено Тогда
			СтрЗСН.РезультатПроверки = ТекстОшибки_КодНеНайденВОперации();
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Товар) И СтрКода.Товар <> Товар Тогда
			СтрЗСН.РезультатПроверки = ТекстОшибки_КодПринадлежитДругомуGTIN();
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрЗСН.ЗаводскойСерийныйНомер) Тогда
			
			Если ЗначениеЗаполнено(СтрКода.ЗаводскойСерийныйНомер)
				И СтрКода.ЗаводскойСерийныйНомер <> СтрЗСН.ЗаводскойСерийныйНомер Тогда
				СтрЗСН.РезультатПроверки = ТекстОшибки_КодУжеСодержитДругойЗСН();
				Продолжить;
			КонецЕсли;
			
			Отбор = Новый Структура("ЗаводскойСерийныйНомер", СтрЗСН.ЗаводскойСерийныйНомер);
			Если ТаблицаЗСН.НайтиСтроки(Отбор).Количество() > 1 Тогда
				СтрЗСН.РезультатПроверки = ТекстОшибки_ОбнаруженыДублиЗСН();
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Отбор = Новый Структура("РезультатПроверки", "");
	ЕстьОшибки = ТаблицаЗСН.Количество() > ТаблицаЗСН.НайтиСтроки(Отбор).Количество();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЗаводскиеСерийныеНомера()
	
	ТаблицаЗСН = ЗаводскиеСерийныеНомераИзТабличногоДокумента();
	ТаблицаКодов = МодульОбъекта().Новый_ТаблицаКодов();
	
	Для каждого СтрЗСН Из ТаблицаЗСН Цикл
		ТаблицаКодов.Добавить().КодМаркировки = СтрЗСН.КодМаркировки;
	КонецЦикла;
	
	МодульОбъекта().ТаблицаКодов_ЗаполнитьКлючиКодов(ТаблицаКодов);
	МодульОбъекта().КодыМаркировки_Прочитать(ТаблицаКодов);
	
	Для каждого СтрКода Из ТаблицаКодов Цикл
		СтрЗСН = ТаблицаЗСН.Найти(СтрКода.КодМаркировки, "КодМаркировки");
		СтрКода.ЗаводскойСерийныйНомер = СтрЗСН.ЗаводскойСерийныйНомер;
	КонецЦикла;
	
	МодульОбъекта().КодыМаркировки_Записать(ТаблицаКодов);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличныйДокумент(ТаблицаЗСН)
	
	ТабличныйДокумент.Очистить();
	
	Макет = МодульОбъекта().ПолучитьМакет("ШаблонЗагрузкиЗаводскихСерийныхНомеров");
	ШаблонШапки = Макет.ПолучитьОбласть("Шапка");
	ШаблонСтроки = Макет.ПолучитьОбласть("Строка");
	
	ТабличныйДокумент.Вывести(ШаблонШапки);
	
	Для каждого Стр Из ТаблицаЗСН Цикл
		
		ШаблонСтроки.Параметры.Заполнить(Стр);
		ОбластьСтроки = ТабличныйДокумент.Вывести(ШаблонСтроки);
		
		Если ЗначениеЗаполнено(Стр.РезультатПроверки)
			И Стр.РезультатПроверки <> ТекстОшибокНеНайдено() Тогда
			
			Ячейка = ТабличныйДокумент.Область(
			ОбластьСтроки.Низ, ОбластьСтроки.Право
			, ОбластьСтроки.Низ, ОбластьСтроки.Право);
			
			Ячейка.ЦветТекста = WebЦвета.Красный;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТабличныйДокумент.ФиксацияСверху = 1;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокФормы()
	
	ТекстЗаголовка = НСтр("ru = 'Заводские серийные номера'");
	
	Если ЗначениеЗаполнено(Товар) Тогда
		Заголовок = ТекстЗаголовка + ": " + Товар;
	ИначеЕсли ЗначениеЗаполнено(КлючНоменклатуры1С) Тогда
		Заголовок = ТекстЗаголовка + ": " + КлючНоменклатуры1С;
	ИначеЕсли ЗначениеЗаполнено(ДокументУчета) Тогда
		Заголовок = ТекстЗаголовка + ": " + ДокументУчета;
	Иначе
		Заголовок = ТекстЗаголовка;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьРезультатПроверки()
	
	Если ЕстьОшибки Тогда
		Элементы.ТекстРезультатаПроверки.Заголовок = ТекстЕстьОшибки();
	Иначе
		Элементы.ТекстРезультатаПроверки.Заголовок = ТекстОшибокНеНайдено();
	КонецЕсли;
	
	Элементы.КартинкаОшибки.Видимость = ЕстьОшибки;
	Элементы.КартинкаУспешно.Видимость = Не ЕстьОшибки;
	Элементы.ГруппаРезультатПроверки.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Функция ЗаводскиеСерийныеНомераИзБазы()
	
	Результат = Новый_ТаблицаЗаводскихСерийныхНомеров();
	
	Если ЗначениеЗаполнено(ДокументУчета)
		И Не ЗначениеЗаполнено(КлючСтрокиДокумента) Тогда
		Возврат Результат; // В таком случае пользователь самостоятельно заполняет таблицу
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументУчета) Тогда
		ТаблицаКодов = МодульОбъекта().КодыДокументов_Прочитать(ДокументУчета, КлючСтрокиДокумента);
	Иначе
		ТаблицаКодов = МодульОбъекта().КодыОпераций_Прочитать(Операция, КлючСтрокиОперации);
	КонецЕсли;
	
	МодульОбъекта().КодыМаркировки_Прочитать(ТаблицаКодов);
	
	Для каждого СтрКода Из ТаблицаКодов Цикл
		ЗаполнитьЗначенияСвойств(Результат.Добавить(), СтрКода);
	КонецЦикла;
	
	Результат.Сортировать("КодМаркировки");
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЗаводскиеСерийныеНомераИзТабличногоДокумента()
	
	Результат = Новый_ТаблицаЗаводскихСерийныхНомеров();
	
	Для каждого Стр Из МодульОбъекта().ТаблицаЗначенийИзТабличногоДокумента(ТабличныйДокумент) Цикл
		ЗаполнитьЗначенияСвойств(Результат.Добавить(), Стр);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Новый_ТаблицаЗаводскихСерийныхНомеров()
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("КодМаркировки", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ЗаводскойСерийныйНомер", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("РезультатПроверки", Новый ОписаниеТипов("Строка"));
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ТекстОшибки_КодНеНайден()
	Возврат НСтр("ru = 'Код маркировки не найден'");
КонецФункции

&НаСервере
Функция ТекстОшибки_КодУжеНанесен()
	Возврат НСтр("ru = 'Код уже нанесен'");
КонецФункции

&НаСервере
Функция ТекстОшибки_КодУжеСодержитДругойЗСН()
	Возврат НСтр("ru = 'Код уже содержит заводской серийный номер'");
КонецФункции

&НаСервере
Функция ТекстОшибки_КодПринадлежитДругомуGTIN()
	Возврат НСтр("ru = 'Код принадлежит другому GTIN'");
КонецФункции

&НаСервере
Функция ТекстОшибки_КодНеНайденВДокументе()
	Возврат НСтр("ru = 'Код не найден в документе'");
КонецФункции

&НаСервере
Функция ТекстОшибки_КодНеНайденВОперации()
	Возврат НСтр("ru = 'Код не найден в операции'");
КонецФункции

&НаСервере
Функция ТекстОшибки_ОбнаруженыДублиЗСН()
	Возврат НСтр("ru = 'Обнаружено дублирование заводских серийных номеров'");
КонецФункции

&НаСервере
Функция ТекстОшибокНеНайдено()
	Возврат НСтр("ru = 'Ошибок не найдено'");
КонецФункции

&НаСервере
Функция ТекстЕстьОшибки()
	Возврат НСтр("ru = 'Обнаружены ошибки'");
КонецФункции

// #КонецОбласти
