
&НаКлиенте
Перем ОсновнойМодуль Экспорт;

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

// #Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработатьСобытие(ИмяСобытия, ПараметрыСобытия, СтандартнаяОбработка) Экспорт
	
	Если ИмяСобытия = "ПриНажатииДопКнопкиНаКлиенте" Тогда
		//ПриНажатииДопКнопкиНаКлиенте(ПараметрыСобытия, СтандартнаяОбработка);
		Возврат;
	КонецЕсли;

	Если ИмяСобытия = "ПослеНажатияДопКнопкиНаКлиенте" Тогда
		//ПослеНажатияДопКнопкиНаКлиенте(ПараметрыСобытия);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Для обработки на клиенте нажатие дополнительной кнопки
//
// Параметры:
//  ПараметрыСобытия - Структура - содержит:
//   * ИмяКнопки - Строка - имя кнопки;
//   * Размещение - Строка - см. Перечисление_РазмещениеДополнительныхКнопок();
//   * ДопСведения - Структура - содержит:
//      ** ВыбранныеДокументы - Массив - документы учета выделенные в списке документов на основной форме;
//      ** ДокументУчета - СправочникСсылка.КонтурМаркировка_ДокументыУчета - документ учета;
//      ** Документ1С - ДокументСсылка - документ 1С;
//      ** Операция - СправочникСсылка.КонтурМаркировка_Операции - операция;
//   * ДопПараметры - Структура - дополнительные параметры, которые можно передать
//         в события ПриНажатииДопКнопкиНаСервере и ПослеНажатияДопКнопкиНаКлиенте;
&НаКлиенте
Процедура ПриНажатииДопКнопкиНаКлиенте(ПараметрыСобытия, СтандартнаяОбработка)
	
	ИмяКнопки = ПараметрыСобытия.ИмяКнопки;
	Размещение = ПараметрыСобытия.Размещение;
	ДопСведения = ПараметрыСобытия.ДопСведения;
	ДопПараметры = ПараметрыСобытия.ДопПараметры;
	
	ВыбранныеДокументы = ДопСведения.ВыбранныеДокументы;
	ДокументУчета = ДопСведения.ДокументУчета;
	Документ1С = ДопСведения.Документ1С;
	Операция = ДопСведения.Операция;
	
КонецПроцедуры

// Для обработки на клиенте нажатие дополнительной кнопки
//
// Параметры:
//  ПараметрыСобытия - Структура - содержит:
//   * ИмяКнопки - Строка - имя кнопки;
//   * Размещение - Строка - см. Перечисление_РазмещениеДополнительныхКнопок();
//   * ДопСведения - Структура - содержит:
//      ** ВыбранныеДокументы - Массив - документы учета выделенные в списке документов на основной форме;
//      ** ДокументУчета - СправочникСсылка.КонтурМаркировка_ДокументыУчета - документ учета;
//      ** Документ1С - ДокументСсылка - документ 1С;
//      ** Операция - СправочникСсылка.КонтурМаркировка_Операции - операция;
//   * ДопПараметры - Структура - дополнительные параметры, которые можно получить
//         из событий ПриНажатииДопКнопкиНаКлиенте и ПриНажатииДопКнопкиНаСервере;
&НаКлиенте
Процедура ПослеНажатияДопКнопкиНаКлиенте(ПараметрыСобытия)
	
	ИмяКнопки = ПараметрыСобытия.ИмяКнопки;
	Размещение = ПараметрыСобытия.Размещение;
	ДопСведения = ПараметрыСобытия.ДопСведения;
	ДопПараметры = ПараметрыСобытия.ДопПараметры;
	
	ВыбранныеДокументы = ДопСведения.ВыбранныеДокументы;
	ДокументУчета = ДопСведения.ДокументУчета;
	Документ1С = ДопСведения.Документ1С;
	Операция = ДопСведения.Операция;
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

// Возвращает все возможные типы операций у операции
// 
// Возвращаемое значение:
//  Структура
//
&НаКлиенте
Функция Перечисление_ТипыОпераций()
	
	Возврат ОсновнойМодуль.Перечисление_ТипыОпераций();
	
КонецФункции

// Возвращает варианты размещения дополнительных кнопок на формах.
// 
// Возвращаемое значение:
//  Структура:
//   *ОсновнаяФормаДокументыУчета - командная панель таблицы ДокументыУчета основной формы
//   *ДокументУчетаШапка - шапка формы ДокументУчета
//   *ДокументУчетаСписокКодов - командная панель таблицы КодыМаркировки формы ДокументУчета
//   *ОперацияШапка - шапка формы Операция
//
&НаКлиенте
Функция Перечисление_РазмещениеДополнительныхКнопок()
	
	Возврат ОсновнойМодуль.Перечисление_РазмещениеДополнительныхКнопок();
	
КонецФункции

// Проверяет возможность использования отложенной функциональности
//
// Параметры:
//  ИмяФункции - Строка - имя функции;
// 
// Возвращаемое значение:
//  Булево - Истина, если функциональность уже можно использовать
//
&НаКлиенте
Функция ОтложеннуюФункциюМожноИспользовать(ИмяФункции)
	
	Возврат ОсновнойМодуль.ОтложеннуюФункциюМожноИспользовать(ИмяФункции);
	
КонецФункции

// Проверяет необходимость отключения временной функциональности
//
// Параметры:
//  ИмяФункции - Строка - имя функции;
// 
// Возвращаемое значение:
//  Булево - Истина, если временную функцию уже нужно отключить
//
&НаКлиенте
Функция ВременнуюФункциюНужноОтключить(ИмяФункции)
	
	Возврат ОсновнойМодуль.ВременнуюФункциюНужноОтключить(ИмяФункции);
	
КонецФункции

&НаКлиенте
Процедура ПоказатьДиалогВопроса(ОписаниеОбработчика, ТекстВопроса, Кнопки = Неопределено, ЗаголовокДиалога = "")
	
	ОсновнойМодуль.ПоказатьДиалогВопроса(ОписаниеОбработчика, ТекстВопроса, Кнопки, ЗаголовокДиалога);
	
КонецПроцедуры

&НаКлиенте
Функция ОписаниеОбработчикаОповещения(Обработчик, Модуль, ДопПараметры = Неопределено)
	
	Возврат ОсновнойМодуль.ОписаниеОбработчикаОповещения(Обработчик, Модуль, ДопПараметры);
	
КонецФункции

&НаКлиенте
Функция ВыполнитьАвторизацию(Организация, ВызывающаяФорма, ПродлеватьДоступГИС = Истина)
	
	Возврат ОсновнойМодуль.ВыполнитьАвторизацию(Организация, ВызывающаяФорма, ПродлеватьДоступГИС);
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьОбменПоВсемОрганизациям(ВызывающаяФорма)
	
	ОсновнойМодуль.ВыполнитьОбменПоВсемОрганизациям(ВызывающаяФорма);
	
КонецПроцедуры

&НаКлиенте
Функция ЗначенияРеквизитовОбъекта_Марк(Ссылка, Реквизиты) Экспорт
	
	Возврат ОсновнойМодуль.ЗначенияРеквизитовОбъекта_Марк(Ссылка, Реквизиты);
	
КонецФункции

&НаКлиенте
Функция ЗначениеРеквизитаОбъекта_Марк(Ссылка, ИмяРеквизита) Экспорт
	
	Возврат ОсновнойМодуль.ЗначениеРеквизитаОбъекта_Марк(Ссылка, ИмяРеквизита);
	
КонецФункции

// #КонецОбласти
