
// #Область СлужебныеПеременныеИМетодыФормы

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		Результат = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		Результат = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

// #КонецОбласти

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Документ", Документ);
	Параметры.Свойство("Операция", Операция);
	Параметры.Свойство("ТипОперации", ТипОперации);
	
	ЗаполнитьКонтекстФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьЗаголовокФормы();
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	МодульКлиента().СохранитьИзмененияНаФорме("ЗаписатьИЗакрыть", ЭтаФорма, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если МодульКлиента().ЭтоЗавершениеРаботыПрограммы(ЗавершениеРаботы) Тогда
		Возврат; // При завершении работы программы серверный вызов недоступен
	КонецЕсли;
	
	ПриЗакрытииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	
	Если ЗначениеЗаполнено(Документ) Тогда
		МодульОбъекта().РедакторКодов_УдалитьФайл(Документ);
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	ЗаписатьКодыВФайлРедактора();
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьКодыВФайлCSV(Команда)
	
	ФорматыФайловСКодами = МодульКлиента().Перечисление_ФорматыФайловСКодами();
	СохранитьКодыВФайл(ФорматыФайловСКодами.csv);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьКодыВФайлXLS(Команда)
	
	ФорматыФайловСКодами = МодульКлиента().Перечисление_ФорматыФайловСКодами();
	СохранитьКодыВФайл(ФорматыФайловСКодами.xlsx);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьКодыВФайл(ФорматФайла)
	
	ТипыФайловСКодами = МодульКлиента().Перечисление_ТипыФайловСКодами();
	
	ПараметрыСохранения = МодульКлиента().Новый_ПараметрыСохраненияФайлаСКодами();
	
	ПараметрыСохранения.Ссылка = Операция;
	ПараметрыСохранения.ФорматФайла = ФорматФайла;
	ПараметрыСохранения.ТипФайлаСКодами = ТипыФайловСКодами.ФайлКодовСОшибками;
	
	МодульКлиента().СохранитьКодыВФайл(ПараметрыСохранения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьТолькоКодыСОшибками(Команда)
	
	ПоказатьТолькоКодыСОшибками = Не ПоказатьТолькоКодыСОшибками;
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура РаспознатьКоды(Команда)
	
	Если ЗагружатьПолныеКоды И Не ВсеКодыМаркировкиСодержатЭквивалентРазделителяGS1() Тогда
		Возврат;
	КонецЕсли;
	
	РаспознатьКодыНаСервере();
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьДубли(Команда)
	
	ПроверитьДублиНаСервере();
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьВОперацию(Команда)
	
	Если Не ПроверитьРезультат() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьКодыВОперацию();
	
	Оповестить("КонтурМаркировка_ОбработаныКодыВРедакторе", Операция);
	
	Если ЭтаФорма.Окно <> Неопределено Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьПолучениеКодов(Команда)
	
	Если Не ПроверитьРезультат() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьКодыВФайлРедактора();
	ЗавершитьПолучениеКодовИзСервиса();
	
	Оповестить("КонтурМаркировка_ОбработаныКодыВРедакторе", Операция);
	
	Если ЭтаФорма.Окно <> Неопределено Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьВДокумент(Команда)
	
	Если Не ПроверитьРезультат() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьКодыВДокумент();
	
	Оповестить("КонтурМаркировка_КодыВДокументах_Изменен", Документ);
	
	Если ЭтаФорма.Окно <> Неопределено Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КодыМаркировкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.ИндексВТаблицеКодовИзФайла = -1;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КодыМаркировкиПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура КодыМаркировкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ТипыОпераций = МодульКлиента().Перечисление_ТипыОпераций();
	Если ТипОперации = ТипыОпераций.НаполнениеОдногоАгрегатаНаТСД Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЭквивалентовРазделителяGS1Нажатие(Элемент)
	
	Обработчик = МодульКлиента().ОписаниеОбработчикаОповещения("СписокЭквивалентовРазделителяGS1ПослеРедактирования", ЭтаФорма);
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Строка"));
	
	КонтекстФормы = МодульКлиента().Новый_ПараметрыФормыРедактированияСписка();
	
	КонтекстФормы.РазрешитьРедактирование = Истина;
	КонтекстФормы.Заголовок               = НСтр("ru = 'Эквиваленты разделителя GS1'");
	КонтекстФормы.Список                  = СписокЭквивалентовРазделителяGS1;
	КонтекстФормы.МассивТипов             = МассивТипов;
	
	МодульКлиента().ОткрытьФормуПросмотраСписка(ЭтаФорма, КонтекстФормы, Обработчик);
	
КонецПроцедуры

&НаСервере
Процедура СписокЭквивалентовРазделителяGS1ПослеРедактирования(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивЭквивалентовGS1 = Результат.ВыгрузитьЗначения();
	ЗаписатьЭквивалентыРазделителяGS1(МассивЭквивалентовGS1);
	
	ЗаполнитьСписокЭквивалентовРазделителяGS1();
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьКонтекстФормы()
	
	ЗаполнитьСписокЭквивалентовРазделителяGS1();
	ЗаполнитьТребованиеЗавершитьПолучениеКодов();
	ПоказатьТолькоКодыСОшибками = ТребуетсяЗавершитьПолучениеКодовИзСервиса;
	
	Если ЗначениеЗаполнено(Документ) Тогда
		ВладелецФайла = Документ;
	Иначе
		ВладелецФайла = Операция;
	КонецЕсли;
	
	Организация = МодульОбъекта().ЗначениеРеквизитаОбъекта_Марк(ВладелецФайла, "Организация");
	
	ДанныеРедактора = МодульОбъекта().РедакторКодов_ПолучитьИзФайла(ВладелецФайла);
	Если ДанныеРедактора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаКодов = ДанныеРедактора.ТаблицаКодов;
	УдалитьСтарыеКоды = ДанныеРедактора.УдалитьСтарыеКоды;
	УдалитьИзДокументаКодыВАгрегатах = ДанныеРедактора.УдалитьИзДокументаКодыВАгрегатах;
	ЗагружатьПолныеКоды = ДанныеРедактора.ЗагружатьПолныеКоды;
	
	ЗаполнитьКодыМаркировки(ТаблицаКодов);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКодыМаркировки(ТаблицаКодов)
	
	КодыМаркировки.Очистить();
	
	Если Не ЗначениеЗаполнено(ТаблицаКодов) Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрКода Из ТаблицаКодов Цикл
		
		Стр = КодыМаркировки.Добавить();
		ЗаполнитьЗначенияСвойств(Стр, СтрКода, ,"КодМаркировки");
		
		Если ЗагружатьПолныеКоды Тогда
			Стр.КодМаркировки = МодульОбъекта().УдалитьНедопустимыеСимволыXML(СтрКода.ИсходныйКодМаркировки);
		Иначе
			Стр.КодМаркировки = МодульОбъекта().УдалитьНедопустимыеСимволыXML(СтрКода.КодМаркировки);
		КонецЕсли;
		Стр.ИндексВТаблицеКодовИзФайла = ТаблицаКодов.Индекс(СтрКода);
		Стр.ЕстьОшибка = ЗначениеЗаполнено(Стр.ОписаниеОшибки);
		
		Стр.НомерКартинкиОписанияОшибки = -1;
		Если Стр.ЕстьОшибка Тогда
			Стр.НомерКартинкиОписанияОшибки = 2;
		КонецЕсли;
		
		Стр.НомерКартинкиКодРазобран = -1;
		Если Стр.КодРазобран Тогда
			Стр.НомерКартинкиКодРазобран = 4;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьКодыВОперацию()
	
	ЗаписатьКодыВФайлРедактора();
	МодульОбъекта().КодыОпераций_ДобавитьИзРедактораКодов(Операция);
	МодульОбъекта().Метрика_Функциональность_РедактированиеКодовСОшибками(Операция);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьКодыВДокумент()
	
	ЗаписатьКодыВФайлРедактора();
	МодульОбъекта().КодыДокументов_ДобавитьИзРедактораКодов(Документ);
	МодульОбъекта().Метрика_Функциональность_РедактированиеКодовСОшибками(Документ);
	
КонецПроцедуры

&НаСервере
Процедура ЗавершитьПолучениеКодовИзСервиса()
	
	МодульОбъекта().ОчередьОбмена_ЗавершитьПолучениеКодов(Операция);
	МодульОбъекта().Метрика_Функциональность_РедактированиеКодовСОшибками(Операция);
	
КонецПроцедуры

&НаСервере
Процедура РаспознатьКодыНаСервере()
	
	ТаблицаКодов = МодульОбъекта().Новый_ТаблицаКодов();
	
	Если ТребуетсяЗавершитьПолучениеКодовИзСервиса Тогда
		ЗаполнитьТаблицуКодовИзФайла(ТаблицаКодов);
	Иначе
		ЗаполнитьТаблицуКодовИзКодовМаркировки(ТаблицаКодов);
	КонецЕсли;
	
	МодульОбъекта().РаспознатьКоды(ТаблицаКодов, Организация);
	МодульОбъекта().ТаблицаКодов_ЗаполнитьКлючиКодов(ТаблицаКодов);
	ЗаполнитьКодыМаркировки(ТаблицаКодов);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьДублиНаСервере()
	
	ОписаниеОперации = МодульОбъекта().Операция_Прочитать(Операция);
	КлючАгрегата = ОписаниеОперации.ДопРеквизиты.КлючКода;
	КодАгрегата = МодульОбъекта().КодМаркировки_НайтиПоКлючу(КлючАгрегата);
	
	ТаблицаКодов = МодульОбъекта().Новый_ТаблицаКодов();
	ЗаполнитьТаблицуКодовИзКодовМаркировки(ТаблицаКодов);
	МодульОбъекта().ТаблицаКодов_ПрочитатьВсюИнформацию(ТаблицаКодов);
	
	Для каждого Стр Из ТаблицаКодов Цикл
		
		Если Стр.КодМаркировки = КодАгрегата Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Стр.КодАгрегата)
			И Стр.КодАгрегата <> КодАгрегата Тогда
			Стр.ОписаниеОшибки = МодульОбъекта().ОписаниеОшибки_КодПринадлежитДругомуАгрегату(Стр.КодАгрегата);
			Продолжить;
		КонецЕсли;
		
		Стр.КодАгрегата = КодАгрегата;
		Стр.ОписаниеОшибки = "";
		
	КонецЦикла;
	
	ЗаполнитьКодыМаркировки(ТаблицаКодов);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьКодыВФайлРедактора()
	
	ТаблицаКодов = МодульОбъекта().Новый_ТаблицаКодов();
	ЗаполнитьТаблицуКодовИзКодовМаркировки(ТаблицаКодов);
	
	ДанныеРедактора = МодульОбъекта().Новый_ДанныеРедактораКодов(ТаблицаКодов);
	ДанныеРедактора.УдалитьСтарыеКоды = УдалитьСтарыеКоды;
	ДанныеРедактора.УдалитьИзДокументаКодыВАгрегатах = УдалитьИзДокументаКодыВАгрегатах;
	ДанныеРедактора.ЗагружатьПолныеКоды = ЗагружатьПолныеКоды;
	
	МодульОбъекта().РедакторКодов_ЗаписатьФайл(ВладелецФайла, ДанныеРедактора);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьКодыВФайлПослеВыбораКаталога(ВыбранныеФайлы, ФорматФайла) Экспорт
	
	Если Не ЗначениеЗаполнено(ВыбранныеФайлы) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьКодыВФайлРедактора();
	
	АдресФайлов = МодульКлиента().ВыгрузитьКодыРедактораКодовВФайл(Операция, ФорматФайла);
	Если Не ЗначениеЗаполнено(АдресФайлов) Тогда
		Возврат;
	КонецЕсли;
	
	МассивФайлов = ПолучитьИзВременногоХранилища(АдресФайлов);
	Если Не ЗначениеЗаполнено(МассивФайлов) Тогда
		Возврат;
	КонецЕсли;
	
	Каталог = ВыбранныеФайлы[0];
	Для каждого ОписаниеФайла Из МассивФайлов Цикл
		ПутьКФайлу = МодульКлиента().ОбъединитьПути(Каталог, ОписаниеФайла.ИмяФайла);
		ОписаниеФайла.ДвоичныеДанные.Записать(ПутьКФайлу);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьЭлементыФормы()
	
	Элементы.Кнопка_ПоказатьТолькоКодыСОшибками.Пометка = ПоказатьТолькоКодыСОшибками;
	Если ПоказатьТолькоКодыСОшибками Тогда
		Элементы.КодыМаркировки.ОтборСтрок = Новый ФиксированнаяСтруктура("ЕстьОшибка", Истина);
	Иначе
		Элементы.КодыМаркировки.ОтборСтрок = Неопределено;
	КонецЕсли;
	
	Если ЗагружатьПолныеКоды Тогда
		Элементы.КодыМаркировкиКодМаркировки.Заголовок = "Полный код маркировки";
	Иначе
		Элементы.КодыМаркировкиКодМаркировки.Заголовок = "Код маркировки";
	КонецЕсли;
	
	ПоказатьКнопкиПоискаДля82();
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	ЕстьОшибки = КодыМаркировки_ЕстьОшибки();
	ВсеКодыРазобраны = КодыМаркировки_ВсеКодыРазобраны();
	ТипыОпераций = МодульКлиента().Перечисление_ТипыОпераций();
	
	Элементы.Кнопка_РаспознатьКоды.Видимость = Не ВсеКодыРазобраны;
	Элементы.Кнопка_ПроверитьДубли.Видимость = Ложь;
	Если ТипОперации = ТипыОпераций.НаполнениеОдногоАгрегатаНаТСД Тогда
		Элементы.Кнопка_ПроверитьДубли.Видимость = ЕстьОшибки И ВсеКодыРазобраны;
	КонецЕсли;
	
	Если ТребуетсяЗавершитьПолучениеКодовИзСервиса Тогда
		Элементы.Кнопка_ЗаписатьВОперацию.Видимость = Ложь;
		Элементы.Кнопка_ЗавершитьПолучениеКодов.Видимость = Не ЕстьОшибки И ВсеКодыРазобраны;
		Элементы.Кнопка_ЗаписатьВДокумент.Видимость = Ложь;
	ИначеЕсли ЗначениеЗаполнено(Документ) Тогда
		Элементы.Кнопка_ЗаписатьВОперацию.Видимость = Ложь;
		Элементы.Кнопка_ЗавершитьПолучениеКодов.Видимость = Ложь;
		Элементы.Кнопка_ЗаписатьВДокумент.Видимость = Истина;
	Иначе
		Элементы.Кнопка_ЗаписатьВОперацию.Видимость = Не ЕстьОшибки И ВсеКодыРазобраны;
		Элементы.Кнопка_ЗавершитьПолучениеКодов.Видимость = Ложь;
		Элементы.Кнопка_ЗаписатьВДокумент.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокФормы()
	
	ТипыОпераций = МодульКлиента().Перечисление_ТипыОпераций();
	Если ТипОперации = ТипыОпераций.ДобавлениеВАгрегат
		Или ТипОперации = ТипыОпераций.ДобавлениеВАТК Тогда
		ШаблонЗаголовка = НСтр("ru = 'Коды для добавления: %1'");
	ИначеЕсли ТипОперации = ТипыОпераций.ИзъятиеИзАгрегата
		Или ТипОперации = ТипыОпераций.ИзъятиеИзАТК Тогда
		ШаблонЗаголовка = НСтр("ru = 'Коды для изъятия: %1'");
	Иначе
		Если ЗагружатьПолныеКоды Тогда
			ШаблонЗаголовка = НСтр("ru = 'Полные коды с ошибками: %1'");
		Иначе
			ШаблонЗаголовка = НСтр("ru = 'Коды с ошибками: %1'");
		КонецЕсли;
	КонецЕсли;
	
	ЭтаФорма.Заголовок = МодульКлиента().ПараметрыВСтроку(ШаблонЗаголовка, ВладелецФайла);
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьКнопкиПоискаДля82()
	
	Если МодульОбъекта().ВерсияПлатформыНиже("8.3") Тогда
		Элементы.КодыМаркировкиКнопкиПоискаДля82.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТребованиеЗавершитьПолучениеКодов()
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	
	ПодходящиеТипы = Новый Массив;
	ПодходящиеТипы.Добавить(ТипыОпераций.ПодборКодовНаТСД);
	ПодходящиеТипы.Добавить(ТипыОпераций.ПодборТоваровИКодовНаТСД);
	ПодходящиеТипы.Добавить(ТипыОпераций.ОтчетОНанесенииНаТСД);
	ПодходящиеТипы.Добавить(ТипыОпераций.ОтчетОВыбытииНаТСД);
	ПодходящиеТипы.Добавить(ТипыОпераций.НаполнениеОдногоАгрегатаНаТСД);
	
	ТребуетсяЗавершитьПолучениеКодовИзСервиса = (ПодходящиеТипы.Найти(ТипОперации) <> Неопределено);
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьРезультат()
	
	ЕстьОшибки = Ложь;
	
	Если Не КодыМаркировки_ВсеКодыРазобраны() Тогда
		ТекстСообщения = НСтр("ru = 'Необходимо чтобы все коды были распознаны'");
		МодульКлиента().СообщитьПользователюЛок(ТекстСообщения, УникальныйИдентификатор);
		ЕстьОшибки = Истина;
	КонецЕсли;
		
	Если КодыМаркировки_ЕстьОшибки() Тогда
		ТекстСообщения = НСтр("ru = 'Необходимо исправить ошибки в кодах'");
		МодульКлиента().СообщитьПользователюЛок(ТекстСообщения, УникальныйИдентификатор);
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Возврат Не ЕстьОшибки;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуКодовИзКодовМаркировки(ТаблицаКодов)
	
	Для каждого СтрКода Из КодыМаркировки Цикл
		Стр = ТаблицаКодов.Добавить();
		ЗаполнитьЗначенияСвойств(Стр, СтрКода);
		Если ЗагружатьПолныеКоды Тогда
			Стр.КодМаркировки = ЗаменитьНаОсновнойЭквивалентыРазделителяGS1(Стр.КодМаркировки);
			Стр.ПолныйКод = Стр.КодМаркировки;
			Стр.КодРазобран = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуКодовИзФайла(ТаблицаКодов)
	
	ДанныеРедактора = МодульОбъекта().РедакторКодов_ПолучитьИзФайла(ВладелецФайла);
	Если ЗначениеЗаполнено(ДанныеРедактора) Тогда
		ТаблицаКодовИзФайла = ДанныеРедактора.ТаблицаКодов;
	Иначе
		ТаблицаКодовИзФайла = МодульОбъекта().Новый_ТаблицаКодов();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТаблицаКодовИзФайла) Тогда
		ЗаполнитьТаблицуКодовИзКодовМаркировки(ТаблицаКодовИзФайла);
	КонецЕсли;
	
	Для каждого СтрКода Из КодыМаркировки Цикл
		Стр = ТаблицаКодов.Добавить();
		Если СтрКода.ИндексВТаблицеКодовИзФайла > -1 Тогда
			ЗаполнитьЗначенияСвойств(Стр, ТаблицаКодовИзФайла[СтрКода.ИндексВТаблицеКодовИзФайла]);
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(Стр, СтрКода);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция КодыМаркировки_ЕстьОшибки()
	
	Отбор = Новый Структура("ОписаниеОшибки", "");
	Возврат КодыМаркировки.Количество() > КодыМаркировки.НайтиСтроки(Отбор).Количество();
	
КонецФункции

&НаСервере
Функция КодыМаркировки_ВсеКодыРазобраны()
	
	Отбор = Новый Структура("КодРазобран", Истина);
	Возврат КодыМаркировки.Количество() = КодыМаркировки.НайтиСтроки(Отбор).Количество();
	
КонецФункции

&НаКлиенте
Функция ВсеКодыМаркировкиСодержатЭквивалентРазделителяGS1()
	
	Результат = Истина;
	
	МассивРазделителей = СписокЭквивалентовРазделителяGS1.ВыгрузитьЗначения();
	Для Каждого СтрКода Из КодыМаркировки Цикл
		
		КодМаркировки = СтрКода.КодМаркировки;
		
		ЕстьРазделители = Ложь;
		Для Каждого Разделитель Из МассивРазделителей Цикл
			Если Найти(КодМаркировки, Разделитель) > 0 Тогда
				ЕстьРазделители = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Не ЕстьРазделители Тогда
			ШаблонОшибки = НСтр("ru = 'Код маркировки %1 не содержит эквивалентов разделителя GS1 и не может быть загружен как полный.'");
			ТекстОшибки = МодульКлиента().ПараметрыВСтроку(ШаблонОшибки, КодМаркировки);
			МодульКлиента().СообщитьОбОшибкеВСтрокеТабЧасти(ТекстОшибки, УникальныйИдентификатор
			, Элементы.КодыМаркировки, "КодМаркировки", КодыМаркировки.Индекс(СтрКода));
			Результат = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокЭквивалентовРазделителяGS1()
	
	МассивЭквивалентовGS1 = МодульОбъекта().ЭквивалентыРазделителяGS1();
	СписокЭквивалентовРазделителяGS1.ЗагрузитьЗначения(МассивЭквивалентовGS1);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЭквивалентыРазделителяGS1(МассивЭквивалентовGS1)
	
	МодульОбъекта().ЭквивалентыРазделителяGS1_Записать(МассивЭквивалентовGS1);
	
КонецПроцедуры

&НаСервере
Функция ЗаменитьНаОсновнойЭквивалентыРазделителяGS1(Строка)
	
	Результат = Строка;
	
	ОсновнойЭквивалент = СписокЭквивалентовРазделителяGS1[0];
	Для каждого ДопЭквивалент Из СписокЭквивалентовРазделителяGS1 Цикл
		Результат = СтрЗаменить(Результат, ДопЭквивалент, ОсновнойЭквивалент);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти
