
// Описание переменных

&НаКлиенте
Перем КэшМодуляКлиента;

// Методы получения модулей

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		Результат = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		Результат = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСтатусОбработки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьКонтекстПоУмолчанию();
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьВыполнениеЗаданий(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьЗадания();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрерватьВыполнениеЗаданий(Команда)
	
	ОтключитьОбработчикОжидания("ВыполнитьЗадания");
	
	СтатусОбработки = СтатусыОбработки().ОбработкаНеЗапущена;
	НастроитьЭлементыФормы();
	
КонецПроцедуры

// Служебные методы

&НаКлиенте
Процедура ЗаполнитьКонтекстПоУмолчанию()
	
	Если Не ЗначениеЗаполнено(ИнтервалОбработки) Тогда
		ИнтервалОбработки = 5;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗадания() Экспорт
	
	СтатусОбработки = СтатусыОбработки().ВыполняетсяОбработка;
	НастроитьЭлементыФормы();
	
	ПодключитьОбработчикОжидания("ВыполнитьОбработку", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработку() Экспорт
	
	ВыполнитьОбработкуЗаданий();
	
	СтатусОбработки = СтатусыОбработки().ОжиданиеСледующейОбработки;
	НастроитьЭлементыФормы();
	
	ПодключитьОбработчикОжидания("ВыполнитьЗадания", ИнтервалОбработки, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьЭлементыФормы()
	
	СтатусыОбработки = СтатусыОбработки();
	
	Если СтатусОбработки = СтатусыОбработки.НевозможноВыполнитьОбработку Тогда
		Элементы.НадписьНеПодходятУсловия.Видимость = Истина;
		Элементы.НадписьРекомендуетсяОтдельныйСеанс.Видимость = Ложь;
	Иначе
		Элементы.НадписьНеПодходятУсловия.Видимость = Ложь;
		Элементы.НадписьРекомендуетсяОтдельныйСеанс.Видимость = Истина;
	КонецЕсли;
	
	Если СтатусОбработки = СтатусыОбработки.ОбработкаНеЗапущена Тогда
		Элементы.Кнопка_ЗапуститьВыполнениеЗаданий.Доступность = Истина;
		Элементы.ИнтервалОбработки.Доступность = Истина;
	Иначе
		Элементы.Кнопка_ЗапуститьВыполнениеЗаданий.Доступность = Ложь;
		Элементы.ИнтервалОбработки.Доступность = Ложь;
	КонецЕсли;
	
	Если СтатусОбработки = СтатусыОбработки.ОжиданиеСледующейОбработки Тогда
		Элементы.Кнопка_ПрерватьВыполнениеЗаданий.Доступность = Истина;
	Иначе
		Элементы.Кнопка_ПрерватьВыполнениеЗаданий.Доступность = Ложь;
	КонецЕсли;
	
	Если СтатусОбработки = СтатусыОбработки.ОжиданиеСледующейОбработки Тогда
		ТекстСтатуса = НСтр("ru = 'Ожидание следующего выполнения...'");
		Элементы.НадписьСтатусВыполнения.Заголовок = ТекстСтатуса;
		Элементы.НадписьСтатусВыполнения.Видимость = Истина;
	ИначеЕсли СтатусОбработки = СтатусыОбработки.ВыполняетсяОбработка Тогда
		ТекстСтатуса = НСтр("ru = 'Выполняется обработка...'");
		Элементы.НадписьСтатусВыполнения.Заголовок = ТекстСтатуса;
		Элементы.НадписьСтатусВыполнения.Видимость = Истина;
	Иначе
		Элементы.НадписьСтатусВыполнения.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатусОбработки()
	
	СтатусыОбработки = СтатусыОбработки();
	
	Если МодульОбъекта().МожноВыполнятьОбработкуФоновыхЗаданийНаКлиенте() Тогда
		СтатусОбработки = СтатусыОбработки.ОбработкаНеЗапущена;
	Иначе
		СтатусОбработки = СтатусыОбработки.НевозможноВыполнитьОбработку;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СтатусыОбработки()
	
	Результат = Новый Структура;
	Результат.Вставить("ОбработкаНеЗапущена", "ОбработкаНеЗапущена");
	Результат.Вставить("НевозможноВыполнитьОбработку", "НевозможноВыполнитьОбработку");
	Результат.Вставить("ОжиданиеСледующейОбработки", "ОжиданиеСледующейОбработки");
	Результат.Вставить("ВыполняетсяОбработка", "ВыполняетсяОбработка");
	
	Возврат Результат;
	
КонецФункции
