// Copyright (C) 2012-2025 Engineer Mareev Enterprises
// Модуль для УТ 10.3

// 	$Возврат товаров от покупателя
//	Импорт сообщений RECEIPT:
//	 - Оператор EME.WMS (руч.) создает документ "Возврат" на основе ASN.
//	 - После закрытия документа возврата EME.WMS (авт.) экспортирует сообщение RECEIPT.
//	 - 1C (авт.) импортирует сообщение RECEIPT.
//	 - 1С (авт.) При несовпадении данных документа 1С по товарам с фактически принятыми, корректируется документ "Возврат товаров от покупателя".
//	 - 1C (авт.) документ "Возврат товаров от покупателя" проводится, в комментарий заносится информация о документе WMS, на основании которого документ принят (скорректирован).

#Область ПрограммныйИнтерфейс  

// Импорт документа Возврат товаров от покупателя по receipt (is_return = 1) с сериями (или харакеристиками) и марками
Процедура Импортировать(ERPData, Трассировка, ТемаСообщения) Экспорт
	
	Если ERPData.header.erp_doc_type <> ПолучитьМетаданные().Имя Тогда
		Возврат;
	КонецЕсли;
	
	// #IBS 22.11.2024 Принимать только сообщение для закрытого или подтвержденного документа.
	Если Не EmeWmsСтатусы.ДокументЗакрыт(ERPData) Тогда
		возврат;
	КонецЕсли;  

	Если ERPData.header.is_return <> 1 Тогда // Принимать только возвраты
		возврат;
	КонецЕсли;  
	
	Если ERPData.header.is_partly = 1 Тогда // Принимать только закрывающий receipt
		возврат;
	КонецЕсли;  
	
	Если ERPData.header.asn_id = "" Тогда // Возврат импортируется только на основе ASN. Без ASN - ОприходованиеТоваров.
		Возврат;
	КонецЕсли;
	
	НомерЕМЕ	= ERPData.header.receipt_reg_no;
	ИдЕМЕ 		= ERPData.header.receipt_id;       
	
	//	Соберем товары и количества
	КодЗоны = неопределено;
	КодЗоныБрака = неопределено;
	КартаТоваров = Новый Соответствие;
	КартаБрака = Новый Соответствие;     
	ПолучитьКоличестваТоваровСБраком(ERPData, КодЗоны, КодЗоныБрака, КартаТоваров, КартаБрака);
	
	// Получим склад по коду EME
	КодСклада = ERPData.header.whs_to_code;
	КодОрганизации = ERPData.header.vendor_to_code;
	СкладСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаСкладПоКодуEME(КодСклада, КодЗоны, КодОрганизации);
	Если СкладСсылка.Пустая() Тогда
		EmeWmsERPEngine.ErrorHeader(ERPData, "WTOBAD");
		Возврат;
	КонецЕсли;
	
	ОрганизацияСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаОрганизациюПоКодуEME(КодОрганизации);
	Если ОрганизацияСсылка.Пустая() Тогда
		EmeWmsERPEngine.ErrorHeader(ERPData, "VNDBAD");
		Возврат;
	КонецЕсли;
	
	// Ссылка на документ-основание из ASN (Возврат товаров от покупателя)
	ВозвратТоваровСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаВозвратТоваровОтПокупателя(ERPData.header.asn_id);
	Если ВозвратТоваровСсылка.Пустая() Тогда
		EmeWmsERPEngine.ErrorHeader(ERPData, "ASNBAD");
	КонецЕсли;
	
	//	Если были ошибки
	Если EmeWmsERPEngine.HasErrors(ERPData) Тогда
		Возврат;
	КонецЕсли;
	
	//*** Проверки сделали, пишем в базу данных 1C ***
	
	ВозвратТоваров	= ВозвратТоваровСсылка.ПолучитьОбъект();
	СкладСсылка 	= ВозвратТоваров.СкладОрдер;	

	КартаТоваровДокумента = EmeWmsУтилиты.ПолучитьКартуТоваровДокумента(ВозвратТоваровСсылка);
	ТаблицаРазличий = EmeWmsУтилиты.ПолучитьТаблицуРазличий(КартаТоваровДокумента, КартаТоваров);		
	Если ТаблицаРазличий.Количество() > 0 Тогда
		ТекстРасхождений = EmeWmsУтилиты.ПолучитьКраткоеОписаниеРазличий(ВозвратТоваровСсылка, ERPData.header.asn_reg_no, ТаблицаРазличий);
		Если ERPData.header.state = "NEW" Тогда 
			Тема = "Расхождение данных по принятым товарам в исходном документе Возврат товаров и документе возврата wms";
			EmeWmsУтилиты.ДобавитьНапоминаниеИнтеграции(ТекстРасхождений, ВозвратТоваровСсылка);
		КонецЕсли;                    

		EmeWmsУтилиты.СкорректироватьТЧДокумента(ВозвратТоваров.Товары, КартаТоваров, Истина);

		// Пересчитаем упаковки штатным способом
		Для Каждого СтрокаТовара Из ВозвратТоваров.Товары Цикл
			ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТовара, ВозвратТоваров);
		КонецЦикла;    

		ВозвратТоваров.Комментарий = "Документ скорректирован на основании документа прихода EME: " + ERPData.header.receipt_reg_no + " (" + ERPData.header.comment + ")";
	Иначе
		ВозвратТоваров.Комментарий = "Документ принят без изменений на основании документа прихода EME: " + ERPData.header.receipt_reg_no + " (" + ERPData.header.comment + ")";
	КонецЕсли;
	
	ВозвратТоваров.Записать();

	EmeWmsПроведениеДокументов.ПометитьДокументКПроведению(ВозвратТоваров.Ссылка, 0);
	
	Если КартаБрака.Количество() > 0 Тогда  // Только проведенный документ может быть основанием для перемещения
		СкладБрака = EmeWmsУтилиты.ПолучитьСсылкуНаСкладПоКодуEME(КодСклада,,КодОрганизации, "B");
		// #IBS 07.12.2023 Создавать перемещение на брак, если такой склад определен
		Если ЗначениеЗаполнено(СкладБрака) Тогда
			ПеремещениеСсылка = СоздатьИзменитьДокументПеремещенияНаСкладБрака(ERPData, ИдЕМЕ, НомерЕМЕ, ВозвратТоваров, КартаБрака, СкладБрака);
			Тема = "Создан документ перемещения на склад брака на основании прихода EME";
			Текст = "На основании " + ВозвратТоваровСсылка + Символы.ПС + " и документа прихода EME " + ERPData.header.receipt_reg_no + Символы.ПС + 
					" создан документ перемещения на склад брака " + ПеремещениеСсылка;
			EmeWmsУтилиты.ДобавитьНапоминаниеИнтеграции(Текст, ПеремещениеСсылка);
		КонецЕсли;
	КонецЕсли;
		
	СоздатьОтметкуОбИмпортеВозвратаТоваровОтПокупателя(ВозвратТоваров.Ссылка, ИдЕМЕ);
	
	Трассировка = Трассировка + ВозвратТоваров + Символы.ПС;
	ТемаСообщения = "Создан документ Приходный ордер на товары по приходу EME " + ERPData.header.receipt_reg_no;
	
	EmeWmsERPEngine.Success(ERPData); 
	
КонецПроцедуры

#КонецОбласти

#Область ЭкспортныеСлужебныеПроцедурыИФункции

// Функция ПолучитьИмяСообщения возвращает имя сообщения
Функция ПолучитьИмяСообщения() Экспорт
	Возврат "receipt";
КонецФункции

// Функция ПолучитьМетаданные возвращает метаданные сообщения
Функция ПолучитьМетаданные() Экспорт
	Возврат Метаданные.Документы.ВозвратТоваровОтПокупателя;
КонецФункции

#КонецОбласти

#Область ЛокальныеСлужебныеПроцедурыИФункции

// #IBS 05.05.2023 В карте товаров - всё принятое, в карте брака - только брак
// Карта товаров: ключ = UID товара + UID серии + UID характеристики, значение = количество в ед.хранения
Процедура ПолучитьКоличестваТоваровСБраком(ERPData, КодЗоны, КодЗоныБрака, КартаТоваров, КартаБрака)
	
	//	Использование серий в интеграции
	ИспользоватьСерии = Константы.EmeWmsИспользоватьСерии.Получить();	

	КлючиТоваров = Новый Соответствие();
	НомераСерий = Новый Соответствие;        
	СерийныеНомера = Новый Соответствие;
	НомераХарактеристик = Новый Соответствие;
	
	// Заполнить карту серийных номеров товара (строка номеров по номеру строки)
	EmeWmsERPEngine.SelectChild(ERPData, "numbers");
	Пока EmeWmsERPEngine.NextChildLine(ERPData) Цикл 
		// Номер серии: WMS "-" = 1С "Неизвестная серия"	
		СерийныйНомер = ?(ERPData.numbers.serial_no <> "-", ERPData.numbers.serial_no, "Неизвестная серия");
		
		КлючСтроки = ERPData.numbers.receipt_line_id;
		СтрокаНомеров = СерийныеНомера.Получить(КлючСтроки);
		СерийныеНомера.Вставить(КлючСтроки, ?(СтрокаНомеров = неопределено, СерийныйНомер, СтрокаНомеров + "," + СерийныйНомер));
	КонецЦикла;	

	// Весь товар в сообщении
	EmeWmsERPEngine.SelectChild(ERPData, "lines");
	Пока EmeWmsERPEngine.NextChildLine(ERPData) Цикл
		//	Проверим товар
		УИДТовара = ERPData.lines.goods_id;
		УИДЕдиницы = ERPData.lines.pack_id;
		Если УИДТовара = "" Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "GDSNUL");
			Продолжить
		КонецЕсли;
		
		ТоварСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаТовар(УИДТовара);
		Если ТоварСсылка.Пустая() Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "GDSBAD");
			Продолжить
		КонецЕсли;
		
		ЕдиницаИзмерения = EmeWmsУтилиты.ПолучитьСсылкуНаЕдиницуИзмерения(УИДЕдиницы);
		Если ЕдиницаИзмерения.Пустая() Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "PCKBAD");
			Продолжить
		КонецЕсли;
		
		РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТоварСсылка, "ВестиУчетПоСериям, ВестиУчетПоХарактеристикам"); 

		Если Не ИспользоватьСерии Тогда
			РеквизитыНоменклатуры.ВестиУчетПоСериям = Ложь;
		КонецЕсли;

		СерияНоменклатуры 		   	= Неопределено;
		ХарактеристикаНоменклатуры 	= Неопределено;
		
		Если РеквизитыНоменклатуры.ВестиУчетПоСериям Тогда   
			СерияНоменклатуры = EmeWmsУтилиты.ПолучитьСериюПоНаименованию(ERPData.lines.lot_no, ТоварСсылка);
		ИначеЕсли РеквизитыНоменклатуры.ВестиУчетПоХарактеристикам Тогда
			ХарактеристикаНоменклатуры = EmeWmsУтилиты.ПолучитьХарактеристикуПоНаименованию(ERPData.lines.lot_no, ТоварСсылка);
		КонецЕсли;
		
		// Номера серий по строкам
		НомераСерий.Вставить(ERPData.lines.id, СерияНоменклатуры);
		НомераХарактеристик.Вставить(ERPData.lines.id, ХарактеристикаНоменклатуры);
		
		КлючиТоваров.Вставить(ERPData.lines.id, ТоварСсылка);
		КодЗоны = ERPData.lines.zone_to_code;
		КлючТовара = EmeWmsУтилиты.СоздатьКлючТовара(ТоварСсылка, СерияНоменклатуры, ХарактеристикаНоменклатуры);
		КоличествоВБазовой = EmeWmsУтилиты.ПересчетВДругуюЕдиницу(ERPData.lines.receipt_qty, ЕдиницаИзмерения, ТоварСсылка.БазоваяЕдиницаИзмерения);
		КоличествоПоКарте = ?(КартаТоваров.Получить(КлючТовара) = неопределено, 0.0, КартаТоваров.Получить(КлючТовара));
		
		КартаТоваров.Вставить(КлючТовара, КоличествоПоКарте + КоличествоВБазовой);
		Если ERPData.lines.stock_status = "B" Тогда // Добавим количество в карту брака
			КодЗоныБрака = ERPData.lines.zone_to_code;
			КоличествоПоКарте = ?(КартаБрака.Получить(КлючТовара) = неопределено, 0.0, КартаБрака.Получить(КлючТовара));
			КартаБрака.Вставить(КлючТовара, КоличествоПоКарте + КоличествоВБазовой);
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(КодЗоныБрака) ИЛИ КодЗоны = КодЗоныБрака Тогда
		КодЗоныБрака = "BRAK"; // По умолчанию, если в строках не заполнено
	КонецЕсли;
	
КонецПроцедуры

// Функция создает документ перемещения на склад брака по карте товаров брака, возвращает ссылку на документ перемещения
Функция СоздатьИзменитьДокументПеремещенияНаСкладБрака(ERPData, ИдЕМЕ, НомерЕМЕ, Распоряжение, КартаБрака, СкладБрака)
	Перем Документ, ТаблицаРазличий;
	
	ДокументСсылка = НайтиДокументПеремещенияТоваров(ИдЕМЕ);
	Если ДокументСсылка.Пустая() Тогда
		Документ = Документы.ПеремещениеТоваров.СоздатьДокумент();
		Документ.Заполнить(Распоряжение);
		Документ.Дата = ТекущаяДата();
		Документ.Организация = Распоряжение.Организация;
		Документ.СкладОтправитель = Распоряжение.СкладОрдер;
		Документ.СкладПолучатель =  СкладБрака;
		Документ.ОтражатьВБухгалтерскомУчете = Истина;
		Документ.ОтражатьВУправленческомУчете = Истина;
		Документ.ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.ТоварыПродукция;
		
		Документ.Комментарий = "Создан на основании документа возврата EME: " +
			НомерЕМЕ + " (" + ИдЕМЕ + ")" + " (" + ERPData.header.comment + ")";
	Иначе
		Документ = ДокументСсылка.ПолучитьОбъект();
		Документ.Комментарий = "Изменен на основании документа возврата EME: " +
			НомерЕМЕ + " (" + ИдЕМЕ + ")" + " (" + ERPData.header.comment + ")";
	КонецЕсли;
		
	EmeWmsУтилиты.СкорректироватьТЧДокумента(Документ.Товары, КартаБрака, Истина);		
	ПересчитатьУпаковкиДокумента(Документ);
	// EmeWmsДрайвер.ЗаполнитьСтатусыУказанияСерий(Документ, Документы.ПеремещениеТоваров);

	Документ.Записать(РежимЗаписиДокумента.Запись);
	СоздатьОтметкуОбИмпортеПеремещенияТоваров(Документ, ИдЕМЕ);

	EmeWmsПроведениеДокументов.ПометитьДокументКПроведению(Документ.Ссылка, 1);
	
	Возврат Документ.Ссылка;
КонецФункции

// Пересчитывает количества упаковок товара в ТЧ Товары
Процедура ПересчитатьУпаковкиДокумента(Документ)
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоУпаковок");
	Для Каждого СтрокаТовара Из Документ.Товары Цикл
		СтрокаТовара.Коэффициент = СтрокаТовара.ЕдиницаИзмерения.Коэффициент;
		ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТовара, Документ);
	КонецЦикла;
КонецПроцедуры    


// Создает в регистре пометку об импорте документа Возврат товаров от покупателя с идентификаторов документа EME
Процедура СоздатьОтметкуОбИмпортеВозвратаТоваровОтПокупателя(Документ, ИдEME)
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеВозвратовТоваровОтПокупателя.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.ДатаИмпорта = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsОтметкиОбИмпортеВозвратовТоваровОтПокупателя.СоздатьМенеджерЗаписи();
	НоваяЗапись.ID = ИдEME;
	НоваяЗапись.Ссылка = Документ.Ссылка;
	НоваяЗапись.ДатаИмпорта = ТекущаяДата();
    НоваяЗапись.Записать(); 
КонецПроцедуры

// Создает в регистре отметку об импорте Перемещения товаров с ID прихода EME
Процедура СоздатьОтметкуОбИмпортеПеремещенияТоваров(Документ, ИдЕМЕ)
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеПеремещенийТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.ДатаИмпорта = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsОтметкиОбИмпортеПеремещенийТоваров.СоздатьМенеджерЗаписи();
	НоваяЗапись.ID = ИдЕМЕ;
	НоваяЗапись.Ссылка = Документ.Ссылка;
	НоваяЗапись.ДатаИмпорта = ТекущаяДата();
    НоваяЗапись.Записать(); 
КонецПроцедуры

// Функция возвращает ссылку на документ Перемещение товаров по ИД EME
Функция НайтиДокументПеремещенияТоваров(ИдЕМЕ)
	Перем Запрос, док1;
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Перемещение.Ссылка КАК Ссылка
		|ИЗ
		|	
		|РегистрСведений.EmeWmsОтметкиОбИмпортеПеремещенийТоваров КАК Перемещение
		|ГДЕ
		|	Перемещение.ID = &ИдЕМЕ";
	Запрос.УстановитьПараметр("ИдЕМЕ", ИдЕМЕ);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		док1 = Выборка.Ссылка.ПолучитьОбъект();
		Если НЕ док1.ПометкаУдаления Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Документы.ПеремещениеТоваров.ПустаяСсылка();

КонецФункции

#КонецОбласти
