
// #Область СлужебныйПрограммныйИнтерфейс

// См. ВзаимодействиеКонтурМаркировкаКлиент.МодульКонтурМаркировкаКлиент()
// 
// Параметры:
//  ПутьКФормеМодуляКлиента - Строка - полный путь к форме модуля;
//  ИдентификаторСеанса - Строка - идентификатор, с которым связана обработка для повторного использования;
// 
// Возвращаемое значение:
//  ОбработкаОбъект, ВнешняяОбработка - объект модуля маркировки;
//
Функция МодульКонтурМаркировкаКлиент(ПутьКФормеМодуляКлиента, ИдентификаторСеанса) Экспорт
	
	Возврат ОткрытьФорму(ПутьКФормеМодуляКлиента);
	
КонецФункции

// #КонецОбласти // СлужебныйПрограммныйИнтерфейс
