
// #Область СлужебныеПеременныеИМетодыФормы

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		Результат = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		Результат = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

// #КонецОбласти

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Ссылка = Параметры.Ссылка;
	
	Если Не ЗначениеЗаполнено(Параметры.Ссылка) Тогда
		ВызватьИсключение НСтр("ru = 'Новые склады подгружаются из сервиса автоматически'");
	КонецЕсли;
	
	ЗаполнитьКонтекст();
	УстановитьЗаголовок();
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	МодульКлиента().СохранитьИзмененияНаФорме("ЗаписатьИЗакрыть", ЭтаФорма, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПлощадкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Обработчик = МодульКлиента().ОписаниеОбработчикаОповещения("ПлощадкаПослеВыбора", ЭтаФорма);
	МодульКлиента().ОткрытьФормуВыбораПлощадки(Обработчик, Площадка, Организация, Неопределено, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПлощадкаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(Площадка) Тогда
		Возврат;
	КонецЕсли;
	
	МодульКлиента().ОткрытьФормуПлощадки(Площадка, ЭтаФорма);
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	Если Не МодульКлиента().ПроверитьУстановленнуюВерсиюМодуля() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьЗаполнениеПолей() Тогда
		Возврат;
	КонецЕсли;
	
	Записать();
	
	ПровестиОпросПользователяИЗакрыть();
	
КонецПроцедуры

// #КонецОбласти

// #Область ПроверкаЗаполнения

&НаКлиенте
Функция ПроверитьЗаполнениеПолей()
	
	ОчиститьСообщения();
	
	Возврат ПроверитьЗаполнениеПолейНаСервере();
	
КонецФункции

&НаСервере
Функция ПроверитьЗаполнениеПолейНаСервере()
	
	ЕстьОшибки = Ложь;
	
	ПроверитьЗаполнениеСклада1С(ЕстьОшибки);
	
	Возврат Не ЕстьОшибки;
	
КонецФункции

&НаСервере
Процедура ПроверитьЗаполнениеСклада1С(ЕстьОшибки)
	
	Если Не ЗначениеЗаполнено(Склад1С) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Т.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурМаркировка_Склады КАК Т
	|ГДЕ
	|	Т.Ссылка <> &Ссылка
	|	И Т.Организация = &Организация
	|	И Т.КлючСклада1С = &КлючСклада1С
	|	И Т.ТипКлючаСклада1С = &ТипКлючаСклада1С");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("КлючСклада1С", МодульОбъекта().КлючОбъекта1С(Склад1С));
	Запрос.УстановитьПараметр("ТипКлючаСклада1С", МодульОбъекта().ТипКлючаОбъекта1С(Склад1С));
	
	ДругойСклад = МодульОбъекта().ПолучитьРезультатЗапроса(Запрос);
	
	Если ЗначениеЗаполнено(ДругойСклад) Тогда
		ТекстСообщения = НСтр("ru = 'Склад 1С ""%2"" уже использован в ""%3""'");
		ТекстСообщения = МодульОбъекта().ПараметрыВСтроку(ТекстСообщения, Организация, Склад1С, ДругойСклад);
		МодульОбъекта().СообщитьПользователюЛок(ТекстСообщения, УникальныйИдентификатор, "Склад1С");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область ОпросыПользователей

&НаКлиенте
Процедура ПровестиОпросПользователяИЗакрыть()
	
	КлючиСценариев = МодульКлиента().Перечисление_КлючиСценариевДляОпросов();
	ОписаниеОпроса = МодульКлиента().ОпросПользователяПоСценарию(КлючиСценариев.Склады);
	
	Если ЗначениеЗаполнено(ОписаниеОпроса) Тогда
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПослеОпросаПользователя", ЭтаФорма);
		МодульКлиента().ОткрытьФормуОпросаПользователя(ОписаниеОпроса, ЭтаФорма, ОписаниеОбработчика);
		Возврат;
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОпросаПользователя(РезультатВыбора, ДопПараметры = Неопределено) Экспорт
	
	Закрыть();
	
КонецПроцедуры

// #КонецОбласти // ОпросыПользователей

// #Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Записать()
	
	ЗаписатьНаСервере();
	
	Оповестить("КонтурМаркировка_Склад_Изменен", Ссылка);
	
	ОповеститьОбИзменении(Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	ОписаниеСклада = МодульОбъекта().Новый_Склад();
	ЗаполнитьЗначенияСвойств(ОписаниеСклада, ЭтаФорма);
	
	МодульОбъекта().Склад_Записать(ОписаниеСклада);
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтекст()
	
	ОписаниеСклада = МодульОбъекта().Склад_Прочитать(Ссылка);
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ОписаниеСклада);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовок()
	
	Заголовок = МодульОбъекта().ПараметрыВСтроку(
	НСтр("ru = 'Склад: %1'"), СокрЛП(Ссылка));
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы()
	
	ТипыОбъектов = МодульОбъекта().ТипыОбъектовИС();
	
	МодульОбъекта().УстановитьОграничениеПоТипу(Элементы.Склад1С, ТипыОбъектов.Склад);
	
КонецПроцедуры

&НаКлиенте
Процедура ПлощадкаПослеВыбора(РезультатВыбора, ДопПараметр = Неопределено) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Площадка = РезультатВыбора;
	
КонецПроцедуры

// #КонецОбласти // СлужебныеПроцедурыИФункции
