
// #Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Наименование");
	Поля.Добавить("ИНН");
	Поля.Добавить("КПП");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Данные.Наименование) Тогда
		
		Представление = Данные.Наименование;
		
	Иначе
		
		Представление = "";
		Если ЗначениеЗаполнено(Данные.ИНН) Тогда
			Представление = Данные.ИНН;
		КонецЕсли;
		Если ЗначениеЗаполнено(Данные.КПП) Тогда
			Представление = Представление + " / " + Данные.КПП;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

