
// #Область СведенияОВнешнейОбработке

// Версия обработки в стандартном формате
//
// Возвращаемое значение:
//  Строка - версия в формате РР.ВВ.ФФ.СС, где:
//   * РР - номер редакции    - в рамках одной редакции гарантируется обратная совместимость;
//   * ВВ - номер версии      - новая функциональность (или несколько);
//   * ФФ - номер исправления - исправление ошибки;
Функция ВерсияОбработки() Экспорт
	
	Возврат "3.15.0";
	
КонецФункции

// Сведения о внешней обработке совместимые со стандартной подсистемой ДополнительныеОтчетыИОбработки
//
// Возвращаемое значение:
//  Структура - содержит свойства:
//   * Версия          - Строка - версия обработки;
//   * Наименование    - Строка - представление для администратора (наименование элемента справочника),
//                                берется синоним объекта метаданных внешней обработки;
//   * Информация      - Строка - краткая информация о внешней обработке,
//                                берется комментарий объекта метаданных внешней обработки;
//   * БезопасныйРежим - Булево - признак подключения внешней обработки в безопасном режиме:
//                                 Игнорируется привилегированный режим
//                                 Запрещены внешние по отношению к платформе «1С:Предприятия» действия:
//                                  COM;
//                                  загрузка внешних компонент;
//                                  запуск внешних приложений и команд операционной системы;
//                                  доступ к файловой системе, кроме временных файлов;
//                                  доступ к Интернету.
//   * Вид             - Строка - содержит значение "ДополнительнаяОбработка";
//   * Команды         - ТаблицаЗначений - настройки команд, поставляемых внешней обработкой:
//      ** Идентификатор        - Строка- внутреннее имя команды;
//      ** Представление        - Строка- пользовательское представление команды;
//      ** Использование        - Строка- тип команды:
//                                         "ВызовКлиентскогоМетода",
//                                         "ВызовСерверногоМетода";
//      ** Модификатор          - Строка- дополнительная классификация команды;
//      ** ПоказыватьОповещение - Булево- если Истина, то при запуске команды выводится оповещение "Команда выполняется...";
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	МетаданныеОбработки = Метаданные();
	
	Результат = Новый Структура;
	Результат.Вставить("БезопасныйРежим", Ложь);
	Результат.Вставить("Наименование", МетаданныеОбработки.Синоним);
	Результат.Вставить("Информация", МетаданныеОбработки.Комментарий);
	Результат.Вставить("Команды", КомандыВнешнейОбработки());
	Результат.Вставить("Версия", ВерсияОбработки());
	Результат.Вставить("Вид", "ДополнительнаяОбработка");
	Результат.Вставить("ВерсияБСП", "1.2.1.4");
	
	Возврат Результат;
	
КонецФункции

Функция КомандыВнешнейОбработки()
	
	МетаданныеОбработки = Метаданные();
	ТипСтрока = Новый ОписаниеТипов("Строка");
	ТипБулево = Новый ОписаниеТипов("Булево");
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Представление", ТипСтрока);
	Результат.Колонки.Добавить("Идентификатор", ТипСтрока);
	Результат.Колонки.Добавить("Использование", ТипСтрока);
	Результат.Колонки.Добавить("Модификатор", ТипСтрока);
	Результат.Колонки.Добавить("ПоказыватьОповещение", ТипБулево);
	Результат.Колонки.Добавить("Скрыть", ТипБулево);
	
	Команды = Перечисление_КомандыОбработки();
	ПредставленияКоманд = Перечисление_ПредставленияКомандОбработки();
	ВариантыИспользования = Перечисление_ВариантыИспользованияКоманд();
	
	Если МетаданныеОбработки.Синоним = "Контур.Маркировка" Тогда
		Стр = Результат.Добавить();
		Стр.Идентификатор = Команды.ОткрытьФорму;
		Стр.Представление = МетаданныеОбработки.Синоним;
		Стр.Использование = ВариантыИспользования.ОткрытиеФормы;
	КонецЕсли;
	
	Стр = Результат.Добавить();
	Стр.Идентификатор = Команды.ВыполнитьРегламентныеДействия;
	Стр.Представление = ПредставленияКоманд.ВыполнитьРегламентныеДействия;
	Стр.Использование = ВариантыИспользования.ВызовСерверногоМетода;
	Стр.ПоказыватьОповещение = Истина;
	
	Стр = Результат.Добавить();
	Стр.Идентификатор = Команды.ОбменССервисом;
	Стр.Представление = ПредставленияКоманд.ОбменССервисом;
	Стр.Использование = ВариантыИспользования.ВызовСерверногоМетода;
	Стр.ПоказыватьОповещение = Истина;
	
	Стр = Результат.Добавить();
	Стр.Идентификатор = Команды.ОбновлениеМодуля;
	Стр.Представление = ПредставленияКоманд.ОбновлениеМодуля;
	Стр.Использование = ВариантыИспользования.ВызовСерверногоМетода;
	Стр.ПоказыватьОповещение = Истина;
	
	Стр = Результат.Добавить();
	Стр.Идентификатор = Команды.ОчисткаУстаревшихДанных;
	Стр.Представление = ПредставленияКоманд.ОчисткаУстаревшихДанных;
	Стр.Использование = ВариантыИспользования.ВызовСерверногоМетода;
	Стр.ПоказыватьОповещение = Истина;
	
	Стр = Результат.Добавить();
	Стр.Идентификатор = Команды.ОбновитьДанныеПодсистемы;
	Стр.Представление = ПредставленияКоманд.ОбновитьДанныеПодсистемы;
	Стр.Использование = ВариантыИспользования.ВызовСерверногоМетода;
	Стр.ПоказыватьОповещение = Ложь;
	Стр.Скрыть = Истина;
	
	Стр = Результат.Добавить();
	Стр.Идентификатор = Команды.ОбновитьСтатусыКодовДокумента;
	Стр.Представление = ПредставленияКоманд.ОбновитьСтатусыКодовДокумента;
	Стр.Использование = ВариантыИспользования.ВызовСерверногоМетода;
	Стр.ПоказыватьОповещение = Ложь;
	Стр.Скрыть = Истина;
	
	Стр = Результат.Добавить();
	Стр.Идентификатор = Команды.ОбновлениеПлагинов;
	Стр.Представление = ПредставленияКоманд.ОбновлениеПлагинов;
	Стр.Использование = ВариантыИспользования.ВызовСерверногоМетода;
	Стр.ПоказыватьОповещение = Истина;
	Стр.Скрыть = Истина;
	
	Стр = Результат.Добавить();
	Стр.Идентификатор = Команды.ПроверитьКодыДокумента;
	Стр.Представление = ПредставленияКоманд.ПроверитьКодыДокумента;
	Стр.Использование = ВариантыИспользования.ВызовСерверногоМетода;
	Стр.ПоказыватьОповещение = Ложь;
	Стр.Скрыть = Истина;
	
	Возврат Результат;
	
КонецФункции

Функция Перечисление_КомандыОбработки() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ОткрытьФорму"					, "ОткрытьФорму");
	Результат.Вставить("ВыполнитьРегламентныеДействия"	, "ВыполнитьРегламентныеДействия");
	Результат.Вставить("ОбменССервисом"					, "ОбменССервисом");
	Результат.Вставить("ОбновлениеМодуля"				, "ОбновлениеМодуля");
	Результат.Вставить("ОчисткаУстаревшихДанных"		, "ОчисткаУстаревшихДанных");
	Результат.Вставить("ОбновлениеПлагинов"				, "ОбновлениеПлагинов");
	// Служебные команды
	Результат.Вставить("ОбновитьДанныеПодсистемы"		, "ОбновитьДанныеПодсистемы");
	Результат.Вставить("ОбновитьСтатусыКодовДокумента"	, "ОбновитьСтатусыКодовДокумента");
	Результат.Вставить("ПроверитьКодыДокумента"			, "ПроверитьКодыДокумента");
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

Функция Перечисление_ВариантыИспользованияКоманд()
	
	Результат = Новый Структура;
	Результат.Вставить("ОткрытиеФормы", "ОткрытиеФормы");
	Результат.Вставить("ВызовСерверногоМетода", "ВызовСерверногоМетода");
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

Функция Перечисление_ПредставленияКомандОбработки()
	
	Команды = Перечисление_КомандыОбработки();
	
	Результат = Новый Структура;
	Результат.Вставить(Команды.ВыполнитьРегламентныеДействия, НСтр("ru = 'Регламентные действия'"));
	Результат.Вставить(Команды.ОбменССервисом				, НСтр("ru = 'Обмен с сервисом'"));
	Результат.Вставить(Команды.ОбновлениеМодуля				, НСтр("ru = 'Обновление модуля'"));
	Результат.Вставить(Команды.ОчисткаУстаревшихДанных		, НСтр("ru = 'Очистка устаревших данных'"));
	Результат.Вставить(Команды.ОбновлениеПлагинов			, НСтр("ru = 'Обновление плагинов'"));
	// Служебные команды
	Результат.Вставить(Команды.ОбновитьДанныеПодсистемы		, НСтр("ru = 'Обновить данные подсистемы (служебная)'"));
	Результат.Вставить(Команды.ОбновитьСтатусыКодовДокумента, НСтр("ru = 'Обновить статусы кодов документа (служебная)'"));
	Результат.Вставить(Команды.ПроверитьКодыДокумента		, НСтр("ru = 'Проверить коды документа (служебная)'"));
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

// #КонецОбласти

// #Область ПрограммныйИнтерфейс

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыКоманды) Экспорт
	
	Если ИдентификаторКоманды = Перечисление_КомандыОбработки().ВыполнитьРегламентныеДействия Тогда
		ВзаимодействиеКонтурМаркировка.ВыполнитьРегламентныеДействия(ПараметрыКоманды);
	Иначе
		ВзаимодействиеКонтурМаркировка.ВыполнитьЗадание(ПараметрыКоманды);
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти
