
// #Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка
		Или Не ЗначениеЗаполнено(ЭтотОбъект)
		Или ДополнительныеСвойства.Свойство("ОтключитьЗаполнениеКлюча") Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьКлючи();
	НайтиСуществующиеКлючи();
	СоздатьНовыеКлючи();
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

Процедура ОчиститьКлючи()
	
	Для каждого Запись Из ЭтотОбъект Цикл
		Запись.КлючНоменклатуры1С = Неопределено;
	КонецЦикла;
	
КонецПроцедуры

Процедура НайтиСуществующиеКлючи()
	
	// BSLLS:CreateQueryInCycle-off
	Для каждого Запись Из ЭтотОбъект Цикл
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Т.КлючНоменклатуры1С КАК КлючНоменклатуры1С
		|ИЗ
		|	РегистрСведений.КонтурМаркировка_КлючиАналитикиНоменклатуры1С КАК Т
		|ГДЕ
		|	Т.КлючНоменклатуры = &КлючНоменклатуры
		|	И Т.КлючХарактеристики = &КлючХарактеристики
		|	И Т.КлючУпаковки = &КлючУпаковки
		|	И Т.КлючСерии = &КлючСерии");
		Запрос.УстановитьПараметр("КлючНоменклатуры", Запись.КлючНоменклатуры);
		Запрос.УстановитьПараметр("КлючХарактеристики", Запись.КлючХарактеристики);
		Запрос.УстановитьПараметр("КлючУпаковки", Запись.КлючУпаковки);
		Запрос.УстановитьПараметр("КлючСерии", Запись.КлючСерии);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Запись.КлючНоменклатуры1С = Выборка.КлючНоменклатуры1С;
		КонецЕсли;
		
	КонецЦикла;
	// BSLLS:CreateQueryInCycle-on
	
КонецПроцедуры

Процедура СоздатьНовыеКлючи()
	
	Для каждого Запись Из ЭтотОбъект Цикл
		
		Если ЗначениеЗаполнено(Запись.КлючНоменклатуры1С) Тогда
			Продолжить;
		КонецЕсли;
		
		ОбъектКлюча = Справочники.КонтурМаркировка_КлючиНоменклатуры1С.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(ОбъектКлюча, Запись);
		ОбъектКлюча.ДополнительныеСвойства.Вставить("ОтключитьЗаписьАналитики");
		ОбъектКлюча.Записать();
		
		Запись.КлючНоменклатуры1С = ОбъектКлюча.Ссылка;
		
	КонецЦикла;
	
КонецПроцедуры

// #КонецОбласти