
// #Область СлужебныеПеременныеМетодыФормы

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		Результат = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		Результат = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Результат = ВладелецФормы;
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти


// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийОтбор = Параметры.ТекущийОтборСпискаДокументов;
	АдресСхемыСКД = Параметры.АдресСхемыСКД;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыСКД));
	
	ВосстановитьНастройкуОтбораСКД();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОтборыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.ГруппаСохраненные Тогда
		ЗаполнитьСписокСохраненныхОтборов();
	КонецЕсли
	
КонецПроцедуры

// #КонецОбласти


// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Применить(Команда)
	
	Если Модифицированность Тогда
		ТекущийОтбор = Перечисление_СлужебныеОтборы().ОтборБезНазвания;
		СохранитьОтбор(ТекущийОтбор);
	КонецЕсли;
	
	Закрыть(ТекущийОтбор);
	
	МодульКлиента().Метрика_Функциональность_ПримененыОтборыСпискаДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьОтборНажатие(Элемент)
	
	КоличествоАктивныхЭлементовОтбора = КоличествоАктивныхЭлементовОтбора();
	
	Если КоличествоАктивныхЭлементовОтбора = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОбработчикОповещения = МодульКлиента().ОписаниеОбработчикаОповещения("ОбработчикСохраненияОтбора", ЭтаФорма);
	
	ТекСтрока = "";
	СлужебныеОтборы = Перечисление_СлужебныеОтборы();
	
	Если ТекущийОтбор <> СлужебныеОтборы.ОтборБезНазвания Тогда
		ТекСтрока = ТекущийОтбор;
	КонецЕсли;
	
	МодульКлиента().ПоказатьДиалогВводаСтроки(ОбработчикОповещения, ТекСтрока, НСтр("ru = 'Введите имя для отбора'"));
	
КонецПроцедуры

&НаСервере
Функция Перечисление_СлужебныеОтборы()
	
	Возврат МодульОбъекта().Перечисление_СлужебныеОтборы();
	
КонецФункции

&НаКлиенте
Процедура УдалитьВыделенные(Команда)
	
	УдалитьОтбор();
	
КонецПроцедуры

&НаКлиенте
Процедура СохраненныеОтборыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.СохраненныеОтборы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийОтбор = ТекущиеДанные.Значение;
	
	ВосстановитьНастройкуОтбораСКД();
	
	Закрыть(ТекущийОтбор);
	
КонецПроцедуры


// #КонецОбласти


// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокСохраненныхОтборов()
	
	СписокСохраненныхОтборов = МодульОбъекта().СписокСохраненныхОтборовБезСлужебных();
	
	СохраненныеОтборы.Очистить();
	
	Для Каждого Элемент Из СписокСохраненныхОтборов Цикл
		НовыйОтбор = СохраненныеОтборы.Добавить();
		НовыйОтбор.Значение = Элемент;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция КоличествоАктивныхЭлементовОтбора()
	
	Результат = 0;
	
	Для Каждого Элемент Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		
		Если Элемент.Использование = Истина Тогда
			
			Результат = Результат + 1;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработчикСохраненияОтбора(Значение, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Значение) Тогда
		Возврат;
	КонецЕсли;
	
	НаименованиеНовогоОтбора = Значение;
	КоличествоСохраненныхОтборов = КоличествоСохраненныхОтборов();
	
	Если КоличествоСохраненныхОтборов <= МаксимальноеКоличествоСохраненныхОтборов() Тогда
		
		СохранитьОтбор(НаименованиеНовогоОтбора);
		
		МодульКлиента().Метрика_Функциональность_СохраненыПользовательскиеОтборыСпискаДокументов();
		
	Иначе
		
		ТекстОшибки = МодульКлиента().ПараметрыВстроку(НСтр("ru = 'Вы уже сохранили максимальное количество - %1 отборов'"),
														МаксимальноеКоличествоСохраненныхОтборов());
		Заголовок 	= НСтр("ru = 'Нельзя сохранить отбор'");
		
		МодульКлиента().ПоказатьДиалогПредупреждения(ТекстОшибки, Заголовок);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция КоличествоСохраненныхОтборов()
	
	СписокОтборов = МодульОбъекта().СписокСохраненныхОтборовБезСлужебных();
	Возврат СписокОтборов.Количество();
	
КонецФункции

&НаСервере
Функция МаксимальноеКоличествоСохраненныхОтборов()
	
	Возврат МодульОбъекта().МаксимальноеКоличествоСохраненныхОтборов();
	
КонецФункции

&НаСервере
Процедура СохранитьОтбор(НаименованиеНовогоОтбора)
	
	МодульОбъекта().СохранитьОтборСпискаДокументов(НаименованиеНовогоОтбора, КомпоновщикНастроек);
	ТекущийОтбор = НаименованиеНовогоОтбора;
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьОтбор()
	
	ИмяПользователя1С = ИмяПользователя();
	
	Для каждого Идентификатор Из Элементы.СохраненныеОтборы.ВыделенныеСтроки Цикл
		
		УдаляемыйОтбор = СохраненныеОтборы.НайтиПоИдентификатору(Идентификатор).Значение;
		
		Если ТекущийОтбор = УдаляемыйОтбор Тогда
			ТекущийОтбор = "";
			ВосстановитьНастройкуОтбораСКД();
			МодульОбъекта().СохранитьДействующийОтборСпискаДокументов(ТекущийОтбор);
		КонецЕсли;
		ХранилищеНастроекДанныхФорм.Удалить(КлючНастроекСКД(), УдаляемыйОтбор, ИмяПользователя1С);
		
	КонецЦикла;
	
	ЗаполнитьСписокСохраненныхОтборов();
	
КонецПроцедуры

&НаСервере 
Функция КлючНастроекСКД()
	
	Возврат МодульОбъекта().СписокДокументов_КлючНастроекСКД();
	
КонецФункции

&НаСервере 
Процедура ВосстановитьНастройкуОтбораСКД()
	
	Если ЗначениеЗаполнено(ТекущийОтбор) Тогда
		МодульОбъекта().ВосстановитьНастройкуОтбораСКД(ТекущийОтбор, КомпоновщикНастроек)
	Иначе
		СхемаСКД = ПолучитьИзВременногоХранилища(АдресСхемыСКД);
		КомпоновщикНастроек.ЗагрузитьНастройки(СхемаСКД.НастройкиПоУмолчанию);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

// #КонецОбласти
