
// #Область СлужебныеПеременныеИМетодыФормы

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		Результат = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		Результат = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

// #КонецОбласти

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТипЭтикетки") Тогда
		Список_ДобавитьОтбор("ТипЭтикетки", Параметры.ТипЭтикетки)
	КонецЕсли;
	
	Если Параметры.Свойство("РежимВыбора") Тогда
		Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	КонецЕсли;
	
	Если Параметры.Свойство("ТекущийШаблон") Тогда
		Элементы.Список.ТекущаяСтрока = Параметры.ТекущийШаблон;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурМаркировка_ШаблонЭтикетки_Изменен" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.РежимВыбора Тогда
		ОповеститьОВыборе(ВыбраннаяСтрока);
	Иначе
		МодульКлиента().ОткрытьФормуШаблонаЭтикетки(ВыбраннаяСтрока, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОповеститьОВыборе(Элемент.ТекущиеДанные.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ТекущаяСтрока = Элемент.ТекущаяСтрока;
	
	Если Копирование Тогда
		МодульКлиента().ОткрытьФормуШаблонаЭтикетки(ТекущаяСтрока, ЭтаФорма, Копирование);
	Иначе
		МодульКлиента().ОткрытьФормуШаблонаЭтикетки(Неопределено, ЭтаФорма, Копирование);
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекущаяСтрока = Элемент.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МодульКлиента().ОткрытьФормуШаблонаЭтикетки(ТекущаяСтрока, ЭтаФорма);
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьИзПримераТоварнуюЭтикетку(Команда)
	
	МодульКлиента().ОткрытьФормуШаблонаЭтикетки(ИмяМакетаТоварнойЭтикетки(), ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзПримераТранспортнуюЭтикетку(Команда)
	
	МодульКлиента().ОткрытьФормуШаблонаЭтикетки(ИмяМакетаТранспортнойЭтикетки(), ЭтаФорма);
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ИмяМакетаТоварнойЭтикетки()
	
	ТипЭтикетки = Перечисления.КонтурМаркировка_ТипыЭтикеток.Товарная;
	Результат = МодульОбъекта().ШаблонЭтикетки_ИмяМакетаПримера(ТипЭтикетки);
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ИмяМакетаТранспортнойЭтикетки()
	
	ТипЭтикетки = Перечисления.КонтурМаркировка_ТипыЭтикеток.Транспортная;
	Результат = МодульОбъекта().ШаблонЭтикетки_ИмяМакетаПримера(ТипЭтикетки);
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура Список_ДобавитьОтбор(ИмяПоля, Значение)
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
	ЭлементОтбора.ПравоеЗначение = Значение;
	ЭлементОтбора.Использование = Истина;
	
КонецПроцедуры

// #КонецОбласти

