// Copyright (C) 2012-2025 Engineer Mareev Enterprises
// Модуль для УТ 10.3

//	Процедура ЭкспортироватьСообщения экспортирует сообщения в транзитную базу данных
Процедура ЭкспортироватьСообщения(ERPData, ОбщийМодуль)
	
	ВыборкаСсылок = ОбщийМодуль.ПолучитьВыборкуСсылок();
	
	МассивСсылок = Новый Массив();
	
	//	#AMP Попов 10.12.2024 В режиме экспорта уникальных сообщений старые сообщения не удаляем
	ERPData.IsSkipDeleteOldMessages = Константы.EmeWmsСоздаватьУникальныеСообщения.Получить();
	
	Счетчик = 0;
	Пока ВыборкаСсылок.Следующий() Цикл
		
		//	Защита от плохих данных
		Если ВыборкаСсылок.Ссылка = Null Тогда
			Продолжить;
		КонецЕсли;
		
		МассивСсылок.Добавить(ВыборкаСсылок.Ссылка);
		Если МассивСсылок.Количество() = 256 Тогда
			ЭкспортироватьСообщенияПоМассивуСсылок(ERPData, ОбщийМодуль, МассивСсылок);
			Счетчик = Счетчик + МассивСсылок.Количество();
			МассивСсылок.Очистить();
		КонецЕсли
		
	КонецЦикла;
	
	Если МассивСсылок.Количество() <> 0 Тогда
		ЭкспортироватьСообщенияПоМассивуСсылок(ERPData, ОбщийМодуль, МассивСсылок);
		Счетчик = Счетчик + МассивСсылок.Количество();
	КонецЕсли;
	
	Если Счетчик <> 0 Тогда
		Сообщить("" + ОбщийМодуль.ПолучитьМетаданные() + ": проэкспортировали сообщения " + ОбщийМодуль.ПолучитьИмяСообщения() + " (" + Счетчик + "шт)");
	КонецЕсли;
	
КонецПроцедуры

//	Процедура ЭкспортироватьСообщенияПоМассивуСсылок экспортирует сообщения в транзитную базу данных
Процедура ЭкспортироватьСообщенияПоМассивуСсылок(ERPData, ОбщийМодуль, МассивСсылок)
	
	НачатьТранзакцию();
	Попытка    		
		
		EmeWmsERPEngine.BeginExport(ERPData, "erp", "wms", ОбщийМодуль.ПолучитьИмяСообщения());
		Попытка
			
			Для Каждого Ссылка Из МассивСсылок Цикл
				
				Если ОбщийМодуль.РазрешенКЭкспорту(Ссылка) Тогда
					//	Вначале подтверждаем экспорт,
					ОбщийМодуль.ПодтвердитьЭкспорт(Ссылка);
					//	а только потом экспортируем, чтобы не потерять флажок КЭКспорту при параллельном изменении данных.
					ОбщийМодуль.Экспортировать(ERPData, Ссылка);  				
				КонецЕсли;

			КонецЦикла;
			
			EmeWmsERPEngine.CommitExport(ERPData);
			
		Исключение
			EmeWmsERPEngine.RollbackExport(ERPData);
			ВызватьИсключение(ОписаниеОшибки());
		КонецПопытки;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		Ошибка = ОписаниеОшибки();
		Сообщить(Ошибка);
		ЗаписьЖурналаРегистрации(
			"Интеграция 1C-EME. Экспорт. " + ОбщийМодуль.ПолучитьИмяСообщения(),
			УровеньЖурналаРегистрации.Ошибка,
			ОбщийМодуль.ПолучитьМетаданные(),
			Ссылка,
			Ошибка);
		EmeWmsУтилиты.СообщитьПоПочте(
			"Критическая ошибка экспорта сообщения " + ОбщийМодуль.ПолучитьИмяСообщения(),
			"ИБ: " +  СтрокаСоединенияИнформационнойБазы() + Символы.ПС +
			"No: " + Ссылка + Символы.ПС +
			Ошибка);
	КонецПопытки;
	
КонецПроцедуры

//	Процедура Экспортировать экспортирует все сообщения, вызывается из EmeWmsРеглЗаданиеЭкспорт
Процедура EmeWmsЭкспорт() Экспорт
	Экспортировать();
	// Вставить содержимое обработчика.
КонецПроцедуры

//	Процедура Экспортировать экспортирует все сообщения в транзитную базу данных
Процедура Экспортировать() Экспорт
	Если НЕ Константы.EmeWmsОбменВключен.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	ERPData = Новый Структура;
	EmeWmsERPEngine.Create(ERPData);
	
	ERPData.ERPEngine = EmeWmsУтилиты.ПолучитьСодержимоеФайлаНастроек();
	Если ERPData.ERPEngine = Неопределено Или ERPData.ERPEngine = "" Тогда
		Возврат;
	КонецЕсли;
	
	Ошибка = EmeWmsERPEngine.Connect(ERPData);
	Если Ошибка <> "" Тогда
		Сообщить(Ошибка);
		ЗаписьЖурналаРегистрации("Интеграция 1C-EME. Экспорт", УровеньЖурналаРегистрации.Ошибка,,,"Подключение к SQL базе данных: " + Ошибка);
		Возврат;
	КонецЕсли;
	
	Попытка
		ЭкспортироватьСообщения(ERPData, EmeWmsЭкспортГруппНоменклатуры); 
		ЭкспортироватьСообщения(ERPData, EmeWmsЭкспортНоменклатуры); 
		ЭкспортироватьСообщения(ERPData, EmeWmsЭкспортКонтрагентов);            
		ЭкспортироватьСообщения(ERPData, EmeWmsЭкспортПриходныхОрдеровНаТовары);
		ЭкспортироватьСообщения(ERPData, EmeWmsЭкспортСписанийТоваров);
		ЭкспортироватьСообщения(ERPData, EmeWmsЭкспортВозвратовТоваровОтПокупателя);
		ЭкспортироватьСообщения(ERPData, EmeWmsЭкспортПеремещенийТоваровКакПрихода); 
		ЭкспортироватьСообщения(ERPData, EmeWmsЭкспортПеремещенийТоваровКакОтгрузки); 
		ЭкспортироватьСообщения(ERPData, EmeWmsЭкспортПеремещенийТоваровВнутренних); 
		ЭкспортироватьСообщения(ERPData, EmeWmsЭкспортРеализацийТоваров);
		ЭкспортироватьСообщения(ERPData, EmeWmsЭкспортЗаданийНаДоставку);
		ЭкспортироватьСообщения(ERPData, EmeWmsЭкспортПоступленийТоваровУслуг);
		ЭкспортироватьСообщения(ERPData, EmeWmsЭкспортКорректировокПоступлений);
		ЭкспортироватьСообщения(ERPData, EmeWmsЭкспортКорректировокРеализаций);

	Исключение
		Ошибка = ОписаниеОшибки();
		Сообщить(Ошибка);
		ЗаписьЖурналаРегистрации("Интеграция 1C-EME. Экспорт", УровеньЖурналаРегистрации.Ошибка,,,"Экспорт сообщений: " + Ошибка);
		EmeWmsУтилиты.СообщитьПоПочте(
			"Критическая ошибка экспорта сообщений",
			"ИБ: " + СтрокаСоединенияИнформационнойБазы() + Символы.ПС +
			Ошибка);
	КонецПопытки;
	
	EmeWmsERPEngine.Disconnect(ERPData);
КонецПроцедуры
