//	Copyright (C) 2012-2025 Engineer Mareev Enterprises
//	Модуль для УТ 10.3
//	Импортирует TRANSFER в документ Перемещение товаров c характеристиками или сериями товара 

//	$Перемещение товаров межскладское (неордерная схема)
//	Импорт сообщений TRANSFER:
//	 - Оператор EME.WMS (руч.) проверяет предварительный заказ на Перемещение, проводит и закрывает автоматически просчитанный документ Перемещения.
//	 - После закрытия документа EME.WMS (авт.) экспортирует сообщение TRANSFER.
//	 - 1C (авт.) импортирует сообщение TRANSFER, подтверждает документ "Перемещение товаров", в случае несовпадения количеств посылает менеджеру, ответственному за документ, сообщение о несовпадениях по почте, указанной в контактах менеджера (пользователя ИБ). При отсутствии такового адреса, сообщения уйдут по списку рассылки, настроенному в обработке отладки.

#Область ПрограммныйИнтерфейс

//	Функция ПолучитьИмяСообщения возвращает имя сообщения
Функция ПолучитьИмяСообщения() Экспорт
	Возврат "transfer";
КонецФункции

//	Функция ПолучитьМетаданные возвращает метаданные сообщения
Функция ПолучитьМетаданные() Экспорт
	Возврат Метаданные.Документы.ПеремещениеТоваров;
КонецФункции

//	Импорт Перемещения товаров
Процедура Импортировать(ERPData, Трассировка, ТемаСообщения) Экспорт
	
	// Перемещения импортируются только на основе предзаказа 1C (Перемещение товаров)
	Если ERPData.header.po_reg_no = "" Тогда 
		Возврат;
	КонецЕсли;
	
	// Перемещения импортируются только на основе документа 1С Перемещение товаров
	Если ERPData.header.erp_doc_type <> ПолучитьМетаданные().Имя Тогда
		Возврат;
	КонецЕсли;
	
	//	Идентификатор документа 1C
	ИдЕМЕ = ERPData.header.po_id;
	//	Номер документа WMS
	НомерЕМЕ = ERPData.header.transfer_reg_no;
	
	//	Соберем товары и количества
	КодЗоныОтправителя 	= Неопределено;
	КодЗоныПолучателя 	= Неопределено;
	КартаТоваров 	= Новый Соответствие;
	ПолучитьКоличестваТоваров(ERPData, КодЗоныОтправителя, КодЗоныПолучателя, КартаТоваров);
	
	//	Проверки
	//	Получим склад-отправитель по коду EME
	КодСклада = ERPData.header.whs_code;
	КодОрганизации = ERPData.header.vendor_code;
	
	// Эта проверка нужна только при создании нового перемещения
	//СкладСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаСкладПоКодуEME(КодСклада, КодЗоны, КодОрганизации);
	//Если СкладСсылка.Пустая() Тогда
	//	EmeWmsERPEngine.ErrorHeader(ERPData, "WHSBAD");
	//	Возврат;
	//КонецЕсли;
	
	//	Ссылка на документ-основание (Перемещение товаров)
	ПеремещениеСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаПеремещениеТоваров(ИдЕМЕ);	
	
	Если ПеремещениеСсылка.Пустая() Тогда  // Создать новый документ
		EmeWmsERPEngine.ErrorHeader(ERPData, "TRNBAD"); // Ошибка отсутствия документа
		Возврат;
	КонецЕсли;
	
	//	Если были ошибки
	Если EmeWmsERPEngine.HasErrors(ERPData) Тогда
		Возврат;
	КонецЕсли;
	
	//*** Проверки сделали, пишем в базу данных 1C ***
	Перемещение = ПеремещениеСсылка.ПолучитьОбъект(); // Обработать исходный документ  
	
	Если Перемещение.ПометкаУдаления Тогда
		EmeWmsERPEngine.WarningHeader(ERPData, "NOTPST");
		СоздатьОтметкуОбИмпорте(Перемещение.Ссылка, ИдЕМЕ);
		Возврат;
	КонецЕсли;
	
	//	Для контроля соответствия количеств товаров после прихода в WMS
	КартаТоваровДокумента = EmeWmsУтилиты.ПолучитьКартуТоваровДокумента(Перемещение);
	
	//	Валюта регламентированного учета
	мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	//	Коррекция табличной части товара по фактическому приходу
	Если НЕ EmeWmsУтилиты.ПроверитьТоварыНаСоответствие(Перемещение, КартаТоваров) Тогда
		EmeWmsУтилиты.СкорректироватьТЧДокумента(Перемещение.Товары, КартаТоваров, Истина);

		//	Пересчет реквизитов ТЧ товары
		Для Каждого СтрокаТовара Из Перемещение.Товары Цикл
			//	Пересчитываем только строки добавленные при Импорте
			Если ЗначениеЗаполнено(СтрокаТовара.Качество) Тогда
				Продолжить;
			КонецЕсли;
			
			//	Выполнить общие действия для всех документов при изменении номенклатуры.
			ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(СтрокаТовара, Перемещение);			
			
			УстановитьЦенуНоменклатуры(Перемещение, СтрокаТовара, мВалютаРегламентированногоУчета);

			СтрокаТовара.Качество = Справочники.Качество.Новый;
		КонецЦикла;

		ПересчитатьУпаковкиДокумента(Перемещение);
		
		Перемещение.Комментарий =  Перемещение.Комментарий + ?(Перемещение.Комментарий = "", "", " ") +
			"(Документ скорректирован на основании перемещения EME:" + НомерЕМЕ + ")";
		
		//	Пометить для асинхронного проведения 
		EmeWmsПроведениеДокументов.ПометитьДокументКПроведению(Перемещение.Ссылка);
	Иначе
		//	Если документ не корректируется, добавить комментарий об импорте
		Перемещение.Комментарий = Перемещение.Комментарий + ?(Перемещение.Комментарий = "", "", " ") +
			"(Документ соответствует перемещению EME:" + НомерЕМЕ + ")";
	КонецЕсли;  
		
	//	Добавляет марки в ТЧ ШтрихкодыУпаковок документа
	//Если Константы.EmeWmsИмпортироватьМаркиЧЗ.Получить() Тогда  
	//	Параметры = Новый Структура;
	//	Параметры.Вставить("ERPData",		ERPData);
	//	Параметры.Вставить("ЗаказОбъект",	Перемещение);
	//	ПолучитьТаблицуМарок(Параметры);
	//	
	//	Перемещение.ШтрихкодыУпаковок.Очистить(); 
	//	ДобавитьМаркиВТЧШтрихкодыУпаковок(Перемещение.ШтрихкодыУпаковок, Параметры.ТаблицаМарок);
	//КонецЕсли;                              
	
	Перемещение.EmeWmsСтатус = "К проведению";
	
	СоздатьОтметкуОбИмпорте(Перемещение.Ссылка, ИдЕМЕ);
	Перемещение.Записать(РежимЗаписиДокумента.Запись); 
	
	EmeWmsERPEngine.Success(ERPData);
КонецПроцедуры

#КонецОбласти

#Область ЛокальныеСлужебныеПроцедурыИФункции

// Создает в регистре пометку об импорте документа перемещения товаров с идентификатором EME
Процедура СоздатьОтметкуОбИмпорте(Документ, ИдЕМЕ)
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеПеремещенийТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.ДатаИмпорта = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsОтметкиОбИмпортеПеремещенийТоваров.СоздатьМенеджерЗаписи();
	НоваяЗапись.ID = ИдЕМЕ;
	НоваяЗапись.Ссылка = Документ.Ссылка;
	НоваяЗапись.ДатаИмпорта = ТекущаяДата();
    НоваяЗапись.Записать(); 
 
КонецПроцедуры

//	Карта товаров: ключ = UID товара + UID серии + UID характеристики, значение = количество в ед.хранения
Процедура ПолучитьКоличестваТоваров(ERPData, КодЗоныОтправителя, КодЗоныПолучателя, КартаТоваров)

	//	Использование серий в интеграции
	ИспользоватьСерии = Константы.EmeWmsИспользоватьСерии.Получить();	

	// Весь товар в сообщении 
	КартаКлючей = Новый Соответствие;
	EmeWmsERPEngine.SelectChild(ERPData, "lines");
	Пока EmeWmsERPEngine.NextChildLine(ERPData) Цикл
		//	Проверим товар
		УИДТовара = ERPData.lines.goods_id;
		УИДЕдиницы = ERPData.lines.pack_id;
		Если УИДТовара = "" Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "GDSNUL");
			Продолжить
		КонецЕсли;
		
		ТоварСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаТовар(УИДТовара);
		Если ТоварСсылка.Пустая() Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "GDSBAD");
			Продолжить
		КонецЕсли;
		
		ЕдиницаИзмерения = EmeWmsУтилиты.ПолучитьСсылкуНаЕдиницуИзмерения(УИДЕдиницы);
		Если ЕдиницаИзмерения.Пустая() Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "PCKBAD");
			Продолжить
		КонецЕсли;

		РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТоварСсылка, "ВестиУчетПоСериям, ВестиУчетПоХарактеристикам"); 

		// Серии или серийные номера
		Если Не ИспользоватьСерии Тогда
			РеквизитыНоменклатуры.ВестиУчетПоСериям = Ложь;
		КонецЕсли;

		СерияНоменклатуры 		   	= Неопределено;
		ХарактеристикаНоменклатуры 	= Неопределено;
		
		Если РеквизитыНоменклатуры.ВестиУчетПоСериям Тогда   
			СерийныйНомер 	 = ERPData.lines.lot_no;
			ДатаГодности  	 = ERPData.lines.bbd;
			ДатаПроизводства = ERPData.lines.prd; 
			
			СерияНоменклатуры = EmeWmsУтилиты.ПолучитьСериюПоНаименованию(ERPData.lines.lot_no, ТоварСсылка);
		ИначеЕсли РеквизитыНоменклатуры.ВестиУчетПоХарактеристикам Тогда
			ХарактеристикаНоменклатуры = EmeWmsУтилиты.ПолучитьХарактеристикуПоНаименованию(ERPData.lines.lot_no, ТоварСсылка);
		КонецЕсли;
		
		КодЗоныОтправителя = ERPData.lines.zone_code;
		КодЗоныПолучтеля = ERPData.lines.zone_to_code;
		КлючТовара = EmeWmsУтилиты.СоздатьКлючТовара(ТоварСсылка, СерияНоменклатуры, ХарактеристикаНоменклатуры);
		КоличествоВБазовой = EmeWmsУтилиты.ПересчетВДругуюЕдиницу(ERPData.lines.quantity, 
																  ЕдиницаИзмерения, 
																  EmeWmsУтилиты.ПолучитьБазовуюЕдиницуИзмерения(ТоварСсылка));
		КоличествоПоКарте = ?(КартаТоваров.Получить(КлючТовара) = Неопределено, 0, КартаТоваров.Получить(КлючТовара));
		КартаТоваров.Вставить(КлючТовара, КоличествоПоКарте + КоличествоВБазовой);
		// Это для привязки серийных номеров к товару
		КартаКлючей.Вставить(ERPData.lines.id, КлючТовара);
	КонецЦикла;
	
КонецПроцедуры

// Пересчитывает количества упаковок товара в ТЧ Товары
Процедура ПересчитатьУпаковкиДокумента(Документ)
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоУпаковок");
	Для Каждого СтрокаТовара Из Документ.Товары Цикл
		СтрокаТовара.Коэффициент = СтрокаТовара.ЕдиницаИзмерения.Коэффициент;
		ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТовара, Документ);
	КонецЦикла;
КонецПроцедуры    

// Производит заполнение и установку необходимых полей при изменении товара в табличной части.
// Вызывается из:
//  ТоварыНоменклатураПриИзменении()
//  ВнешнееСобытие()
//
Процедура УстановитьЦенуНоменклатуры(Перемещение, СтрокаТабличнойЧасти, мВалютаРегламентированногоУчета)

	Если Не (Перемещение.СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.НТТ
		     или Перемещение.СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.НТТ) Тогда
		СтрокаТабличнойЧасти.Цена = 0;
	ИначеЕсли (Не Перемещение.СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.НТТ) 
		    И (Перемещение.СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.НТТ) Тогда
		ВалютаДокумента    = мВалютаРегламентированногоУчета;
		КурсДокумента      = 1;
		КратностьДокумента = 1;

		// Тип цен устанавливает склад получатель.
		СтрокаТабличнойЧасти.Цена = Ценообразование.ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура, 
										СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры,
		                              	Перемещение.СкладПолучатель.ТипЦенРозничнойТорговли, Перемещение.Дата, 
										СтрокаТабличнойЧасти.ЕдиницаИзмерения,
		                              	ВалютаДокумента, КурсДокумента, КратностьДокумента);
	ИначеЕсли Перемещение.СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
		ВалютаДокумента    = мВалютаРегламентированногоУчета;
		КурсДокумента      = 1;
		КратностьДокумента = 1;

		СтрокаТабличнойЧасти.Цена = УправлениеРозничнойТорговлей.ПолучитьРозничнуюЦену(СтрокаТабличнойЧасти.Номенклатура,, 
															Перемещение.СкладОтправитель,
		                                                  	мВалютаРегламентированногоУчета, Перемещение.Дата,
		                                                  	СтрокаТабличнойЧасти.ЕдиницаИзмерения,
		                                                  	ВалютаДокумента, КурсДокумента, КратностьДокумента);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область МаркиЧЗ 

//	Добавляет марки в ТЧ ШтрихкодыУпаковок документа
Процедура ДобавитьМаркиВТЧШтрихкодыУпаковок(ТЧШтрихкодыУпаковок, ТаблицаМарок)  
	
	Для Каждого СтрокаМарок Из ТаблицаМарок Цикл
		//	Штрихкод марки
		ШтрихкодУпаковки = НайтиСоздатьШтрихкодУпаковки(СтрокаМарок);
		
		//  Штрихкод упаковки
		Если ЗначениеЗаполнено(СтрокаМарок.ШтрихкодКороба) Тогда
			ШтрихкодУпаковки = НайтиСоздатьШтрихкодМонотоварнойУпаковки(СтрокаМарок, СтрокаМарок.ШтрихкодКороба, ШтрихкодУпаковки);
			
			//	Штрихкод паллеты
			Если ЗначениеЗаполнено(СтрокаМарок.ШтрихкодПаллеты) Тогда
				ШтрихкодУпаковки = НайтиСоздатьШтрихкодМонотоварнойУпаковки(СтрокаМарок, СтрокаМарок.ШтрихкодПаллеты, ШтрихкодУпаковки);				
			КонецЕсли;
		КонецЕсли;
		
		//	Поиск Штрихкода в Штрихкодах упаковки проверяемого документа
		Отбор = Новый Структура();
		Отбор.Вставить("ШтрихкодУпаковки", ШтрихкодУпаковки);
		
		МассивСтрок = ТЧШтрихкодыУпаковок.НайтиСтроки(Отбор);
		Если МассивСтрок.Количество() > 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		СтрокаШтрихкода = ТЧШтрихкодыУпаковок.Добавить();
		СтрокаШтрихкода.ШтрихкодУпаковки = ШтрихкодУпаковки;
	КонецЦикла;
	
КонецПроцедуры   

//	Находит или создает новую строку в справочнике ШтрикодыУпаковокТовара
Функция НайтиСоздатьШтрихкодМонотоварнойУпаковки(СтрокаМарок, ЗначениеШтрихкода, ВложенныйШтрихкод)
	
	Штрихкод = Справочники.ШтрихкодыУпаковокТоваров.НайтиПоРеквизиту("ЗначениеШтрихкода", ЗначениеШтрихкода);
	Если Штрихкод.Пустая() Тогда
		ШтрихкодОбъект = Справочники.ШтрихкодыУпаковокТоваров.СоздатьЭлемент();
		ШтрихкодОбъект.ЗначениеШтрихкода  = ЗначениеШтрихкода;
		ШтрихкодОбъект.ТипШтрихкода 	  = Перечисления.ТипыШтрихкодов.GS1_DataMatrix;
		ШтрихкодОбъект.ТипУпаковки 		  = Перечисления.ТипыУпаковок.МонотоварнаяУпаковка;
		ШтрихкодОбъект.Количество	   	  = 1;
		ШтрихкодОбъект.ДатаУпаковки 	  = ТекущаяДата();
	Иначе
		ШтрихкодОбъект = Штрихкод.ПолучитьОбъект();
		
		//	Поиск Штрихкода в Штрихкодах упаковки проверяемого документа
		Отбор = Новый Структура();
		Отбор.Вставить("Штрихкод", ВложенныйШтрихкод);
			
		МассивСтрок = ШтрихкодОбъект.ВложенныеШтрихкоды.НайтиСтроки(Отбор);
		Если МассивСтрок.Количество() > 0 Тогда 
			Возврат ШтрихкодОбъект.Ссылка;
		КонецЕсли;		
	КонецЕсли;
			
	НоваяСтрока = ШтрихкодОбъект.ВложенныеШтрихкоды.Добавить();
	НоваяСтрока.Штрихкод = ВложенныйШтрихкод;
	
	ШтрихкодОбъект.Записать();
	
	Возврат ШтрихкодОбъект.Ссылка;   	
	
КонецФункции

//	Находит или создает новую строку в справочнике ШтрикодыУпаковокТовара
Функция НайтиСоздатьШтрихкодУпаковки(СтрокаМарок)
	
	Штрихкод = Справочники.ШтрихкодыУпаковокТоваров.НайтиПоРеквизиту("ЗначениеШтрихкода", СтрокаМарок.ЗначениеШтрихкода);
	Если Не Штрихкод.Пустая() Тогда
		Возврат Штрихкод;
	КонецЕсли;
	
	Штрихкод = Справочники.ШтрихкодыУпаковокТоваров.СоздатьЭлемент(); 
	ЗаполнитьЗначенияСвойств(Штрихкод, СтрокаМарок, , "Количество");
	
	Штрихкод.ТипШтрихкода 	= Перечисления.ТипыШтрихкодов.GS1_DataMatrix;
	Штрихкод.ТипУпаковки 	= Перечисления.ТипыУпаковок.МаркированныйТовар;
	Штрихкод.Количество	    = 1;
	Штрихкод.ДатаУпаковки 	= ТекущаяДата();
	
	Штрихкод.Записать(); 
	
	Возврат Штрихкод.Ссылка;   	
	
КонецФункции

//  Получить таблицу марок
Процедура ПолучитьТаблицуМарок(Параметры)
	
	ERPData		 = Параметры.ERPData;
	ТаблицаМарок = РазметитьТаблицуМарок();
	НаименованияРеквизитов = "ВестиУчетПоСериям, ВестиУчетПоХарактеристикам";
	
	EmeWmsERPEngine.SelectChild(ERPData, "sscc");
	Пока EmeWmsERPEngine.NextChildLine(ERPData) Цикл  
		ТоварСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаТовар(ERPData.sscc.goods_id);
		Если ТоварСсылка.Пустая() Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "GDSBAD");
			Продолжить
		КонецЕсли;            
		
		РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТоварСсылка, НаименованияРеквизитов);
		
		Если НЕ EmeWmsУтилиты.ПродукцияМаркируемаяДляГИСМ(ТоварСсылка) Тогда 
			Продолжить;
		КонецЕсли;
		
		СерияНоменклатуры 		   	= Неопределено;
		ХарактеристикаНоменклатуры 	= Неопределено;
		
		// Серия или Характеристика			
		Если РеквизитыНоменклатуры.ВестиУчетПоСериям Тогда   
			СерияНоменклатуры = EmeWmsУтилиты.ПолучитьСериюПоНомеру(ERPData.sscc.lot_no, ТоварСсылка);
		Иначе                  
			Если РеквизитыНоменклатуры.ВестиУчетПоХарактеристикам Тогда      
				ХарактеристикаНоменклатуры = EmeWmsУтилиты.ПолучитьХарактеристикуПоНаименованию(ERPData.sscc.lot_no, ТоварСсылка);
			КонецЕсли;                           
		КонецЕсли;                           
					
		КодМарки = ERPData.sscc.true_sign;
		Если ЗначениеЗаполнено(КодМарки) Тогда
			СтрокаМарки = ТаблицаМарок.Добавить();
			СтрокаМарки.Номенклатура 	  = ТоварСсылка;
			СтрокаМарки.Характеристика 	  = ХарактеристикаНоменклатуры;
			СтрокаМарки.Серия 			  = СерияНоменклатуры;
			СтрокаМарки.Упаковка 		  = EmeWmsУтилиты.ПолучитьБазовуюЕдиницуИзмерения(ТоварСсылка);
			СтрокаМарки.Количество		  = ERPData.sscc.quantity;
			СтрокаМарки.ЗначениеШтрихкода = EmeWmsУтилиты.КодМаркиВЗначениеСоСкобками(КодМарки);
			СтрокаМарки.ШтрихкодКороба	  = EmeWmsУтилиты.КодМаркиВЗначениеСоСкобками(ERPData.sscc.box_sscc);
			СтрокаМарки.ШтрихкодПаллеты   = EmeWmsУтилиты.КодМаркиВЗначениеСоСкобками(ERPData.sscc.pallet_sscc);			
		КонецЕсли;
	КонецЦикла;	
		
	Параметры.Вставить("ТаблицаМарок", ТаблицаМарок);

	//	Тестирование Интеграции марок, подберем случайным образом необходиоме количество марок по Номенклатуре
	// ТестированиеИмпортаМарок(Параметры);
	
КонецПроцедуры

//	Создает таблицу для отгруженных марок ЧЗ из sscc сообщения despatch
Функция РазметитьТаблицуМарок()
	ТаблицаМарок = Новый ТаблицаЗначений;
	ТаблицаМарок.Колонки.Добавить("Номенклатура");
	ТаблицаМарок.Колонки.Добавить("Характеристика");
	ТаблицаМарок.Колонки.Добавить("Упаковка");
	ТаблицаМарок.Колонки.Добавить("Серия");
	ТаблицаМарок.Колонки.Добавить("Количество");
	ТаблицаМарок.Колонки.Добавить("ЗначениеШтрихкода");
	ТаблицаМарок.Колонки.Добавить("ШтрихкодКороба");
	ТаблицаМарок.Колонки.Добавить("ШтрихкодПаллеты");
	
	Возврат ТаблицаМарок;
КонецФункции

#КонецОбласти

#Область ТестированиеМарокЧЗ 

//	Сгенерировать штрихкоды упаковок
Процедура СгенерироватьШтрихкодыУпаковкок(Параметры)         
	
	ГСЧ = Новый ГенераторСлучайныхЧисел(День(ТекущаяДата())*84600 + Час(ТекущаяДата())*3600 + Минута(ТекущаяДата())*60 + Секунда(ТекущаяДата()));	
	
	//	Минимальное количество генерируемых марок
	Количество  = ?(Параметры.СтрокаТовара.Количество > 10, 10, Параметры.СтрокаТовара.Количество * Параметры.СтрокаТовара.Коэффициент);
		
	//	Значение штрихкода короба должно быть уникальным (15 попыток получить уникальный ШК)
	Для н = 1 По 15 Цикл
		ШККороба = СоздатьРандомныйШК(ГСЧ);				
		ШКСсылка = Справочники.ШтрихкодыУпаковокТоваров.НайтиПоРеквизиту("ЗначениеШтрихкода", ШККороба);
		
		Если НЕ ЗначениеЗаполнено(ШКСсылка) Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла; 

	
	Для МаркаПоТовару = 1 По Количество Цикл
		
		Если Не EmeWmsУтилиты.ПродукцияМаркируемаяДляГИСМ(Параметры.СтрокаТовара.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		//	Значение штрихкода должно быть уникальным (15 попыток получить уникальный ШК)
		Для н = 1 По 15 Цикл
			ШКМарки  = СоздатьРандомныйШК(ГСЧ);				
			ШКСсылка = Справочники.ШтрихкодыУпаковокТоваров.НайтиПоРеквизиту("ЗначениеШтрихкода", ШКМарки);
			
			Если НЕ ЗначениеЗаполнено(ШКСсылка) Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла; 
		
		Если ЗначениеЗаполнено(ШКСсылка) Тогда
			ТекстСообщения = НСтр("ru='Штрихкоды упаковок не заполнены, дублируются номера Штрихкода'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		Параметры.Вставить("ЗначениеШтрихкода", ШКМарки);
		
		//	Пераые три марки упакуем в короб
		Если МаркаПоТовару < 4 Тогда
			Параметры.Вставить("ШтрихкодКороба", ШККороба);
		Иначе
			Параметры.Вставить("ШтрихкодКороба", "");
		КонецЕсли;
		
		СоздатьНовыйШКВСправочнике(Параметры);		
		
	КонецЦикла;
	
	Параметры.Удалить("ЗначениеШтрихкода");
	Параметры.Удалить("ШтрихкодКороба");
		
КонецПроцедуры

//	Записать в справочник новый штрихкод упаковки
Процедура СоздатьНовыйШКВСправочнике(Параметры)
	
	НовыйЭлемент = Справочники.ШтрихкодыУпаковокТоваров.СоздатьЭлемент(); 

	ЗаполнитьЗначенияСвойств(НовыйЭлемент, Параметры.СтрокаТовара);
	
	Если ЗначениеЗаполнено(Параметры.СтрокаТовара.ЕдиницаИзмерения) Тогда
		НовыйЭлемент.Упаковка = Параметры.СтрокаТовара.ЕдиницаИзмерения;
	Иначе
		НовыйЭлемент.Упаковка = EmeWmsУтилиты.ПолучитьБазовуюЕдиницуИзмерения(Параметры.СтрокаТовара.Номенклатура);
	КонецЕсли;

	НовыйЭлемент.ЗначениеШтрихкода	= Параметры.ЗначениеШтрихкода;
	НовыйЭлемент.ТипШтрихкода		= Перечисления.ТипыШтрихкодов.GS1_DataMatrix;
	НовыйЭлемент.ТипУпаковки        = Перечисления.ТипыУпаковок.МаркированныйТовар;
	НовыйЭлемент.Количество			= 1;
	НовыйЭлемент.ДатаУпаковки 	 	= ТекущаяДата();
	НовыйЭлемент.Записать();	

	СтрокаМарки = Параметры.ТаблицаМарок.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаМарки, НовыйЭлемент);
	СтрокаМарки.ШтрихкодКороба = Параметры.ШтрихкодКороба; 
	
КонецПроцедуры

//	Сгенерировать случайный штрихкод
Функция СоздатьРандомныйШК(ГСЧ)
	
	СтрокаЦифр = "0123456789";
	СтрокаБукв = "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWYZ,-.!?%></;*'_+=()";
	
	// (01)04602443466045(21)P=uxqUQfzw'Ut
	СтрокаШК = "(01)";
	Для инд1 = 1 По 14 Цикл                         
		Позиция1 = ГСЧ.СлучайноеЧисло(1,10);
		СтрокаШК = СтрокаШК + Сред(СтрокаЦифр, Позиция1, 1);
	КонецЦикла;
	СтрокаШК = СтрокаШК + "(21)";
	Для инд1 = 1 По 13 Цикл
		Позиция1 = ГСЧ.СлучайноеЧисло(1, СтрДлина(СтрокаБукв));
		СтрокаШК = СтрокаШК + Сред(СтрокаБукв, Позиция1, 1);
	КонецЦикла; 
	
	Возврат СтрокаШК;
	
КонецФункции    

//	Тестирование Интеграции марок, подберем случайным образом необходиоме количество марок по Номенклатуре
Процедура ТестированиеИмпортаМарок(Параметры)
	
	Если ЗначениеЗаполнено(Параметры.ТаблицаМарок) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТовара Из Параметры.ЗаказОбъект.Товары Цикл
		Если Не EmeWmsУтилиты.ПродукцияМаркируемаяДляГИСМ(СтрокаТовара.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;  
		
		Если ЗначениеЗаполнено(СтрокаТовара.ЕдиницаИзмерения) Тогда
			Упаковка = СтрокаТовара.ЕдиницаИзмерения;
		Иначе
			Упаковка = EmeWmsУтилиты.ПолучитьБазовуюЕдиницуИзмерения(СтрокаТовара.Номенклатура);
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПеремещениеТоваровШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки
		|ПОМЕСТИТЬ ВТ_ШтрихкодыУпаковок
		|ИЗ
		|	Документ.ПеремещениеТоваров.ШтрихкодыУпаковок КАК ПеремещениеТоваровШтрихкодыУпаковок
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ШтрихкодУпаковки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ &КоличествоМарок
		|	ШтрихкодыУпаковокТоваров.Номенклатура КАК Номенклатура,
		|	ШтрихкодыУпаковокТоваров.Характеристика КАК Характеристика,
		|	ШтрихкодыУпаковокТоваров.Упаковка КАК Упаковка,
		|	ШтрихкодыУпаковокТоваров.Серия КАК Серия,
		|	ШтрихкодыУпаковокТоваров.Количество КАК Количество,
		|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода КАК ЗначениеШтрихкода
		|ИЗ
		|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ШтрихкодыУпаковок КАК ВТ_ШтрихкодыУпаковок
		|		ПО ШтрихкодыУпаковокТоваров.Ссылка = ВТ_ШтрихкодыУпаковок.ШтрихкодУпаковки
		|ГДЕ
		|	ВТ_ШтрихкодыУпаковок.ШтрихкодУпаковки ЕСТЬ NULL
		|	И НЕ ШтрихкодыУпаковокТоваров.ПометкаУдаления
		|	И ШтрихкодыУпаковокТоваров.Номенклатура = &Номенклатура
		|	И ШтрихкодыУпаковокТоваров.Характеристика = &Характеристика
		|	И ШтрихкодыУпаковокТоваров.Упаковка = &Упаковка
		|	И ШтрихкодыУпаковокТоваров.Серия = &Серия
		|	И ШтрихкодыУпаковокТоваров.ТипУпаковки = &ТипУпаковки
		|	И ШтрихкодыУпаковокТоваров.ТипШтрихкода = &ТипШтрихкода";
				
		КоличествоМарок = ?(СтрокаТовара.Количество > 10, 10, СтрокаТовара.Количество * СтрокаТовара.Коэффициент);                		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&КоличествоМарок", СтрЗаменить(Строка(КоличествоМарок), Символы.НПП, "")); 
		
		Запрос.УстановитьПараметр("Номенклатура", 	 СтрокаТовара.Номенклатура);
		Запрос.УстановитьПараметр("Характеристика",  СтрокаТовара.ХарактеристикаНоменклатуры);
		Запрос.УстановитьПараметр("Упаковка", 		 Упаковка);
		Запрос.УстановитьПараметр("Серия", 			 СтрокаТовара.СерияНоменклатуры);
		Запрос.УстановитьПараметр("ТипУпаковки", 	 Перечисления.ТипыУпаковок.МаркированныйТовар);
		Запрос.УстановитьПараметр("ТипШтрихкода", 	 Перечисления.ТипыШтрихкодов.GS1_DataMatrix);
	
		РезультатЗапроса = Запрос.Выполнить();   
		
		Если РезультатЗапроса.Пустой() Тогда         
			Параметры.Вставить("СтрокаТовара", СтрокаТовара);
			СгенерироватьШтрихкодыУпаковкок(Параметры);
	
			Продолжить;
		КонецЕсли;
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтрокаМарки = Параметры.ТаблицаМарок.Добавить();
            ЗаполнитьЗначенияСвойств(СтрокаМарки, ВыборкаДетальныеЗаписи);
		КонецЦикла;
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

