//	Copyright (C) 2012-2024 Engineer Mareev Enterprises
//	Модуль для УТ 10.3

//	$Инвентаризация товаров
//	Импорт сообщений INVENTORY:
//	- Оператор EME.WMS (руч.) создает документ Инвентаризация товаров.
//	- После закрытия документа инвентаризации EME.WMS (авт.) экспортирует сообщение INVENTORY.
//	- 1C (авт.) импортирует сообщение INVENTORY.
//  - 1C (авт.) создает документ Инвентаризация товаров.

#Область ПрограммныйИнтерфейс

//	Импортирует сообщения inventory в документы ПересчетТоваров, ОприходованиеИзлишков, СписаниеНедостач, ПеремещениеТоваров
// 	ОрдерНаОтражениеИзлишковТовара, ОрдерНаОтражениеНедостачТоваров, ОприходованиеИзлишков, СписаниеНедостачТоваров
// 	Inventory принимается на один склад.
Процедура Импортировать(ERPData, Трассировка, ТемаСообщения) Экспорт
	//	Идентификатор док-та EME для записи в регистры импорта
	ИдЕМЕ 		= ERPData.header.inventory_id;
	//	Номер документа EME для комментариев
	НомерЕМЕ 	= ERPData.header.inventory_reg_no;

	// 	Получим склад по коду EME
	КодСклада 	= ERPData.header.whs_code;
	КодЗоны 	= ПолучитьКодЗоны(ERPData);
	
	// 	Склад не может быть группой для инвентаризации
	Если ЗначениеЗаполнено(КодЗоны) Тогда
		СкладСсылка = ПолучитьСсылкуНаСкладПоКодуEME(КодСклада, КодЗоны);
	Иначе
		СкладСсылка = ПолучитьСсылкуНаСкладПоКодуEME(КодСклада, "WRH"); // Возьмем основной склад 
	КонецЕсли;
	
	ОрганизацияСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаОрганизациюПоКодуEME(ERPData.header.vendor_code);
	Если ОрганизацияСсылка.Пустая() Тогда
		EmeWmsERPEngine.ErrorHeader(ERPData, "VNDBAD");
		Возврат
	КонецЕсли;
	
	Пересчет = НайтиДокументПересчетТоваров(ИдЕМЕ);
	Если НЕ Пересчет.Пустая() Тогда  
		EmeWmsERPEngine.Success(ERPData);
		возврат;
	КонецЕсли;
	
	КартаТоваровСписания 		= Новый Соответствие;                                                                           
	КартаТоваровОприходования 	= Новый Соответствие;                                                                           
	ТаблицаПересчета 			= РазметитьТаблицуПересчета();
	ПолучитьКоличестваТоваров(ERPData, КодЗоны, КартаТоваровСписания, КартаТоваровОприходования, ТаблицаПересчета);
	
	// Ордер формируем, когда нет документа Пересчет и установлен признак 
	// ордерного склада "при отражении излишков, недостач, пересортицы и порчи"
	// Для инвентаризации документы: Пересчет - Складские акты (ОприходованиеИзлишков, СписаниеНедостачТоваров)
	Параметры = Новый Структура;
	Параметры.Вставить("ERPData", 					ERPData);
	Параметры.Вставить("ИдЕМЕ", 					ИдЕМЕ);
	Параметры.Вставить("НомерЕМЕ", 					НомерЕМЕ);
	Параметры.Вставить("ОрганизацияСсылка", 		ОрганизацияСсылка);
	Параметры.Вставить("СкладСсылка", 				СкладСсылка);
	Параметры.Вставить("ТаблицаПересчета", 			ТаблицаПересчета);
	Параметры.Вставить("ПересчетТоваровСсылка", 	СоздатьИзменитьДокументПересчетТоваров(Параметры));	
	Параметры.Вставить("ИспользоватьОрдернуюСхему", Ложь);
	Параметры.Вставить("ИмпортироватьМаркиЧЗ", 		Константы.EmeWmsИмпортироватьМаркиЧЗИзОтгрузки.Получить());

	ПересчетСсылка = Параметры.ПересчетТоваровСсылка;
	
	// Если есть списания, создадим ордер на отражение недостач
	//Если КартаТоваровСписания.Количество() > 0 Тогда            		
	//	Параметры.Вставить("КартаТоваровСписания", КартаТоваровСписания);				
	//	СоздатьИзменитьДокументСписанияНедостачТоваров(Параметры);
	//	
	//	Если Параметры.ИмпортироватьМаркиЧЗ Тогда
	//		СоздатьИзменитьДокументВыводИзОборотаИСМП(Параметры);	
	//	КонецЕсли;		
	//КонецЕсли;   
	
	// Если есть оприходование, создадим ордер на отражение излишков
	//Если КартаТоваровОприходования.Количество() > 0 Тогда		
	//	СоздатьИзменитьДокументОприходованияИзлишковТоваров(ПересчетСсылка, КартаТоваровОприходования, СкладСсылка, ОрганизацияСсылка, ИдЕМЕ, НомерЕМЕ, ERPData);		
	//КонецЕсли;   

	//	Если были ошибки - выйдем
	Если EmeWmsERPEngine.HasErrors(ERPData) Тогда
		Возврат
	КонецЕсли;

	СоздатьОтметкуОбИмпортеДокументаПересчетТоваров(ПересчетСсылка, ИдЕМЕ);
	//EmeWmsПроведениеДокументов.ПометитьДокументКПроведению(ПересчетСсылка);

	EmeWmsERPEngine.Success(ERPData);
			
КонецПроцедуры

// 	Функция ПолучитьИмяСообщения возвращает имя сообщения
Функция ПолучитьИмяСообщения() Экспорт
	Возврат "inventory";
КонецФункции

// 	Функция ПолучитьМетаданные возвращает метаданные сообщения
Функция ПолучитьМетаданные() Экспорт
	Возврат Метаданные.Документы.ПересчетТоваров;
КонецФункции

#КонецОбласти

#Область ЛокальныеСлужебныеПроцедурыИФункции

//	Получить код зоны для сообщения инвентаризации
Функция ПолучитьКодЗоны(ERPData)
	
	EmeWmsERPEngine.SelectChild(ERPData, "diff_lines");
	Пока EmeWmsERPEngine.NextChildLine(ERPData) Цикл
		Если ЗначениеЗаполнено(ERPData.diff_lines.zone_code) Тогда
			Возврат ERPData.diff_lines.zone_code;
		КонецЕсли;
	КонецЦикла;
	
	Возврат неопределено;
КонецФункции

//	Получить карты товаров для списания, оприходования, пересорта из строк receipt_lines и offrite_lines
// 	Карта товаров: ключ = UID товара + UID серии + UID характеристики, значение = количество в ед.хранения
Процедура ПолучитьКоличестваТоваров(ERPData, КодЗоны, КартаТоваровСписания, КартаТоваровОприходования, ТаблицаПересчета)

	//	Использование серий в интеграции
	ИспользоватьСерии = Константы.EmeWmsИспользоватьСерии.Получить();	

	КлючиТоваров = Новый Соответствие();
	КартаТоваров = Новый Соответствие();
		
	EmeWmsERPEngine.SelectChild(ERPData, "receipt_lines");
	Пока EmeWmsERPEngine.NextChildLine(ERPData) Цикл
		Если ERPData.receipt_lines.quantity > 0.0 Тогда 
			УИДТовара = ERPData.receipt_lines.goods_id;
			УИДЕдиницы = ERPData.receipt_lines.pack_id;
			Если УИДТовара = "" Тогда
				EmeWmsERPEngine.ErrorChild(ERPData, "GDSNUL");
				Продолжить
			КонецЕсли;
		
			ТоварСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаТовар(УИДТовара);
			Если ТоварСсылка.Пустая() Тогда
				EmeWmsERPEngine.ErrorChild(ERPData, "GDSBAD");
				Продолжить
			КонецЕсли;
		
			ЕдиницаИзмерения = EmeWmsУтилиты.ПолучитьСсылкуНаЕдиницуИзмерения(УИДЕдиницы);
			Если ЕдиницаИзмерения.Пустая() Тогда
				EmeWmsERPEngine.ErrorChild(ERPData, "PCKBAD");
				Продолжить
			КонецЕсли;
		
			РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТоварСсылка, "БазоваяЕдиницаИзмерения, 
																					|ВестиУчетПоСериям, ВестиУчетПоХарактеристикам"); 
			Если Не ИспользоватьСерии Тогда
				РеквизитыНоменклатуры.ВестиУчетПоСериям = Ложь;
			КонецЕсли;

			СерияНоменклатуры 		   	= Неопределено;
			ХарактеристикаНоменклатуры 	= Неопределено;
			
			Если РеквизитыНоменклатуры.ВестиУчетПоСериям Тогда   			
				СерияНоменклатуры = EmeWmsУтилиты.ПолучитьСериюПоНаименованию(ERPData.receipt_lines.lot_no, ТоварСсылка);
			ИначеЕсли РеквизитыНоменклатуры.ВестиУчетПоХарактеристикам Тогда
				ХарактеристикаНоменклатуры = EmeWmsУтилиты.ПолучитьХарактеристикуПоНаименованию(ERPData.receipt_lines.lot_no, ТоварСсылка);
			КонецЕсли;

			КлючиТоваров.Вставить(ERPData.receipt_lines.id, ТоварСсылка);
			КодЗоны = ERPData.receipt_lines.zone_code;
			КлючТовара = EmeWmsУтилиты.СоздатьКлючТовара(ТоварСсылка, СерияНоменклатуры, ХарактеристикаНоменклатуры);
			КоличествоВБазовой = EmeWmsУтилиты.ПересчетВДругуюЕдиницу(ERPData.receipt_lines.quantity, 
			                                                          ЕдиницаИзмерения, 
																	  РеквизитыНоменклатуры.БазоваяЕдиницаИзмерения);
																	  
			КоличествоПоКарте = ?(КартаТоваров.Получить(КлючТовара) = Неопределено, 0.0, КартаТоваров.Получить(КлючТовара));
			КартаТоваров.Вставить(КлючТовара, КоличествоПоКарте + КоличествоВБазовой);
			
			СтрокаПересчета = ТаблицаПересчета.Добавить();
			СтрокаПересчета.Номенклатура 	= ТоварСсылка;
			СтрокаПересчета.Характеристика 	= ХарактеристикаНоменклатуры;
			СтрокаПересчета.Серия 			= СерияНоменклатуры;			
			СтрокаПересчета.Упаковка 		= ЕдиницаИзмерения;
			СтрокаПересчета.КоличествоНовое = КоличествоВБазовой;
			СтрокаПересчета.КоличествоСтарое= 0;
		КонецЕсли;
	КонецЦикла;  
	
	EmeWmsERPEngine.SelectChild(ERPData, "offwrite_lines");
	Пока EmeWmsERPEngine.NextChildLine(ERPData) Цикл
		Если ERPData.offwrite_lines.quantity > 0.0 Тогда 
			УИДТовара = ERPData.offwrite_lines.goods_id;
			УИДЕдиницы = ERPData.offwrite_lines.pack_id;
			Если УИДТовара = "" Тогда
				EmeWmsERPEngine.ErrorChild(ERPData, "GDSNUL");
				Продолжить
			КонецЕсли;
		
			ТоварСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаТовар(УИДТовара);
			Если ТоварСсылка.Пустая() Тогда
				EmeWmsERPEngine.ErrorChild(ERPData, "GDSBAD");
				Продолжить
			КонецЕсли;
		
			ЕдиницаИзмерения = EmeWmsУтилиты.ПолучитьСсылкуНаЕдиницуИзмерения(УИДЕдиницы);
			Если ЕдиницаИзмерения.Пустая() Тогда
				EmeWmsERPEngine.ErrorChild(ERPData, "PCKBAD");
				Продолжить
			КонецЕсли;
			
			РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТоварСсылка, "БазоваяЕдиницаИзмерения, 
																					|ВестиУчетПоСериям, ВестиУчетПоХарактеристикам"); 
			Если Не ИспользоватьСерии Тогда
				РеквизитыНоменклатуры.ВестиУчетПоСериям = Ложь;
			КонецЕсли;

			СерияНоменклатуры 		   	= Неопределено;
			ХарактеристикаНоменклатуры 	= Неопределено;
			
			Если РеквизитыНоменклатуры.ВестиУчетПоСериям Тогда   			
				СерияНоменклатуры = EmeWmsУтилиты.ПолучитьСериюПоНаименованию(ERPData.offwrite_lines.lot_no, ТоварСсылка);
			ИначеЕсли РеквизитыНоменклатуры.ВестиУчетПоХарактеристикам Тогда
				ХарактеристикаНоменклатуры = EmeWmsУтилиты.ПолучитьХарактеристикуПоНаименованию(ERPData.offwrite_lines.lot_no, ТоварСсылка);
			КонецЕсли;

			КлючиТоваров.Вставить(ERPData.offwrite_lines.id, ТоварСсылка);
			КодЗоны = ERPData.offwrite_lines.zone_code;
			КлючТовара = EmeWmsУтилиты.СоздатьКлючТовара(ТоварСсылка, СерияНоменклатуры, ХарактеристикаНоменклатуры);
			КоличествоВБазовой = EmeWmsУтилиты.ПересчетВДругуюЕдиницу(ERPData.offwrite_lines.quantity, 
			                                                          ЕдиницаИзмерения, 
																	  РеквизитыНоменклатуры.БазоваяЕдиницаИзмерения);
																	  
			КоличествоПоКарте = ?(КартаТоваров.Получить(КлючТовара) = Неопределено, 0.0, КартаТоваров.Получить(КлючТовара));
			КартаТоваров.Вставить(КлючТовара, КоличествоПоКарте - КоличествоВБазовой);
			
			СтрокаПересчета 				= ТаблицаПересчета.Добавить();
			СтрокаПересчета.Номенклатура 	= ТоварСсылка;
			СтрокаПересчета.Характеристика 	= ХарактеристикаНоменклатуры;
			СтрокаПересчета.Серия 			= СерияНоменклатуры;
			СтрокаПересчета.Упаковка 		= ЕдиницаИзмерения;
			СтрокаПересчета.КоличествоСтарое= КоличествоВБазовой;
			СтрокаПересчета.КоличествоНовое = 0.0;
		КонецЕсли;
	КонецЦикла;                                 
	
	Для каждого СтрокаТовара из КартаТоваров Цикл
		КлючТовара = СтрокаТовара.Ключ;
		КоличествоТовара = СтрокаТовара.Значение;
		Если КоличествоТовара > 0.0 Тогда
			КоличествоПоКарте = ?(КартаТоваровОприходования.Получить(КлючТовара) = неопределено, 0.0, КартаТоваровОприходования.Получить(КлючТовара));
			КартаТоваровОприходования.Вставить(КлючТовара, КоличествоПоКарте + КоличествоТовара);
		ИначеЕсли КоличествоТовара < 0.0 Тогда
			КоличествоПоКарте = ?(КартаТоваровСписания.Получить(КлючТовара) = неопределено, 0.0, КартаТоваровСписания.Получить(КлючТовара));
			КартаТоваровСписания.Вставить(КлючТовара, КоличествоПоКарте - КоличествоТовара);
		КонецЕсли;
	КонецЦикла;                                 
	ТаблицаПересчета.Свернуть("Номенклатура,Характеристика,Серия,Упаковка", "КоличествоСтарое,КоличествоНовое");
	ТаблицаПересчета.Сортировать("Номенклатура,Характеристика,Серия");
	
КонецПроцедуры

//	Получить коэф. пересчета (сколько упак 2 содержится в упак 1)
Функция ПолучитьКоэффициентПересчетаЕдиниц(Упаковка1, Упаковка2)
	
	КоэффициентПересчета = 1;

	Если Упаковка1 <> Справочники.ЕдиницыИзмерения.ПустаяСсылка() И
		Упаковка2 <> Справочники.ЕдиницыИзмерения.ПустаяСсылка() Тогда
		
		Коэффициент1 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Упаковка1, "Коэффициент");
		Коэффициент2 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Упаковка2, "Коэффициент");
		
		Если Коэффициент1 <> 0 И Коэффициент2 <> 0 Тогда
			КоэффициентПересчета = Коэффициент1 / Коэффициент2;
		КонецЕсли;
	КонецЕсли;
	
	Возврат КоэффициентПересчета;
	
КонецФункции

//	Возвращает только элемент склад, не группы
Функция ПолучитьСсылкуНаСкладПоКодуEME(КодСклада, КодЗоны = Неопределено) Экспорт
	Перем Запрос, Выборка;
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Склады.Склад КАК Ссылка
		|ИЗ
		|	РегистрСведений.EmeWmsМаппингСкладов КАК Склады
		|ГДЕ                                  
		|	(Склады.КодСкладаEME = &КодСклада) И
		|	(Склады.КодЗоны = &КодЗоны ИЛИ Склады.ИспользоватьЗоны = ЛОЖЬ)";
	Запрос.УстановитьПараметр("КодСклада", КодСклада);
	Запрос.УстановитьПараметр("КодЗоны", КодЗоны);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Склад = Выборка.Ссылка;
		Если НЕ Склад.ЭтоГруппа Тогда
			Возврат Склад;
		КонецЕсли;
	КонецЕсли;    
	
	Возврат Справочники.Склады.ПустаяСсылка();
КонецФункции

//	Таблица для данных пересчета
Функция РазметитьТаблицуПересчета()
	ТаблицаПересорта = Новый ТаблицаЗначений;
	ТаблицаПересорта.Колонки.Добавить("Номенклатура");
	ТаблицаПересорта.Колонки.Добавить("Упаковка");
	ТаблицаПересорта.Колонки.Добавить("Характеристика");
	ТаблицаПересорта.Колонки.Добавить("Серия");
	ТаблицаПересорта.Колонки.Добавить("РазностьКоличеств");
	ТаблицаПересорта.Колонки.Добавить("КоличествоСтарое");
	ТаблицаПересорта.Колонки.Добавить("КоличествоНовое");
	
	Возврат ТаблицаПересорта;
КонецФункции

//	Найти ссылку на Пересчет товаров по номеру импортированного документа EME
Функция НайтиДокументПересчетТоваров(ИдЕМЕ)
	
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	EmeWmsОтметкиОбИмпорте.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрСведений.EmeWmsОтметкиОбИмпортеИнвентаризацийТоваров КАК EmeWmsОтметкиОбИмпорте
		|ГДЕ
		|	EmeWmsОтметкиОбИмпорте.ID = &ИдЕМЕ";
	Запрос.УстановитьПараметр("ИдЕМЕ", ИдЕМЕ);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Документы.ИнвентаризацияТоваровНаСкладе.ПустаяСсылка();
	
КонецФункции

//	Создать или изменить документ Пересчет товаров  
Функция СоздатьИзменитьДокументПересчетТоваров(Параметры)

	ПересчетСсылка = НайтиДокументПересчетТоваров(Параметры.ИдЕМЕ);
	Если ПересчетСсылка.Пустая() Тогда
		Пересчет 						= Документы.ИнвентаризацияТоваровНаСкладе.СоздатьДокумент();
		Пересчет.Дата 					= ТекущаяДата();
		Пересчет.Склад 					= Параметры.СкладСсылка;
		Пересчет.Ответственный 			= ПараметрыСеанса.ТекущийПользователь;
		Пересчет.Комментарий = "Создан автоматом на основании документа EME: " +
			Параметры.НомерЕМЕ + " ("+ Параметры.ИдЕМЕ + ")" + " (" + Параметры.ERPData.header.comment + ")";
	Иначе 
		Пересчет = ПересчетСсылка.ПолучитьОбъект();
		Пересчет.Комментарий = "Документ скорректирован на основании документа EME: " +
			Параметры.НомерЕМЕ + " ("+ Параметры.ИдЕМЕ + ")" + " (" + Параметры.ERPData.header.comment + ")";  			
	КонецЕсли;
	
	Пересчет.Товары.Очистить();  
	Для Каждого СтрокаТовара из Параметры.ТаблицаПересчета Цикл
		
		БазоваяЕдиницаИзмерения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовара.Номенклатура);
		КоэффУпак = ПолучитьКоэффициентПересчетаЕдиниц(СтрокаТовара.Упаковка, БазоваяЕдиницаИзмерения);
		
		НоваяСтрока = Пересчет.Товары.Добавить();
		НоваяСтрока.Качество					= Справочники.Качество.Новый;
		НоваяСтрока.Номенклатура 				= СтрокаТовара.Номенклатура;		
		НоваяСтрока.ХарактеристикаНоменклатуры	= СтрокаТовара.Характеристика;
		НоваяСтрока.СерияНоменклатуры			= СтрокаТовара.Серия;
		НоваяСтрока.ЕдиницаИзмерения			= СтрокаТовара.Упаковка;
		НоваяСтрока.КоличествоУчет				= СтрокаТовара.КоличествоСтарое * КоэффУпак;
		НоваяСтрока.Количество					= СтрокаТовара.КоличествоНовое * КоэффУпак;  
		
		//НоваяСтрока.КоличествоМест				= СтрокаТовара.КоличествоСтарое;
		//НоваяСтрока.ЕдиницаИзмеренияМест		= СтрокаТовара.КоличествоНовое;
	КонецЦикла;

	Пересчет.Записать(РежимЗаписиДокумента.Запись);
	
	СоздатьОтметкуОбИмпортеДокументаПересчетТоваров(Пересчет.Ссылка, Параметры.ИдЕМЕ);
	//EmeWmsПроведениеДокументов.ПометитьДокументКПроведению(Пересчет.Ссылка);	
	
	Возврат Пересчет.Ссылка; 
	
КонецФункции

//	Создает в регистре пометку об импорте документа Пересчет товаров с номером в EME
Процедура СоздатьОтметкуОбИмпортеДокументаПересчетТоваров(Документ, ИдЕМЕ)
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеИнвентаризацийТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.ДатаИмпорта = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsОтметкиОбИмпортеИнвентаризацийТоваров.СоздатьМенеджерЗаписи();
	НоваяЗапись.ID = ИдЕМЕ;
	НоваяЗапись.Ссылка = Документ.Ссылка;
	НоваяЗапись.ДатаИмпорта = ТекущаяДата();
    НоваяЗапись.Записать();  
	
 КонецПроцедуры

#КонецОбласти
