// #Область ОписаниеПеременных

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

// #КонецОбласти

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресХранилища = Неопределено;
	ТаблицаДанных = Неопределено;
	
	Если Параметры.Свойство("АдресТаблицы", АдресХранилища) Тогда
		ТаблицаДанных = ПолучитьИзВременногоХранилища(АдресХранилища);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТаблицаДанных) Тогда
		ТаблицаДанных = Новый ТаблицаЗначений;
	КонецЕсли;
	
	МодульОбъекта().ТаблицаКодов_ЗаменитьНаПредставлениеРазделителиGS1(ТаблицаДанных);
	
	СоздатьТаблицуФормы("Таблица", "Таблица", ТаблицаДанных);
	
	НастроитьДоступностьКомандФормы();
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НормализоватьКоды(Команда)
	
	НормализоватьКодыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура НормализоватьКодыНаСервере()

	ТаблицаКодов = Таблица.Выгрузить();
	
	МодульОбъекта().ТаблицаКодов_ДополнитьКолонки(ТаблицаКодов);
	ТаблицаКодов.ЗаполнитьЗначения(Ложь, "КодРазобран");
	
	МодульОбъекта().ТаблицаКодов_ВосстановитьРазделителиGS1(ТаблицаКодов);
	МодульОбъекта().НормализоватьКоды(ТаблицаКодов,, Ложь);
	МодульОбъекта().ТаблицаКодов_ЗаменитьНаПредставлениеРазделителиGS1(ТаблицаКодов);
	
	Таблица.Очистить();
	Таблица.Загрузить(ТаблицаКодов);

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВложенныеКоды(Команда)
	
	ДобавитьВложенныеКодыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВложенныеКодыНаСервере()
	
	ТаблицаКодов = Таблица.Выгрузить();
	
	МодульОбъекта().ТаблицаКодов_ВосстановитьРазделителиGS1(ТаблицаКодов);
	МодульОбъекта().ДобавитьВсеВложенныеКодыВТаблицуКодов(ТаблицаКодов);
	МодульОбъекта().ТаблицаКодов_ЗаменитьНаПредставлениеРазделителиGS1(ТаблицаКодов);
	
	Таблица.Очистить();
	Таблица.Загрузить(ТаблицаКодов);
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьДоступностьКомандФормы()
	
	ЭтоТаблицаКодов = Ложь;
	Если Параметры.Свойство("ЭтоТаблицаКодов") Тогда
		ЭтоТаблицаКодов = Параметры.ЭтоТаблицаКодов;
	КонецЕсли;
	
	Элементы.ТаблицаКодов.Видимость = ЭтоТаблицаКодов;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьТаблицуФормы(Знач ИмяПоляТаблицыФормы, Знач ИмяРеквизитаДанныеФормыКоллекция, Знач ТаблицаЗначений)
	
	УдаляемыеРеквизиты = Новый Массив;
	РеквизитыДляУдаления = ПолучитьРеквизиты(ИмяРеквизитаДанныеФормыКоллекция);
	Для Каждого РеквизитУдаления Из РеквизитыДляУдаления Цикл
		УдаляемыеРеквизиты.Добавить(ИмяРеквизитаДанныеФормыКоллекция + "." + РеквизитУдаления.Имя);
		// Удаляем элементы формы
		Элементы.Удалить(Элементы[ИмяПоляТаблицыФормы + РеквизитУдаления.Имя]);
	КонецЦикла;
	
	// Добавление реквизитов в таблицу формы
	ДобавляемыеРеквизиты = Новый Массив;
	Для каждого Колонка Из ТаблицаЗначений.Колонки Цикл
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, ИмяРеквизитаДанныеФормыКоллекция, Колонка.Заголовок));
	КонецЦикла;
	ИзменитьРеквизиты(ДобавляемыеРеквизиты, УдаляемыеРеквизиты);
	
	// Добавление элементов форму
	Для каждого Колонка Из ТаблицаЗначений.Колонки Цикл
		ЭлементРеквизита = Элементы.Добавить(ИмяПоляТаблицыФормы + Колонка.Имя, Тип("ПолеФормы"), Элементы[ИмяПоляТаблицыФормы]);
		ЭлементРеквизита.ПутьКДанным = ИмяРеквизитаДанныеФормыКоллекция + "." + Колонка.Имя;
		ЭлементРеквизита.Вид = ВидПоляФормы.ПолеВвода;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ТаблицаЗначений, ИмяРеквизитаДанныеФормыКоллекция);
	
КонецПроцедуры

// #КонецОбласти
