
Перем ОсновнойМодуль Экспорт;

// #Область СведенияОВнешнейОбработке

// Версия обработки в стандартном формате
//
Функция ВерсияОбработки() Экспорт
	
	Возврат "3.15.0";
	
КонецФункции

// Сведения о внешней обработке совместимые с БСП
//
// Возвращаемое значение:
//  Структура - содержит свойства:
//   * Версия          - Строка - версия обработки;
//   * Наименование    - Строка - представление для администратора (наименование элемента справочника),
//                                берется синоним объекта метаданных внешней обработки;
//   * Информация      - Строка - краткая информация о внешней обработке,
//                                берется комментарий объекта метаданных внешней обработки;
//   * БезопасныйРежим - Булево - признак подключения внешней обработки в безопасном режиме:
//                                 Игнорируется привилегированный режим
//                                 Запрещены внешние по отношению к платформе «1С:Предприятия» действия:
//                                  COM;
//                                  загрузка внешних компонент;
//                                  запуск внешних приложений и команд операционной системы;
//                                  доступ к файловой системе, кроме временных файлов;
//                                  доступ к Интернету.
//   * Вид             - Строка - содержит значение "ДополнительнаяОбработка";
//   * Команды         - ТаблицаЗначений - настройки команд, поставляемых внешней обработкой:
//      ** Идентификатор        - Строка- внутреннее имя команды;
//      ** Представление        - Строка- пользовательское представление команды;
//      ** Использование        - Строка- тип команды:
//                                         "ВызовКлиентскогоМетода",
//                                         "ВызовСерверногоМетода";
//      ** Модификатор          - Строка- дополнительная классификация команды;
//      ** ПоказыватьОповещение - Булево- если Истина, то при запуске команды выводится оповещение "Команда выполняется...";
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("БезопасныйРежим", Ложь);
	Результат.Вставить("Наименование"	, Метаданные().Синоним);
	Результат.Вставить("Информация"		, Метаданные().Комментарий);
	Результат.Вставить("Версия"			, ВерсияОбработки());
	Результат.Вставить("Команды"		, Новый ТаблицаЗначений);
	Результат.Вставить("Вид"			, "ДополнительнаяОбработка");
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти СведенияОВнешнейОбработке

// #Область СлужебныйПрограммныйИнтерфейс

// Вызывает в нужный обработчик события
//
// Параметры:
//  ИмяСобытия           - Строка    - имя события;
//  ПараметрыСобытия     - Структура - параметры события, см. обработчик события;
//  СтандартнаяОбработка - Булево    - Ложь, если обработчик события выполняет действия;
//
Процедура ОбработатьСобытие(ИмяСобытия, ПараметрыСобытия, СтандартнаяОбработка = Ложь) Экспорт
	
	Если ИмяСобытия = "ПриЗаполненииТиповОбъектовИС" Тогда
		//ПриЗаполненииТиповОбъектовИС(ПараметрыСобытия);
		Возврат;
	КонецЕсли;
	
	Если ИмяСобытия = "ПриЗаполненииДокументаУчета" Тогда
		//ПриЗаполненииДокументаУчета(ПараметрыСобытия);
		Возврат;
	КонецЕсли;
	
	Если ИмяСобытия = "ПриЗаполненииОперации" Тогда
		//ПриЗаполненииОперации(ПараметрыСобытия);
		Возврат;
	КонецЕсли;
	
	Если ИмяСобытия = "ПриИзмененииОперации" Тогда
		//ПриИзмененииОперации(ПараметрыСобытия);
		Возврат;
	КонецЕсли;
	
	Если ИмяСобытия = "ПриПолученииПараметровНоменклатуры" Тогда
		//ПриПолученииПараметровНоменклатуры(ПараметрыСобытия, СтандартнаяОбработка);
		Возврат;
	КонецЕсли;
	
	Если ИмяСобытия = "ПриЗагрузкеКодовВНовыйДокументУчета" Тогда
		//ПриЗагрузкеКодовВНовыйДокументУчета(ПараметрыСобытия);
		Возврат;
	КонецЕсли;
	
	Если ИмяСобытия = "ПриЗагрузкеКодовИзВнешнегоИсточника" Тогда
		//ПриЗагрузкеКодовИзВнешнегоИсточника(ПараметрыСобытия);
		Возврат;
	КонецЕсли;
	
	Если ИмяСобытия = "ПриЗагрузкеКодовИзДругогоДокумента" Тогда
		//ПриЗагрузкеКодовИзДругогоДокумента(ПараметрыСобытия, СтандартнаяОбработка);
		Возврат;
	КонецЕсли;
	
	Если ИмяСобытия = "ПриЗаполненииВидовДокументовДляЗагрузкиКодов" Тогда
		//ПриЗаполненииВидовДокументовДляЗагрузкиКодов(ПараметрыСобытия, СтандартнаяОбработка);
		Возврат;
	КонецЕсли;
	
	Если ИмяСобытия = "ПриВыгрузкеКодовВФайл" Тогда
		//ПриВыгрузкеКодовВФайл(ПараметрыСобытия, СтандартнаяОбработка);
		Возврат;
	КонецЕсли;
	
	Если ИмяСобытия = "ПриЗаписиСтатусовДокументаУчета" Тогда
		//ПриЗаписиСтатусовДокументаУчета(ПараметрыСобытия);
		Возврат;
	КонецЕсли;
	
	Если ИмяСобытия = "ВыполнитьРегламентныеДействия" Тогда
		//ВыполнитьРегламентныеДействия(ПараметрыСобытия);
		Возврат;
	КонецЕсли;
	
	Если ИмяСобытия = "ПриНастройкеСпискаДокументов" Тогда
		//ПриНастройкеСпискаДокументов(ПараметрыСобытия, СтандартнаяОбработка);
		Возврат;
	КонецЕсли;
	
	Если ИмяСобытия = "ПриЗаполненииСпискаДокументов" Тогда
		//ПриЗаполненииСпискаДокументов(ПараметрыСобытия);
		Возврат;
	КонецЕсли;
	
	Если ИмяСобытия = "ПриЗаполненииДополнительногоПараметраЭтикетки" Тогда
		//ПриЗаполненииДополнительногоПараметраЭтикетки(ПараметрыСобытия);
		Возврат;
	КонецЕсли;
	
	Если ИмяСобытия = "ПередЗагрузкойКодовИзФайловВДокументУчета" Тогда
		//ПередЗагрузкойКодовИзФайловВДокументУчета(ПараметрыСобытия);
		Возврат;
	КонецЕсли;
	
	Если ИмяСобытия = "ПриЗагрузкеКодовИзФайловВДокументУчета" Тогда
		//ПриЗагрузкеКодовИзФайловВДокументУчета(ПараметрыСобытия, СтандартнаяОбработка);
		Возврат;
	КонецЕсли;
	
	Если ИмяСобытия = "ПриНастройкеДополнительныхКнопок" Тогда
		//ПриНастройкеДополнительныхКнопок(ПараметрыСобытия);
		Возврат;
	КонецЕсли;
	
	Если ИмяСобытия = "ПриНажатииДопКнопкиНаСервере" Тогда
		//ПриНажатииДопКнопкиНаСервере(ПараметрыСобытия);
		Возврат;
	КонецЕсли;
	
	Если ИмяСобытия = "ПриЗаполненииРазвернутойТаблицыУпаковок" Тогда
		//ПриЗаполненииРазвернутойТаблицыУпаковок(ПараметрыСобытия, СтандартнаяОбработка);
		Возврат;
	КонецЕсли;
	
	Если ИмяСобытия = "ПриФормированииСпискаЭтикетокДляПечати" Тогда
		//ПриФормированииСпискаЭтикетокДляПечати(ПараметрыСобытия);
		Возврат;
	КонецЕсли;

	Если ИмяСобытия = "ПриВыполненииЗадачиВОчередиОбмена" Тогда
		//ПриВыполненииЗадачиВОчередиОбмена(ПараметрыСобытия, СтандартнаяОбработка);
		Возврат;
	КонецЕсли;
	
	Если ИмяСобытия = "ПриЗаполненииСведенийОМаркировке" Тогда
		//ПриЗаполненииСведенийОМаркировке(ПараметрыСобытия, СтандартнаяОбработка);
		Возврат;
	КонецЕсли;
	
	Если ИмяСобытия = "ПередОткрытиемРабочегоСтола" Тогда
		//ПередОткрытиемРабочегоСтола(ПараметрыСобытия);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Возвращает дополнительные параметры подключаемого модуля
// 
// Возвращаемое значение:
//  Структура - доп. параметры;
//
Функция ДополнительныеПараметры() Экспорт
	
	Результат = Новый Структура;
	
	Возврат Результат;
	
КонецФункции

// Возвращает безопасные дополнительные параметры подключаемого модуля
// Значения таких параметров можно ввести, но нельзя увидеть
// Хранятся такие параметры в безопасном хранилище
// 
// Возвращаемое значение:
//  Структура - доп. параметры;
//
Функция БезопасныеДополнительныеПараметры() Экспорт
	
	Результат = Новый Структура;
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти СлужебныйПрограммныйИнтерфейс

// #Область ОбработчикиСобытий

// Для описания типов объектов информационной системы
// Используются для типизации полей на формах и т.п.
//
// Параметры:
//  ПараметрыСобытия - Структура - содержит свойства:
//   * Результат - Структура - см. ОсновнойМодуль.Новый_ОписаниеТиповОбъектовИС():
//
Процедура ПриЗаполненииТиповОбъектовИС(ПараметрыСобытия)
	
	Результат = ПараметрыСобытия.Результат;
	
КонецПроцедуры

// Для изменения данных нового документа учета
//
// Параметры:
//  ПараметрыСобытия - Структура - содержит свойства:
//   * Документ1С - ДокументСсылка - связанный документ 1С;
//   * ОписаниеДокумента - Структура - см. НовоеОписаниеДокументаУчета();
//
Процедура ПриЗаполненииДокументаУчета(ПараметрыСобытия)
	
	Документ1С = ПараметрыСобытия.Документ1С;
	ОписаниеДокумента = ПараметрыСобытия.ОписаниеДокумента;
	
	// Пример_ПриЗаполненииДокументаУчета_ВСО(ОписаниеДокумента, Документ1С);
	
КонецПроцедуры

// Для изменения данных операции новой операции
//
// Параметры:
//  ПараметрыСобытия - Структура - содержит свойства:
//   * Документ1С - ДокументСсылка - (необязательный) связанный документ 1С;
//   * ДокументУчета - СправочникСсылка.КонтурМаркировка_ДокументыУчета - (необязательный) документ учета;
//   * ОписаниеОперации - Структура - описание операции;
//   * ТаблицаКодов - ТаблицаЗначений - (необязательный) коллекция кодов операции см. ТаблицаНовыхКодов();
//
Процедура ПриЗаполненииОперации(ПараметрыСобытия)
	
	Документ1С = ПараметрыСобытия.Документ1С;
	ДокументУчета = ПараметрыСобытия.ДокументУчета;
	ОписаниеОперации = ПараметрыСобытия.ОписаниеОперации;
	ТаблицаКодов = ПараметрыСобытия.ТаблицаКодов;
	
	// ПримерКакИзменитьРеквизитыОперации(Операция, Документ1С);
	// Пример_ПриЗаполненииОперации_ВСО(ОписаниеОперации, Документ1С);
	
КонецПроцедуры

// Для дополнения данных при изменении операции пользователем
//
// Параметры:
//  ПараметрыСобытия - Структура - содержит свойства:
//   * ОписаниеОперации - Структура - см. НовоеОписаниеОперации();
//   * ТаблицаКодов - ТаблицаЗначений - коллекция кодов операции, которую можно изменить, см. ТаблицаНовыхКодов();
//   * ДокументУчета - СправочникСсылка.КонтурМаркировка_ДокументыУчета - документ учета;
//   * Документ1С - ДокументСсылка - связанный документ 1С;
//
Процедура ПриИзмененииОперации(ПараметрыСобытия)
	
	ОписаниеОперации = ПараметрыСобытия.ОписаниеОперации;
	ТаблицаКодов = ПараметрыСобытия.ТаблицаКодов;
	ДокументУчета = ПараметрыСобытия.ДокументУчета;
	Документ1С = ПараметрыСобытия.Документ1С;
	
КонецПроцедуры

// Для передачи артикула и штрихкодов номенклатуры 1С
// Необходимо заполнить ПараметрыНоменклатуры
//
// Параметры:
//  ПараметрыСобытия - Структура - содержит свойства:
//   * АналитикаНоменклатуры - Структура - см. ОсновнойМодуль.Новый_АналитикаНоменклатуры1С();
//   * ПараметрыНоменклатуры - Структура - содержит свойства:
//      * Артикул   - Строка - артикул номенклатуры;
//      * Штрихкоды - Массив - массив штрихкодов;
//  СтандартнаяОбработка - Булево - Ложь, если заполнять параметры стандартным образом не нужно;
//
Процедура ПриПолученииПараметровНоменклатуры(ПараметрыСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Номенклатура = ПараметрыСобытия.АналитикаНоменклатуры.Номенклатура;
	Характеристика = ПараметрыСобытия.АналитикаНоменклатуры.Характеристика;
	Упаковка = ПараметрыСобытия.АналитикаНоменклатуры.Упаковка;
	Серия = ПараметрыСобытия.АналитикаНоменклатуры.Серия;
	
	ПараметрыНоменклатуры = ПараметрыСобытия.ПараметрыНоменклатуры;
	
	// ПримерКакПолучитьАртикулНоменклатуры(ПараметрыНоменклатуры, Номенклатура);
	
КонецПроцедуры

// Для добавления кодов в новый документ учета
//
// Параметры:
//  ПараметрыСобытия - Структура - содержит свойства:
//   * Документ1С - ДокументСсылка - связанный документ 1С, в который нужно добавить коды;
//   * ОписаниеДокумента - Структура - описание нового документа учета, см. НовоеОписаниеДокументаУчета();
//   * ТаблицаКодов - Таблица значений - см. ТаблицаНовыхКодов()
//   * ПараметрыЗагрузкиКодов - Структура - см. ПараметрыЗагрузкиНовыхКодовВДокумент()
//
Процедура ПриЗагрузкеКодовВНовыйДокументУчета(ПараметрыСобытия)
	
	ОписаниеДокумента = ПараметрыСобытия.ОписаниеДокумента;
	Документ1С = ПараметрыСобытия.Документ1С;
	ТаблицаКодов = ПараметрыСобытия.ТаблицаКодов;
	ПараметрыЗагрузкиКодов = ПараметрыСобытия.ПараметрыЗагрузкиКодов;
	
	//ПараметрыЗагрузкиКодов.ЗаполнитьТоварыДокумента = Истина;
	// ПримерКакДобавитьКодыИзДокумента1С(ТаблицаКодов, Документ1С);
	// ПримерКакДобавитьПроизвольныеКоды(ТаблицаКодов);
	// Пример_ПриЗагрузкеКодовВНовыйДокументУчета_ВСО(ОписаниеДокумента, Документ1С, ПараметрыСобытия);
	
КонецПроцедуры

// Для загрузки кодов в документ из внешнего источника
// Необходимо заполнить ТаблицаКодов
//
// Параметры:
//  ПараметрыСобытия - Структура - содержит свойства:
//   * Документ1С - ДокументСсылка - связанный документ 1С;
//   * ДокументУчета - СправочникСсылка.КонтурМаркировка_ДокументыУчета - документ учета;
//   * ТаблицаКодов - Таблица значений - см. ТаблицаНовыхКодов()
//   * ПараметрыЗагрузкиКодов - Структура - см. ПараметрыЗагрузкиНовыхКодовВДокумент()
//   * ДопПараметры - Произвольный - дополнительные параметры;
//
Процедура ПриЗагрузкеКодовИзВнешнегоИсточника(ПараметрыСобытия)
	
	Документ1С = ПараметрыСобытия.Документ1С;
	ДокументУчета = ПараметрыСобытия.ДокументУчета;
	ТаблицаКодов = ПараметрыСобытия.ТаблицаКодов;
	ДопПараметры = ПараметрыСобытия.ДопПараметры;
	ПараметрыЗагрузкиКодов = ПараметрыСобытия.ПараметрыЗагрузкиКодов;
	
	// ПримерКакДобавитьКодыИзДокумента1С(ТаблицаКодов, Документ1С);
	// ПримерКакДобавитьПроизвольныеКоды(ТаблицаКодов);
	// Пример_ПриЗагрузкеКодовИзВнешнегоИсточника_ВСО(Документ1С, ДокументУчета, ПараметрыЗагрузкиКодов);
	
КонецПроцедуры

// Для загрузки кодов из другого документа
// Необходимо заполнить ТаблицаКодов
//
// Параметры:
//  ПараметрыСобытия - Структура - содержит свойства:
//   * Документ1С - ДокументСсылка - документ 1С, в который нужно добавить коды;
//   * ДокументУчета - СправочникСсылка.КонтурМаркировка_ДокументыУчета - документ учета,
//                                                         в который нужно добавить коды;
//   * ДругойДокумент1С - ДокументСсылка - документ 1С, из которого нужно взять коды;
//   * ДругойДокументУчета - СправочникСсылка.КонтурМаркировка_ДокументыУчета - документ учета,
//                                                                из которого нужно взять коды;
//   * ТаблицаКодов - Таблица значений - см. ТаблицаНовыхКодов()
//   * ПараметрыЗагрузкиКодов - Структура - см. ПараметрыЗагрузкиНовыхКодовВДокумент()
//  СтандартнаяОбработка - Булево - Ложь, если выполнять стандартную попытку копирования кодов не нужно;
//
Процедура ПриЗагрузкеКодовИзДругогоДокумента(ПараметрыСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Документ1С = ПараметрыСобытия.Документ1С;
	ДокументУчета = ПараметрыСобытия.ДокументУчета;
	ДругойДокумент1С = ПараметрыСобытия.ДругойДокумент1С;
	ДругойДокументУчета = ПараметрыСобытия.ДругойДокументУчета;
	ПараметрыЗагрузкиКодов = ПараметрыСобытия.ПараметрыЗагрузкиКодов;
	ТаблицаКодов = ПараметрыСобытия.ТаблицаКодов;
	
	// ПараметрыЗагрузкиКодов.УдалитьСтарыеКоды = Истина;
	// ПримерКакДобавитьКодыИзДокумента1С(ТаблицаКодов, ДругойДокумент1С);
	// ПримерКакДобавитьПроизвольныеКоды(ТаблицаКодов);
	
КонецПроцедуры

// Для заполнения видов документов, из которых можно загрузить коды
// Необходимо заполнить ВидыДокументовДляВыбора
//
// Параметры:
//  ПараметрыСобытия - Структура - содержит свойства:
//   * Документ1С - ДокументСсылка - связанный документ 1С;
//   * ДокументУчета - СправочникСсылка.КонтурМаркировка_ДокументыУчета - документ учета;
//   * ВидыДокументовДляВыбора - Массив - содержит структуры см. НовоеОписаниеВидаДокументаДляВыбора();
//  СтандартнаяОбработка - Булево - Ложь, если использовать стандартный список всех видов документов не нужно;
//
Процедура ПриЗаполненииВидовДокументовДляЗагрузкиКодов(ПараметрыСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Документ1С = ПараметрыСобытия.Документ1С;
	ДокументУчета = ПараметрыСобытия.ДокументУчета;
	ВидыДокументовДляВыбора = ПараметрыСобытия.ВидыДокументовДляВыбора;
	
	// ПримерКакЗаполнитьВидыДокументовДляВыбора(ВидыДокументовДляВыбора, Документ1С);
	
КонецПроцедуры

// Для изменения файлов выгрузки кодов
// Необходимо заполнить ОписанияФайлов
//
// Параметры:
//  ПараметрыСобытия - Структура - содержит свойства:
//   * ОписанияФайлов - Массив - содержит структуры,см. НовоеОписаниеФайлаДляВыгрузкиКодов();
//   * Документ1С     - ДокументСсылка - (необязательный) связанный документ 1С;
//   * ДокументУчета  - СправочникСсылка.КонтурМаркировка_ДокументыУчета - (необязательный) документ учета;
//   * Операция       - СправочникСсылка.КонтурМаркировка_Операции - (необязательный) операция;
//   * ФорматФайла    - Строка - формат файла, см. Перечисление_ФорматыФайловСКодами();
//   * ТаблицаКодов   - ТаблицаЗначений - содержит колонки:
//      * КодМаркировки - Строка - код без криптохвоста;
//      * ПолныйКод     - Строка - код с криптохвостом;
//      * ТипУпаковки   - ПеречислениеСсылка.КонтурМаркировка_ТипыУпаковок - тип упаковки;
//      * ТипШтрихкода  - ПеречислениеСсылка.КонтурМаркировка_ТипыШтрихкодов - тип штрихкода;
//      * GTIN          - Строка - GTIN;
//      * Товар         - СправочникСсылка.КонтурМаркировка_Товары - товар;
//      * НаименованиеТовара - Строка - наименование товара;
//      * Номенклатура   - СправочникСсылка - номенклатура 1С;
//      * Характеристика - СправочникСсылка - характеристика номенклатуры 1С;
//      * Упаковка       - СправочникСсылка - упаковка;
//      * Серия          - СправочникСсылка - серия;
//      * ПредставлениеНоменклатуры - Строка - представление номенклатуры 1С;
//  СтандартнаяОбработка - Булево - Ложь, если выполнять стандартную выгрузку кодов не нужно;
//
Процедура ПриВыгрузкеКодовВФайл(ПараметрыСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписанияФайлов = ПараметрыСобытия.ОписанияФайлов;
	ФорматФайла = ПараметрыСобытия.ФорматФайла;
	ТаблицаКодов = ПараметрыСобытия.ТаблицаКодов;
	Документ1С = ПараметрыСобытия.Документ1С;
	ДокументУчета = ПараметрыСобытия.ДокументУчета;
	Операция = ПараметрыСобытия.Операция;
	
	// ПримерКакЗаполнитьФайлВыгрузкиКодов(ОписанияФайлов, ТаблицаКодов, ФорматФайла, ДокументУчета);
	
КонецПроцедуры

// Для выполнения действий при изменении статусов документа учета
//
// Параметры:
//  ПараметрыСобытия - Структура - содержит свойства:
//   * Документ1С - ДокументСсылка - связанный документ 1С;
//   * ДокументУчета - СправочникСсылка.КонтурМаркировка_ДокументыУчета - документ учета;
//   * СтатусыДокумента - Структура - статусы документа учета;
//
Процедура ПриЗаписиСтатусовДокументаУчета(ПараметрыСобытия)
	
	Документ1С = ПараметрыСобытия.Документ1С;
	ДокументУчета = ПараметрыСобытия.ДокументУчета;
	СтатусыДокумента = ПараметрыСобытия.СтатусыДокумента;
	
	// ПримерКакПроверитьНаличиеНезавершенныхОпераций(ДокументУчетаСсылка, СтатусыДокумента);
	
КонецПроцедуры

// Для выполнения регламентных действий
//
// Параметры:
//  ПараметрыСобытия - Структура - параметры события
//
Процедура ВыполнитьРегламентныеДействия(ПараметрыСобытия)
	
	//Документы1С = ПримерКакПолучитьДокументы1С();
	//Для Каждого Документ1С Из Документы1С Цикл
	//	
	//	// создание документа учета по документу 1С
	//	ДокументУчета = ПримерКакСоздатьДокументУчета(Документ1С);
	//	
	//	// создание операции заказа кодов по документу 1С
	//	ОперацияЗаказаКодов = ПримерКакЗаказатьНовыеКоды(Документ1С);
	//	
	//	// создание операции отчет о нанесении по документу 1С
	//	ОперацияОтчетОНанесении = ПримерКакСоздатьОтчетОНанесении(Документ1С);
	//	
	//	// создание операции ввод в оборот
	//	ОперацияВводВОборот = ПримерКакСоздатьВводВОборот(Документ1С);
	//	
	//	// выполнение обмена с сервисом по одному документу учета
	//	Организация = ЗначениеРеквизитаОбъекта_Марк(ДокументУчета, "Организация");
	//	ВыполнитьОбменПоОрганизации(Организация, ДокументУчета);
	//	
	//КонецЦикла;
	//
	//// выполнение обмена с сервисом по всем организациям
	//ВыполнитьОбменПоВсемОрганизациям();
	
КонецПроцедуры

// Формирует состав и настройки дополнительных колонок.
// Необходимо заполнить ПараметрыСобытия
//
// Параметры:
//  ПараметрыСобытия - Структура - содержит свойства:
//   * ДопКолонка1 - Структура - содержит свойства:
//      ** Заголовок - Строка - заголовок поля табличной части;
//      ** Видимость - Булево - признак видимости поля;
//      ** ТипКолонки - Строка - строка, содержащая имена типов, разделенных запятыми;
//   * ДопКолонка2 - Структура - см. ДопКолонка1;
//   * ДопКолонка3 - Структура - см. ДопКолонка1;
//   * ТребуетсяОбработкаПриЗаполненияСписка - Булево - Истина, если необходимо передать список в событие ПриЗаполненииСпискаДокументов();
//  СтандартнаяОбработка - Булево - Ложь, если заполнять параметры стандартным образом не нужно.
//
Процедура ПриНастройкеСпискаДокументов(ПараметрыСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	//ДопКолонка1 = ПараметрыСобытия.ДопКолонка1;
	//ДопКолонка1.Заголовок = "Партнер";
	//ДопКолонка1.Видимость = Истина;
	//ДопКолонка1.ТипКолонки = "СправочникСсылка.Контрагенты, СправочникСсылка.Партнеры, Строка";
	
	//ПараметрыСобытия.ТребуетсяОбработкаПриЗаполненияСписка = Истина;
	
КонецПроцедуры

// Для заполнения дополнительных колонок, данными, для которых недостаточно формул в настройках.
//
// Параметры:
//  ПараметрыСобытия - Структура - содержит свойства:
//   * СписокДокументов - ТаблицаЗначений - Таблица со списком документов.
//      ** Номер - Строка - Номер документа 1С;
//      ** Дата - Дата - Дата документа 1С;
//      ** ТипДокумента - Строка - Тип документа 1С;
//      ** Организация - СправочникСсылка.КонтурМаркировка_Организации - Организация документа учета;
//      ** Статус - Строка - Текущий статус документа учета;
//      ** ТребуемоеДействие - Строка - см. Перечисление_ТребуемыеДействия();
//      ** ДокументУчета - СправочникСсылка.КонтурМаркировка_ДокументыУчета - Ссылка на документ учета;
//      ** РаботаЗавершена - Булево - Признак ,что работа с документом завершена;
//      ** Сумма - Число - Сумма документа 1С;
//      ** ТипПоследнейОперации - Строка - Тип последней интерактивной операции по документу учета;
//      ** СтатусПоследнейОперации - Строка - Статус последней интерактивной операции по документу учета;
//      ** НомерСтроки - Число - Номер строки в таблице списка;
//      ** Контрагент - задается в настройке документов учета - Настраиваемое поле, может отличаться у разных документов разных типов;
//      ** Документ1С - ДокументСсылка - Соответсвующий документ 1С;
//      ** Склад - - задается в настройке документов учета -  - настраиваемое поле, может отличаться у разных документов разных типов;
//
Процедура ПриЗаполненииСпискаДокументов(ПараметрыСобытия)
	
	СписокДокументов = ПараметрыСобытия.СписокДокументов;
	
	//Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Документы сданы в бухгалтерию");
	// ПримерДозаполненияСпискаДокументовНужнымДопСвойством(СписокДокументов, Свойство, "ДопКолонка2");
	
КонецПроцедуры

// Для произвольного получения значения дополнительного параметра этикетки
//
// Параметры:
//  ПараметрыСобытия - Структура - параметры события:
//   * ИмяПараметра - Строка - имя параметра;
//   * ЗначениеПараметра - Строка, Неопределено - значение параметра (выходной параметр);
//   * КэшЗначенийПараметра - Соответствие - кэш значений;
//   * ОперацияПечати - СправочникСсылка.КонтурМаркировка_Операции - операция печати;
//   * Организация1С - СправочникСсылка - организация 1С;
//   * Документ1С - ДокументСсылка - документ 1С;
//   * СтрокаЭтикетки - СтрокаТаблицыЗначений - содержит колонки:
//      ** КодАгрегата - Строка - код агрегата;
//      ** КодМаркировки - Строка - код маркировки;
//      ** ТипЭтикетки - ПеречислениеСсылка.КонтурМаркировка_ТипыЭтикеток - тип этикетки;
//      ** ШаблонЭтикетки - СправочникСсылка.КонтурМаркировка_ШаблоныЭтикеток - шаблон этикетки;
//      ** ТипШтрихкода - ПеречислениеСсылка.КонтурМаркировка_ТипыШтрихкодов - тип штрихкода;
//      ** ВидУпаковки - ПеречислениеСсылка.КонтурМаркировка_ВидыУпаковок - вид упаковки;
//      ** Номенклатура - СправочникСсылка - номенклатура;
//      ** Характеристика - СправочникСсылка - характеристика;
//      ** Упаковка - СправочникСсылка - упаковка;
//      ** Серия - СправочникСсылка - серия номенклатуры;
//      ** Товар - СправочникСсылка.КонтурМаркировка_Товары - серия номенклатуры;
//      ** НомерСтрокиДокумента - Число - номер строки документа 1С;
//      ** НомерЭтикеткиПоПорядку - Число - сквозной номер этикетки;
//      ** НомерУпаковкиПоПорядку - Число - сквозной номер коробки;
//      ** НомерУпаковки - число - номер коробки, в которую входит этикетка;
//
Процедура ПриЗаполненииДополнительногоПараметраЭтикетки(ПараметрыСобытия)
	
	ИмяПараметра = ПараметрыСобытия.ИмяПараметра;
	СтрокаЭтикетки = ПараметрыСобытия.СтрокаЭтикетки;
	КэшЗначенийПараметра = ПараметрыСобытия.КэшЗначенийПараметра;
	ОперацияПечати = ПараметрыСобытия.ОперацияПечати;
	Организация1С = ПараметрыСобытия.Организация1С;
	Документ1С = ПараметрыСобытия.Документ1С;
	
	//Результат = ПримерКакЗаполнитьДополнительныйПараметрЭтикеткиРазмер(ИмяПараметра, СтрокаЭтикетки, КэшЗначенийПараметра);
	//Если ЗначениеЗаполнено(Результат) Тогда
	//	ПараметрыСобытия.ЗначениеПараметра = Результат;
	//КонецЕсли;
	
КонецПроцедуры

// Для изменения параметров диалога выбора перед загрузкой кодов в документ учета из файлов
//
// Параметры:
//  ПараметрыСобытия - Структура - параметры события:
//   * Документ1С - ДокументСсылка - связанный документ 1С;
//   * ДокументУчета - СправочникСсылка.КонтурМаркировка_ДокументыУчета - документ учета;
//   * ПараметрыВыбораФайлов - Структура - параметры диалога выбора файлов,
//                                         см. функцию Новый_ПараметрыДиалогаВыбора();
//
Процедура ПередЗагрузкойКодовИзФайловВДокументУчета(ПараметрыСобытия)
	
	Документ1С = ПараметрыСобытия.Документ1С;
	ДокументУчета = ПараметрыСобытия.ДокументУчета;
	ПараметрыВыбораФайлов = ПараметрыСобытия.ПараметрыВыбораФайлов;
	
	// пример для выбора файлов
	//ПараметрыВыбораФайлов.Каталог = "\\share\marking-codes";
	//ПараметрыВыбораФайлов.Фильтр = "Текстовый документ (*.txt)|*.txt|Текстовый документ с разделителями (*.csv)|*.csv";
	
КонецПроцедуры

// Для загрузки кодов в документ из файлов. Необходимо заполнить ТаблицаКодов.
//
// Параметры:
//  ПараметрыСобытия - Структура - параметры события:
//   * Документ1С - ДокументСсылка - связанный документ 1С;
//   * ДокументУчета - СправочникСсылка.КонтурМаркировка_ДокументыУчета - документ учета;
//   * ОписанияФайлов - Массив - см. функцию МодульКлиента().ОписанияФайлов();
//   * ПараметрыВыбораФайлов - Структура - параметры диалога выбора файлов,
//                                         см. функцию МодульКлиента().Новый_ПараметрыДиалогаВыбораФайла();
//   * ТаблицаКодов - Таблица значений - см. ТаблицаНовыхКодов()
//   * ПараметрыЗагрузкиКодов - Структура - см. ПараметрыЗагрузкиНовыхКодовВДокумент()
//  СтандартнаяОбработка - Булево - Ложь, если использовать стандартную загрузку не нужно;
//
Процедура ПриЗагрузкеКодовИзФайловВДокументУчета(ПараметрыСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Документ1С = ПараметрыСобытия.Документ1С;
	ДокументУчета = ПараметрыСобытия.ДокументУчета;
	ОписанияФайлов = ПараметрыСобытия.ОписанияФайлов;
	ПараметрыВыбораФайлов = ПараметрыСобытия.ПараметрыВыбораФайлов;
	ТаблицаКодов = ПараметрыСобытия.ТаблицаКодов;
	ПараметрыЗагрузкиКодов = ПараметрыСобытия.ПараметрыЗагрузкиКодов;
	
	ПараметрыЗагрузкиКодов.УдалитьСтарыеКоды = Истина;
	Для Каждого ОписаниеФайла Из ОписанияФайлов Цикл
		Если ОписаниеФайла.Расширение = ".csv" Тогда
			ПримерКакЗагрузитьКодыИзCsvФайла(ТаблицаКодов, ОписаниеФайла.Расширение, ОписаниеФайла.ДвоичныеДанные);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Для описания состава дополнительных кнопок, которые нужно добавить в модуле
// Необходимо заполнить ПараметрыСобытия.НастройкиДопКнопок
//
// Параметры:
//  ПараметрыСобытия - Структура - содержит свойства:
//   * НастройкиДопКнопок - Массив - содержит структуры, см. НоваяНастройкаДопКнопки()
//
Процедура ПриНастройкеДополнительныхКнопок(ПараметрыСобытия)
	
	НастройкиДопКнопок = ПараметрыСобытия.НастройкиДопКнопок;
	
	//ПримерНастройкиДополнительныхКнопок(НастройкиДопКнопок);
	
КонецПроцедуры

// Для обработки на сервере нажатие дополнительной кнопки
//
// Параметры:
//  ПараметрыСобытия - Структура - содержит:
//   * ИмяКнопки - Строка - имя кнопки;
//   * Размещение - Строка - см. Перечисление_РазмещениеДополнительныхКнопок();
//   * ДопСведения - Структура - содержит:
//      ** ВыбранныеДокументы - Массив - документы учета выделенные в списке документов на основной форме;
//      ** ДокументУчета - СправочникСсылка.КонтурМаркировка_ДокументыУчета - документ учета;
//      ** Документ1С - ДокументСсылка - документ 1С;
//      ** Операция - СправочникСсылка.КонтурМаркировка_Операции - операция;
//      ** ТипОперации -Строка - см. Перечисление_ТипыОпераций();
//   * ДопПараметры - Структура - дополнительные параметры, которые можно получить
//         из события ПриНажатииДопКнопкиНаКлиенте и передать в событие ПослеНажатияДопКнопкиНаКлиенте;
//
Процедура ПриНажатииДопКнопкиНаСервере(ПараметрыСобытия)
	
	ИмяКнопки = ПараметрыСобытия.ИмяКнопки;
	Размещение = ПараметрыСобытия.Размещение;
	ДопСведения = ПараметрыСобытия.ДопСведения;
	ДопПараметры = ПараметрыСобытия.ДопПараметры;
	
	ВыбранныеДокументы = ДопСведения.ВыбранныеДокументы;
	ВыбранныеДокументы1С = ДопСведения.ВыбранныеДокументы1С;
	ДокументУчета = ДопСведения.ДокументУчета;
	Документ1С = ДопСведения.Документ1С;
	Операция = ДопСведения.Операция;
	
КонецПроцедуры

// Для заполнения развернутой таблицы упаковок и передачи в документ ЭДО Диадока
// Нужно заполнить ПараметрыСобытия.РазвернутаяТаблицаУпаковок
//
// Возвращает таблицу упаковок и кодов маркировки с номенклатурой
// (характеристикой, серией), которая в них входит
//
// Параметры:
//  ПараметрыСобытия - Структура - содержит:
//   * Документы1С - Массив - содержит документы, по которым нужно заполнить таблицу;
//   * ОшибкиЗаполнения - Массив - содержит структуры см. НовоеОписаниеОшибкиРазвернутойТаблицыУпаковок();
//   * ПроверитьЗавершениеРаботыСКодами - Булево - Истина, если нужно проверить, что работа с кодами завершена;
//   * РазвернутаяТаблицаУпаковок - ТаблицаЗначений - таблица упаковок с товарами, содержит колонки:
//      ** Ссылка - ДокументСсылка - документ-владелец штрихкода;
//      ** Штрихкод - СправочникСсылка.КонтурМаркировка_КодыУпаковок - ссылка на код упаковки;
//      ** Номенклатура - СправочникСсылка - Номенклатура;
//      ** Характеристика - СправочникСсылка - Характеристика;
//      ** Серия - СправочникСсылка - Серия;
//      ** ЗначениеШтрихкода - Строка - код маркировки или строка объемно-сортового учета;
//      ** Мультитоварная - Булево - признак мультитоварной упаковки;
//      ** ВидПродукции - Перечислениессылка.КонтурМаркировка_ВидыПродукции - вид продукции;
//      ** ВидУпаковки - ПеречислениеСсылка.КонтурМаркировка_ВидыУпаковок - вид упаковки;
//  СтандартнаяОбработка - Булево - Ложь, если использовать стандартное заполнение не нужно;
//
Процедура ПриЗаполненииРазвернутойТаблицыУпаковок(ПараметрыСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Документы1С = ПараметрыСобытия.Документы1С;
	ОшибкиЗаполнения = ПараметрыСобытия.ОшибкиЗаполнения;
	ПроверитьЗавершениеРаботыСКодами = ПараметрыСобытия.ПроверитьЗавершениеРаботыСКодами;
	РазвернутаяТаблицаУпаковок = ПараметрыСобытия.РазвернутаяТаблицаУпаковок;
	
КонецПроцедуры

// Для изменения шаблона или параметров этикеток
//
// Параметры:
//  ПараметрыСобытия - Структура - содержит:
//   * Документ1С - ДокументСсылка - документ 1С;
//   * Организация1С - СправочникСсылка - организация 1С;
//   * ОперацияПечати - СправочникСсылка.КонтурМаркировка_Операции - операция печати;
//   * ТаблицаЭтикеток - ТаблицаЗначений - содержит колонки:
//      ** КодАгрегата - Строка - код агрегата;
//      ** КодМаркировки - Строка - код маркировки;
//      ** ТипЭтикетки - ПеречислениеСсылка.КонтурМаркировка_ТипыЭтикеток - тип этикетки;
//      ** ШаблонЭтикетки - СправочникСсылка.КонтурМаркировка_ШаблоныЭтикеток - шаблон этикетки;
//      ** ТипШтрихкода - ПеречислениеСсылка.КонтурМаркировка_ТипыШтрихкодов - тип штрихкода;
//      ** ВидУпаковки - ПеречислениеСсылка.КонтурМаркировка_ВидыУпаковок - вид упаковки;
//      ** Номенклатура - СправочникСсылка - номенклатура;
//      ** Характеристика - СправочникСсылка - характеристика;
//      ** Упаковка - СправочникСсылка - упаковка;
//      ** Серия - СправочникСсылка - серия номенклатуры;
//      ** Товар - СправочникСсылка.КонтурМаркировка_Товары - серия номенклатуры;
//      ** НомерСтрокиДокумента - Число - номер строки документа 1С;
//      ** НомерЭтикеткиПоПорядку - Число - сквозной номер этикетки;
//      ** НомерУпаковкиПоПорядку - Число - сквозной номер коробки;
//      ** НомерУпаковки - число - номер коробки, в которую входит этикетка;
//
Процедура ПриФормированииСпискаЭтикетокДляПечати(ПараметрыСобытия)
	
	Документ1С = ПараметрыСобытия.Документ1С;
	ТаблицаЭтикеток = ПараметрыСобытия.ТаблицаЭтикеток;
	
КонецПроцедуры

// Для выполнения нестандартного обмена с сервисом
//
// Параметры:
//  ПараметрыСобытия - Структура - содержит:
//   * ТипБизнесПроцесса - Строка - см. Перечисление_ТипыБизнесПроцессовОчередиОбмена();
//   * ОписаниеЗадачи - Структура - содержит:
//      ** Операция                - СправочникСсылка.КонтурМаркировка_Операции - операция;
//      ** Организация             - СправочникСсылка.КонтурМаркировка_Организации - организация;
//      ** ДатаПостановки          - Дата   - дата записи в очередь текущего действия;
//      ** ДатаНачалаВыполнения    - Дата   - дата начала выполнения текущего действия;
//      ** ТребуемоеДействие       - Строка - действие, которое нужно выполнить см. Перечисление_ТребуемыеДействия();
//      ** ИдентификаторДокумента  - Строка - идентификатор документа в сервисе;
//      ** СтатусДокументаВСервисе - Строка - статус документа в сервисе;
//      ** ОписаниеОшибки          - Строка, ИнформацияОбОшибке - подбробное описание ошибки или ИнформацияОбОшибке();
//      ** ПредыдущееДействие      - Строка - предыдущее действие, которое было выполнено;
//      ** НовоеДействие           - Строка - следующее действие, которое нужно будет выполнить, см. Перечисление_ТребуемыеДействия();
//      ** НовыйСтатусОперации     - Строка - новый статус, который нужно установить в операции, см. Перечисление_СтатусыОпераций();
//      ** ДопРеквизиты - Структура - содержит:
//          *** ПредыдущийКод               - Строка    - используется при загрузке очередной порции заказа кодов;
//          *** КраткоеОписаниеОшибки       - Строка    - краткое описание ошибки для отображения в шапке операции;
//          *** ДатаОбновленияСтатусовКодов - Дата      - используется при ожидании подходящего статуса кодов при вводе в оборот;
//          *** ПроизвольныеДопРеквизиты    - Структура - для хранения произвольных данных в течении всего обмена, сохраняется в базе;
//  СтандартнаяОбработка - Булево - Ложь, если стандартный обмен использовать не нужно;
//
Процедура ПриВыполненииЗадачиВОчередиОбмена(ПараметрыСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТипБизнесПроцесса = ПараметрыСобытия.ТипБизнесПроцесса;
	ОписаниеЗадачи = ПараметрыСобытия.ОписаниеЗадачи;
	
КонецПроцедуры

// Для заполнения сведений о маркировке во входящей таблице товаров ЭДО Диадока
// Нужно заполнить ПараметрыСобытия.ТоварыДокументов
//
// Заполняет в таблице ТоварыДокумента колонку СведенияОМаркировке
//
// Параметры:
//  ПараметрыСобытия - Структура - содержит:
//   * ОшибкиЗаполнения - Массив - содержит структуры см. НовоеОписаниеОшибкиРазвернутойТаблицыУпаковок();
//   * ПроверитьЗавершениеРаботыСКодами - Булево - Истина, если нужно проверить, что работа с кодами завершена;
//   * РазвернутаяТаблицаУпаковок - ТаблицаЗначений - таблица упаковок с товарами, содержит колонки:
//   * ТоварыДокументов - ТаблицаЗначений - содержит строки товаров документов, по которым нужно заполнить таблицу;
//      ** Номенклатура        - СправочникСсылка - содержимое;
//      ** Характеристика      - СправочникСсылка - содержимое;
//      ** Серия               - СправочникСсылка - содержимое;
//      ** Количество          - Число - количество в строке (ограничивает привязанные строки маркировки).
//      ** Упаковка            - СправочникСсылка - упаковка или единица измерения;
//      ** ПервичныйДокумент   - ДокументСсылка - ссылка на первичный документ;
//      ** КодТоварнойГруппы   - Число - код товарной группы в ГИС МТ, см. СоответствиеВидовПродукцииИКодовТоварныхГруппГИСМТ() в ядре
//      ** СведенияОМаркировке - ТаблицаЗначений - ссылка на первичный документ;
//         ** ЗначениеШтрихкода - Строка - код маркировки товара;
//         ** ВидУпаковки       - ПеречислениеСсылка.КонтурМаркировка_ВидыУпаковок - вид упаковки товара;
//         ** GTIN              - Строка - код товара, заполняется только для ОСУ;
//         ** Количество        - Число - количество в единицах учета, указанное в коде ОСУ;
//  СтандартнаяОбработка - Булево - Ложь, если стандартный обмен использовать не нужно;
//
Процедура ПриЗаполненииСведенийОМаркировке(ПараметрыСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОшибкиЗаполнения = ПараметрыСобытия.ОшибкиЗаполнения;
	ТоварыДокументов = ПараметрыСобытия.ТоварыДокументов;
	ПроверитьЗавершениеРаботыСКодами = ПараметрыСобытия.ПроверитьЗавершениеРаботыСКодами;
	
КонецПроцедуры

// Позволяет отключить рабочий стол
//
// Параметры:
//  ПараметрыСобытия - Структура - содержит:
//   * ОтключитьРабочийСтол - Булево - Истина, если вместо рабочего стола нужно открыть форму модуля;
//
Процедура ПередОткрытиемРабочегоСтола(ПараметрыСобытия)
	
	ПараметрыСобытия.ОтключитьРабочийСтол = Истина;
	
КонецПроцедуры

// #КонецОбласти ОбработчикиСобытий

// #Область Примеры

// Пример добавления произвольных кодов
//
// Параметры:
//  ТаблицаКодов - Таблица значений - см. ТаблицаНовыхКодов()
//
Процедура ПримерКакДобавитьПроизвольныеКоды(ТаблицаКодов)
	
	// Код агрегата
	НовыйАгрегат = ТаблицаКодов.Добавить();
	НовыйАгрегат.КодМаркировки = "046024433130000011";
	НовыйАгрегат.ВидПродукции = Перечисления.КонтурМаркировка_ВидыПродукции.Обувь;
	НовыйАгрегат.ВидУпаковки = Перечисления.КонтурМаркировка_ВидыУпаковок.Логистическая;
	НовыйАгрегат.ТипУпаковки = Перечисления.КонтурМаркировка_ТипыУпаковок.МонотоварнаяУпаковка;
	НовыйАгрегат.ТипШтрихкода = Перечисления.КонтурМаркировка_ТипыШтрихкодов.SSCC;
	
	// Вложенные коды агрегата
	НовыйКод = ТаблицаКодов.Добавить();
	НовыйКод.GTIN = "04620056093779";
	НовыйКод.КодМаркировки = "010462005609377921GRK_Xj8sH<3.d";
	НовыйКод.ВидПродукции = Перечисления.КонтурМаркировка_ВидыПродукции.Обувь;
	НовыйКод.ВидУпаковки = Перечисления.КонтурМаркировка_ВидыУпаковок.Потребительская;
	НовыйКод.ТипУпаковки = Перечисления.КонтурМаркировка_ТипыУпаковок.МаркированныйТовар;
	НовыйКод.ТипШтрихкода = Перечисления.КонтурМаркировка_ТипыШтрихкодов.GS1_DataMatrix;
	НовыйКод.КодАгрегата = НовыйАгрегат.КодМаркировки; //код родительской упаковки
	
	НовыйКод = ТаблицаКодов.Добавить();
	НовыйКод.GTIN = "04620056093779";
	НовыйКод.КодМаркировки = "010462005609377921R2Rf?zm!FqM'S";
	НовыйКод.ВидПродукции = Перечисления.КонтурМаркировка_ВидыПродукции.Обувь;
	НовыйКод.ВидУпаковки = Перечисления.КонтурМаркировка_ВидыУпаковок.Потребительская;
	НовыйКод.ТипУпаковки = Перечисления.КонтурМаркировка_ТипыУпаковок.МаркированныйТовар;
	НовыйКод.ТипШтрихкода = Перечисления.КонтурМаркировка_ТипыШтрихкодов.GS1_DataMatrix;
	НовыйКод.КодАгрегата = НовыйАгрегат.КодМаркировки; //код родительской упаковки
	
	// Агрегированный таможенный код (АТК)
	НовыйАТК = ТаблицаКодов.Добавить();
	НовыйАТК.КодМаркировки = "00860316332023092308Dhg3O";
	НовыйАТК.ВидПродукции = Перечисления.КонтурМаркировка_ВидыПродукции.Молоко;
	НовыйАТК.ВидУпаковки = Перечисления.КонтурМаркировка_ВидыУпаковок.Логистическая;
	НовыйАТК.ОбщийТипУпаковки = Перечисления.КонтурМаркировка_ОбщиеТипыУпаковок.АТК;
	НовыйАТК.ТипШтрихкода = Перечисления.КонтурМаркировка_ТипыШтрихкодов.GS1_128;
	
	// Вложенные коды агрегата
	НовыйКод = ТаблицаКодов.Добавить();
	НовыйКод.GTIN = "04602443313288";
	НовыйКод.КодМаркировки = "0104602443313288215KZwZO";
	НовыйКод.ВидПродукции = Перечисления.КонтурМаркировка_ВидыПродукции.Молоко;
	НовыйКод.ВидУпаковки = Перечисления.КонтурМаркировка_ВидыУпаковок.Потребительская;
	НовыйКод.ТипУпаковки = Перечисления.КонтурМаркировка_ТипыУпаковок.МаркированныйТовар;
	НовыйКод.ТипШтрихкода = Перечисления.КонтурМаркировка_ТипыШтрихкодов.GS1_DataMatrix;
	НовыйКод.КодАгрегата = НовыйАТК.КодМаркировки; //код родительской упаковки
	
КонецПроцедуры

// Пример добавления кодов маркировки из документа
//
// Параметры:
//  ТаблицаКодов - Таблица значений - см. ТаблицаНовыхКодов()
//  Документ1С - ДокументСсылка - документ 1С
//
Процедура ПримерКакДобавитьКодыИзДокумента1С(ТаблицаКодов, Документ1С)
	
	ТаблицаКодовДокумента = КодыМаркировкиИзДокумента1С(Документ1С);
	
	Для каждого Стр Из ТаблицаКодовДокумента Цикл
		
		СтрокаКода = ТаблицаКодов.Добавить();
		
		СтрокаКода.КодМаркировки = Стр.ЗначениеШтрихкода;
		СтрокаКода.ВидПродукции = Перечисления.КонтурМаркировка_ВидыПродукции.Обувь;
		СтрокаКода.ВидУпаковки = Перечисления.КонтурМаркировка_ВидыУпаковок.Потребительская;
		СтрокаКода.ТипУпаковки = Перечисления.КонтурМаркировка_ТипыУпаковок.МаркированныйТовар;
		СтрокаКода.ТипШтрихкода = Перечисления.КонтурМаркировка_ТипыШтрихкодов.GS1_DataMatrix;
		
		СтрокаКода.Номенклатура = Стр.Номенклатура;
		СтрокаКода.Характеристика = Стр.Характеристика;
		СтрокаКода.Упаковка = Стр.Упаковка;
		СтрокаКода.Серия = Стр.Серия;
		
	КонецЦикла;
	
КонецПроцедуры

Функция КодыМаркировкиИзДокумента1С(Документ1С)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СпрКодов.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
	|	СпрКодов.Номенклатура КАК Номенклатура,
	|	СпрКодов.Характеристика КАК Характеристика,
	|	СпрКодов.Упаковка КАК Упаковка,
	|	СпрКодов.Серия КАК Серия
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.ШтрихкодыУпаковок КАК ТЧ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК СпрКодов
	|		ПО ТЧ.ШтрихкодУпаковки = СпрКодов.Ссылка
	|ГДЕ
	|	ТЧ.Ссылка = &Документ1С");
	
	Запрос.УстановитьПараметр("Документ1С", Документ1С);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

Процедура ПримерКакЗаполнитьФайлВыгрузкиКодов(ОписанияФайлов, ТаблицаКодов, ФорматФайла, ДокументУчета)
	
	ОписаниеФайла = НовоеОписаниеФайлаДляВыгрузкиКодов();
	
	Если ФорматФайла = Перечисление_ФорматыФайловСКодами().xlsx Тогда
		ОписаниеФайла.ДобавитьЗаголовкиКолонок = Истина;
	КонецЕсли;
	
	КодДата = ЗначенияРеквизитовОбъекта_Марк(ДокументУчета, "Код, Дата");
	ИмяФайла = ПараметрыВСтроку("Mark_%1_%2", КодДата.Код, Формат(КодДата.Дата, "ДФ=dd-MM-yyyy"));
	
	ОписаниеФайла.ИмяФайлаБезРасширения = ИмяФайла;
	ОписаниеФайла.ТаблицаСтрок.Колонки.Добавить("GTIN", , "GTIN");
	ОписаниеФайла.ТаблицаСтрок.Колонки.Добавить("НаименованиеТовара", , "Наименование");
	ОписаниеФайла.ТаблицаСтрок.Колонки.Добавить("КодМаркировки", , "Код маркировки");
	
	Для каждого Стр Из ТаблицаКодов Цикл
		
		Если ЗначениеЗаполнено(Стр.ПолныйКод) Тогда
			КодМаркировки = Стр.ПолныйКод;
		ИначеЕсли ЗначениеЗаполнено(Стр.КодМаркировки) Тогда
			КодМаркировки = Стр.КодМаркировки;
		Иначе
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Стр.ПредставлениеНоменклатуры) Тогда
			НаименованиеТовара = Стр.ПредставлениеНоменклатуры;
		ИначеЕсли ЗначениеЗаполнено(Стр.НаименованиеТовара) Тогда
			НаименованиеТовара = Стр.НаименованиеТовара;
		Иначе
			Продолжить;
		КонецЕсли;
		
		СтрокаФайла = ОписаниеФайла.ТаблицаСтрок.Добавить();
		СтрокаФайла.GTIN = Стр.GTIN;
		СтрокаФайла.НаименованиеТовара = НаименованиеТовара;
		СтрокаФайла.КодМаркировки = КодМаркировки;
		
	КонецЦикла;
	
	ОписанияФайлов.Добавить(ОписаниеФайла);
	
КонецПроцедуры

Процедура ПримерКакЗаполнитьВидыДокументовДляВыбора(ВидыДокументовДляВыбора, Документ1С)
	
	Организация1С = ЗначениеРеквизитаОбъекта_Марк(Документ1С, "Организация");
	
	// РТУ
	МетаданныеДокумента = Метаданные.Документы.РеализацияТоваровУслуг;
	ОписаниеВида = НовоеОписаниеВидаДокументаДляВыбора();
	ОписаниеВида.Представление = МетаданныеДокумента.Синоним;
	ОписаниеВида.ПолноеИмяОбъекта = МетаданныеДокумента.ПолноеИмя();
	ОписаниеВида.ПараметрыФормы.Отбор.Вставить("Организация", Организация1С);
	ВидыДокументовДляВыбора.Добавить(ОписаниеВида);
	
	// ПТУ
	МетаданныеДокумента = Метаданные.Документы.ПриобретениеТоваровУслуг;
	ОписаниеВида = НовоеОписаниеВидаДокументаДляВыбора();
	ОписаниеВида.Представление = МетаданныеДокумента.Синоним;
	ОписаниеВида.ИмяФормыВыбора = МетаданныеДокумента.Формы.ФормаВыбора.Имя;
	ОписаниеВида.ПолноеИмяОбъекта = МетаданныеДокумента.ПолноеИмя();
	ОписаниеВида.ПараметрыФормы.Отбор.Вставить("Организация", Организация1С);
	ВидыДокументовДляВыбора.Добавить(ОписаниеВида);
	
КонецПроцедуры

Процедура ПримерКакИзменитьРеквизитыОперации(Операция, Документ1С)
	
	Если Операция.ТипОперации = Перечисление_ТипыОпераций().ВыводИзОборота
		И ТипЗнч(Документ1С) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		
		Реквизиты = ЗначенияРеквизитовОбъекта_Марк(Документ1С, "Номер, Дата");
		
		Операция.ДопРеквизиты.НомерДокумента = Реквизиты.Номер;
		Операция.ДопРеквизиты.ДатаДокумента = Реквизиты.Дата;
		Операция.ДопРеквизиты.НаименованиеПервичногоДокумента = "Заказ наряд";
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПримерКакПолучитьАртикулНоменклатуры(ПараметрыНоменклатуры, Номенклатура)
	
	ПараметрыНоменклатуры.Артикул = ЗначениеРеквизитаОбъекта_Марк(Номенклатура, "Артикул");
	
КонецПроцедуры

Процедура ПримерКакПроверитьНаличиеНезавершенныхОпераций(ДокументУчета, СтатусыДокумента)
	
	Если СтатусыДокумента.ОсновнойСтатус <> Перечисление_СтатусыДокументовУчета().Завершен Тогда
		Возврат;
	КонецЕсли;
	
	ПодходящиеТипы = Новый Массив;
	ПодходящиеТипы.Добавить(Перечисление_ТипыОпераций().ВыводИзОборота);
	СписокОпераций = ОперацииДокумента(ДокументУчета, ПодходящиеТипы, Неопределено);
	
	Для каждого Стр Из СписокОпераций Цикл
		Если Стр.Статус <> Перечисление_СтатусыОпераций().ОперацияЗавершена Тогда
			ВызватьИсключение ПараметрыВСтроку(НСтр(
			"ru = 'По документу учета есть незавершенная операция: %1'"), Стр.ОперацияСсылка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПримерДозаполненияСпискаДокументовНужнымДопСвойством(СписокДокументовУчета, НужноеСвойство, ИмяДопКолонки)
	
	Если Не ЗначениеЗаполнено(СписокДокументовУчета) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ЗАпрос.Текст = 
	"ВЫБРАТЬ
	|	ТабДок.Документ1С КАК Документ1С,
	|	ТабДок.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ТабДок
	|ИЗ
	|	&СписокДокументовУчета КАК ТабДок
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Документ1С
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабДок.Документ1С КАК Документ1С,
	|	ТабДок.НомерСтроки КАК НомерСтроки,
	|	ДопСведения.Значение КАК Значение
	|ИЗ
	|	ТабДок КАК ТабДок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДопСведения
	|		ПО ТабДок.Документ1С = ДопСведения.Объект
	|			И (ДопСведения.Свойство = &НужноеСвойство)";
	Запрос.УстановитьПараметр("СписокДокументовУчета", СписокДокументовУчета);
	Запрос.УстановитьПараметр("НужноеСвойство", НужноеСвойство);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СписокДокументовУчета[Выборка.НомерСтроки - 1][ИмяДопКолонки] = Выборка.Значение;
	КонецЦикла;
	
КонецПроцедуры

// Выбирает из базы документы Реализация товаров и услуг по сопоставленным организациям
// 
// Возвращаемое значение:
//  Массив из ДокументСсылка.РеализацияТоваровУслуг - документы реализации
//
Функция ПримерКакПолучитьДокументы1С()
	
	Результат = Новый Массив;
	
	НачалоПериода = НачалоДня(ТекущаяДатаСеанса());
	КонецПериода = КонецДня(НачалоПериода);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КонтурМаркировка_Организации КАК КонтурМаркировка_Организации
	|		ПО Т.Организация = КонтурМаркировка_Организации.Организация1С
	|ГДЕ
	|	Т.Дата МЕЖДУ &НачалоПериода И &КонецПериода");
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Создает по документу 1С документ учета и начинает по нему работу
// Если документ учета уже был создан - вернет ссылку на него
//
// Параметры:
//  Документ1С - ДокументСсылка - документ 1С
// 
// Возвращаемое значение:
//  СправочникСсылка.КонтурМаркировка_ДокументыУчета - документ учета
//
Функция ПримерКакСоздатьДокументУчета(Документ1С)
	
	ДокументУчета = НайтиДокументУчетаПоДокументу1С(Документ1С);
	Если ЗначениеЗаполнено(ДокументУчета) Тогда
		// по переданному документу 1С уже создан документ учета
		Возврат ДокументУчета;
	КонецЕсли;
	
	НачатьРаботуСДокументом = Истина;
	ДокументУчета = СоздатьДокументУчетаПоДокументу1С(Документ1С, НачатьРаботуСДокументом);
	
	ОшибкиЗаполнения = ПроверитьЗаполнениеДокументаУчета(ДокументУчета);
	Если ЗначениеЗаполнено(ОшибкиЗаполнения) Тогда
		
		МассивОшибок = Новый Массив;
		Для Каждого ОписаниеОшибки Из ОшибкиЗаполнения Цикл
			Если ЗначениеЗаполнено(ОписаниеОшибки.ИмяТаблицы) Тогда
				ШаблонСообщения = ("ru = 'В таб. части ""%1"" в строке %2: %3'");
				ТекстСообщения = ПараметрыВСтроку(ШаблонСообщения, ОписаниеОшибки.ИмяТаблицы, ОписаниеОшибки.НомерСтроки, ОписаниеОшибки.ТекстОшибки);
				МассивОшибок.Добавить(ТекстСообщения);
			Иначе
				МассивОшибок.Добавить(ОписаниеОшибки.ТекстОшибки);
			КонецЕсли;
		КонецЦикла;
		
		ТекстОшибки = СоединитьСтроку(МассивОшибок, Символы.ПС);
		Действие = НСтр("ru = 'Создание документа учета через ПМ'");
		ШаблонСообщения = Нстр("ru = 'Не удалось создать документ учета по документу %1'");
		ТекстСообщения = ПараметрыВСтроку(ШаблонСообщения, Документ1С);
		ОбработатьОшибку(Действие, ТекстОшибки, Документ1С, ТекстСообщения);
		
	КонецЕсли;
	
	Возврат ДокументУчета;
	
КонецФункции

// Создает по документу 1С операцию заказа кодов.
// Если по документу существуют операции заказа кодов - вернет первую
//
// Параметры:
//  Документ1С - ДокументСсылка - документ 1С
// 
// Возвращаемое значение:
//  СправочникСсылка.КонтурМаркировка_Операции - операция
//
Функция ПримерКакЗаказатьНовыеКоды(Документ1С)
	
	ТипОперации = Перечисление_ТипыОпераций().ЗаказКодов;
	МассивОпераций = ОперацииПоДокументу(Документ1С, ТипОперации);
	Если ЗначениеЗаполнено(МассивОпераций) Тогда
		// операция заказа кодов создана
		Возврат МассивОпераций[0];
	КонецЕсли;
	
	Операция = СоздатьОперациюПоДокументу(Документ1С, ТипОперации);
	// заполнить способ выпуска товаров можно в событии ПриЗаполненииОперации
	
	Возврат Операция;
	
КонецФункции

// Создает по документу 1С операцию отчет о нанесении.
// Обновляет статусы кодов, проверяет возможность формирования отчета о нанесении.
//
// Параметры:
//  Документ1С - ДокументСсылка - документ 1С
// 
// Возвращаемое значение:
//  СправочникСсылка.КонтурМаркировка_Операции - операция
//
Функция ПримерКакСоздатьОтчетОНанесении(Документ1С)
	
	// первым делом обновим статусы кодов
	ОбновитьСтатусыКодовДокумента(Документ1С);
	
	Если Не МожноСформироватьОтчетОНанесенииПоДокументу(Документ1С) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТипОперации = Перечисление_ТипыОпераций().ОтчетОНанесении;
	МассивОпераций = ОперацииПоДокументу(Документ1С, ТипОперации);
	Если ЗначениеЗаполнено(МассивОпераций) Тогда
		// операция отчет о нанесении создана
		Возврат МассивОпераций[0];
	КонецЕсли;
	
	Операция = СоздатьОперациюПоДокументу(Документ1С, ТипОперации);
	// заполнить реквизиты операции можно в событии ПриЗаполненииОперации
	
КонецФункции

// Создает по документу 1С операцию ввода в оборот
//
// Параметры:
//  Документ1С - ДокументСсылка - документ 1С
// 
// Возвращаемое значение:
//  СправочникСсылка.КонтурМаркировка_Операции - операция
//
Функция ПримерКакСоздатьВводВОборот(Документ1С)
	
	ТипОперации = Перечисление_ТипыОпераций().ВводВОборот;
	МассивОпераций = ОперацииПоДокументу(Документ1С, ТипОперации);
	Если ЗначениеЗаполнено(МассивОпераций) Тогда
		// операция ввод в оборот создана
		Возврат МассивОпераций[0];
	КонецЕсли;
	
	Операция = СоздатьОперациюПоДокументу(Документ1С, ТипОперации);
	// заполнить реквизиты операции можно в событии ПриЗаполненииОперации
	
КонецФункции

// Получает значение дополнительного реквизита "Размер" одной из связанных с товаром номенклатуры
//
// Параметры:
//  ИмяПараметра - Строка - имя параметра;
//  ПараметрыЭтикетки - СтрокаТаблицыЗначений - параметры этикетки;
//  КэшЗначений - Соответствие - кэш значений;
// 
// Возвращаемое значение:
//  Произвольное - значение дополнительного реквизита "Размер" или Неопределено
//
Функция ПримерКакЗаполнитьДополнительныйПараметрЭтикеткиРазмер(ИмяПараметра, ПараметрыЭтикетки, КэшЗначений)
	
	Результат = Неопределено;
	
	Если ИмяПараметра <> "ДопПараметрПечати1" Тогда
		Возврат Результат;
	КонецЕсли;
	
	Товар = ПараметрыЭтикетки.Товар;
	Результат = КэшЗначений[Товар];
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого СтрокаТЗ Из НоменклатураТовара(Товар) Цикл
		
		Результат = ЗначениеДопРеквизитаОбъекта(СтрокаТЗ.Номенклатура, ИмяПараметра);
		Если ЗначениеЗаполнено(Результат) Тогда
			КэшЗначений.Вставить(Товар, Результат);
			Возврат Результат;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Пример загрузки кодов маркировки из csv файла.
// Файл имеет следующую структуру:
// <КодМаркировки>Табуляция<GTIN>Табуляция<Наименование>
//
// Параметры:
//  ТаблицаКодов - Таблица значений - см. ТаблицаНовыхКодов()
//  Расширение - Строка - расширение файла;
//  ДвоичныеДанные - ДвоичныеДанные - данные файла;
//
Процедура ПримерКакЗагрузитьКодыИзCsvФайла(ТаблицаКодов, Расширение, ДвоичныеДанные)
	
	// BSLLS:FileSystemAccess-off
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Расширение);
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	
	КоличествоКолонок = 3;
	Чтение = Новый ЧтениеТекста(ИмяВременногоФайла, КодировкаТекста.UTF8);
	Пока Истина Цикл
		
		СтрокаТекста = Чтение.ПрочитатьСтроку();
		Если СтрокаТекста = Неопределено Тогда
			// дошли до конца файла
			Прервать;
		КонецЕсли;
		
		ЧастиТекста = РазделитьСтроку(СтрокаТекста, Символы.Таб);
		Если ЧастиТекста.Количество() <> КоличествоКолонок Тогда
			// строка имеет неверный формат
			// можно вызвать исключение или продолжить загрузку без этой строки
			Продолжить;
		КонецЕсли;
		
		СтрокаКода = ТаблицаКодов.Добавить();
		СтрокаКода.КодМаркировки = ЧастиТекста[0];
		СтрокаКода.ВидПродукции = Перечисления.КонтурМаркировка_ВидыПродукции.Молоко;
		
	КонецЦикла;
	
	Попытка
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение
		Ошибка = ИнформацияОбОшибке();
	КонецПопытки;
	
	// BSLLS:FileSystemAccess-on
	
КонецПроцедуры

// Пример по настройке дополнительных кнопок в модуле
//
// Параметры:
//  НастройкиКнопок - Структура - настройки доп кнопок;
//
Процедура ПримерНастройкиДополнительныхКнопок(НастройкиДопКнопок)
	
	РазмещенияКнопок = Перечисление_РазмещениеДополнительныхКнопок();
	
	Настройка = НоваяНастройкаДопКнопки();
	Настройка.ИмяКнопки = "ПечатьПромОборудование";
	Настройка.Заголовок = "Печать (Пром. оборудование)";
	Настройка.Размещение = РазмещенияКнопок.ДокументУчетаШапка;
	НастройкиДопКнопок.Добавить(Настройка);
	
КонецПроцедуры

// #Область ПримерыДляРаботыВСО

// Заполняет документ учета данными из документа ВСО
//
Процедура Пример_ПриЗаполненииДокументаУчета_ВСО(ОписаниеДокумента, Документ1С)
	
	Если ТипЗнч(Документ1С) = Тип("ДокументСсылка.КонтурМаркировкаВСО_ЗаказКодов")
		Или ТипЗнч(Документ1С) = Тип("ДокументСсылка.КонтурМаркировкаВСО_ЗаданиеНаПроизводство") Тогда
		
		ЗаполнитьДокументУчетаПоДокументуВСО(ОписаниеДокумента, Документ1С);
		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет операцию данными из документа ВСО
//
Процедура Пример_ПриЗаполненииОперации_ВСО(ОписаниеОперации, Документ1С)
	
	ТипДокумента1С = ТипЗнч(Документ1С);
	
	Если ТипДокумента1С = Тип("ДокументСсылка.КонтурМаркировкаВСО_ЗаказКодов")
		И ОписаниеОперации.ТипОперации = Перечисление_ТипыОпераций().ЗаказКодов Тогда
		
		ТипОплатыКодовВСО = ЗначениеРеквизитаОбъекта_Марк(Документ1С, "ТипОплатыКодов");
		Если ТипОплатыКодовВСО = Перечисления.КонтурМаркировкаВСО_ТипыОплатыКодов.ПоНанесению Тогда
			ТипОплатыКодов = Перечисление_ТипыОплатыКодов().ПоНанесению;
		Иначе
			ТипОплатыКодов = Перечисление_ТипыОплатыКодов().ПоЭмиссии;
		КонецЕсли;
		
		ОписаниеОперации.ДопРеквизиты.ТипОплатыКодов = ТипОплатыКодов;
		ОписаниеОперации.ДопРеквизиты.СпособВыпускаТоваров = Перечисление_СпособыВыпускаТоваров().ПроизводствоРФ;
		
	ИначеЕсли ТипДокумента1С = Тип("ДокументСсылка.КонтурМаркировкаВСО_ЗаданиеНаПроизводство") Тогда
		
		Если ОписаниеОперации.ТипОперации = Перечисление_ТипыОпераций().ОтчетОНанесении Тогда
			
			ДатаСрокаГодности = ЗначениеРеквизитаОбъекта_Марк(Документ1С, "СрокГодности");
			ОписаниеОперации.ДопРеквизиты.ТипИспользования = Перечисление_ТипыИспользованияКодов().Нанесен;
			
			Для Каждого Стр Из ОписаниеОперации.Товары Цикл
				Стр.ДатаСрокаГодности = ДатаСрокаГодности;
			КонецЦикла;
			
		ИначеЕсли ОписаниеОперации.ТипОперации = Перечисление_ТипыОпераций().ВводВОборот Тогда
			
			ДатаПроизводства = ЗначениеРеквизитаОбъекта_Марк(Документ1С, "ДатаПроизводства");
			
			ОписаниеОперации.ДопРеквизиты.ДатаПроизводства = ДатаПроизводства;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Загружает коды в новый документ учета, так же заполняет поля документа учета
//
Процедура Пример_ПриЗагрузкеКодовВНовыйДокументУчета_ВСО(ОписаниеДокумента, Документ1С, ПараметрыСобытия)
	
	Если НЕ ТипЗнч(Документ1С) = Тип("ДокументСсылка.КонтурМаркировкаВСО_ЗаданиеНаПроизводство") Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДокументУчетаПоДокументуВСО(ОписаниеДокумента, Документ1С);
	
	// + Раскомментируй меня
	//КоличествоВыбранныхЭтапов = 0;
	//Для Каждого ЭтапМаркировки Из Документ1С.ЭтапыМаркировки Цикл
	//	Если ЭтапМаркировки. Активен = Истина Тогда
	//		КоличествоВыбранныхЭтапов = КоличествоВыбранныхЭтапов + 1;
	//	КонецЕсли;
	//КонецЦикла;
	//Если КоличествоВыбранныхЭтапов > 1 Тогда
	//	ТипОтчетаДляОтраженияВМаркировке = Перечисления.КонтурМаркировкаВСО_ТипыОтчетовОборудования.АгрегацияКодов;
	//Иначе
	//	ТипОтчетаДляОтраженияВМаркировке = Перечисления.КонтурМаркировкаВСО_ТипыОтчетовОборудования.ИспользованныеКоды;
	//КонецЕсли;	
	//ТаблицаКодов = Документы.КонтурМаркировкаВСО_ОтчетСОборудования.ДанныеОтчетаПоДокументуОснования(Документ1С, ТипОтчетаДляОтраженияВМаркировке);
	//ПараметрыСобытия.ТаблицаКодов = ТаблицаКодов;
	// - Раскомментируй меня
	
КонецПроцедуры

// Ищет подходящие отчеты с производства по товарам, складу и дате производства из документа учета
// после загружает коды из найденных отчетов в документ учета
//
Процедура Пример_ПриЗагрузкеКодовИзВнешнегоИсточника_ВСО(Документ1С, ДокументУчета, ПараметрыЗагрузкиКодов)
	
	ПараметрыЗагрузкиКодов.УдалитьСтарыеКоды = Истина;
	
	Склад = ДокументУчета.Склад;
	ДатаПроизводства = ДокументУчета.Дата;
	Товары = Новый Массив;
	
	Для Каждого СтрокаТоваров Из ДокументУчета.ТоварыМаркировки Цикл
		Товары.Добавить(СтрокаТоваров.Товар);
	КонецЦикла;
	
	// + Раскомментируй меня
	//КодыМаркировки = ВзаимодействиеКонтурМаркировкаВСО.ПолучитьНанесенныеКодыПоТоварамМаркировки(Товары, Склад, ДатаПроизводства, ДокументУчета, Истина);
	//ПараметрыСобытия.КодыМаркировки = КодыМаркировки;
	// - Раскомментируй меня
	
КонецПроцедуры

// В общем случае заполнять документ учета в ПриЗаполненииДокументаУчета следует только для КонтурМаркировкаВСО_ЗаказКодов,
// для документа КонтурМаркировкаВСО_ЗаданиеНаПроизводство следует заполнять в ПриЗагрузкеКодовВНовыйДокументУчета,
// так как при добавлении кодов, которые заказы не через модуль может возникнуть ошибка
//
Процедура ЗаполнитьДокументУчетаПоДокументуВСО(ОписаниеДокумента, Документ1С)
	
	ДанныеЛинии = ЗначенияРеквизитовОбъекта_Марк(Документ1С.ПроизводственнаяЛиния, "Организация, Склад");
	ДанныеТовара = ЗначенияРеквизитовОбъекта_Марк(Документ1С.Товар, "ТоварМаркировки, КлючНоменклатуры1С");
	АналитикаНоменклатуры = АналитикаНоменклатуры1С(ДанныеТовара.КлючНоменклатуры1С);
	
	ОписаниеДокумента.Склад = ДанныеЛинии.Склад;
	ОписаниеДокумента.Организация = ДанныеЛинии.Организация;
	
	СтрДок = ОписаниеДокумента.ТоварыДокумента[0];
	СтрДок.Номенклатура = АналитикаНоменклатуры.Номенклатура;
	СтрДок.КлючНоменклатуры1С = ДанныеТовара.КлючНоменклатуры1С;
	
	СтрТовара = ОписаниеДокумента.ТоварыМаркировки.Добавить();
	СтрТовара.Товар = ДанныеТовара.ТоварМаркировки;
	СтрТовара.КоличествоУпаковок = СтрДок.Количество;
	СтрТовара.КлючСтрокиДокумента = СтрДок.КлючСтрокиДокумента;
	
КонецПроцедуры

// #КонецОбласти ПримерыДляРаботыВСО

// #КонецОбласти Примеры

// #Область СлужебныеПроцедурыИФункции

// #Область ДокументУчета

// Записывает документ учета в базу данных
//
// Параметры:
//  ОписаниеДокумента - Структура - см. НовоеОписаниеДокументаУчета();
//
Процедура ЗаписатьДокументУчета(ОписаниеДокумента)
	
	ОсновнойМодуль.ЗаписатьДокументУчета(ОписаниеДокумента);
	
КонецПроцедуры

// Читает документ учета из базы и возвращает его структуру
//
// Параметры:
//  ДокументУчета - СправочникСсылка.КонтурМаркировка_ДокументыУчета - документ, который нужно прочитать
// 
// Возвращаемое значение:
//  Структура - см. НовоеОписаниеДокументаУчета()
//
Функция ПрочитатьДокументУчета(ДокументУчета)
	
	Возврат ОсновнойМодуль.ПрочитатьДокументУчета(ДокументУчета);
	
КонецФункции

// Находит документ учета в маркировке по документу 1С
//
// Параметры:
//  Документ1С - ДокументСсылка - документ 1С;
// 
// Возвращаемое значение:
//  СправочникСсылка.КонтурМаркировка_ДокументыУчета - документ учета;
//
Функция НайтиДокументУчетаПоДокументу1С(Документ1С)
	
	Возврат ОсновнойМодуль.НайтиДокументУчетаПоДокументу1С(Документ1С);
	
КонецФункции

// Находит документы учета в маркировке по документам 1С
//
// Параметры:
//  Документы1С - Массив - содержит ссылки на документы 1С;
// 
// Возвращаемое значение:
//  Массив - содержит значения СправочникСсылка.КонтурМаркировка_ДокументыУчета;
//
Функция НайтиДокументыУчетаПоДокументам1С(Документы1С)
	
	Возврат ОсновнойМодуль.НайтиДокументыУчетаПоДокументам1С(Документы1С);
	
КонецФункции

// Создает документ учета в маркировке по данным документа 1С
//
// Параметры:
//  Документ1С - ДокументСсылка - документ 1С;
//  НачатьРаботуСДокументом - Булево - если Истина, то с созданным документом учета сразу начинается работа;
// 
// Возвращаемое значение:
//  СправочникСсылка.КонтурМаркировка_ДокументыУчета - документ учета;
//
Функция СоздатьДокументУчетаПоДокументу1С(Документ1С, НачатьРаботуСДокументом = Ложь)
	
	Возврат ОсновнойМодуль.СоздатьДокументУчетаПоДокументу1С(Документ1С, НачатьРаботуСДокументом);
	
КонецФункции

// Перезаполняет документ учета по документу 1С
//
// Параметры:
//  ДокументУчета - СправочникСсылка.КонтурМаркировка_ДокументыУчета - документ учета;
//  Документ1С - ДокументСсылка - документ в учетной системе;
//  ЗагрузитьКоды - Булево - если параметр установлен в истину, будет вызвано событие
//                           подключаемого модуля "ПриЗагрузкеКодовВНовыйДокументУчета";
//
Процедура ПерезаполнитьДокументУчета(ДокументУчета, Документ1С, ЗагрузитьКоды = Истина)
	
	ОсновнойМодуль.ПерезаполнитьДокументУчета(ДокументУчета, Документ1С, ЗагрузитьКоды);
	
КонецПроцедуры

// Проверяет заполнение полей документа учета и товары маркировки
//
// Параметры:
//  ДокументУчета - ДокументСсылка.КонтурМаркировка_ДокументыУчета - документ учета;
// 
// Возвращаемое значение:
//  Массив - содержит структуры с полями:
//   * ТекстОшибки - Строка - описание ошибки;
//   * ИмяПоля - Строка - Имя поля документа, связанного с ошибкой;
//   * ИмяТаблицы - Строка - Имя табличной, части связанной с ошибкой;
//   * НомерСтроки - Число - Номер строки табличной части;
//
Функция ПроверитьЗаполнениеДокументаУчета(ДокументУчета)
	
	Возврат ОсновнойМодуль.ПроверитьЗаполнениеДокументаУчета(ДокументУчета);
	
КонецФункции

// Возвращает основной статус документа учета
//
// Параметры:
//  ДокументУчета - СправочникСсылка.КонтурМаркировка_ДокументыУчета - документ учета;
// 
// Возвращаемое значение:
//  Строка - основной статус документа учета;
//
Функция ОсновнойСтатусДокументаУчета(ДокументУчета)
	
	Возврат ОсновнойМодуль.ДокументУчета_ОсновнойСтатус(ДокументУчета);
	
КонецФункции

// Получает таблицу кодов маркировки по документу 1С
//
// Параметры:
//  Документ1С - ДокументСсылка - документ 1С;
//  ЗаменитьGS - Булево - Истина, если необходимо заменить разделитель GS1 на его эквивалент \u001d
// 
// Возвращаемое значение:
//  ТаблицаЗначений - см. ТаблицаНовыхКодов()
//
Функция ТаблицаКодовДокумента(Документ1С, ЗаменитьGS = Ложь)
	
	Возврат ОсновнойМодуль.ТаблицаКодовДокумента(Документ1С, ЗаменитьGS);
	
КонецФункции

// Определяет наличие маркируемого товара в документе
//
// Параметры:
//  Документ1С - ДокументСсылка - документ 1С;
// 
// Возвращаемое значение:
//  Булево - Истина, если в документе есть хотябы один маркируемый товар;
//
Функция ДокументСодержитМаркируемыйТовар(Документ1С)
	
	Возврат ОсновнойМодуль.ДокументСодержитМаркируемыйТовар(Документ1С);
	
КонецФункции

// Проверяет в документе статус кодов "Выпущен" и наличие полных кодов
//
// Параметры:
//  Документ1С - ДокументСсылка - документ 1С
// 
// Возвращаемое значение:
//  Булево - Истина, если по документу можно сформировать отчет о нанесении
//
Функция МожноСформироватьОтчетОНанесенииПоДокументу(Документ1С)
	
	Возврат ОсновнойМодуль.МожноСформироватьОтчетОНанесенииПоДокументу(Документ1С);
	
КонецФункции

// Устанавливает дату печати кодов и основной статус операций печати по документу
//
// Параметры:
//  Документ1С - ДокументСсылка - документ 1С
//
Процедура ОтметитьНапечатанныеКодыПоДокументу(Документ1С)
	
	ОсновнойМодуль.ОтметитьНапечатанныеКодыПоДокументу(Документ1С);
	
КонецПроцедуры

// Получает статусы кодов маркировки по документу 1С из сервиса Контур.Маркировка
//
// Параметры:
//  Документ1С - ДокументСсылка - документ 1С
// 
// Возвращаемое значение:
//  Булево - Истина, если обновился статус хотя-бы у одного кода
//
Функция ОбновитьСтатусыКодовДокумента(Документ1С)
	
	Возврат ОсновнойМодуль.ОбновитьСтатусыКодовДокумента(Документ1С);
	
КонецФункции

// Завершает работу с документом.
// У связанного с документом 1С документа учета устанавливает следующие значения:
//  ДокументУчета.Статусы.ОсновнойСтатус = Завершен
//  ДокументУчета.Статусы.ТребуемоеДействие = РаботаЗавершена
//
// Параметры:
//  Документ1С - ДокументСсылка - документ 1С
//
Процедура ЗавершитьРаботуСДокументом(Документ1С)
	
	ОсновнойМодуль.ЗавершитьРаботуСДокументом(Документ1С);
	
КонецПроцедуры

// Проверяет наличие в документе учета завершенных операций вывода кодов из оборота
//
// Параметры:
//  Документ1С - ДокументСсылка - документ 1С
// 
// Возвращаемое значение:
//  Булево - Истина, если операции с выводом из оборота в документе учета есть
//
Функция ДокументСодержитВыводаИзОборота(Документ1С)
	
	Возврат ОсновнойМодуль.ДокументСодержитВыводаИзОборота(Документ1С);
	
КонецФункции

// #КонецОбласти ДокументУчета

// #Область Операции

// Возвращает описание операции совместимое с ПМ
//
// Параметры:
//  ОписаниеОперации - Структура - см. НовоеОписаниеОперации()
//
Функция ПрочитатьОперацию(Операция)
	
	Возврат ОсновнойМодуль.ПрочитатьОперацию(Операция);
	
КонецФункции

// Возвращает таблицу операций по документу учета с отобром по типам и статусам
//
// Параметры:
//  Документ - СправочникСсылка.КонтурМаркировка_ДокументыУчета, ДокументСсылка - документ 1С или документ учета;
//  ТипыОпераций - Массив - (необязательный) фильтр по типам операций, см Перечисление_ТипыОпераций();
//  СтатусыОпераций - Массив - (необязательный) фильтр по статусам операций, см. Перечисление_СтатусыОпераций();
//  ОперацииОснования - Массив - (необязательный) фильтр по операциям основания;
//  БезОперацииОснования - Булево - (необязадельный) Истина, если нужны операции в которых нет операции основания;
// Возвращаемое значение:
//  ТаблицаЗначений - содержит колонки:
//   * ОперацияСсылка - СправочникСсылка.КонтурМаркировка_Операции;
//   * ТипОперации    - Строка - см. Перечисление_ТипыОпераций();
//   * Статус         - Строка - см. Перечисление_СтатусыОпераций();
//
Функция ОперацииДокумента(Документ, ТипыОпераций = Неопределено, СтатусыОпераций = Неопределено)
	
	Возврат ОсновнойМодуль.ОперацииДокумента(Документ, ТипыОпераций, СтатусыОпераций);
	
КонецФункции

// Создает операцию указанного типа, заполняет ее данными документа и записывает в базу
//
// Параметры:
//  Документ1С - ДокументСсылка - документ 1С;
//             - СправочникСсылка.КонтурМаркировка_ДокументыУчета - документ учета;
//  ТипОперации - Строка - см. Перечисление_ТипыОпераций();
//  ОперацияОснование - СправочникСсылка.КонтурМаркировка_Операции - (необязательный)
//                           операция, на основании которой создается новая операция;
// 
// Возвращаемое значение:
//  СправочникСсылка.КонтурМаркировка_Операции - созданная операция
//
Функция СоздатьОперациюПоДокументу(Документ1С, ТипОперации, ОперацияОснование = Неопределено)
	
	Возврат ОсновнойМодуль.СоздатьОперациюПоДокументу(Документ1С, ТипОперации, ОперацияОснование);
	
КонецФункции

// Устарел. Следует использовать КодыДокументаИзСверкиНаПриемке
// Возвращает коды из сверки на приемке для добавления их в другой документ
//
// Параметры:
//  ОрганизацияПолучатель - СправочникСсылка - организация получатель электронного документа;
//  ИННОтправителя        - Строка - ИНН отправителя электронного документа;
//  НомерДокумента        - Строка - номер электронного документа;
//  ДатаДокумента         - Дата   - дата электронного документа (с точностью до дня);
// 
// Возвращаемое значение:
//  Массив - содержит структуры, см. ОсновнойМодуль.Новый_КодыВДокументах_СтрокаНовогоКода()
//
Функция КодыВДокументах_КодыИзСверкиНаПриемке(ОрганизацияПолучатель
	, ИННОтправителя, НомерДокумента, ДатаДокумента)
	
	Возврат ОсновнойМодуль.КодыДокументаИзСверкиНаПриемке(
	ОрганизацияПолучатель, ИННОтправителя, НомерДокумента, ДатаДокумента);
	
КонецФункции

// Возвращает коды из электронного документа, на основании которого создана сверка на приемке
//
// Параметры:
//  ОрганизацияПолучатель - СправочникСсылка - организация получатель электронного документа;
//  ИННОтправителя        - Строка - ИНН отправителя электронного документа;
//  НомерДокумента        - Строка - номер электронного документа;
//  ДатаДокумента         - Дата   - дата электронного документа (с точностью до дня);
//  ОписаниеОшибки        - Строка - исходящий параметр, содержит ошибку возникшую при выполнении функции;
// 
// Возвращаемое значение:
//  Массив - содержит структуры с полями:
//   * НомерСтроки        - Число  - номер строки в табличной части электронного документа;
//   * НаименованиеТовара - Строка - наименование товара;
//   * КодыМаркировки     - Массив - содержит структуры с полями:
//      ** КодМаркировки          - Строка - значение штрихкода;
//      ** ВложенныеКоды          - Массив - содержит аналогичные структуры с вложенными кодами;
//      ** Отсканирован           - Булево, Неопределено - Истина, если код был отсканирован;
//      ** ВведенВОборот          - Булево, Неопределено - Ложь, если код не введен в оборот;
//      ** ПринадлежитОтправителю - Булево, Неопределено - Ложь, если код не принадлежит отправителю;
//      ** КорректныйФорматКода   - Булево, Неопределено - Ложь, если код имеет некорректный формат передачи в УПД;
//      ** ЕстьДействующийРД      - Булево, Неопределено - Ложь, если код имеет ошибки разрешительной документации;
//
Функция КодыДокументаИзСверкиНаПриемке(ОрганизацияПолучатель, ИННОтправителя, НомерДокумента, ДатаДокумента
	, ОписаниеОшибки = Неопределено)
	
	Результат = ОсновнойМодуль.КодыДокументаИзСверкиНаПриемке(ОрганизацияПолучатель
	, ИННОтправителя, НомерДокумента, ДатаДокумента, ОписаниеОшибки);
	
	Возврат Результат;
	
КонецФункции

// Удаляет все операции указанного типа по документу 1С
//
// Параметры:
//  Документ - ДокументСсылка, СправочникСсылка.КонтурМаркировка_ДокументыУчета - документ 1С;
//  ТипОпераций - Строка - см. Перечисление_ТипыОпераций();
//
Процедура УдалитьОперацииПоДокументу(Документ, ТипОпераций)
	
	ОсновнойМодуль.УдалитьОперацииПоДокументу(Документ, ТипОпераций);
	
КонецПроцедуры

// Удаляет операции маркировки из справочника
//
// Параметры:
//  МассивОпераций - Массив из СправочникСсылка.КонтурМаркировка_Операции
//
Процедура УдалитьОперации(МассивОпераций)
	
	ОсновнойМодуль.УдалитьОперации(МассивОпераций);
	
КонецПроцедуры

// Возвращает статус первой незавершенной операции или статус последней если все операции завершены
//
// Параметры:
//  Документ1С - ДокументСсылка - документ 1С;
//  ТипОперации - Строка - см. Перечисление_ТипыОпераций();
//
// Возвращаемое значение:
//  Строка - статус операции;
//
Функция СтатусОперацииПоДокументу(Документ1С, ТипОперации)
	
	Возврат ОсновнойМодуль.СтатусОперацииПоДокументу(Документ1С, ТипОперации);
	
КонецФункции

// Возвращает основной статус операции
//
// Параметры:
//  Операция - СправочникСсылка.КонтурМаркировка_Операции - операция;
// 
// Возвращаемое значение:
//  Строка - см. Перечисление_СтатусыОпераций()
//
Функция ОсновнойСтатусОперации(Операция)
	
	Возврат ОсновнойМодуль.ОсновнойСтатусОперации(Операция);
	
КонецФункции

// Возвращает массив операций указанного типа по документу
//
// Параметры:
//  Документ1С - ДокументСсылка - документ 1С;
//  ТипОпераций - Строка - см. Перечисление_ТипыОпераций();
//
// Возвращаемое значение:
//  Массив из СправочникСсылка.КонтурМаркировка_Операции - операции;
//
Функция ОперацииПоДокументу(Документ1С, ТипОпераций)
	
	Возврат ОсновнойМодуль.ОперацииПоДокументу(Документ1С, ТипОпераций);
	
КонецФункции

// Добавляет операцию в регистр сведений очередь обмена
//
// Параметры:
//  Операция - СправочникСсылка.КонтурМаркировка_Операции - операция;
//
Процедура ДобавитьОперациюВОчередьОбмена(Операция)
	
	ОсновнойМодуль.ДобавитьОперациюВОчередьОбмена(Операция);
	
КонецПроцедуры

// Получает коды маркировки операции
//
// Параметры:
//  Операция - СправочникСсылка.КонтурМаркировка_Операции - операция, коды которой нужно получить;
//  КлючСтрокиОперации - УникальныйИдентификатор - (необязательный) ключ строки операции основания;
// 
// Возвращаемое значение:
//  ТаблицаЗначений - см. Новый_ТаблицаКодов();
//
Функция ПрочитатьКодыОперации(Операция, КлючСтрокиОперации = Неопределено)
	
	Возврат ОсновнойМодуль.ПрочитатьКодыОперации(Операция, КлючСтрокиОперации);
	
КонецФункции

// #КонецОбласти Операции

// Возвращает значения настроек модуля по умолчанию
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура
//
Функция ЗначенияПолейПоУмолчанию()
	
	Возврат ОсновнойМодуль.ЗначенияПолейПоУмолчанию();
	
КонецФункции

// Возвращает все типы документов с которыми умеет работать модуль
// 
// Возвращаемое значение:
//  Массив из Строка - типы документов строкой;
//
Функция ТипыДокументовМодуля()
	
	Возврат ОсновнойМодуль.ТипыДокументовМодуля();
	
КонецФункции

// Выполняет обмен с сервисом Контур.Маркировка по указанной организации
//
// Параметры:
//  Организация1С - СправочникСсылка - организация;
//  Документ1С - ДокументСсылка - (необязательный) документ;
//
Процедура ВыполнитьОбменПоОрганизации(Организация1С, Документ1С = Неопределено)
	
	ОсновнойМодуль.ВыполнитьОбменПоОрганизации(Организация1С, Документ1С);
	
КонецПроцедуры

// Выполняет обмен с сервисом Контур.Маркировка по всем организациям
//
Процедура ВыполнитьОбменПоВсемОрганизациям()
	
	ОсновнойМодуль.ВыполнитьОбменПоВсемОрганизациям();
	
КонецПроцедуры

// Возвращает таблицу упаковок и кодов маркировки с номенклатурой
// (характеристикой, серией), которая в них входит
//
// Параметры:
//  Документы1С   - Массив, ДокументСсылка - документы-владельцы штрихкодов;
//  ОшибкиЗаполнения - Массив - исходящий параметр, ошибки выполнения функции, содержит структуры с полями:
//   * ТекстОшибки        - Строка           - описание ошибки;
//   * ВладелецКодов      - ДокументСсылка   - документ-владелец штрихкодов, в котором возникла ошибка;
//   * ДокументМаркировки - СправочникСсылка - документ Контур.Маркировки, с которым связан документ-владелец;
//  ПроверитьЗавершениеРаботыСКодами - Булево - Истина, если нужно проверить, что работа с кодами завершена;
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица упаковок с товарными данными:
//   * Ссылка            - ДокументСсылка - документ-владелец штрихкода;
//   * Штрихкод          - СправочникСсылка.КонтурМаркировка_КодыУпаковок - ссылка на код упаковки;
//   * Номенклатура      - СправочникСсылка - содержимое;
//   * Характеристика    - СправочникСсылка - содержимое;
//   * Серия             - СправочникСсылка - содержимое;
//   * ЗначениеШтрихкода - Строка - код маркировки для заполнения документа ЭДО;
//   * Мультитоварная    - Булево - признак мультитоварной упаковки;
//   * ВидПродукции      - Перечислениессылка.КонтурМаркировка_ВидыПродукции - вид продукции кода маркировки;
//   * ВидУпаковки       - ПеречислениеСсылка.КонтурМаркировка_ВидыУпаковок - вид упаковки кода маркировки;
//
Функция РазвернутаяТаблицаУпаковок(Документы1С, ОшибкиЗаполнения = Неопределено
	, ПроверитьЗавершениеРаботыСКодами = Истина)
	
	Результат = ОсновнойМодуль.РазвернутаяТаблицаУпаковок(Документы1С
	, ОшибкиЗаполнения, ПроверитьЗавершениеРаботыСКодами);
	
	Возврат Результат;
	
КонецФункции

// Подбирает коды маркировки для печати этикеток по документу
//
// Параметры:
//  Документ1С - ДокументСсылка - документ 1С;
//  ПараметрыПодбораКодов - Структура - содержит поля:
//   * Товар - СправочникСсылка.КонтурМаркировка_Товары - товар маркировки;
//   * Номенклатура - СправочникСсылка - номенклатура 1С;
//   * Характеристика - СправочникСсылка - характеристика номенклатуры;
//   * Упаковка - СправочникСсылка - упаковка;
//   * Серия - СправочникСсылка - серия;
//   * КоличествоКодовТребуется - Число - количество кодов;
// 
// Возвращаемое значение:
//  Массив из Строка - коды маркировки с криптохвостами
//
Функция КодыМаркировкиДляНанесенияПоДокументу(Документ1С, ПараметрыПодбораКодов = Неопределено)
	
	Возврат ОсновнойМодуль.КодыМаркировкиДляНанесенияПоДокументу(Документ1С, ПараметрыПодбораКодов);
	
КонецФункции

// Пытается распознать коды маркировки
// Требуется авторизация в сервсие
//
// Параметры:
//  ТаблицаКодов - Таблица значений - см. ТаблицаНовыхКодов()
//
Процедура НормализоватьКоды(ТаблицаКодов)
	
	ОсновнойМодуль.НормализоватьКоды(ТаблицаКодов);
	
КонецПроцедуры

// Читает в базе связи товара с номенклатурой 1С
//
// Параметры:
//  Товар - СправочникСсылка.КонтурМаркировка_Товары - товар
// 
// Возвращаемое значение:
//  ТаблицаЗначений - см. регистр сведений КонтурМаркировка_СвязиНоменклатуры
//
Функция НоменклатураТовара(Товар)
	
	Возврат ОсновнойМодуль.НоменклатураТовара(Товар);
	
КонецФункции

// Формирует этикетки по шаблонам
//
// Параметры:
//  КодыУпаковок - СправочникСсылка.КонтурМаркировка_КодыУпаковок, Массив - код упаковки, либо массив кодов упаковок;
//  ШаблоныЭтикеток - Структура - см. функцию ШаблоныДляПечатиЭтикеток();
//  Документ1С - ДокументСсылка - (необязательный) документ 1С связанный с кодами;
//  ПечататьВложенныеКоды - Булево - (необязательный) Ложь, если этикетки для вложенных кодов печатать не нужно;
//   * ДопПараметрПечати1 - Произвольный - дополнительный параметр этикетки №1;
//   * ДопПараметрПечати2 - Произвольный - дополнительный параметр этикетки №2;
//   * ДопПараметрПечати3 - Произвольный - дополнительный параметр этикетки №3;
// 
// Возвращаемое значение:
//  ТабличныйДокумент - содержит сформированные этикетки
//
Функция СформироватьЭтикетки(КодыУпаковок
							, ШаблоныЭтикеток
							, Документ1С = Неопределено
							, ПечататьВложенныеКоды = Истина
							, ДопПараметрыПечати  = Неопределено)
	
	Возврат ОсновнойМодуль.СформироватьЭтикетки(КодыУпаковок
												, ШаблоныЭтикеток
												, Документ1С
												, ПечататьВложенныеКоды
												, ДопПараметрыПечати );
	
КонецФункции

// Записывает дополнительные сведения кодов упаковок
//
// Параметры:
//  ТаблицаКодов - Таблица значений - см. ТаблицаНовыхКодов()
//
Процедура ЗаписатьДопСведенияКодов(ТаблицаКодов)
	
	ОсновнойМодуль.ЗаписатьДопСведенияКодов(ТаблицаКодов);
	
КонецПроцедуры

// Добавляет в полный код информацию по объему: ПолныйКод + РазделительGS + 3103 + 6 символов объема в кг
//
// Параметры:
//  ТаблицаКодов - Таблица значений - см. ТаблицаНовыхКодов()
//  ЗаменитьGS - Булево - Истина, если необходимо заменить разделитель GS1 на его эквивалент \u001d
//
Процедура ДобавитьОбъемВПолныйКод(ТаблицаКодов, ЗаменитьGS = Ложь)
	
	ОсновнойМодуль.ДобавитьОбъемВПолныйКод(ТаблицаКодов, ЗаменитьGS);
	
КонецПроцедуры

// Генерирует нужное количество новых штрихкодов для агрегатов
//
// Параметры:
//  ВидАгрегата - СправочникСсылка.КонтурМаркировка_ВидыАгрегатов - вид агрегата;
//  КоличествоКодов - Число - количество кодов, которые нужно сгенерировать;
// 
// Возвращаемое значение:
//  Массив - содержит строки с новыми кодами
//
Функция СформироватьНовыеКодыАгрегатов(ВидАгрегата, КоличествоКодов = 1)
	
	Возврат ОсновнойМодуль.СформироватьНовыеКодыАгрегатов(ВидАгрегата, КоличествоКодов);
	
КонецФункции

// Добавляет коды в документ через событие подключаемого модуля "ПриЗагрузкеКодовИзВнешнегоИсточника"
//
// Параметры:
//  Документ1С - ДокументСсылка - документ 1С;
//  ДопПараметры - Произвольный - дополнительные параметры;
// 
// Возвращаемое значение:
//  Булево - Истина, если новые коды добавить удалось;
//
Функция ДобавитьКодыВДокументИзВнешнегоИсточника(Документ1С, ДопПараметры = Неопределено)
	
	Возврат ОсновнойМодуль.ДобавитьКодыВДокументИзВнешнегоИсточника(Документ1С, ДопПараметры);
	
КонецФункции

// Добавляет коды в документ
//
// Параметры:
//  Документ - ДокументСсылка, СправочникСсылка.КонтурМаркировка_ДокументыУчета - документ 1С или документ учета;
//  ТаблицаКодов  - ТаблицаЗначений - см. функцию ТаблицаНовыхКодов();
//  ПараметрыЗагрузки - Структура - (необязательный), см. функцию ПараметрыЗагрузкиНовыхКодовВДокумент()
//
Процедура ДобавитьНовыеКодыВДокумент(Документ, ТаблицаКодов, ПараметрыЗагрузки = Неопределено)
	
	ОсновнойМодуль.ДобавитьНовыеКодыВДокумент(Документ, ТаблицаКодов, ПараметрыЗагрузки);
	
КонецПроцедуры

// Выгружает коды документа 1С в файл
//
// Параметры:
//  Документ1С			 - ДокументСсылка	 - документ 1С;
//  ФорматФайла			 - Строка			 - см. функцию Перечисление_ФорматыФайловСКодами();
//  ВыгружатьПолныеКоды	 - Булево			 - (необязательный) если не указан используется настройка модуля, иначе:
//  			* Истина - если нужно выгрузить коды с криптохвостами;
//  			* Ложь   - если нужно выгрузить коды без криптохвостов;
// 
// Возвращаемое значение:
//  Массив - содержит по умолчанию один элемент, структуру со свойствами:
//  * ИмяФайла - имя, с которым нужно сохранить файл;
//  * ДвоичныеДанные - данные файла;
//
Функция ВыгрузитьКодыДокументаВФайл(Документ1С, ФорматФайла, ВыгружатьПолныеКоды = Неопределено) Экспорт
	
	Возврат ОсновнойМодуль.ВыгрузитьКодыДокументаВФайл(Документ1С, ФорматФайла, ВыгружатьПолныеКоды);
	
КонецФункции

// Формирует штрихкод маркированной продукции в объёмно-сортовом
// разрезе учёта, используя регулярное выражение: [02][gtin][37][количество]
//
// Параметры:
//  GTIN - Строка - GTIN товара;
//  Количество - Число - количество в единицах подлежащих маркировке;
// 
// Возвращаемое значение:
//  Строка - штрихкод
//
Функция ШтрихкодОбъемноСортовогоУчета(GTIN, Количество)
	
	Возврат ОсновнойМодуль.ШтрихкодОбъемноСортовогоУчета(GTIN, Количество);
	
КонецФункции

// Записывает ошибку в журнал регистрации и сообщает пользователю
//
// Параметры:
//  Действие			 - Строка - действие, при котором возникла ошибка;
//  Ошибка				 - ИнформацияОбОшибке, Строка - описание ошибки;
//  ДопИнформация		 - Строка, Массив, СписокЗначений, Структура, Соответствие - доп информация;
//  ТекстСообщения		 - Строка - текст сообщения пользователю;
//  ИдентификаторФормы	 - УникальныйИдентификатор - см. СообщитьПользователюЛок();
//  ПолеФормы			 - Строка                  - см. СообщитьПользователюЛок();
//
Процедура ОбработатьОшибку(Действие, Ошибка
	, ДопИнформация		 = Неопределено
	, ТекстСообщения	 = Неопределено
	, ИдентификаторФормы = Неопределено
	, ПолеФормы			 = Неопределено)
	
	ОсновнойМодуль.ОбработатьОшибку(Действие, Ошибка
	, ДопИнформация
	, ТекстСообщения
	, ИдентификаторФормы
	, ПолеФормы);
	
КонецПроцедуры

// Получает список номенклатуры 1С с признаком "Не подлежит маркировке"
// 
// Возвращаемое значение:
//  Массив - содержит СправочникСсылка - номенклатура 1С
//
Функция СписокНоменклатурыНеПодлежитМаркировке()
	
	Возврат ОсновнойМодуль.СписокНоменклатурыНеПодлежитМаркировке();
	
КонецФункции

// Устанавливает признак номенклатуры 1С "Не подлежит маркировке"
//
// Параметры:
//  КоллекцияНоменклатуры - СправочникСсылка, Массив - номенклатура 1С
//
Процедура УстановитьПризнакНоменклатурыНеПодлежитМаркировке(КоллекцияНоменклатуры)
	
	ОсновнойМодуль.УстановитьПризнакНоменклатурыНеПодлежитМаркировке(КоллекцияНоменклатуры);
	
КонецПроцедуры

// Удаляет признак номенклатуры 1С "Не подлежит маркировке"
//
// Параметры:
//  КоллекцияНоменклатуры - СправочникСсылка, Массив - номенклатура 1С
//
Процедура УдалитьПризнакНоменклатурыНеПодлежитМаркировке(КоллекцияНоменклатуры)
	
	ОсновнойМодуль.УдалитьПризнакНоменклатурыНеПодлежитМаркировке(КоллекцияНоменклатуры);
	
КонецПроцедуры

// Выполняет авторизацию в сервисе Контур.Маркировка и продлевает доступ в ГИС МТ если нужно
//
// Параметры:
//  Организация1С - СправочникСсылка - организация;
//  ВызыватьИсключение - Булево - (необязательный) Ложь, если вызывать исключение при ошибке не нужно;
// 
// Возвращаемое значение:
//  Булево - Истина, если авторизация выполнена успешно
//
Функция ВыполнитьАвторизацию(Организация1С, ВызыватьИсключение = Истина)
	
	Возврат ОсновнойМодуль.ВыполнитьАвторизацию(Организация1С, ВызыватьИсключение);
	
КонецФункции

// Проверяет возможность использования отложенной функциональности
//
// Параметры:
//  ИмяФункции - Строка - имя функции;
// 
// Возвращаемое значение:
//  Булево - Истина, если функциональность уже можно использовать
//
Функция ОтложеннуюФункциюМожноИспользовать(ИмяФункции)
	
	Возврат ОсновнойМодуль.ОтложеннуюФункциюМожноИспользовать(ИмяФункции);
	
КонецФункции

// Проверяет необходимость отключения временной функциональности
//
// Параметры:
//  ИмяФункции - Строка - имя функции;
// 
// Возвращаемое значение:
//  Булево - Истина, если временную функцию уже нужно отключить
//
Функция ВременнуюФункциюНужноОтключить(ИмяФункции)
	
	Возврат ОсновнойМодуль.ВременнуюФункциюНужноОтключить(ИмяФункции);
	
КонецФункции

// Возвращает структуру с объектами 1С по ключу номенклатуры 1С
//
// Параметры:
//  КлючиАналитики - Структура - содержит поля:
//  * КлючНоменклатуры - УникальныйИдентификатор - ключ номенклатуры;
//  * КлючХарактеристики - УникальныйИдентификатор - ключ характеристики;
//  * КлючУпаковки - УникальныйИдентификатор - ключ упаковки;
//  * КлючСерии - УникальныйИдентификатор - ключ серии;
//  КэшКлючейНоменклатуры1С - Соответствие - локальный кэш полученных данных
// 
// Возвращаемое значение:
//  Структура - содержит поля:
//  * Номенклатура - СправочникСсылка - номенклатура;
//  * Характеристика - СправочникСсылка - характеристика;
//  * Упаковка - СправочникСсылка - упаковка;
//  * Серия - СправочникСсылка - серия;
//
Функция АналитикаНоменклатуры1С(КлючиАналитики, КэшКлючейНоменклатуры1С = Неопределено)
	
	Возврат ОсновнойМодуль.АналитикаНоменклатуры1С(КлючиАналитики, КэшКлючейНоменклатуры1С);
	
КонецФункции

// Добавляет в базу информацию о кодах
//
// Параметры:
//  ТаблицаКодов - ТаблицаЗначений - см. функцию ТаблицаНовыхКодов();
//  ДобавитьКоличествоВСоставКода - Булево - Истина, если необходимо добавить количество в полный код;
//
Процедура ДобавитьИнформациюОКодах(ТаблицаКодов, ДобавитьКоличествоВСоставКода = Ложь)
	
	ОсновнойМодуль.ДобавитьИнформациюОКодах(ТаблицаКодов, ДобавитьКоличествоВСоставКода);
	
КонецПроцедуры

// Добавляет в таблицу кодов вложенные коды и читает информацию по ним
//
// Параметры:
//  ТаблицаКодов - ТаблицаЗначений - см. функцию Новый_ТаблицаКодов();
//
Процедура ДобавитьВложенныеКодыВТаблицуКодов(ТаблицаКодов)
	
	ОсновнойМодуль.ДобавитьВложенныеКодыВТаблицуКодов(ТаблицаКодов);
	
КонецПроцедуры

// Добавляет в таблицу кодов вложенные коды всех уровней и читает информацию по ним
//
// Параметры:
//  ТаблицаКодов - ТаблицаЗначений - см. функцию Новый_ТаблицаКодов();
//
Процедура ДобавитьВсеВложенныеКодыВТаблицуКодов(ТаблицаКодов)
	
	ОсновнойМодуль.ДобавитьВсеВложенныеКодыВТаблицуКодов(ТаблицаКодов);
	
КонецПроцедуры

// Добавляет в таблицу кодов полные коды
//
// Параметры:
//  ТаблицаКодов - ТаблицаЗначений - см. функцию Новый_ТаблицаКодов();
//  ЗаменитьGS - Булево - Истина, если необходимо заменить разделитель GS1 на строку \u001d
//
Процедура ДобавитьПолныеКодыВТаблицуКодов(ТаблицаКодов, ЗаменитьGS = Ложь)
	
	ОсновнойМодуль.ДобавитьПолныеКодыВТаблицуКодов(ТаблицаКодов);
	
КонецПроцедуры

// Заполняет связи ключей, коды маркировки, а также информацию из регистров
// КонтурМаркировка_СтатусыКодовГИСМТ и КонтурМаркировка_ИнформацияОКодах
//
// Параметры:
//  ТаблицаКодов - ТаблицаЗначений - см. функцию Новый_ТаблицаКодов();
//
Процедура ЗаполнитьВсюИнформациюВТаблицеКодов(ТаблицаКодов)
	
	ОсновнойМодуль.ЗаполнитьВсюИнформациюВТаблицеКодов(ТаблицаКодов);
	
КонецПроцедуры

// Расформировывает агрегат
//
// Параметры:
//  КодАгрегата - Строка - код маркировки агрегата
//
Процедура РасформироватьАгрегат(КодАгрегата)
	
	ОсновнойМодуль.РасформироватьАгрегат(КодАгрегата);
	
КонецПроцедуры

// Читает описание товара по ссылке
//
// Параметры:
//  Товар - СправочникСсылка.КонтурМаркировка_Товары - товар;
//  КэшРезультатов - Соответствие - (необязательный) кэш результатов функции;
// 
// Возвращаемое значение:
//  Структура - см. Новый_Товар();
//
Функция ОписаниеТовара(Товар, КэшРезультатов = Неопределено)
	
	Возврат ОсновнойМодуль.ОписаниеТовара(Товар, КэшРезультатов);
	
КонецФункции

// Получает любой склад организации
//
// Параметры:
//  Организация - СправочникСсылка.КонтурМаркировка_Товары - товар;
// 
// Возвращаемое значение:
//  СправочникСсылка.КонтурМаркировка_Склады - склад указанной организации;
//
Функция СкладОрганизации(Организация)
	
	Возврат ОсновнойМодуль.СкладОрганизации(Организация);
	
КонецФункции

// #КонецОбласти СлужебныеПроцедурыИФункции

// #Область ПрограммныеПеречисления

// Возвращает доступные форматы файлов для хранения кодов
// 
// Возвращаемое значение:
//  Структура - содержит свойства:
//   * csv  - текстовый файл с разделителями колонок;
//   * xlsx - таблица Excel;
//
Функция Перечисление_ФорматыФайловСКодами()
	
	Возврат ОсновнойМодуль.Перечисление_ФорматыФайловСКодами();
	
КонецФункции

// Возвращает все возможные значения основного статуса документов учета
// 
// Возвращаемое значение:
//  Структура
//
Функция Перечисление_СтатусыДокументовУчета()
	
	Возврат ОсновнойМодуль.Перечисление_СтатусыДокументовУчета();
	
КонецФункции

// Возвращает все возможные типы операций у операции
// 
// Возвращаемое значение:
//  Структура
//
Функция Перечисление_ТипыОпераций()
	
	Возврат ОсновнойМодуль.Перечисление_ТипыОпераций();
	
КонецФункции

// Возвращает все возможные статусы у операции
// 
// Возвращаемое значение:
//  Структура
//
Функция Перечисление_СтатусыОпераций()
	
	Возврат ОсновнойМодуль.Перечисление_СтатусыОпераций();
	
КонецФункции

// Возвращает все возможные типы оплаты в заказе кодов
// 
// Возвращаемое значение:
//  Структура
//
Функция Перечисление_ТипыОплатыКодов()
	
	Возврат ОсновнойМодуль.Перечисление_ТипыОплатыКодов();
	
КонецФункции

// Возвращает все возможные типы использования кодов в отчете о нанесении
// 
// Возвращаемое значение:
//  Структура
//
Функция Перечисление_ТипыИспользованияКодов()
	
	Возврат ОсновнойМодуль.Перечисление_ТипыИспользованияКодов();
	
КонецФункции

// Возвращает все возможные способы выпуска товаров
// 
// Возвращаемое значение:
//  Структура
//
Функция Перечисление_СпособыВыпускаТоваров()
	
	Возврат ОсновнойМодуль.Перечисление_СпособыВыпускаТоваров();
	
КонецФункции

// Возвращает варианты размещения дополнительных кнопок на формах.
// 
// Возвращаемое значение:
//  Структура:
//   *ОсновнаяФормаСписокДокументов - панель над списком документов на основной форме;
//   *ДокументУчетаШапка - шапка формы ДокументУчета;
//   *ДокументУчетаСписокКодов - панель над списком кодов маркировки в документе учета;
//   *ОперацияШапка - шапка формы Операция;
//   *ОперацияЭтикетки - панель над этикетками в операции печати;
//
Функция Перечисление_РазмещениеДополнительныхКнопок()
	
	Возврат ОсновнойМодуль.Перечисление_РазмещениеДополнительныхКнопок();
	
КонецФункции

// Возвращает все возможные требуемые действия для выполнении обмена с сервисом
// 
// Возвращаемое значение:
//  Строка
//
Функция Перечисление_ТребуемыеДействия()
	
	Возврат ОсновнойМодуль.Перечисление_ТребуемыеДействия();
	
КонецФункции

// Возвращает все возможные типы бизнес процессов для выполнении обмена с сервисом
// 
// Возвращаемое значение:
//  Строка
//
Функция Перечисление_ТипыБизнесПроцессовОчередиОбмена()
	
	Возврат ОсновнойМодуль.Перечисление_ТипыБизнесПроцессовОчередиОбмена();
	
КонецФункции

// Возвращает все виды первичных документов
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура
//
Функция Перечисление_ВидыПервичныхДокументов()
	
	Возврат ОсновнойМодуль.Перечисление_ВидыПервичныхДокументов();
	
КонецФункции

// Возвращает все причины вывода из оборота
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура
//
Функция Перечисление_ПричиныВыводаИзОборота()
	
	Возврат ОсновнойМодуль.Перечисление_ПричиныВыводаИзОборота();
	
КонецФункции

// Возвращает все роли документов учета
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура
//
Функция Перечисление_РолиДокументовУчета()
	
	Возврат ОсновнойМодуль.Перечисление_РолиДокументовУчета();
	
КонецФункции

// #КонецОбласти ПрограммныеПеречисления

// #Область Контракты

// Контракт таблицы кодов маркировки для добавления в документ
// 
// Возвращаемое значение:
//  ТаблицаЗначений - содержит колонки:
//   * КодАгрегата - Строка - (необязательный) код родительской упаковки;
//   * КодМаркировки - Строка - код маркировки или агрегата;
//   * ИсходныйКодМаркировки - Строка - (необязательный) код маркировки до нормализации;
//   * СерийныйНомер - Строка - (необязательный) серийный номер товара;
//   * ОписаниеОшибки - Строка - (необязательный) описание ошибки при действиях с кодом;
//   * КлючКода - УникальныйИдентификатор - (необязательный) ключ кода маркировки;
//   * КлючАгрегата - УникальныйИдентификатор - (необязательный) ключ кода агрегата;
//   * КлючСтрокиДокумента - УникальныйИдентификатор - (необязательный) ключ строки документа учета;
//   * КлючСтрокиОперации - УникальныйИдентификатор - (необязательный) ключ строки документа операции;
//   * КодРазобран - Булево - Истина, если код успешно нормализован;
//   * ДляВнутреннегоУчета - Булево - признак использования кода только для внутреннего учета;
//   * ОбщийТипУпаковки - ПеречислениеСсылка.КонтурМаркировка_ОбщиеТипыУпаковок - (необязательный) общий тип упаковки;
//   * ТипУпаковки   - ПеречислениеСсылка.КонтурМаркировка_ТипыУпаковок - (необязательный) тип упаковки;
//   * ТипШтрихкода  - ПеречислениеСсылка.КонтурМаркировка_ТипыШтрихкодов - (необязательный) тип штрихкода;
//   * ВидПродукции  - ПеречислениеСсылка.КонтурМаркировка_ВидыПродукции - (необязательный) вид продукции;
//   * КлючНоменклатуры1С - Строка - ключ номенклатуры 1С;
//   * Товар - СправочникСсылка.КонтурМаркировка_Товары - (необязательный) товар маркировки;
//   * GTIN - Строка - (необязательный) код товара;
//   * ПолныйКод - Строка - (необязательный) код маркировки с криптохвостом;
//   * ДатаСрокаГодности - Дата - (необязательный) дата окончания срока годности;
//   * ДатаПроизводства - Дата - (необязательный) дата производства;
//   * Количество - Число - (необязательный) вес или объем;
//   * ИдентификаторВСД - Строка - (необязательный) идентификатор ВСД;
//   * КодТНВЭД - Строка - (необязательный) код ТНВЭД;
//   * Производитель - СправочникСсылка.КонтурМаркировка_Контрагенты - (необязательный) производитель;
//   * ПроизводительИНН - Строка - ИНН (необязательный) производителя;
//   * ПроизводительНаименование - Строка - (необязательный) наименование производителя;
//   * Владелец - СправочникСсылка.КонтурМаркировка_Контрагенты - (необязательный) владелец;
//   * ВладелецИНН - Строка - (необязательный) ИНН владельца;
//   * ВладелецНаименование - Строка - (необязательный) наименование владельца;
//   * Номенклатура - СправочникСсылка - (необязательный) номенклатура 1С;
//   * Характеристика - СправочникСсылка - (необязательный) характеристика номенклатуры;
//   * Упаковка - СправочникСсылка - (необязательный) упаковка;
//   * Серия - СправочникСсылка - (необязательный) серия;
//
Функция ТаблицаНовыхКодов() Экспорт
	
	Возврат ОсновнойМодуль.ТаблицаНовыхКодов();
	
КонецФункции

// Контракт параметров загрузки новых кодов в документ
// 
// Возвращаемое значение:
//  Структура - параметры загрузки:
//   * УдалитьСтарыеКоды        - Булево - (необязательный) Истина, если из документа нужно удалить старые коды;
//   * ЗаполнитьТоварыДокумента - Булево - (необязательный) Истина, если товары документа нужно перезаполнить номенклатурой кодов;
//   * ЗаполнитьТоварыАгрегатов - Булево - (необязательный) Истина, если нужно заполнить товары агрегатов,
//                                      если не указан используются настройки модуля;
//   * УдалитьИзДокументаКодыВАгрегатах - Булево - (необязательный) Истина, если нужно удалить из документа коды в агрегатах;
//
Функция ПараметрыЗагрузкиНовыхКодовВДокумент() Экспорт
	
	Возврат ОсновнойМодуль.ПараметрыЗагрузкиНовыхКодовВДокумент();
	
КонецФункции

// Содержит параметры для сохранения кодов в файл
// 
// Возвращаемое значение:
//  Структура - содержит свойства:
//   * ТаблицаСтрок             - ТаблицаЗначений - таблица с кодами,
//                                         которые нужно сохранить в файл;
//   * РазделительКолонок       - Строка - символ для разделения колонок в файле CSV;
//   * ИмяФайлаБезРасширения    - Строка - имя файла без расширения;
//   * ДобавитьЗаголовкиКолонок - Булево - Истина, если в первую строку файла
//                                         нужно добавить заголовки колонок;
//
Функция НовоеОписаниеФайлаДляВыгрузкиКодов()
	
	Возврат ОсновнойМодуль.НовоеОписаниеФайлаДляВыгрузкиКодов();
	
КонецФункции

// Описание вида документа для выбора из информационной системы
// 
// Возвращаемое значение:
//  Структура - содержит свойства:
//   * Представление    - Строка - представление вида документа;
//   * ПолноеИмяОбъекта - Строка - полное имя объекта, который нужно выбрать;
//   * ИмяФормыВыбора   - Строка - (необязательный) путь к нестандартной форме выбора, которую нужно открыть;
//   * ПараметрыФормы   - Структура - параметры, которые будут переданы в форму, содержит свойство:
//      ** Отбор - Структура - отбор, который будет установлен списке выбора:
//          *** Ключ     - Строка - имя поля для отбора;
//          *** Значение - Произвольный - значение поля отбора;
//
Функция НовоеОписаниеВидаДокументаДляВыбора()
	
	Возврат ОсновнойМодуль.НовоеОписаниеВидаДокументаДляВыбора();
	
КонецФункции

// Контракт коллекции шаблонов этикеток
// 
// Возвращаемое значение:
//  Структура - шаблоны этикеток:
//   * ШаблонТоварнойЭтикетки - шаблон товарной этикетки;
//   * ШаблонТранспортнойЭтикетки - шаблон транспортной этикетки;
//   * ШаблонГрупповойЭтикетки - шаблон этикетки КИГУ;
//
Функция ШаблоныДляПечатиЭтикеток()
	
	Возврат ОсновнойМодуль.ШаблоныДляПечатиЭтикеток();
	
КонецФункции

// Контракт описания дополнительной кнопки для размещения в модуле
// 
// Возвращаемое значение:
//   * Структура - таблица с настройками кнопок;
//     ** ИмяКнопки - Строка - имя кнопки;
//     ** Заголовок - Строка - заголовок кнопки;
//     ** Размещение - Строка - см. Перечисление_РазмещениеДополнительныхКнопок();
//     ** ТипОперации - Строка - см. Перечисление_ТипыОпераций();
//     ** ТипДокумента - Строка - имя документа в дереве метаданных;
//
Функция НоваяНастройкаДопКнопки()
	
	Возврат ОсновнойМодуль.НоваяНастройкаДопКнопки();
	
КонецФункции

// Контракт описания ошибки при заполнении развернутой таблицы упаковок
// 
// Возвращаемое значение:
//   Структура - содержит:
//    * ТекстОшибки - Строка - описание ошибки;
//    * ВладелецКодов - ДокументСсылка - документ-владелец штрихкодов, в котором возникла ошибка;
//    * ДокументМаркировки - СправочникСсылка - документ Контур.Маркировки, с которым связан документ-владелец;
//
Функция НовоеОписаниеОшибкиРазвернутойТаблицыУпаковок(ВладелецКодов, ДокументМаркировки)
	
	Возврат ОсновнойМодуль.НовоеОписаниеОшибкиРазвернутойТаблицыУпаковок(ВладелецКодов, ДокументМаркировки);
	
КонецФункции

// #КонецОбласти Контракты

// #Область МетодыОбщегоНазначения

// Подставляет параметры в строку, максимальное число параметров - 5
//
// Параметры:
//  ШаблонСтроки - Строка - шаблон с маркерами подстановки: "%1..%N";
//  Параметр<n>  - Строка - параметры, которые нужно подставить;
//
// Возвращаемое значение:
//   Строка - строка шаблона с подставленными параметрами.
//
Функция ПараметрыВСтроку(ШаблонСтроки, Параметр1
	, Параметр2 = Неопределено, Параметр3 = Неопределено
	, Параметр4 = Неопределено, Параметр5 = Неопределено)
	
	Возврат ОсновнойМодуль.ПараметрыВСтроку(ШаблонСтроки
	, Параметр1, Параметр2, Параметр3, Параметр4, Параметр5);
	
КонецФункции

// Возвращает структуру, содержащую значения реквизитов прочитанные из информационной базы
// по ссылке на объект.
// 
//  Если доступа к одному из реквизитов нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
// 
// Параметры:
//  Ссылка    - Ссылка на объект - элемент справочника, документ, ...
//
//  Реквизиты - Строка - имена реквизитов, перечисленные через запятую, в формате
//              требований к свойствам структуры.
//              Например, "Код, Наименование, Родитель".
//            - Структура, ФиксированнаяСтруктура - в качестве ключа передается
//              псевдоним поля для возвращаемой структуры с результатом, а в качестве
//              значения (опционально) фактическое имя поля в таблице.
//              Если значение не определено, то имя поля берется из ключа.
//            - Массив, ФиксированныйМассив - имена реквизитов в формате требований
//              к свойствам структуры.
//
// Возвращаемое значение:
//  Структура - содержит имена (ключи) и значения затребованных реквизитов.
//              Если строка затребованных реквизитов пуста, то возвращается пустая структура
//
Функция ЗначенияРеквизитовОбъекта_Марк(Ссылка, Реквизиты)
	
	Возврат ОсновнойМодуль.ЗначенияРеквизитовОбъекта_Марк(Ссылка, Реквизиты);
	
КонецФункции

// Возвращает значение реквизита объекта прочитанного из базы через запрос
// 
// Параметры:
//  Ссылка - ЛюбаяСсылка - ссылка на объект;
//  ИмяРеквизита - Строка - имя реквизита;
// 
// Возвращаемое значение:
//  Произвольный - значение реквизита
//
Функция ЗначениеРеквизитаОбъекта_Марк(Ссылка, ИмяРеквизита)
	
	Возврат ОсновнойМодуль.ЗначениеРеквизитаОбъекта_Марк(Ссылка, ИмяРеквизита);
	
КонецФункции

// Возвращает значение дополнительного реквизита объекта
//
// Параметры:
//  Ссылка - ЛюбаяСсылка - ссылка на объект;
//  ИмяДопРеквизита - Строка - имя дополнительного реквизита;
//  ЗначениеПоУмолчанию - Произвольный - значение по умолчанию, если доп реквизита нет;
// 
// Возвращаемое значение:
//  Произвольный - значение дополнительного реквизита
//
Функция ЗначениеДопРеквизитаОбъекта(Ссылка, ИмяДопРеквизита, ЗначениеПоУмолчанию = Неопределено)
	
	Возврат ОсновнойМодуль.ЗначениеДопРеквизитаОбъекта(Ссылка, ИмяДопРеквизита, ЗначениеПоУмолчанию);
	
КонецФункции

// Возвращает значение свойства из регистра доп сведений
// 
// Параметры:
//  Ссылка - ЛюбаяСсылка - ссылка на объект;
//  ИмяСвойства - Строка - имя свойства;
//  ЗначениеПоУмолчанию - Произвольный - значение по умолчанию, если доп сведений нет;
// 
// Возвращаемое значение:
//  Произвольный - значение доп сведения;
//  Неопределено - если таких доп сведений нет;
//
Функция ЗначениеДопСвойстваОбъекта(Ссылка, ИмяСвойства, ЗначениеПоУмолчанию = Неопределено)
	
	Возврат ОсновнойМодуль.ЗначениеДопСвойстваОбъекта(Ссылка, ИмяСвойства, ЗначениеПоУмолчанию);
	
КонецФункции

// Выполняет поиск строки в таблице значений по параметрам отбора
//
// Параметры:
//  ТаблицаЗначений - ТаблицаЗначений - таблица значений;
//  ПараметрыОтбора - Структура - параметры отбора, где:
//                     * Ключ - имя колонки
//                     * Значение - значение, которое нужно найти в колонке
// 
// Возвращаемое значение:
//  СтрокаТаблицыЗначений - первая найденная строка;
//  Неопределено          - если значение найти не удалось;
//
Функция ТаблицаЗначений_НайтиСтроку(ТаблицаЗначений, ПараметрыОтбора)
	
	Возврат ОсновнойМодуль.ТаблицаЗначений_НайтиСтроку(ТаблицаЗначений, ПараметрыОтбора);
	
КонецФункции

// Ищет подходящие строки в массиве структур
//
// Параметры:
//  МассивСтруктур  - Массив	 - содержит структуры с одинаковым набором свойств;
//  ПараметрыОтбора - Структура	 - условия поиска, где:
//   * Ключ		 - имя свойства в структурах массива;
//   * Значение	 - подходящее значение;
//
// Возвращаемое значение:
//  Массив - содержит подходящие структуры
//
Функция МассивСтруктур_НайтиСтроки(МассивСтруктур, ПараметрыОтбора)
	
	Возврат ОсновнойМодуль.МассивСтруктур_НайтиСтроки(МассивСтруктур, ПараметрыОтбора);
	
КонецФункции

// Считает хеш-сумму SHA-256 для каждой строки
//
// Параметры:
//  Строки - Массив, Строка - строки, по которым нужно посчитать хеш
// 
// Возвращаемое значение:
//  Массив - содержит хеш-суммы в виде строк base64
//
Функция ХешСуммыСтрок(Строки)
	
	Возврат ОсновнойМодуль.ХешСуммыСтрок(Строки);
	
КонецФункции

// Получает текст из строки base64
//
// Параметры:
//  СтрокаBase64 - Строка - строка закодированная по алгоритму base64;
//  Кодировка - КодировкаТекста, Строка - (необязательный) кодировка текста;
// 
// Возвращаемое значение:
//  Строка
//
Функция СтрокаИзBase64(СтрокаBase64, Кодировка = "UTF-8")
	
	Возврат ОсновнойМодуль.СтрокаИзBase64(СтрокаBase64, Кодировка);
	
КонецФункции

// Записывает текст в строку base64
//
// Параметры:
//  Строка - Строка - текст, который нужно записать;
//  Кодировка - КодировкаТекста, Строка - (необязательный) кодировка текста;
// 
// Возвращаемое значение:
//  Строка - строка закодированная по алгоритму base64
//
Функция Base64ИзСтроки(Строка, Кодировка = "UTF-8")
	
	Возврат ОсновнойМодуль.Base64ИзСтроки(Строка, Кодировка);
	
КонецФункции

// Формирует массив структур из таблицы значений
// свойства структур соответствуют колонкам таблицы значений
//
// Параметры:
//  ТаблицаЗначений - ТаблицаЗначений - таблица, из которой нужно сформировать массив структур
// 
// Возвращаемое значение:
//  Массив - содержит структуры
//
Функция МассивСтруктурИзТаблицыЗначений(ТаблицаЗначений)
	
	Возврат ОсновнойМодуль.МассивСтруктурИзТаблицыЗначений(ТаблицаЗначений);
	
КонецФункции

// Формирует таблицу значений из массива структур
// колонки таблицы значений соответствуют свойствам структур
//
// Параметры:
//  МассивСтруктур - Массив - содержит структуры
// 
// Возвращаемое значение:
//  ТаблицаЗначений
//
Функция ТаблицаЗначенийИзМассиваСтруктур(МассивСтруктур)
	
	Возврат ОсновнойМодуль.ТаблицаЗначенийИзМассиваСтруктур(МассивСтруктур);
	
КонецФункции

// Разделяет текст на части по указанному разделителю
//
// Параметры:
//  Строка - Строка - разделяемый текст;
//  Разделитель - Строка - (необязательный) значение разделителя;
//  ВключатьПустые - Булево - Истина, если пустые части нужно включить в результат;
// 
// Возвращаемое значение:
//  Массив - содержит части текста
//
Функция РазделитьСтроку(Строка, Разделитель = ",", ВключатьПустые = Ложь)
	
	Возврат ОсновнойМодуль.РазделитьСтроку(Строка, Разделитель, ВключатьПустые);
	
КонецФункции

// Соединяет массив строк в текст
// 
// Параметры:
//  Строки - Массив, ФиксированныйМассив - строки, которые нужно объединить;
//  Разделитель - Строка - разделитель, который будет вставлен между строками;
//
// Возвращаемое значение:
//  Строка
//
Функция СоединитьСтроку(Строки, Разделитель = "")
	
	Возврат ОсновнойМодуль.СоединитьСтроку(Строки, Разделитель);
	
КонецФункции

// Удаляет кавычки экранирования CSV из строки
//
// Параметры:
//  Строка - Строка - строка, в которой необходимо удалить кавычки экранирования;
// 
// Возвращаемое значение:
//  Строка - строка без кавычек экранирования;
//
Функция УдалитьКавычкиЭкранированияCSV(Строка)
	
	Возврат ОсновнойМодуль.УдалитьКавычкиЭкранированияCSV(Строка);
	
КонецФункции

// Возвращает автоматический режим управления блокировкой данных,
// если в базе по умолчанию используется режим "Автоматический и управляемый"
//
// Это нужно для того, чтобы снизить количество ошибок установки неправильного режима блокировки в транзакциях,
// когда кроме объектов Контур.Маркировки задействованы объекты системы учета с автоматическим режимом
// 
// Возвращаемое значение:
//  РежимУправленияБлокировкойДанных.Автоматический - если в базе используется "Автоматический и управляемый" режим блокировки
//  Неопределено - если в базе используется "Автоматический" или "Управляемый" режим управления блокировки данных по умолчанию
//
Функция РежимУправленияБлокировкой()
	
	Возврат ОсновнойМодуль.РежимУправленияБлокировкой();
	
КонецФункции

// Удаляет дубли из массива значений
//
// Параметры:
//  Массив					 - Массив - массив который необходимо свернуть;
//  УдалитьПустыеЗначения	 - Булево - (необязательный) Истина, если нужно удалить пустые значения;
//
Процедура УдалитьДублиИзМассива(Массив, УдалитьПустыеЗначения = Ложь)
	
	ОсновнойМодуль.УдалитьДублиИзМассива(Массив, УдалитьПустыеЗначения);
	
КонецПроцедуры

// Формирует новый пустой уникальный идентификатор
// 
// Возвращаемое значение:
//  УникальныйИдентификатор - пустой уникальный идентификатор
//
Функция НовыйПустойУникальныйИдентификатор()
	
	Возврат ОсновнойМодуль.НовыйПустойУникальныйИдентификатор();
	
КонецФункции

// Создает и заполняет операцию по таблице кодов
//
// Параметры:
//  Документ1С - ДокументСсылка - документ 1С;
//  ТипОперации - Строка - см. Перечисление_ТипыОпераций();
//  ТаблицаКодов - ТаблицаЗначений - см. Новый_ТаблицаКодов()
// 
// Возвращаемое значение:
//  СправочникСсылка.КонтурМаркировка_Операции - созданная операция
//
Функция СоздатьОперациюПоДокументуИЗагрузитьКоды(Документ1С, ТипОперации, ТаблицаКодов)
	
	Возврат ОсновнойМодуль.СоздатьОперациюПоДокументуИЗагрузитьКоды(Документ1С, ТипОперации, ТаблицаКодов);
	
КонецФункции

// #КонецОбласти МетодыОбщегоНазначения
