// 	Copyright (C) 2012-2025 Engineer Mareev Enterprises
//	Модуль для УТ 10.3 экспортирует сообщения shipments 
                                                                                                                 
//	$Задание на доставку
//  Экспорт сообщений SHIPMENTS:
//	 - В 1С оператор (руч.) оформляет документ "Задание на доставку", который при записи (проведенный) (авт.) помечается к Экспорту.
//	 - 1С (авт.) экспортирует сообщение SHIPMENTS.

#Область ПрограммныйИнтерфейс

//	ПолучитьИмяСообщения возвращает имя сообщения
Функция ПолучитьИмяСообщения() Экспорт
	Возврат "shipments";
КонецФункции

//	Функция ПолучитьМетаданные возвращает метаданные сообщения
Функция ПолучитьМетаданные() Экспорт
	Возврат Метаданные.Документы.ЗаданиеНаДоставку_ЛА;
КонецФункции

//	Процедура Экспортировать экспортирует один документ Заявка на перевозку Яндекс-магистрали
Процедура Экспортировать(ERPData, ЗаданиеНаДоставку) Экспорт
		
	//	Заголовок сообщения
	EmeWmsERPEngine.AppendHeaderLine(ERPData);

	ERPData.header.shipment_id      = ЗаданиеНаДоставку.УникальныйИдентификатор();
	Если Константы.EmeWmsСоздаватьУникальныеСообщения.Получить() Тогда
		ERPData.header.id	  		= Новый УникальныйИдентификатор;
	Иначе
		ERPData.header.id	  		= ERPData.header.shipment_id;
	КонецЕсли;
	
	НаименованияРеквизитов 			= "Номер, Дата, Водитель, ДатаДоставки ";
	РеквизитыДокумента   			= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗаданиеНаДоставку.Ссылка, НаименованияРеквизитов);

	ERPData.header.shipment_no		= СокрЛП(РеквизитыДокумента.Номер)+"/"+Формат(Год(РеквизитыДокумента.Дата),"ЧГ=4");

	// Реквизиты документа
	Если ЗначениеЗаполнено(РеквизитыДокумента.Водитель) Тогда
		РеквизитыВодителя			= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РеквизитыДокумента.Водитель, "Наименование, ВодительскоеУд, Телефон, ОсновнойАвтомобиль, КомпанияПеревозчик");
	Иначе 
		РеквизитыВодителя			= Новый Структура("Наименование, ВодительскоеУд, Телефон, ОсновнойАвтомобиль, КомпанияПеревозчик");
	КонецЕсли;              
	
	// Дополнительные параметры
	ПеревозчикСсылка 				= РеквизитыВодителя.КомпанияПеревозчик;
	Если ЗначениеЗаполнено(ПеревозчикСсылка) Тогда
		ERPData.header.carrier_id		= ПеревозчикСсылка.УникальныйИдентификатор();
		ERPData.header.carrier_code		= ПеревозчикСсылка.Код;
		ERPData.header.carrier_name		= ПеревозчикСсылка.Наименование;
	КонецЕсли;
	
	АвтомобильСсылка 				= РеквизитыВодителя.ОсновнойАвтомобиль;
	Если ЗначениеЗаполнено(АвтомобильСсылка) Тогда
		ERPData.header.car_brand		= "Грузовик";
		ERPData.header.car_regno		= АвтомобильСсылка.ГосНомр;
	КонецЕсли;
	
	ERPData.header.despatch_date	= РеквизитыДокумента.ДатаДоставки;
	ERPData.header.arrival_at_plan	= РеквизитыДокумента.ДатаДоставки;

	ERPData.header.driver_name		= РеквизитыВодителя.Наименование;
	ERPData.header.driver_license	= РеквизитыВодителя.ВодительскоеУд;
	ERPData.header.phone			= РеквизитыВодителя.Телефон;

	ERPData.header.is_cancel		= 0;
	
	//	Дата запуска интеграции
	ДатаЗапускаИнтеграции = Константы.EmeWmsДатаЗапускаИнтеграции.Получить();

	EmeWmsERPEngine.SelectChild(ERPData, "orders");

	КодСкладаWMS = "";
	Для Каждого СтрокаДокумента Из ЗаданиеНаДоставку.Задания Цикл

		//	Строки для заказов: отбираем только Реализации товаров, Заказ поставщику не надо
		РеализацияСсылка = СтрокаДокумента.Документ;		
		Если Не РеализацияСсылка.Пустая() Тогда
			Если ТипЗнч(РеализацияСсылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				
				//	Дата запуска интеграции
				Если ЗначениеЗаполнено(ДатаЗапускаИнтеграции)
						И РеализацияСсылка.Дата < ДатаЗапускаИнтеграции Тогда
					Продолжить;
				КонецЕсли;	
								
				СкладСсылка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеализацияСсылка, "Склад");
				КодСкладаWMS = EmeWmsУтилиты.ПолучитьКодСкладаEMEПоСсылке(СкладСсылка);							
				
				Если Не ЗначениеЗаполнено(КодСкладаWMS) Тогда
					Продолжить;
				КонецЕсли;     
				
				EmeWmsERPEngine.AppendChildLine(ERPData); 
				Если LA_ОбщийМодуль.ЭтоСкладМХ(СкладСсылка) Тогда   // склад мх попытаеся найти в еме ссылку на перемещение               //коммит 2701
					ERPData.orders.id      		= РеализацияСсылка.Сделка.УникальныйИдентификатор();
					ERPData.orders.order_id		= ERPData.orders.id;
					ERPData.orders.order_no		= СокрЛП(РеализацияСсылка.Сделка.Номер)+"/"+Формат(Год(РеализацияСсылка.Сделка.Дата),"ЧГ=4");
					ERPData.orders.erp_doc_type	= Метаданные.Документы.РеализацияСсылка.Сделка.Имя;
					ERPData.orders.unloading_order = 0;
				Иначе
					ERPData.orders.id      		= РеализацияСсылка.УникальныйИдентификатор();
					ERPData.orders.order_id		= ERPData.orders.id;
					ERPData.orders.order_no		= СокрЛП(РеализацияСсылка.Номер)+"/"+Формат(Год(РеализацияСсылка.Дата),"ЧГ=4");
					ERPData.orders.erp_doc_type	= Метаданные.Документы.РеализацияТоваровУслуг.Имя;
					ERPData.orders.unloading_order = 0;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;		 
			
	ERPData.header.whs_code	= КодСкладаWMS;

КонецПроцедуры

#КонецОбласти

#Область ЭкспортныеСлужебныеПроцедурыИФункции

//	Процедура ПодтвердитьЭкспорт подтверждает экспорт документа Задание на доставку.
Процедура ПодтвердитьЭкспорт(Документ) Экспорт

	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуЗаданийНаДоставку.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЗаданиеНаДоставку.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Ложь;
		Запись.ДатаЭкспорта = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
КонецПроцедуры

//	Функция ПолучитьВыборкуСсылок возвращает выборку ссылок документов Задание на доставку для экспорта
Функция ПолучитьВыборкуСсылок() Экспорт
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	EmeWmsПометкиКЭкспортуЗаданийНаДоставку.ЗаданиеНаДоставку КАК Ссылка
		|ИЗ
		|	РегистрСведений.EmeWmsПометкиКЭкспортуЗаданийНаДоставку КАК EmeWmsПометкиКЭкспортуЗаданийНаДоставку
		|ГДЕ
		|	EmeWmsПометкиКЭкспортуЗаданийНаДоставку.КЭкспорту";
		
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции

//	Процедура ПометитьКЭкспорту помечает документ Задание на доставку к экспорту.
Процедура ПометитьКЭкспорту(Документ) Экспорт

	Если Не РазрешенКЭкспорту(Документ) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуЗаданийНаДоставку.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЗаданиеНаДоставку.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Истина;
		Запись.Дата = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsПометкиКЭкспортуЗаданийНаДоставку.СоздатьМенеджерЗаписи();
	НоваяЗапись.ЗаданиеНаДоставку = Документ.Ссылка;
	НоваяЗапись.КЭкспорту = Истина;
	НоваяЗапись.Дата = ТекущаяДата();
    НоваяЗапись.Записать(); 
		 
КонецПроцедуры

//	Процедура ПометитьКЭкспорту помечает документ Задание на доставку на событии при записи
Процедура ПометитьКЭкспортуПриЗаписиЗаданийНаДоставку(Источник, Отказ) Экспорт	

	//	Помечать, если включен режим пометок к экспорту
	Если Константы.EmeWmsПометкаВключена.Получить() Тогда
		ПометитьКЭкспорту(Источник);
	КонецЕсли;		 
		 
КонецПроцедуры

//	Функция ПомеченКЭкспорту возвращает Истина, если документ Задание на доставку помечен к экспорту.
Функция ПомеченКЭкспорту(Документ) Экспорт
	
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуЗаданийНаДоставку.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЗаданиеНаДоставку.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Возврат Запись.КЭкспорту;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

//	Процедура ОтменитьЭкспорт отменяет экспорт документа.
Процедура ОтменитьЭкспорт(Документ) Экспорт

	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуЗаданийНаДоставку.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЗаданиеНаДоставку.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Ложь;
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
КонецПроцедуры

//	Функция РазрешенКЭкспорту возвращает Истина, если документ ЗаданиеНаДоставку разрешен к экспорту.
Функция РазрешенКЭкспорту(Документ) Экспорт
	
	ДатаЗапускаИнтеграции = Константы.EmeWmsДатаЗапускаИнтеграции.Получить();
	Если ЗначениеЗаполнено(ДатаЗапускаИнтеграции) И Документ.Дата < ДатаЗапускаИнтеграции Тогда
		ОтменитьЭкспорт(Документ);
		Возврат Ложь;
	КонецЕсли;	

	Если Документ.ПометкаУдаления Тогда
		ОтменитьЭкспорт(Документ);
		Возврат Ложь;
	КонецЕсли;
	
	// Эскпортируются проведенные документы Заявка на перевозку
	Если НЕ Документ.Проведен Тогда
		ОтменитьЭкспорт(Документ);
		Возврат Ложь;
	КонецЕсли;
	
	// Выгрузка только по статусу Готово
	//Если НРег(Документ.EmeWmsСтатус) <> "готово" Тогда
	//	ОтменитьЭкспорт(Документ);
	//	Возврат Ложь;
	//КонецЕсли;
	
	// Уже отгруженные доставки не эскпортируется
	Если Документ.Отгружено Тогда
		ОтменитьЭкспорт(Документ);
		Возврат Ложь;
	КонецЕсли;
	
	// Если нет отгрузок по WMS
	Если Не ЕстьОтгрузкиСоСкладаWMS(Документ) Тогда
		ОтменитьЭкспорт(Документ);
		возврат ложь;
	КонецЕсли;

	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область ЛокальныеСлужебныеПроцедурыИФункции

// Функция определяет, есть ли в строках заданий отгрузки (реализации) товара по склада WMS
Функция ЕстьОтгрузкиСоСкладаWMS(Документ)
	Для каждого СтрокаЗаданий из Документ.Задания Цикл
		Если ТипЗнч(СтрокаЗаданий.Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			СкладСсылка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаЗаданий.Документ, "Склад");
			Если ЗначениеЗаполнено(EmeWmsУтилиты.ПолучитьКодСкладаEMEПоСсылке(СкладСсылка)) Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции

// #IBS Ширяев 21.02.2025 Получить параметры отгрузки по УПД (реализация) из заявки. УПД в этом проекте бывает одна
Функция ПолучитьПараметрыОтгрузки(Заявка)
	Параметры = Новый Структура;
	
	Для Каждого СтрокаУПД Из Заявка.УПД Цикл
		Параметры.Вставить("ДатаОтгрузки", 			СтрокаУПД.ДатаОтгрузки + Час(СтрокаУПД.ВремяОтгрузки) * 3600 + Минута(СтрокаУПД.ВремяОтгрузки) * 60);
		Параметры.Вставить("ДатаДоставки", 			СтрокаУПД.ДатаДоставки + Час(СтрокаУПД.ВремяДоставки) * 3600 + Минута(СтрокаУПД.ВремяДоставки) * 60);

		РеквизитыТТН = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаУПД.ТТН, "Водитель, МаркаАвтомобиля, ГосНомерАвтомобиля, ГосНомерПрицепа");
		Параметры.Вставить("Водитель", 				РеквизитыТТН.Водитель);    
		Параметры.Вставить("МаркаАвтомобиля", 		РеквизитыТТН.МаркаАвтомобиля);    
		Параметры.Вставить("ГосНомерАвтомобиля", 	РеквизитыТТН.ГосНомерАвтомобиля);    
		Параметры.Вставить("ГосНомерПрицепа",	 	РеквизитыТТН.ГосНомерПрицепа);    
		
		Прервать;
	КонецЦикла;	 

	Возврат Параметры;	
КонецФункции

#КонецОбласти
