//	Copyright (C) 2012-2025 Engineer Mareev Enterprises
//	Модуль для УТ 10.3 Экспортирует сообщения orders из документа Корректировка поступления
//	Экспортирует ORDERS c характеристиками или сериями товара. 

//	$Возврат товаров поставщику по корректировке поступления 
//  Экспорт сообщений ORDERS:
//	 - В 1С оператор (руч.) оформляет документ "Корректировка поступления", который при проведении (авт.) помечается к Экспорту.
//	 - 1С (авт.) экспортирует сообщение ORDERS.

#Область ПрограммныйИнтерфейс

//	Функция ПолучитьИмяСообщения возвращает имя сообщения
Функция ПолучитьИмяСообщения() Экспорт
	Возврат "orders";
КонецФункции

//	Функция ПолучитьМетаданные возвращает метаданные сообщения
Функция ПолучитьМетаданные() Экспорт
	Возврат Метаданные.Документы.КорректировкаПоступления;
КонецФункции

// Процедура экспортирует один документ "Корректировка поступления"
Процедура Экспортировать(ERPData, КорректировкаПоступления) Экспорт

    НаборЗаписей = РегистрыСведений.ГраницыЗапретаИзмененияДанных.СоздатьНаборЗаписей();
    НаборЗаписей.Отбор.Организация.Установить(КорректировкаПоступления.Организация);
	НаборЗаписей.Отбор.Пользователь.Установить(ПараметрыСеанса.ТекущийПользователь);
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Сообщить("Дата запрета: " + Строка(Запись.ГраницаЗапретаИзменений));

		Если КорректировкаПоступления.Дата <= Запись.ГраницаЗапретаИзменений Тогда
			Возврат;
			
			Сообщить("Дата запрета");
		КонецЕсли;
	КонецЦикла;
	
	АктуализироватьУИДыСтрок(КорректировкаПоступления.Ссылка);   
	
	//	Заголовок заказа
	EmeWmsERPEngine.AppendHeaderLine(ERPData);

	ERPData.header.order_id       	= КорректировкаПоступления.УникальныйИдентификатор();
	Если Константы.EmeWmsСоздаватьУникальныеСообщения.Получить() Тогда
		ERPData.header.id	  		= Новый УникальныйИдентификатор;
	Иначе
		ERPData.header.id	  		= ERPData.header.order_id;
	КонецЕсли;
	
	ERPData.header.order_no			= СокрЛП(КорректировкаПоступления.Номер)+"/"+Формат(Год(КорректировкаПоступления.Дата),"ЧГ=4");
	ERPData.header.order_date		= КорректировкаПоступления.Дата;
	
	ERPData.header.erp_doc_type	  	= ПолучитьМетаданные().Имя;
	ERPData.header.whs_code 	  	= EmeWmsУтилиты.ПолучитьКодСкладаEMEПоСсылке(КорректировкаПоступления.СкладОрдер, КорректировкаПоступления.Организация);  

	ERPData.header.vendor_code 		= EmeWmsУтилиты.ПолучитьКодОрганизацииEMEПоСсылке(КорректировкаПоступления.Организация);

	ERPData.header.customer_id    	= КорректировкаПоступления.Контрагент.УникальныйИдентификатор();
	ERPData.header.customer_code  	= СокрЛП(КорректировкаПоступления.Контрагент.Код);
	ERPData.header.customer_name  	= КорректировкаПоступления.Контрагент.Наименование;
	
	СведенияОПокупателе 			= УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(КорректировкаПоступления.Контрагент, КорректировкаПоступления.Дата);

	АдресКлиента 					= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе, "ФактическийАдрес");
	АдресДоставки = АдресКлиента;

	Если НЕ ЗначениеЗаполнено(АдресДоставки) Тогда
		АдресДоставки = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе, "ЮридическийАдрес");
	КонецЕсли;
	ERPData.header.customer_addr	= АдресКлиента;
	
	ERPData.header.delivery_id    	= КорректировкаПоступления.Контрагент.УникальныйИдентификатор();
	ERPData.header.delivery_code  	= СокрЛП(КорректировкаПоступления.Контрагент.Код);	
	ERPData.header.delivery_name  	= КорректировкаПоступления.Контрагент.Наименование;
	ERPData.header.delivery_addr  	= АдресДоставки;

	ERPData.header.despatch_date 	= ТекущаяДата();

	ERPData.header.comment        	= Лев(КорректировкаПоступления.Комментарий, 128);
																				  
	//	Экспорт контрагента
	EmeWmsЭкспортКонтрагентов.РазрешитьЭкспорт(КорректировкаПоступления.Контрагент);
	
	//	Использование серий в интеграции
	ИспользоватьСерии = Константы.EmeWmsИспользоватьСерии.Получить();	
	
	//	Строки заказа
	EmeWmsERPEngine.SelectChild(ERPData, "lines");
	Для Каждого СтрокаТовара Из КорректировкаПоступления.Товары Цикл
		//	Не выгружать строку в WMS
		Если СтрокаТовара.EmeWmsНеВыгружать Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаТовара.Номенклатура)
			ИЛИ Не ЗначениеЗаполнено(СтрокаТовара.ЕдиницаИзмерения) Тогда
			
			Продолжить;
		КонецЕсли;  
		
		// 	Количество возвращаемого товара
		КоличествоТовара = СтрокаТовара.КоличествоДоИзменения - СтрокаТовара.Количество;
		Если КоличествоТовара <= 0.0 Тогда
			Продолжить;
		КонецЕсли;
		
		РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТовара.Номенклатура, "БазоваяЕдиницаИзмерения, Код, 
																			|ВестиУчетПоСериям, ВестиУчетПоХарактеристикам");
		
		Если Не ЗначениеЗаполнено(РеквизитыНоменклатуры.БазоваяЕдиницаИзмерения) Тогда
			Продолжить;
		КонецЕсли;  
		
		EmeWmsERPEngine.AppendChildLine(ERPData);

		ERPData.lines.id			= СтрокаТовара.EmeWmsУИДСтроки;
		ERPData.lines.order_line_no	= СтрокаТовара.НомерСтроки;
		ERPData.lines.goods_id		= СтрокаТовара.Номенклатура.УникальныйИдентификатор();
		ERPData.lines.goods_code	= СокрЛП(РеквизитыНоменклатуры.Код);
		ERPData.lines.quantity		= EmeWmsУтилиты.ПересчетВДругуюЕдиницу(КоличествоТовара, 
															 			   СтрокаТовара.ЕдиницаИзмерения,
															 			   РеквизитыНоменклатуры.БазоваяЕдиницаИзмерения);
																		   
		Если ЗначениеЗаполнено(РеквизитыНоменклатуры.БазоваяЕдиницаИзмерения) Тогда
			ERPData.lines.mu_code = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыНоменклатуры.БазоваяЕдиницаИзмерения, "Код"); 
		КонецЕсли;															   
		
		// Серии или серийные номера
		Если Не ИспользоватьСерии Тогда
			РеквизитыНоменклатуры.ВестиУчетПоСериям = Ложь;
		КонецЕсли;
		
		Если РеквизитыНоменклатуры.ВестиУчетПоСериям Тогда // Серии
			Если НЕ СтрокаТовара.СерияНоменклатуры.Пустая() Тогда  
				РеквизитыСерии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТовара.СерияНоменклатуры, "Наименование,СрокГодности");
				
				// Когда Серия - это партия, укажем Серию из документа
				Если ЗначениеЗаполнено(РеквизитыСерии.Наименование) Тогда   
					ERPData.lines.lot_no = РеквизитыСерии.Наименование;      
					ERPData.lines.bbd	 = РеквизитыСерии.СрокГодности;  
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли РеквизитыНоменклатуры.ВестиУчетПоХарактеристикам Тогда // Характеристики
			Если НЕ СтрокаТовара.ХарактеристикаНоменклатуры.Пустая() Тогда
				ERPData.lines.lot_no 	 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовара.ХарактеристикаНоменклатуры, "Наименование");
			КонецЕсли;
		КонецЕсли;

		// Поставщик из строки табличной части товары
		Если ЗначениеЗаполнено(СтрокаТовара.ЗаказПоставщику) Тогда
			ЗаказПоставщику = СтрокаТовара.ЗаказПоставщику;
			ERPData.lines.supplier_id    =	ЗаказПоставщику.Контрагент.УникальныйИдентификатор();
			Если НЕ EmeWmsЭкспортКонтрагентов.Экспортирован(ЗаказПоставщику.Контрагент) Тогда
				EmeWmsЭкспортКонтрагентов.ПометитьКЭкспорту(ЗаказПоставщику.Контрагент);
			КонецЕсли;		
		КонецЕсли;		

		Если СтрокаТовара.Номенклатура.ПометкаУдаления Тогда
			EmeWmsЭкспортНоменклатуры.ПометитьКЭкспортуБезусловно(СтрокаТовара.Номенклатура);
		ИначеЕсли НЕ EmeWmsЭкспортНоменклатуры.Экспортирован(СтрокаТовара.Номенклатура) Тогда
			EmeWmsЭкспортНоменклатуры.РазрешитьЭкспортСГруппами(СтрокаТовара.Номенклатура);
		КонецЕсли;
	КонецЦикла;		

КонецПроцедуры

#КонецОбласти

#Область ЭкспортныеСлужебныеПроцедурыИФункции

//	Процедура ОтменитьЭкспорт отменяет экспорт документа
Процедура ОтменитьЭкспорт(Документ) Экспорт

	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуКорректировокПоступлений.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.КорректировкаПоступления.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Ложь;
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
КонецПроцедуры

//	Функция ПолучитьВыборкуСсылок возвращает выборку ссылок документов для экспорта
Функция ПолучитьВыборкуСсылок() Экспорт
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	EmeWmsПометкиКЭкспортуКорректировокПоступлений.КорректировкаПоступления КАК Ссылка
		|ИЗ
		|	РегистрСведений.EmeWmsПометкиКЭкспортуКорректировокПоступлений КАК EmeWmsПометкиКЭкспортуКорректировокПоступлений
		|ГДЕ
		|	EmeWmsПометкиКЭкспортуКорректировокПоступлений.КЭкспорту";
		
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции

//	Процедура ПометитьКЭкспорту помечает документ к экспорту.
Процедура ПометитьКЭкспорту(Документ) Экспорт

	Если Не РазрешенКЭкспорту(Документ) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуКорректировокПоступлений.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.КорректировкаПоступления.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Истина;
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsПометкиКЭкспортуКорректировокПоступлений.СоздатьМенеджерЗаписи();
	НоваяЗапись.КорректировкаПоступления = Документ.Ссылка;
	НоваяЗапись.КЭкспорту = Истина;
    НоваяЗапись.Записать();  
	
КонецПроцедуры

//	Функция ПомеченКЭкспорту возвращает Истина, если документ помечен к экспорту.
Функция ПомеченКЭкспорту(Документ) Экспорт
	
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуКорректировокПоступлений.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.КорректировкаПоступления.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Возврат Запись.КЭкспорту;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

//	Процедура ПодтвердитьЭкспорт подтверждает экспорт документа
Процедура ПодтвердитьЭкспорт(Документ) Экспорт
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуКорректировокПоступлений.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.КорректировкаПоступления.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Ложь;
		Запись.ДатаЭкспорта = ТекущаяДата();
		НаборЗаписей.Записать();
	КонецЦикла;
КонецПроцедуры

//	Процедура ПометитьКЭкспорту помечает документ на событии при записи
Процедура ПометитьКЭкспортуПриЗаписиКорректировокПоступлений(Источник, Отказ) Экспорт
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//	Помечать, если включен режим пометок к экспорту
	Если Константы.EmeWmsПометкаВключена.Получить() Тогда
		ПометитьКЭкспорту(Источник);
	КонецЕсли;		 
КонецПроцедуры

//	Функция РазрешенКЭкспорту возвращает Истина, если документ РТУ разрешен к экспорту.
Функция РазрешенКЭкспорту(Документ) Экспорт

	ДатаЗапускаИнтеграции = Константы.EmeWmsДатаЗапускаИнтеграции.Получить();
	Если ЗначениеЗаполнено(ДатаЗапускаИнтеграции)
			И Документ.Дата < ДатаЗапускаИнтеграции Тогда
		ОтменитьЭкспорт(Документ);
		Возврат Ложь;
	КонецЕсли;	

	Если Документ.ПометкаУдаления Тогда
		ОтменитьЭкспорт(Документ);
		Возврат Ложь;
	КонецЕсли;

	Если Не Документ.Проведен Тогда
		ОтменитьЭкспорт(Документ);
		Возврат Ложь;
	КонецЕсли; 

	// Экспорт только когда склада-отправитель из EME.WMS (это может быть и группа складов)
	Если EmeWmsУтилиты.ПолучитьКодСкладаEMEПоСсылке(Документ.СкладОрдер, Документ.Организация) = неопределено Тогда 
		ОтменитьЭкспорт(Документ);
		Возврат Ложь;
	КонецЕсли;

	// Экспортируются только корректировки по заказу поставщику
	Если Не ЗначениеЗаполнено(Документ.ДокументПоступления) Тогда
		ОтменитьЭкспорт(Документ);
		Возврат ложь;
	КонецЕсли;

	// Чтобы не было повторного экспорта despatch
	Если ДокументКорректировкаПоступленияИмпортирован(Документ.Ссылка) Тогда
		// Это нужно, чтобы после импорта не пытались экспортироваться от события ПриЗаписи
		ОтменитьЭкспорт(Документ.Ссылка); 
		Возврат ложь;
	КонецЕсли;

	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область ЛокальныеСлужебныеПроцедурыИФункции

// Проверяет, был ли этот документ импортирован (по сообщению despatch), в этом случае возвращает истина
Функция ДокументКорректировкаПоступленияИмпортирован(ДокументСсылка)
	Перем НаборЗаписей;
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеКорректировокПоступлений.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(ДокументСсылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Возврат истина;
	КонецЦикла;
	
	возврат ложь; 
КонецФункции

//	Создать новые УИДы строк и исправить дубли, если возникли (В ТЧ Товары по распоряжениям)
Процедура АктуализироватьУИДыСтрок(ДокументСсылка)  
	
	//	Проверим наличие строк к заполнению реквизита EmeWmsУИДСтроки, прежде чем получать Объект
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИСТИНА КАК ИзменятьEmeWmsУИДСтроки
		|ИЗ
		|	Документ.КорректировкаПоступления.Товары КАК ТЧТовары
		|ГДЕ
		|	ТЧТовары.Ссылка = &Ссылка
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(ТЧТовары.EmeWmsУИДСтроки) 
		|	<> КОЛИЧЕСТВО(РАЗЛИЧНЫЕ 
		|		ВЫБОР
		|			КОГДА ТЧТовары.EmeWmsУИДСтроки > """"
		|				ТОГДА ТЧТовары.EmeWmsУИДСтроки
		|			ИНАЧЕ NULL
		|		КОНЕЦ)";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	// Для исключения дублей УИД в строках ТЧ
	КлючиСтрок 					= Новый Соответствие;
	БылиСозданыИдентификаторы 	= Ложь;

	Документ = ДокументСсылка.ПолучитьОбъект();
	Для Каждого СтрокаТовара Из Документ.Товары Цикл 
		// Генерация специальных UID строк документа при выгрузке
		Если НЕ ЗначениеЗаполнено(СтрокаТовара.EmeWmsУИДСтроки) ИЛИ КлючиСтрок.Получить(СтрокаТовара.EmeWmsУИДСтроки) <> Неопределено Тогда
			СтрокаТовара.EmeWmsУИДСтроки = Новый УникальныйИдентификатор();
			БылиСозданыИдентификаторы 	 = Истина;
		КонецЕсли;
		КлючиСтрок.Вставить(СтрокаТовара.EmeWmsУИДСтроки, 0);
	КонецЦикла;	
	
	Если БылиСозданыИдентификаторы Тогда
		// При записи не перепроводить, не регистрировать по подписке к Эксопрту
		Документ.ОбменДанными.Загрузка = Истина;
		Документ.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

