
// #Область СлужебныеПеременныеИМетодыФормы

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		Результат = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		Результат = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

// #КонецОбласти

// #Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВерсияПлагина = МодульОбъекта().СвойствоСтруктуры(Параметры, "ВерсияПлагина");
	ИдентификаторПлагина = МодульОбъекта().СвойствоСтруктуры(Параметры, "ИдентификаторПлагина");
	
	ОбновитьНастройкиДокументовУчета();
	ЗаполнитьДанныеДляПереносаКоэффициентовПересчета();
	НастроитьТипыЭлементовФормы();
	ЗаполнитьСписокВыбораВидМаркируемойПродукции();
	ОбновитьМаркируемыеТоварныеГруппы();

	Пользователь = МодульОбъекта().Пользователи_ТекущийПользователь();
	ЗаполнитьНастройкиОрганизаций();
	УстановитьОформлениеСписокОрганизаций();
	
	ПоказатьЭтап(ЭтапыСтартовогоПомощника().ПерваяСтраница);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ДанныеНастроек = ДанныеНастроекДляМетрики();
	ДанныеПлагина = ДанныеПлагинаДляМетрики();
	
	МодульКлиента().Метрики_БыстраяНастройка(ДанныеНастроек, ДанныеПлагина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурМаркировка_НастройкаДокументаУчета_Изменен" Тогда
		ОбновитьНастройкиДокументовУчета();
	КонецЕсли;
	
КонецПроцедуры
// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СертификатНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("СертификатПослеВыбора", ЭтаФорма);
	
	МодульКлиента().ОткрытьФормуВыбораСертификата(ОтпечатокСертификата
	, , ЭтаФорма
	, ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиОрганизацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Стр = Элемент.ДанныеСтроки(ВыбраннаяСтрока);
	
	Если Поле = Элементы.СписокОрганизацийСсылкаЗапуститьНастройку Тогда
		
		Организация1С = Стр.Организация1С;
		ИНН = Стр.ИНН;
		КПП = Стр.КПП;
		Организация = Стр.Организация;
		Идентификатор = Стр.Идентификатор;
		НаименованиеОрганизации = СокрЛП(Организация1С);
		Сертификат = Стр.Сертификат;
		
		Если ЗначениеЗаполнено(Организация) Тогда
			ЗаполнитьНастройкиСкладов();
		КонецЕсли;
		
		ПоказатьЭтап("НастройкаОрганизации");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Прокси_ИспользоватьПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры


// #КонецОбласти

// #Область КомандыФормы

&НаКлиенте
Процедура НачатьНастройку(Команда)
	
	Этапы = ЭтапыСтартовогоПомощника();
	ТекущийЭтап = Этапы.ПерваяСтраница;
	ПоказатьСледующийЭтап();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаСледующийЭтап(Команда)
	
	СохранитьТекущиеНастройки();
	
	Если ЭтоПоследнийЭтап() Тогда
		НастройкаЗавершена = Истина;
		Закрыть();
		Возврат;
	КонецЕсли;
	
	ПоказатьСледующийЭтап();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбщиеНастройки(Команда)
	
	СохранитьТекущиеНастройки();
	ПоказатьСледующийЭтап();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаПредыдущийЭтап(Команда)
	
	ПоказатьЭтап(ПредыдущийЭтап());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИдентификаторИзСервиса(Команда)
	
	Если Не ЗначениеЗаполнено(Сертификат) Тогда
		ТекстОшибки = НСтр("ru = 'Необходимо выбрать сертификат.'");
		МодульКлиента().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор, "СертификатГиперссылка");
		Возврат;
	КонецЕсли;
	
	ЗаписатьОрганизацию();
	ЗаписатьНастройкиПодписания();
	
	НовыйИдентификатор = МодульКлиента().Организация_ИдентификаторИзСервиса(Организация, ЭтаФорма);
	Модифицированность = (НовыйИдентификатор <> Идентификатор);
	Идентификатор = НовыйИдентификатор;
	
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда
		Возврат;
	КонецЕсли;
	
	Организация_ЗаписатьИдентификатор();
	
	ОбновитьИнформациюОТарифах();
	
	Попытка
		СинхронизироватьСклады();
	Исключение
		ТекстСообщения = НСтр("ru = 'Не удалось выполнить синхронизацию складов. Подробности в журнале регистрации.'");
		МодульКлиента().СообщитьПользователюЛок(ТекстСообщения);
		Возврат;
	КонецПопытки;
	
	ЗаполнитьНастройкиСкладов();
	
	ЗаполнитьНастройкиОрганизаций();
	
	УправлениеФормой();
	
	Попытка
		СинхронизироватьСправочники();
	Исключение
		ТекстСообщения = НСтр("ru = 'Не удалось выполнить синхронизацию справочников. Подробности в журнале регистрации.'");
		МодульКлиента().СообщитьПользователюЛок(ТекстСообщения);
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	
	ПроверитьПодключениеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиСети(Команда)
	
	ЗаполнитьНастройкиСети();
	ПоказатьЭтап(ЭтапыСтартовогоПомощника().НастройкиСети);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРегистр_КонтурМаркировкаОСУ_СведенияОбУпаковках(Команда)
	
	ОткрытьФорму("РегистрСведений.КонтурМаркировкаОСУ_СведенияОбУпаковках.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокКоэффициентыПересчета(Команда)
	
	МодульКлиента().ОткрытьФормуСпискаКоэффициентовПересчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНастройкуДокумента(Команда)
	
	МодульКлиента().ОткрытьФормуНастройкиДокумента(Неопределено, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьНастройкуДокумента(Команда)
	
	ТекущиеДанные = Элементы.НастройкиДокументовУчета.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Настройка = ТекущиеДанные.Ссылка;
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
	"УдалитьНастройкуДокумента_ПослеСогласия", ЭтаФорма, Настройка);
	
	Если ЕстьДокументыПоТипу(Настройка) Тогда
		ТекстВопроса = НСтр("ru = 'По выбранной настройке есть документы. Продолжить?'");
	Иначе
		ТекстВопроса = НСтр("ru = 'Удалить настройку документа?'");
	КонецЕсли;
	
	МодульКлиента().ПоказатьДиалогВопроса(ОписаниеОбработчика, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаСервере
Функция ЕстьДокументыПоТипу(Настройка)
	
	ТипДокумента = МодульОбъекта().НастройкиДокументаУчета_Прочитать(Настройка).ТипДокумента;
	
	Возврат МодульОбъекта().НастройкиДокументовУчета_ЕстьДокументыПоТипу(ТипДокумента);
	
КонецФункции

&НаКлиенте
Процедура УдалитьНастройкуДокумента_ПослеСогласия(Ответ, Настройка) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		УдалитьНастройкуДокументаНаСервере(Настройка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьНастройкуДокументаНаСервере(Настройка)
	
	ОбъектНастройки = Настройка.ПолучитьОбъект();
	ОбъектНастройки.Удалить();
	
	ОбновитьНастройкиДокументовУчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиВЛичныйКабинетКонтурМаркировка(Команда)
	
	МодульКлиента().ОткрытьЛичныйКабинетКонтурМаркировка();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправкуКакДобавитьЯщикДиадок(Команда)
	
	МодульКлиента().ОткрытьСправкуКакДобавитьЯщикДиадок();
	
КонецПроцедуры

// #КонецОбласти

// #Область НастройкиОрганизации

&НаСервере
Процедура ЗаписатьОрганизацию()
	
	Организация = МодульОбъекта().Организация_НайтиПоИНН(ИНН);
	Если ЗначениеЗаполнено(Организация) Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОрганизации = ОписаниеОрганизацииПоКонтекстуФормы();
	
	МодульОбъекта().Организация_Записать(ОписаниеОрганизации);
	
	Организация = ОписаниеОрганизации.Ссылка;
	
	Действие = МодульОбъекта().Перечисление_ДействияМетрики().ЗаписьВБазу;
	МодульОбъекта().Метрика_ОписаниеОрганизации(Действие, Организация);
	
КонецПроцедуры

&НаСервере
Процедура Организация_ЗаписатьИдентификатор()
	
	ОписаниеОрганизации = МодульОбъекта().Организация_Прочитать(Организация);
	ОписаниеОрганизации.Идентификатор = Идентификатор;
	МодульОбъекта().Организация_Записать(ОписаниеОрганизации);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиПодписания()
	
	ПользовательНастройки = Неопределено;
	
	ВидыСертификатов = МодульОбъекта().Перечисление_ВидыСертификатов();
	ВидСертификата = МодульОбъекта().ЗначениеРеквизитаОбъекта_Марк(Сертификат, "ВидСертификата");
	
	Если ВидСертификата = ВидыСертификатов.НаФизЛицо Тогда
		ПользовательНастройки = Пользователь;
	КонецЕсли;
	
	МодульОбъекта().НастройкаПодписания_Записать(Сертификат, Организация, ПользовательНастройки);
	
КонецПроцедуры

&НаСервере
Функция ОписаниеОрганизацииПоКонтекстуФормы()
	
	Результат = МодульОбъекта().Новый_Организация();
	
	ЗаполнитьЗначенияСвойств(Результат, ЭтаФорма);
	ЗаполнитьЗначенияСвойств(Результат.ДопРеквизиты, ЭтаФорма);
	
	Результат.Наименование = НаименованиеОрганизации;
	
	Результат.ДопРеквизиты.ОтключитьЧтениеВходящихУПД = Ложь;
	Результат.ДопРеквизиты.ОтключитьЧтениеУведомленийОПриемке = Ложь;
	Результат.ДопРеквизиты.ОтключитьОбмен = Ложь;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура НастроитьОтображениеСрокаТарифа()
	
	Если Не ЗначениеЗаполнено(Идентификатор)
		Или Не ЗначениеЗаполнено(Организация) Тогда
		Элементы.ГруппаИнформацияОТарифе.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	МодульОбъекта().НастроитьОтображениеСрокаТарифа(ЭтаФорма, Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаТарифНажатие(Элемент)
	
	Если Не ЗначениеЗаполнено(Идентификатор)
		Или Не ЗначениеЗаполнено(Организация) Тогда
		Возврат;
	КонецЕсли;
	
	МодульКлиента().ОткрытьСтраницуТарифовОрганизации(Организация);
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеФормой()
	
	Этапы = ЭтапыСтартовогоПомощника();
	
	Элементы.ПерваяСтраница.Видимость = Ложь;
	Элементы.НастройкиДокументов.Видимость = Ложь;
	Элементы.НастройкаОрганизаций.Видимость = Ложь;
	Элементы.НастройкаОрганизации.Видимость = Ложь;
	Элементы.НастройкаСкладов.Видимость = Ложь;
	Элементы.НастройкаОтраженияЭДО.Видимость = Ложь;
	Элементы.НастройкиСети.Видимость = Ложь;
	Элементы.НастройкиПереноса.Видимость = Ложь;
	
	Элементы[ТекущийЭтап].Видимость = Истина;
	
	Элементы.КнопкиНавигации.Видимость = Истина;
	Элементы.ОбщиеНастройки.Видимость = Ложь;
	
	Элементы.Группа_НастройкиПрокси.Видимость = Прокси_Использовать;
	
	Если ТекущийЭтап = Этапы.ПерваяСтраница Тогда
		Элементы.КнопкиНавигации.Видимость = Ложь;
	ИначеЕсли ТекущийЭтап = Этапы.НастройкаОрганизаций Тогда
		
		НастройкиВыполнены = (КоличествоНастроенныхОрганизаций() > 0);
		
		Элементы.КнопкиНавигации.Видимость = НастройкиВыполнены;
		Элементы.СледующийШаг.Видимость = Ложь;
		Элементы.ОбщиеНастройки.Видимость = НастройкиВыполнены;
		Элементы.ГруппаНастройкиОрганизацийВыполнены.Видимость = НастройкиВыполнены;
		Элементы.ГруппаНастройкиОрганизацийНеВыполнены.Видимость = Не НастройкиВыполнены;
		
	ИначеЕсли ТекущийЭтап = Этапы.НастройкаОрганизации Тогда
		
		Элементы.СледующийШаг.Видимость = Истина;
		
		Если ЗначениеЗаполнено(Сертификат) Тогда
			СертификатГиперссылка = Строка(Сертификат);
			Элементы.СледующийШаг.Доступность = Истина;
		Иначе
			СертификатГиперссылка = НСтр("ru = 'Выбрать'");
			Элементы.СледующийШаг.Доступность = Ложь;
		КонецЕсли;
		
		НастроитьОтображениеСрокаТарифа();
		
	ИначеЕсли ТекущийЭтап = Этапы.НастройкиСети Тогда
		
		Элементы.СледующийШаг.Видимость = Истина;
		Элементы.СледующийШаг.Доступность = Истина;
		
	ИначеЕсли ТекущийЭтап = Этапы.НастройкиПереноса Тогда
		
		Элементы.СледующийШаг.Видимость = Истина;
		Элементы.СледующийШаг.Доступность = Истина;
		
		Элементы.ПеренестиКоэффициентыПересчетаИДанныеНоменклатуры1С.Доступность = ПеренестиКоэффициентыПересчета И Не ПереносВыполнен;
		Элементы.ПеренестиДанныеПлагинаОСУДД.Доступность = Не ПереносВыполнен;
		
	ИначеЕсли ТекущийЭтап = Этапы.НастройкаОтраженияЭДО Тогда
		Элементы.СледующийШаг.Видимость = Истина;
		Элементы.МаркируемыеТоварныеГруппыВидПродукции1С.Видимость = ОпределенТипВидовПродукции1С;
	КонецЕсли;
	
	Если ЭтоПоследнийЭтап() Тогда
		Элементы.СледующийШаг.Заголовок = НСтр("ru = 'Приступить к работе'");
	ИначеЕсли ТекущийЭтап = Этапы.НастройкиСети Тогда
		Элементы.СледующийШаг.Заголовок = НСтр("ru = 'Сохранить и продолжить'");
	Иначе
		Элементы.СледующийШаг.Заголовок = НСтр("ru = 'Далее'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьСледующийЭтап()
	
	СледующийЭтап = СледующийЭтап();
	ПоказатьЭтап(СледующийЭтап);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНастройкиДокументовУчета()
	
	НастройкиДокументовУчета.Очистить();
	НастройкиДокументов = МодульОбъекта().НастройкиДокументовУчета_ВсеЭлементы();
	
	Для каждого Настройка Из НастройкиДокументов Цикл
		НоваяСтрока = НастройкиДокументовУчета.Добавить();
		НоваяСтрока.Ссылка = Настройка;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиДокументовУчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Настройка = Элементы.НастройкиДокументовУчета.ТекущиеДанные.Ссылка;
	МодульКлиента().ОткрытьФормуНастройкиДокумента(Настройка, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьНастройкиДокументовУчета()
	
	МодульОбъекта().ЗаполнитьНастройкиДокументаУчетаДляТекущейКонфигурации();
	ОбновитьНастройкиДокументовУчета();
	ТребуетсяЗаполнитьНастройкиДокументов = (НастройкиДокументовУчета.Количество() = 0);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьТипыЭлементовФормы()
	
	ТипыОбъектовИС = МодульОбъекта().ТипыОбъектовИС();
	
	ТипОрганизации = ТипыОбъектовИС.Организация;
	МодульОбъекта().УстановитьОграничениеПоТипу(Элементы.СписокОрганизацийОрганизация1С, ТипОрганизации); 
	МодульОбъекта().УстановитьОграничениеПоТипу(Элементы.Организация1С, ТипОрганизации);
	
	ТипВидПродукции = ТипыОбъектовИС.ВидПродукции;
	Если ЗначениеЗаполнено(ТипВидПродукции) Тогда
		ОпределенТипВидовПродукции1С = Истина;
		МодульОбъекта().УстановитьОграничениеПоТипу(Элементы.МаркируемыеТоварныеГруппыВидПродукции1С, ТипВидПродукции);
	КонецЕсли;
	
	ТипСклад = ТипыОбъектовИС.Склад;
	МодульОбъекта().УстановитьОграничениеПоТипу(Элементы.СписокСкладовСклад1С, ТипСклад);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиОрганизаций()
	
	СписокОрганизаций.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Спр.Ссылка КАК Организация1С
	|ИЗ
	|	Справочник.Организации КАК Спр
	|ГДЕ
	|	НЕ Спр.ПометкаУдаления";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Справочник.Организации", МодульОбъекта().ПолноеИмяСправочникаОрганизации());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = СписокОрганизаций.Добавить();
		
		текОрганизация1С = Выборка.Организация1С;
		
		ПутьКРеквизитам = "Справочники." + текОрганизация1С.Метаданные().Имя + ".Реквизиты";
		
		НоваяСтрока.Организация1С = текОрганизация1С;
		НоваяСтрока.Наименование = СокрЛП(Организация1С);
		
		Если МодульОбъекта().ЕстьНеобходимыеМетаданные(ПутьКРеквизитам + ".ИНН") Тогда
			НоваяСтрока.ИНН = СокрЛП(МодульОбъекта().ЗначениеРеквизитаОбъекта_Марк(текОрганизация1С, "ИНН"));
		КонецЕсли;
		
		Если МодульОбъекта().ЕстьНеобходимыеМетаданные(ПутьКРеквизитам + ".КПП") Тогда
			НоваяСтрока.КПП = СокрЛП(МодульОбъекта().ЗначениеРеквизитаОбъекта_Марк(текОрганизация1С, "КПП"));
		КонецЕсли;
		
		НоваяСтрока.ИННКПП = МодульОбъекта().ПараметрыВстроку(НСтр(
							"ru = 'ИНН %1, КПП %2'"), НоваяСтрока.ИНН, НоваяСтрока.КПП);
		
		текОрганизация = МодульОбъекта().Организация_НайтиПоОрганизации1С(текОрганизация1С);
		
		Если Не ЗначениеЗаполнено(текОрганизация) Тогда
			НоваяСтрока.СсылкаЗапуститьНастройку = ТекстЗапуститьНастройку();
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока.Организация = текОрганизация;
		ОписаниеОрганизации = МодульОбъекта().Организация_Прочитать(текОрганизация);
		текСертификат = НастройкаПодписания_Сертификат(текОрганизация);
		
		Если ЗначениеЗаполнено(ОписаниеОрганизации.Идентификатор)
			И ЗначениеЗаполнено(текСертификат) Тогда
			НоваяСтрока.НастройкаВыполнена = Истина;
			НоваяСтрока.Идентификатор = ОписаниеОрганизации.Идентификатор;
			НоваяСтрока.Сертификат = текСертификат;
			НоваяСтрока.СсылкаЗапуститьНастройку = ТекстНастройкиВыполнены();
		Иначе
			НоваяСтрока.СсылкаЗапуститьНастройку = ТекстЗапуститьНастройку();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиСкладов()
	
	СписокСкладов.Очистить();
	ТипыОбъектов = МодульОбъекта().ТипыОбъектовИС();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Склады.Ссылка КАК Склад,
	|	Склады.КлючСклада1С КАК КлючСклада1С,
	|	Склады.ТипКлючаСклада1С КАК ТипКлючаСклада1С
	|ИЗ
	|	Справочник.КонтурМаркировка_Склады КАК Склады
	|ГДЕ
	|	Склады.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	ТаблицаСкладов = Запрос.Выполнить().Выгрузить();
	
	ТаблицаСкладов.Колонки.Добавить("Склад1С", Новый ОписаниеТипов(ТипыОбъектов.Склад));
	МодульОбъекта().ЗаполнитьВТаблицеОбъекты1СПоКлючам(ТаблицаСкладов, "Склад1С", "КлючСклада1С", "ТипКлючаСклада1С");
	
	ЗначениеВРеквизитФормы(ТаблицаСкладов, "СписокСкладов");

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеДляПереносаКоэффициентовПересчета()
	
	Если Не ДоступенПереносИзРегистраПлагинаОСУ() Тогда
		Возврат;
	КонецЕсли;
	
	ПереносКоэффициентовПересчета.Очистить();
	НеперенесенныеКоэффициентыПересчета = МодульОбъекта().ДанныеДиадок_ПереносРегистраКоэффициентыПересчета();
	ПереносКоэффициентовПересчета.Загрузить(НеперенесенныеКоэффициентыПересчета);
	
	ПеренестиКоэффициентыПересчета = (ПереносКоэффициентовПересчета.Количество() > 0);
	ЗагрузитьТоварыМаркировкиПоДаннымДиадок = Истина;
	
	НастройкиМодуля = МодульОбъекта().НастройкиМодуля(Истина);
	ИспользоватьКоэффициентыПересчета = НастройкиМодуля.ИспользоватьКоэффициентыПересчета;
	
КонецПроцедуры

&НаСервере
Функция НастройкаПодписания_Сертификат(ВыбраннаяОрганизация)
	
	Результат = МодульОбъекта().НастройкаПодписания_Сертификат(ВыбраннаяОрганизация, Пользователь);
	
	Если Не ЗначениеЗаполнено(Результат) Тогда // Если для пользователя нет, ищем по организации.
		Результат = МодульОбъекта().НастройкаПодписания_Сертификат(ВыбраннаяОрганизация, Неопределено);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СертификатПослеВыбора(ОписаниеСертификата = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	Если ОписаниеСертификата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Сертификат = НайтиСертификат(ОписаниеСертификата);
	СертификатГиперссылка = Строка(Сертификат);
	
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Функция НайтиСертификат(ОписаниеСертификата)
	
	Результат = МодульОбъекта().Сертификаты_Найти(ОписаниеСертификата.ОтпечатокСертификата);
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = МодульОбъекта().Сертификаты_Записать(ОписаниеСертификата);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПоказатьЭтап(ИмяЭтапа)
	
	Если ЗначениеЗаполнено(ТекущийЭтап) Тогда
		Элементы[ТекущийЭтап].Видимость = Ложь;
	КонецЕсли;
	
	ТекущийЭтап = ИмяЭтапа;
	
	Элементы.ГруппаЭтапыСтартовогоПомощника.ТекущаяСтраница = 
			ЭтаФорма.Элементы.ГруппаЭтапыСтартовогоПомощника.ПодчиненныеЭлементы.Найти(ТекущийЭтап);
	
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьТекущиеНастройки()
	
	Этапы = ЭтапыСтартовогоПомощника();
	
	Если ТекущийЭтап = Этапы.НастройкаСкладов Тогда
		СохранитьНастройкиСкладов();
	ИначеЕсли ТекущийЭтап = Этапы.НастройкаОтраженияЭДО Тогда
		СохранитьМаркируемыеТоварныеГруппы();
	ИначеЕсли ТекущийЭтап = Этапы.НастройкиСети Тогда
		СохранитьНастройкиСети();
	ИначеЕсли ТекущийЭтап = Этапы.НастройкиПереноса Тогда
		СохранитьНастройкиКоэффициентовПересчета();
	ИначеЕсли ТекущийЭтап = Этапы.НастройкаОрганизаций
		И НастройкиДокументовУчета.Количество() = 0 Тогда
		СоздатьНастройкиДокументовУчета();
		ЗаполнитьИСохранитьОбщиеНастройки();
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиСети()
	
	НастройкиМодуля = МодульОбъекта().НастройкиМодуля(Истина);
	
	НастройкиМодуля.Прокси_Использовать = Прокси_Использовать;
	НастройкиМодуля.Прокси_Адрес = Прокси_Адрес;
	НастройкиМодуля.Прокси_Порт = Прокси_Порт;
	НастройкиМодуля.Прокси_Логин = Прокси_Логин;
	НастройкиМодуля.Прокси_Пароль = Прокси_Пароль;
	
	НастройкиМодуля.РазрешитьПодписьНаСервере = РазрешитьПодписьНаСервере;
	
	МодульОбъекта().НастройкиМодуля_Записать(НастройкиМодуля);
	
	ЕстьНастройкиПрокси = Прокси_Использовать;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиКоэффициентовПересчета()
	
	НастройкиМодуля = МодульОбъекта().НастройкиМодуля(Истина);
	НастройкиМодуля.ИспользоватьКоэффициентыПересчета = ИспользоватьКоэффициентыПересчета;
	
	МодульОбъекта().НастройкиМодуля_Записать(НастройкиМодуля);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИСохранитьОбщиеНастройки()
	
	ОбновлятьАвтоматически = Истина;
	
	НастройкиМодуля = МодульОбъекта().НастройкиМодуля(Истина);
	НастройкиМодуля.ОбновлятьАвтоматически = ОбновлятьАвтоматически;
	НастройкиМодуля.СоздаватьДокументыУчетаАвтоматически = Истина;
	МодульОбъекта().НастройкиМодуля_Записать(НастройкиМодуля);
	
	РасписаниеОбновленияМодуля = МодульОбъекта().РасписаниеОбновленияМодуля();
	МодульОбъекта().ОбновитьЗаданиеОбновлениеМодуля(РасписаниеОбновленияМодуля, ОбновлятьАвтоматически);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиСети()
	
	НастройкиМодуля = МодульОбъекта().НастройкиМодуля(Истина);
	
	Прокси_Использовать = НастройкиМодуля.Прокси_Использовать;
	Прокси_Адрес = НастройкиМодуля.Прокси_Адрес;
	Прокси_Порт = НастройкиМодуля.Прокси_Порт;
	Прокси_Логин = НастройкиМодуля.Прокси_Логин;
	Прокси_Пароль = НастройкиМодуля.Прокси_Пароль;
	
	РазрешитьПодписьНаСервере = НастройкиМодуля.РазрешитьПодписьНаСервере;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиСкладов()
	
	Для Каждого Склад Из СписокСкладов Цикл
		Если Не ЗначениеЗаполнено(Склад.Склад1С) Тогда
			Продолжить;
		КонецЕсли;
		ОписаниеСклада = МодульОбъекта().Склад_Прочитать(Склад.Склад);
		ОписаниеСклада.Склад1С = Склад.Склад1С;
		МодульОбъекта().Склад_Записать(ОписаниеСклада);
		ЕстьСопоставленныеСклады = Истина;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура СинхронизироватьСправочники()
	
	МодульОбъекта().СинхронизироватьПлощадки(Организация);
	МодульОбъекта().СинхронизироватьМобильныеУстройства(Организация);
	МодульОбъекта().СервисПровайдеры_Синхронизировать(Организация);
	
КонецПроцедуры

&НаСервере
Процедура СинхронизироватьСклады()
	
	МодульОбъекта().СинхронизироватьСклады(Организация);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьМаркируемыеТоварныеГруппы()
	
	МассивМаркируемыхТГ = Новый Массив;
	
	Для каждого Стр Из МаркируемыеТоварныеГруппы Цикл
		МаркируемаяТГ = МодульОбъекта().Новый_МаркируемаяТоварнаяГруппа();
		ЗаполнитьЗначенияСвойств(МаркируемаяТГ, Стр);
		МассивМаркируемыхТГ.Добавить(МаркируемаяТГ);
	КонецЦикла;
	
	МодульОбъекта().МаркируемыеТоварныеГруппы_ПерезаписатьНастройки(МассивМаркируемыхТГ);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеСписокОрганизаций()
	
	ТаблицаФормы = Элементы.СписокОрганизаций;
	
	ЭлементУО_НастройкаВыполнена = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУО_НастройкаВыполнена.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение		 = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".НастройкаВыполнена"); 
	ЭлементОтбора.ВидСравнения		 = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение	 = Истина;
	
	ЭлементУО_НастройкаВыполнена.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.ТемноЗеленый);
	
	ОформляемоеПоле = ЭлементУО_НастройкаВыполнена.Поля.Элементы.Добавить(); 
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + "СсылкаЗапуститьНастройку");
	
КонецПроцедуры

&НаСервере
Функция ТекстНастройкиВыполнены()
	
	Возврат НСтр("ru = 'Настройки выполнены'");
	
КонецФункции

&НаСервере
Функция ТекстЗапуститьНастройку()
	
	Возврат НСтр("ru = 'Запустить настройку'");
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокВыбораВидМаркируемойПродукции()
	
	СписокВыбора = Элементы.МаркируемыеТоварныеГруппыВидПродукции.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().ВсеВидыПродукции();
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьМаркируемыеТоварныеГруппы()
	
	МаркируемыеТоварныеГруппы.Очистить();
	
	ПредставленияПравил = ПредставленияПравилОтраженияВЭДО();
	
	МассивСсылок = МодульОбъекта().МаркируемыеТоварныеГруппы_ВсеЭлементы();
	
	Для каждого МаркируемаяТГ Из МассивСсылок Цикл
		
		ОписаниеМаркируемойТГ = МодульОбъекта().МаркируемаяТоварнаяГруппа_Прочитать(МаркируемаяТГ);
		
		НоваяСтрока = МаркируемыеТоварныеГруппы.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеМаркируемойТГ);
		ПредставлениеПравила = ПредставленияПравил.НайтиПоЗначению(ОписаниеМаркируемойТГ.ОтражениеВЭДО);
		НоваяСтрока.ПредставлениеОтраженияВЭДО = ПредставлениеПравила;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура МаркируемыеТоварныеГруппыПредставлениеОтраженияВЭДОНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.МаркируемыеТоварныеГруппы.ТекущиеДанные;
	СписокВыбора = ПредставленияПравилОтраженияВЭДО();
	
	Если Не МодульКлиента().ВидПродукцииДопускаетОСУ(ТекущиеДанные.ВидПродукции) Тогда
		ОСУ = ПредопределенноеЗначение("Перечисление.КонтурМаркировка_ПравилаОтраженияВЭДО.ОСУ");
		СписокВыбора.Удалить(СписокВыбора.НайтиПоЗначению(ОСУ));
	КонецЕсли;
	
	Обработчик = МодульКлиента().ОписаниеОбработчикаОповещения(
	"МаркируемыеТоварныеГруппыПредставлениеОтраженияВЭДОПослеВыбора", ЭтаФорма, ТекущиеДанные);
	
	МодульКлиента().ПоказатьДиалогВыбораИзСписка(Обработчик, СписокВыбора, Элемент, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура МаркируемыеТоварныеГруппыПредставлениеОтраженияВЭДОПослеВыбора(РезультатВыбора, ТекущиеДанные) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.ОтражениеВЭДО = РезультатВыбора.Значение;
	ТекущиеДанные.ПредставлениеОтраженияВЭДО = РезультатВыбора.Представление;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПредставленияПравилОтраженияВЭДО()
	
	ПУ = ПредопределенноеЗначение("Перечисление.КонтурМаркировка_ПравилаОтраженияВЭДО.ПУ");
	ОСУ = ПредопределенноеЗначение("Перечисление.КонтурМаркировка_ПравилаОтраженияВЭДО.ОСУ");
	НеОтражать = ПредопределенноеЗначение("Перечисление.КонтурМаркировка_ПравилаОтраженияВЭДО.НеОтражать");
	
	Результат = Новый СписокЗначений;
	Результат.Добавить(ПУ, НСтр("ru = 'ПУ (Только поэкземплярный учет)'"));
	Результат.Добавить(ОСУ, НСтр("ru = 'ОСУ (Допускается объемно-сортовой учет)'"));
	Результат.Добавить(НеОтражать, НСтр("ru = 'Не отражать'"));
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция СледующийЭтап()
	
	Результат = Неопределено;
	
	Этапы = ЭтапыСтартовогоПомощника();
	
	Если ТекущийЭтап = Этапы.ПерваяСтраница Тогда
		Результат = Этапы.НастройкаОрганизаций;
	ИначеЕсли ТекущийЭтап = Этапы.НастройкаОрганизаций Тогда
		Результат = Этапы.НастройкаОтраженияЭДО;
	ИначеЕсли ТекущийЭтап = Этапы.НастройкаОрганизации Тогда
		Если СписокСкладов.Количество() > 1 Тогда
			Результат = Этапы.НастройкаСкладов;
		Иначе
			Результат = Этапы.НастройкаОрганизаций;
		КонецЕсли;
	ИначеЕсли ТекущийЭтап = Этапы.НастройкаСкладов Тогда
		Результат = Этапы.НастройкаОрганизаций;
	ИначеЕсли ТекущийЭтап = Этапы.НастройкаОтраженияЭДО Тогда
		Если ДоступенПереносИзРегистраПлагинаОСУ() Тогда
			Результат = Этапы.НастройкиПереноса;
		Иначе
			Результат = Этапы.НастройкиДокументов;
		КонецЕсли;
	ИначеЕсли ТекущийЭтап = Этапы.НастройкиПереноса Тогда
		Результат = Этапы.НастройкиДокументов;
	ИначеЕсли ТекущийЭтап = Этапы.НастройкиСети Тогда
		Результат = Этапы.НастройкаОрганизации;
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПредыдущийЭтап()
	
	Результат = Неопределено;
	
	Этапы = ЭтапыСтартовогоПомощника();
	
	Если ТекущийЭтап = Этапы.ПерваяСтраница
		Или ТекущийЭтап = Этапы.НастройкаОтраженияЭДО
		Или ТекущийЭтап = Этапы.НастройкаОрганизации Тогда
		Результат = Этапы.НастройкаОрганизаций;
	ИначеЕсли ТекущийЭтап = Этапы.НастройкаОрганизаций Тогда
		Результат = Этапы.ПерваяСтраница;
	ИначеЕсли ТекущийЭтап = Этапы.НастройкаСкладов Тогда
		Результат = Этапы.НастройкаОрганизации;
	ИначеЕсли ТекущийЭтап = Этапы.НастройкиПереноса Тогда
		Результат = Этапы.НастройкаОтраженияЭДО;
	ИначеЕсли ТекущийЭтап = Этапы.НастройкиДокументов Тогда
		Если ДоступенПереносИзРегистраПлагинаОСУ() Тогда
			Результат = Этапы.НастройкиПереноса;
		Иначе
			Результат = Этапы.НастройкаОтраженияЭДО;
		КонецЕсли;
	ИначеЕсли ТекущийЭтап = Этапы.НастройкиСети Тогда
		Результат = Этапы.НастройкаОрганизации;
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЭтоПоследнийЭтап()
	
	Результат = Ложь;
	
	Если ТекущийЭтап = ИмяПоследнегоЭтапа() Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ИмяПоследнегоЭтапа()
	
	Этапы = ЭтапыСтартовогоПомощника();
	
	Если ТребуетсяЗаполнитьНастройкиДокументов Тогда
		Результат = Этапы.НастройкиДокументов;
	ИначеЕсли ДоступенПереносИзРегистраПлагинаОСУ() Тогда
		Результат = Этапы.НастройкиПереноса;
	Иначе
		Результат = Этапы.НастройкаОтраженияЭДО;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДоступенПереносИзРегистраПлагинаОСУ()
	
	Возврат МодульОбъекта().ДоступенПереносИзРегистраПлагинаОСУ();

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЭтапыСтартовогоПомощника()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ПерваяСтраница", "ПерваяСтраница");
	Результат.Вставить("НастройкаОрганизаций", "НастройкаОрганизаций");
	Результат.Вставить("НастройкаОрганизации", "НастройкаОрганизации");
	Результат.Вставить("НастройкаСкладов", "НастройкаСкладов");
	Результат.Вставить("НастройкаОтраженияЭДО", "НастройкаОтраженияЭДО");
	Результат.Вставить("НастройкиДокументов", "НастройкиДокументов");
	Результат.Вставить("НастройкиСети", "НастройкиСети");
	Результат.Вставить("НастройкиПереноса", "НастройкиПереноса");
	
	Результат = Новый ФиксированнаяСтруктура(Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПроверитьПодключениеНаСервере()
	
	НастройкиПрокси = НастройкиПроксиПоДаннымФормы();
	ЕстьПодключение = МодульОбъекта().Маркировка_ПроверитьПодключение(НастройкиПрокси);
	
	Если ЕстьПодключение Тогда
		РезультатПроверкиИнтернета = НСтр("ru = 'Подключение успешно установлено!'");
		Элементы.РезультатПроверкиИнтернета.ЦветТекста = WebЦвета.Зеленый;
	Иначе
		РезультатПроверкиИнтернета = НСтр("ru = 'Возникла ошибка установки подключения!'");
		Элементы.РезультатПроверкиИнтернета.ЦветТекста = WebЦвета.Красный;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НастройкиПроксиПоДаннымФормы()
	
	Результат = МодульОбъекта().Новый_НастройкиПрокси();
	
	Если Прокси_Использовать Тогда
		
		ВариантыНастроек = МодульОбъекта().Перечисление_ВариантыНастроекПроксиСервера();
		Результат.ВариантНастроек = ВариантыНастроек.СвоиНастроки;
		
		Результат.Адрес	 = Прокси_Адрес;
		Результат.Порт	 = Прокси_Порт;
		Результат.Логин	 = Прокси_Логин;
		Результат.Пароль = Прокси_Пароль;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДанныеНастроекДляМетрики()
	
	Результат = Новый Структура;
	
	Результат.Вставить("НастройкаЗавершена", НастройкаЗавершена);
	Результат.Вставить("КоличествоНастроенныхОрганизаций", КоличествоНастроенныхОрганизаций());
	Результат.Вставить("ВсегоОрганизаций", СписокОрганизаций.Количество());
	
	ЗаполненныеНастройкиДляМетрик = Перечисление_ЗаполненныеНастройкиДляМетрик();
	
	МассивЗаполненныхНастроек = Новый Массив;
	
	Если ТребуетсяЗаполнитьНастройкиДокументов Тогда
		МассивЗаполненныхНастроек.Добавить(ЗаполненныеНастройкиДляМетрик.НастройкиДокументов);
	КонецЕсли;
	
	Если МаркируемыеТоварныеГруппы.Количество() > 0 Тогда
		МассивЗаполненныхНастроек.Добавить(ЗаполненныеНастройкиДляМетрик.НастройкиЭДО);
	КонецЕсли;
	
	Если ЕстьНастройкиПрокси Тогда
		МассивЗаполненныхНастроек.Добавить(ЗаполненныеНастройкиДляМетрик.НастройкиПрокси);
	КонецЕсли;
	
	Если ЕстьСопоставленныеСклады Тогда
		МассивЗаполненныхНастроек.Добавить(ЗаполненныеНастройкиДляМетрик.СопоставлениеСкладов);
	КонецЕсли;
	
	Если ПереносВыполнен И ПеренестиКоэффициентыПересчета Тогда
		МассивЗаполненныхНастроек.Добавить(ЗаполненныеНастройкиДляМетрик.ПеренесеныКоэффициенты);
	КонецЕсли;
	
	Если ПереносВыполнен И ЗагрузитьТоварыМаркировкиПоДаннымДиадок Тогда
		МассивЗаполненныхНастроек.Добавить(ЗаполненныеНастройкиДляМетрик.ПеренесеныТовары);
	КонецЕсли;
	
	Если ИспользоватьКоэффициентыПересчета Тогда
		МассивЗаполненныхНастроек.Добавить(ЗаполненныеНастройкиДляМетрик.ИспользоватьКоэффициентыПересчета);
	КонецЕсли;
	
	ЗаполненныеНастройки = МодульОбъекта().СоединитьСтроку(МассивЗаполненныхНастроек, ",");
	Результат.Вставить("ЗаполненныеНастройки", ЗаполненныеНастройки);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДанныеПлагинаДляМетрики()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ВерсияПлагина", ВерсияПлагина);
	Результат.Вставить("ИдентификаторПлагина", ИдентификаторПлагина);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция КоличествоНастроенныхОрганизаций()
	
	ПараметрыОтбора = Новый Структура("НастройкаВыполнена", Истина);
	СтрокиНастройкаВыполнена = СписокОрганизаций.НайтиСтроки(ПараметрыОтбора);
	
	Возврат СтрокиНастройкаВыполнена.Количество();
	
КонецФункции

&НаСервере
Функция Перечисление_ЗаполненныеНастройкиДляМетрик()
	
	Результат = Новый Структура;
	
	Результат.Вставить("НастройкиДокументов", "Настройки документов");
	Результат.Вставить("НастройкиЭДО", "Настройки ЭДО");
	Результат.Вставить("НастройкиПрокси", "Настройки прокси");
	Результат.Вставить("СопоставлениеСкладов", "Сопоставление складов");
	Результат.Вставить("ПеренесеныКоэффициенты", "Перенесены коэффициенты");
	Результат.Вставить("ПеренесеныТовары", "Перенесены товары");
	Результат.Вставить("ИспользоватьКоэффициентыПересчета", "Использовать коэффициенты пересчета");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПеренестиДанныеПлагинаОСУДД(Команда)
	
	ПереносВыполнен = Ложь;
	
	Если ПеренестиКоэффициентыПересчета Тогда
		ПеренестиДанныеПлагинаОСУДД_КоэффициентыПересчета();
	КонецЕсли;
	
	Если ЗагрузитьТоварыМаркировкиПоДаннымДиадок Тогда
		МодульКлиента().ЗагрузитьТоварыПоДаннымДиадок(УникальныйИдентификатор);
	КонецЕсли;
	
	ПереносВыполнен = Истина;
	
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура ПеренестиДанныеПлагинаОСУДД_КоэффициентыПересчета()
	
	ПеренесеноЗаписей = 0;
	
	Для каждого Стр Из ПереносКоэффициентовПересчета Цикл
		КлючНоменклатуры1С = Стр.КлючНоменклатуры1С;
		Числитель = Стр.Числитель;
		Знаменатель = Стр.Знаменатель;
		МодульОбъекта().КоэффициентПересчета_Записать(КлючНоменклатуры1С, Числитель, Знаменатель);
		ПеренесеноЗаписей = ПеренесеноЗаписей + 1;
	КонецЦикла;
	
	ПереносКоэффициентовПересчета.Очистить();
	
	Если ПеренесеноЗаписей > 0 Тогда
		ТекстСообщения = НСтр("ru = 'Перенесено коэффициентов пересчета: %1 '");
		ТекстСообщения = МодульОбъекта().ПараметрыВСтроку(ТекстСообщения, ПеренесеноЗаписей);
		МодульОбъекта().СообщитьПользователюЛок(ТекстСообщения, УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИнформациюОТарифах()
	
	МодульОбъекта().ОбновитьИнформациюОТарифах(Организация);
	
КонецПроцедуры

// #КонецОбласти

