//	Copyright (C) 2012-2025 Engineer Mareev Enterprises
//	Модуль для УТ 10.3

//	$Импортирует все сообщения из EME.WMS.

//	Процедура импортирует все сообщения из EME.WMS.
Процедура Импортировать() Экспорт
	Если НЕ Константы.EmeWmsОбменВключен.Получить() Тогда
		Возврат;
	КонецЕсли; 
	
	ДатаЗапускаИнтеграции = Константы.EmeWmsДатаЗапускаИнтеграции.Получить();
	Если ЗначениеЗаполнено(ДатаЗапускаИнтеграции)
			И ТекущаяДата() < ДатаЗапускаИнтеграции Тогда
		Возврат;
	КонецЕсли;	
	
	ERPData = Новый Структура;
	EmeWmsERPEngine.Create(ERPData);

	ERPData.ERPEngine = EmeWmsУтилиты.ПолучитьСодержимоеФайлаНастроек();
	Если ERPData.ERPEngine = Неопределено Или ERPData.ERPEngine = "" Тогда
		Возврат
	КонецЕсли;
	
	Ошибка = EmeWmsERPEngine.Connect(ERPData);
	Если Ошибка <> "" Тогда
		Сообщить(Ошибка);
		ЗаписьЖурналаРегистрации("Интеграция 1C-EME. Импорт", УровеньЖурналаРегистрации.Ошибка,,,"Подключение к SQL базе данных: " + Ошибка);
		Возврат;
	КонецЕсли;
	
	Попытка  	
		
		ИмпортироватьСообщения(ERPData, EmeWmsИмпортНоменклатуры);
		ИмпортироватьСообщения(ERPData, EmeWmsИмпортПриходныхОрдеровНаТовары); 			// #IBS 21.03.2025
		ИмпортироватьСообщения(ERPData, EmeWmsИмпортПриходаБезASN); 		  			// #IBS 23.03.2025
		ИмпортироватьСообщения(ERPData, EmeWmsИмпортСписанийТоваров);         		// #IBS 25.03.2025
		ИмпортироватьСообщения(ERPData, EmeWmsИмпортСписанийТоваровWMS);      		// #IBS 26.03.2025
		ИмпортироватьСообщения(ERPData, EmeWmsИмпортВозвратовТоваровОтПокупателя);	// #IBS 26.03.2025
		ИмпортироватьСообщения(ERPData, EmeWmsИмпортПеремещенийТоваровКакПрихода);	// #IBS 27.03.2025
		ИмпортироватьСообщения(ERPData, EmeWmsИмпортПеремещенийТоваровКакОтгрузки);	// #IBS 28.03.2025
		ИмпортироватьСообщения(ERPData, EmeWmsИмпортПеремещенийТоваровВнутренних); 	// #IBS 08.04.2025
		ИмпортироватьСообщения(ERPData, EmeWmsИмпортПеремещенийТоваровВнутреннихWMS);	// #IBS 08.04.2025
		ИмпортироватьСообщения(ERPData, EmeWmsИмпортРеализацийТоваров); 		
		ИмпортироватьСообщения(ERPData, EmeWmsИмпортИзмененийХарактеристикWMS); 		// #IBS 31.03.2025
		ИмпортироватьСообщения(ERPData, EmeWmsИмпортЗаданийНаДоставку); 				// #IBS 04.04.2025
		ИмпортироватьСообщения(ERPData, EmeWmsИмпортПоступленийТоваровУслуг); 			// #IBS 09.04.2025
		ИмпортироватьСообщения(ERPData, EmeWmsИмпортКорректировокПоступлений); 			// #IBS 10.04.2025
		ИмпортироватьСообщения(ERPData, EmeWmsИмпортКорректировокРеализаций); 			// #IBS 14.04.2025
		
	Исключение
		Ошибка = ОписаниеОшибки();
		Сообщить(Ошибка);
		ЗаписьЖурналаРегистрации("Интеграция 1C-EME. Импорт", УровеньЖурналаРегистрации.Ошибка,,,"Импорт сообщений: " + Ошибка);
		EmeWmsУтилиты.СообщитьПоПочте(
			"Критическая ошибка импорта сообщений",
			"ИБ: " +  СтрокаСоединенияИнформационнойБазы() + Символы.ПС +
			Ошибка);
	КонецПопытки;
				
	EmeWmsERPEngine.Disconnect(ERPData);
	
КонецПроцедуры

//	Процедура ИмпортироватьСообщения импортирует сообщения из транзитной базу данных
Процедура ИмпортироватьСообщения(ERPData, ОбщийМодуль)
	
	ЗаголовкиСообщений = Новый ТаблицаЗначений();
	EmeWmsERPEngine.GetHeaders(ERPData, "wms", "erp", ОбщийМодуль.ПолучитьИмяСообщения(), "NEW,WRN", ЗаголовкиСообщений);
	
	Счетчик = 0;
	МассивИдентификаторов = Новый Массив();
	Для Каждого ЗаголовокСообщения Из ЗаголовкиСообщений Цикл
		МассивИдентификаторов.Добавить(ЗаголовокСообщения.id);
		Если МассивИдентификаторов.Количество() = 256 Тогда
			Счетчик = Счетчик + ИмпортироватьПачкуСообщений(ERPData, ОбщийМодуль, МассивИдентификаторов);
			МассивИдентификаторов.Очистить();  
		КонецЕсли
	КонецЦикла;		
	
	Если МассивИдентификаторов.Количество() <> 0 Тогда
		Счетчик = Счетчик + ИмпортироватьПачкуСообщений(ERPData, ОбщийМодуль, МассивИдентификаторов);
	КонецЕсли;
		
	Если Счетчик <> 0 Тогда
		Сообщить("" + ОбщийМодуль.ПолучитьМетаданные() + ": проимпортировали сообщения " + ОбщийМодуль.ПолучитьИмяСообщения() + " (" + Счетчик + "шт)");
	КонецЕсли;
	
КонецПроцедуры

//	Процедура ИмпортироватьПачкуСообщений импортирует пачку сообщений из транзитной базу данных
Функция ИмпортироватьПачкуСообщений(ERPData, ОбщийМодуль, МассивИдентификаторов) 
	
	Счетчик = 0;
	СообщенияПоПочте = Новый ТаблицаЗначений();
	СообщенияПоПочте.Колонки.Добавить("Идентификатор");
	СообщенияПоПочте.Колонки.Добавить("ТемаСообщения");
	СообщенияПоПочте.Колонки.Добавить("Трассировка");
	СообщенияПоПочте.Колонки.Добавить("Метаданные");

	//	ВАЖНО! Транзакция источника сообщения должна быть внешней	
	EmeWmsERPEngine.BeginImport(ERPData, "wms", "erp", ОбщийМодуль.ПолучитьИмяСообщения(), МассивИдентификаторов);
	Попытка
		Идентификатор = "";
		НачатьТранзакцию();
		Попытка
			Пока EmeWmsERPEngine.NextHeaderLine(ERPData) <> 0 Цикл
				НовоеСообщение = (ERPData.header.state = "NEW");
				Идентификатор = ERPData.header.id;
				Трассировка = "";
				ТемаСообщения = "";
				ОбщийМодуль.Импортировать(ERPData, Трассировка, ТемаСообщения);
				Если ERPData.header.state <> "NEW" И ERPData.header.state <> "WRN" Тогда
					Счетчик = Счетчик + 1;
				КонецЕсли;
				Если НовоеСообщение И ТемаСообщения <> "" Тогда
					СообщениеПоПочте = СообщенияПоПочте.Добавить();
					СообщениеПоПочте.Идентификатор = Идентификатор;
					СообщениеПоПочте.ТемаСообщения = ТемаСообщения;
					СообщениеПоПочте.Трассировка = Трассировка;
					СообщениеПоПочте.Метаданные = ОбщийМодуль.ПолучитьМетаданные();
				КонецЕсли
			КонецЦикла;
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение(ОписаниеОшибки());
		КонецПопытки;
		EmeWmsERPEngine.CommitImport(ERPData);
		Для Каждого СообщениеПоПочте Из СообщенияПоПочте Цикл
			EmeWmsУтилиты.СообщитьПоПочте(
				СообщениеПоПочте.ТемаСообщения + " (" + СообщениеПоПочте.Метаданные + ")",
				"ИБ: " +  СтрокаСоединенияИнформационнойБазы() + Символы.ПС +
				"ID: " + СообщениеПоПочте.Идентификатор + Символы.ПС +
				СообщениеПоПочте.Трассировка);
		КонецЦикла
	Исключение
		Ошибка = ОписаниеОшибки();
		Если МассивИдентификаторов.Количество() = 1 Тогда
			EmeWmsERPEngine.WarningHeader(ERPData, "EXCEPT", Ошибка);
			EmeWmsERPEngine.CommitImport(ERPData);
			Счетчик = 0;
		Иначе
			EmeWmsERPEngine.RollbackImport(ERPData);
			Счетчик = 0;
			Для Каждого Идентификатор Из МассивИдентификаторов Цикл
				ОдинИдентификатор = Новый Массив();
				ОдинИдентификатор.Добавить(Идентификатор);
				Счетчик = Счетчик + ИмпортироватьПачкуСообщений(ERPData, ОбщийМодуль, ОдинИдентификатор)
			КонецЦикла;
		КонецЕсли;
		
		Сообщить(Ошибка);
		ЗаписьЖурналаРегистрации(
			"Интеграция 1C-EME. Импорт. " + ОбщийМодуль.ПолучитьИмяСообщения(),
			УровеньЖурналаРегистрации.Ошибка,
			ОбщийМодуль.ПолучитьМетаданные(),
			Идентификатор,
			Ошибка);
		EmeWmsУтилиты.СообщитьПоПочте(
			"Критическая ошибка импорта сообщения " + ОбщийМодуль.ПолучитьИмяСообщения(),
			"ИБ: " +  СтрокаСоединенияИнформационнойБазы() + Символы.ПС +
			"No: " + Идентификатор + Символы.ПС +
			Ошибка);
		
	КонецПопытки;
		
	Возврат Счетчик;

КонецФункции
