
// #Область СлужебныеПеременныеИМетодыФормы

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента = Неопределено Тогда
		
		Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
			КэшМодуляКлиента = ВладелецФормы.МодульКлиента();
		Иначе
			ПутьКФорме = ПутьКФормеМодуляКлиента();
			КэшМодуляКлиента = ОткрытьФорму(ПутьКФорме);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат КэшМодуляКлиента;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовСпискаФормы

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	КлючНоменклатуры1С = Неопределено;
	Если Копирование Тогда
		КлючНоменклатуры1С = Элемент.ТекущиеДанные.КлючНоменклатуры1С;
	КонецЕсли;
	
	МодульКлиента().ОткрытьФормуКоэффициентаПересчета(КлючНоменклатуры1С, ЭтаФорма, Копирование);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	КлючНоменклатуры1С = Элемент.ТекущиеДанные.КлючНоменклатуры1С;
	
	МодульКлиента().ОткрытьФормуКоэффициентаПересчета(КлючНоменклатуры1С, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ОписаниеКлюча = Новый Структура;
	ОписаниеКлюча.Вставить("КлючНоменклатуры1С", ВыбранноеЗначение);
	ПараметрыКонструктра = Новый Массив;
	ПараметрыКонструктра.Добавить(ОписаниеКлюча);
	ТипКлюча = "РегистрСведенийКлючЗаписи.КонтурМаркировка_КоэффициентыПересчета";
	
	Элементы.Список.Обновить();
	Элементы.Список.ТекущаяСтрока = Новый(ТипКлюча, ПараметрыКонструктра);
	
КонецПроцедуры

// #КонецОбласти