//  Экспорт перемещений внутренних, со склада на склад EME, с учетом зон склада и статусов
//	Copyright (C) 2012-2025 Engineer Mareev Enterprises

//	Модуль для УТ 10.3 Экспортирует сообщения transfer из документа Перемещение товаров c характеристиками или сериями товара. 
//	$Перемещение товаров межскладское (неордерная схема) 
//	 - В 1С оператор (руч.) оформляет документ "Перемещение товаров", который при проведении (авт.) помечается к Экспорту.
//	 - 1С (авт.) экспортирует сообщение TRANSFER.

#Область ПрограммныйИнтерфейс

//	Функция ПолучитьИмяСообщения возвращает имя сообщения ASN
Функция ПолучитьИмяСообщения() Экспорт
	Возврат "transfer";
КонецФункции

//	Функция ПолучитьМетаданные возвращает метаданные сообщения
Функция ПолучитьМетаданные() Экспорт
	Возврат Метаданные.Документы.ПеремещениеТоваров;
КонецФункции

//	Процедура ЭкспортироватьПеремещениеТоваровКакПриход экспортирует одно перемещение товаров внутреннее (с учетом зон)
Процедура Экспортировать(ERPData, Перемещение) Экспорт

	АктуализироватьУИДыСтрок(Перемещение.Ссылка);   
	
	//	Заголовок TRANSFER
	EmeWmsERPEngine.AppendHeaderLine(ERPData);
	
	ERPData.header.transfer_id       	= Перемещение.УникальныйИдентификатор();
	Если Константы.EmeWmsСоздаватьУникальныеСообщения.Получить() Тогда
		ERPData.header.id	  		= Новый УникальныйИдентификатор;
	Иначе
		ERPData.header.id	  		= ERPData.header.transfer_id;
	КонецЕсли;

	ERPData.header.po_id		  	= Перемещение.УникальныйИдентификатор();
	ERPData.header.po_reg_no		= СокрЛП(Перемещение.Номер)+"/"+Формат(Год(Перемещение.Дата),"ЧГ=4");
	ERPData.header.erp_doc_type	  	= ПолучитьМетаданные().Имя;
	ERPData.header.whs_code 	  	= EmeWmsУтилиты.ПолучитьКодСкладаEMEПоСсылке(Перемещение.СкладОтправитель);
	ERPData.header.whs_to_code 	  	= EmeWmsУтилиты.ПолучитьКодСкладаEMEПоСсылке(Перемещение.СкладПолучатель);
	ERPData.header.vendor_code 		= EmeWmsУтилиты.ПолучитьКодОрганизацииEMEПоСсылке(Перемещение.Организация);
	
	ERPData.header.comment        	= Лев(Перемещение.Комментарий, 128);
	ERPData.header.is_repacking		= 0;
	КодЗоныОткуда			 	  	= EmeWmsУтилиты.ПолучитьКодЗоныEMEПоСсылке(Перемещение.СкладОтправитель);
	КодЗоныКуда			 	  		= EmeWmsУтилиты.ПолучитьКодЗоныEMEПоСсылке(Перемещение.СкладПолучатель);
	СтатусОткуда					= EmeWmsУтилиты.ПолучитьКодСтатусаТовараПоСсылкеНаСклад(Перемещение.СкладОтправитель);
	СтатусКуда						= EmeWmsУтилиты.ПолучитьКодСтатусаТовараПоСсылкеНаСклад(Перемещение.СкладПолучатель);
	
	// Передадим признак смены статуса товара (напр. перемещение на неликвид)
	Если СтатусОткуда <> СтатусКуда Тогда
		ERPData.header.is_status_change = 1;
	КонецЕсли;
	
	// Разрешить автоподбор
	ERPData.header.is_auto_search = 1;  
	
	// Основание - перемещение между складами
	ERPData.header.reason_code = "A09";

	//	Использование серий в интеграции
	ИспользоватьСерииНастройка = Константы.EmeWmsИспользоватьСерии.Получить();	

	//	Строки перемещения
	EmeWmsERPEngine.SelectChild(ERPData, "lines");
	Для Каждого СтрокаТовара Из Перемещение.Товары Цикл
		Если Не ЗначениеЗаполнено(СтрокаТовара.Номенклатура)
			ИЛИ Не ЗначениеЗаполнено(СтрокаТовара.ЕдиницаИзмерения)
			ИЛИ СтрокаТовара.Количество = 0 Тогда
			
			Продолжить;
		КонецЕсли;
		
		EmeWmsERPEngine.AppendChildLine(ERPData);

		ERPData.lines.id			= СтрокаТовара.EmeWmsУИДСтроки;
		ERPData.lines.po_line_no	= СтрокаТовара.НомерСтроки;
		ERPData.lines.goods_id		= СтрокаТовара.Номенклатура.УникальныйИдентификатор();
		ERPData.lines.goods_code	= СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовара.Номенклатура, "Код"));
		ERPData.lines.quantity		= EmeWmsУтилиты.ПересчетВДругуюЕдиницу(СтрокаТовара.Количество, 
															 			   СтрокаТовара.ЕдиницаИзмерения,
															 			   EmeWmsУтилиты.ПолучитьБазовуюЕдиницуИзмерения(СтрокаТовара.Номенклатура));
		ERPData.lines.mu_code		= СтрокаТовара.Номенклатура.БазоваяЕдиницаИзмерения.Код; 
		
		ERPData.lines.zone_code		= КодЗоныОткуда;
		ERPData.lines.zone_to_code	= КодЗоныКуда;  
		// #IBS 28.04.2022 Коды статуса товара нужны для определения транзакции перемещения (324 c изменением статуса)
		ERPData.lines.stock_status	= СтатусОткуда;
		ERPData.lines.stock_status_to = СтатусКуда;
		
		// Выгружаем серии или характеристики товара
		ИспользоватьСерии 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовара.Номенклатура, "ВестиУчетПоСериям"); 

		Если Не ИспользоватьСерииНастройка Тогда
			ИспользоватьСерии = Ложь;
		КонецЕсли;
		
		Если ИспользоватьСерии Тогда // Серии
			// Здесь в сериях номер не заполняется, только наименование, содержащее номер и дату документа в виде текста.
			СерийныйНомер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовара.СерияНоменклатуры, "Наименование");
			СрокГодности = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовара.СерияНоменклатуры, "СрокГодности");
			Если ЗначениеЗаполнено(СерийныйНомер) Тогда 
				ERPData.lines.lot_no = СерийныйНомер;
				ERPData.lines.bbd = СрокГодности;
			КонецЕсли;
		Иначе // Характеристики
			ИспользоватьХарактеристики = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовара.Номенклатура,  "ВестиУчетПоХарактеристикам");
			Если ИспользоватьХарактеристики Тогда
				Если ЗначениеЗаполнено(СтрокаТовара.ХарактеристикаНоменклатуры) Тогда
					ERPData.lines.lot_no = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовара.ХарактеристикаНоменклатуры, "Наименование");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

		Если НЕ EmeWmsЭкспортНоменклатуры.Экспортирован(СтрокаТовара.Номенклатура) Тогда
			EmeWmsЭкспортНоменклатуры.РазрешитьЭкспортСГруппами(СтрокаТовара.Номенклатура);
		КонецЕсли;                                                                       

	КонецЦикла;		
	
КонецПроцедуры

#КонецОбласти

#Область ЭкспортныеСлужебныеПроцедурыИФункции

//	Функция ПолучитьВыборкуСсылок возвращает выборку ссылок для экспорта
Функция ПолучитьВыборкуСсылок() Экспорт
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	EmeWmsПометкиКЭкспортуПеремещенийТоваров.ПеремещениеТоваров.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрСведений.EmeWmsПометкиКЭкспортуПеремещенийТоваров КАК EmeWmsПометкиКЭкспортуПеремещенийТоваров
		|ГДЕ
		|	EmeWmsПометкиКЭкспортуПеремещенийТоваров.КЭкспорту";
		
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции

//	Функция РазрешенКЭкспорту возвращает Истина, если перемещение товаров разрешено к экспорту.
Функция РазрешенКЭкспорту(ПеремещениеТоваров) Экспорт
	
	ДатаЗапускаИнтеграции = Константы.EmeWmsДатаЗапускаИнтеграции.Получить();
	Если ЗначениеЗаполнено(ДатаЗапускаИнтеграции)
			И ПеремещениеТоваров.Дата < ДатаЗапускаИнтеграции Тогда
		ОтменитьЭкспорт(ПеремещениеТоваров);
		Возврат Ложь;
	КонецЕсли;	

	Если ПеремещениеТоваров.ПометкаУдаления Тогда
		ОтменитьЭкспорт(ПеремещениеТоваров);
		Возврат Ложь;
	КонецЕсли;

	Если НЕ ПеремещениеТоваров.Проведен Тогда
		ОтменитьЭкспорт(ПеремещениеТоваров);
		Возврат Ложь;
	КонецЕсли;
	
	// Не экспортировать, если склад-отправитель или склад-получатель не из EME.WMS
	КодСкладаОтправителя	= EmeWmsУтилиты.ПолучитьКодСкладаEMEПоСсылке(ПеремещениеТоваров.СкладОтправитель);
	КодСкладаПолучателя 	= EmeWmsУтилиты.ПолучитьКодСкладаEMEПоСсылке(ПеремещениеТоваров.СкладПолучатель);
	
	Если КодСкладаОтправителя = неопределено ИЛИ КодСкладаПолучателя = неопределено Тогда
		ОтменитьЭкспорт(ПеремещениеТоваров);
	
		Возврат Ложь;
	КонецЕсли;
	
	Если ПеремещениеИмпортировано(ПеремещениеТоваров) Тогда
		ОтменитьЭкспорт(ПеремещениеТоваров);
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область ЛокальныеСлужебныеПроцедурыИФункции

//	Проверить, было импортировано перемещение, или нет
Функция ПеремещениеИмпортировано(Документ)
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеПеремещенийТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Возврат Истина;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции

//	Процедура ПометитьКЭкспорту помечает перемещение товаров к экспорту.
Процедура ПометитьКЭкспорту(ПеремещениеТоваров) Экспорт

	Если Не РазрешенКЭкспорту(ПеремещениеТоваров) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуПеремещенийТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПеремещениеТоваров.Установить(ПеремещениеТоваров.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Истина;
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsПометкиКЭкспортуПеремещенийТоваров.СоздатьМенеджерЗаписи();
	НоваяЗапись.ПеремещениеТоваров = ПеремещениеТоваров.Ссылка;
	НоваяЗапись.КЭкспорту = Истина;
    НоваяЗапись.Записать(); 
		 
КонецПроцедуры

//	Функция ПомеченКЭкспорту возвращает Истина, если перемещение товаров помечено к экспорту.
Функция ПомеченКЭкспорту(ПеремещениеТоваров) Экспорт
	
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуПеремещенийТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПеремещениеТоваров.Установить(ПеремещениеТоваров.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Возврат Запись.КЭкспорту;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

//	Процедура ПодтвердитьЭкспорт подтверждает экспорт перемещения товаров.
Процедура ПодтвердитьЭкспорт(ПеремещениеТоваровСсылка) Экспорт

	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуПеремещенийТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПеремещениеТоваров.Установить(ПеремещениеТоваровСсылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Ложь;
		Запись.ДатаЭкспорта = ТекущаяДата();
		НаборЗаписей.Записать();
	КонецЦикла;	

КонецПроцедуры

//	Процедура отменяет экспорт перемещения товаров
Процедура ОтменитьЭкспорт(ПеремещениеТоваровСсылка)

	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуПеремещенийТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПеремещениеТоваров.Установить(ПеремещениеТоваровСсылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Ложь;
		НаборЗаписей.Записать();
	КонецЦикла;	

КонецПроцедуры

//	#IBS 12.02.2022 Процедура ПометитьКЭкспорту помечает перемещение товаров на событии при записи перемещения товаров.
Процедура ПометитьКЭкспортуПриЗаписиПеремещенияТоваров(Источник, Отказ) Экспорт
	ПометитьКЭкспорту(Источник);
КонецПроцедуры

//	Создать новые УИДы строк ТЧ товары документа и исправить дубли, если возникли (при копировании)
Процедура АктуализироватьУИДыСтрок(ДокументСсылка)
	//	Проверим наличие строк к заполнению реквизита EmeWmsУИДСтроки, прежде чем получать Объект
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИСТИНА КАК ИзменятьEmeWmsУИДСтроки
		|ИЗ
		|	Документ.ПеремещениеТоваров.Товары КАК ТЧТовары
		|ГДЕ
		|	ТЧТовары.Ссылка = &Ссылка
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(ТЧТовары.EmeWmsУИДСтроки) 
		|	<> КОЛИЧЕСТВО(РАЗЛИЧНЫЕ 
		|		ВЫБОР
		|			КОГДА ТЧТовары.EmeWmsУИДСтроки > """"
		|				ТОГДА ТЧТовары.EmeWmsУИДСтроки
		|			ИНАЧЕ NULL
		|		КОНЕЦ)";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	// Для исключения дублей УИД в строках ТЧ
	КлючиСтрок 					= Новый Соответствие;
	БылиСозданыИдентификаторы 	= Ложь;

	Документ = ДокументСсылка.ПолучитьОбъект();
	Для Каждого СтрокаТовара Из Документ.Товары Цикл 
		// Генерация специальных UID строк документа при выгрузке
		Если НЕ ЗначениеЗаполнено(СтрокаТовара.EmeWmsУИДСтроки) ИЛИ КлючиСтрок.Получить(СтрокаТовара.EmeWmsУИДСтроки) <> Неопределено Тогда
			СтрокаТовара.EmeWmsУИДСтроки 	= Новый УникальныйИдентификатор();
			БылиСозданыИдентификаторы 		= Истина;
		КонецЕсли;
		КлючиСтрок.Вставить(СтрокаТовара.EmeWmsУИДСтроки, 0);
	КонецЦикла;	
	
	Если БылиСозданыИдентификаторы Тогда
		// При записи не перепроводить, не регистрировать по подписке к Эксопрту
		Документ.ОбменДанными.Загрузка = Истина;
		Документ.Записать();
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти
