
// #Область СлужебныеПеременныеИМетодыФормы

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		Результат = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		Результат = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

// #КонецОбласти // СлужебныеПеременныеИМетодыФормы

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ТипОперации", ТипОперации);
	Параметры.Свойство("ТипыДокументов", ТипыДокументов);
	Параметры.Свойство("КоличествоКОбработке", КоличествоКОбработке);
	
	ЗаполнитьТаблицуРеквизитов();
	ЗаполнитьСписокВыбораПравилоЗаполнения();
	УстановитьУсловноеОформление();
	
КонецПроцедуры

// #КонецОбласти // ОбработчикиСобытийФормы

// #Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТаблицаРеквизитовПриАктивизацииЯчейки(Элемент)
	
	Если Элемент.ТекущийЭлемент.Имя = "ТаблицаРеквизитовЗначение" Тогда
		ТекущиеДанные = Элементы.ТаблицаРеквизитов.ТекущиеДанные;
		МодульКлиента().НастроитьЭлементЗначенияЗаполненияРеквизита(Элемент.ТекущийЭлемент, ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРеквизитовПравилоЗаполненияПриИзменении(Элемент)
	
	Элементы.ТаблицаРеквизитов.ТекущиеДанные.Значение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРеквизитовЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаРеквизитов.ТекущиеДанные;
	
	Если МодульКлиента().ВыборЗначенияИзСправочника(Элемент, ТекущиеДанные, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияВыбора = МодульКлиента().ДанныеВыбораЗначенияЗаполненияРеквизита(ТекущиеДанные);
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ТаблицаРеквизитовЗначениеПослеВыбора", ЭтаФорма);
	
	Если ЗначениеЗаполнено(ЗначенияВыбора) Тогда
		МодульКлиента().ПоказатьДиалогВыбораИзСписка(ОписаниеОбработчика
		, ЗначенияВыбора
		, Элемент
		, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРеквизитовЗначениеПослеВыбора(ВыбранноеЗначение, ДопПараметры = Неопределено) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ТаблицаРеквизитов.ТекущиеДанные.Значение = ВыбранноеЗначение.Значение;
	Элементы.ТаблицаРеквизитов.ЗакончитьРедактированиеСтроки(Ложь);
	Элементы.ТаблицаРеквизитов.ТекущиеДанные.Пометка = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРеквизитовЗначениеПриИзменении(Элемент)
	
	Элементы.ТаблицаРеквизитов.ТекущиеДанные.Пометка = Истина;
	
КонецПроцедуры

// #КонецОбласти // ОбработчикиСобытийЭлементовФормы

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьОперации(Команда)
	
	Если Не ПроверитьНастройкиЗаполненияРеквизитов() Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияНастроек = ЗаполненныеЗначенияНастроекРеквизитов();
	
	Закрыть(ЗначенияНастроек);
	
КонецПроцедуры

// #КонецОбласти // ОбработчикиКомандФормы

// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	Таблица = Элементы.ТаблицаРеквизитов;
	ПравилаЗаполнения = МодульОбъекта().Перечисление_ПравилаЗаполненияРеквизитов();
	Реквизиты = МодульОбъекта().Перечисление_РеквизитыОперацийДляАвтозаполнения();
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ПолеУО = ЭлементУО.Поля.Элементы.Добавить();
	ПолеУО.Поле = Новый ПолеКомпоновкиДанных(Таблица.ПутьКДанным + "Значение");
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Таблица.Имя + ".ПравилоЗаполнения");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = ПравилаЗаполнения.НеЗаполнять;
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	Для Каждого Страна Из МодульОбъекта().СписокСтранЕАЭС() Цикл
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ПолеУО = ЭлементУО.Поля.Элементы.Добавить();
		ПолеУО.Поле = Новый ПолеКомпоновкиДанных(Таблица.ПутьКДанным + "Значение");
		
		ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Таблица.Имя + ".ИмяРеквизита");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Реквизиты.КодСтраныПолучателя;
		
		ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Таблица.Имя + ".Значение");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Страна.Значение;
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Страна.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуРеквизитов()
	
	ПравилаЗаполнения = МодульОбъекта().Перечисление_ПравилаЗаполненияРеквизитов();
	ОписаниеНастроек = МодульОбъекта().Новый_НастройкиЗаполненияОпераций();
	
	Для Каждого Стр Из ОписаниеНастроек.ТаблицаРеквизитов Цикл
		Если Стр.ТипОперации = ТипОперации Тогда
			НоваяСтрока = ТаблицаРеквизитов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
			НоваяСтрока.ПравилоЗаполнения = ПравилаЗаполнения.ФиксированноеЗначение;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораПравилоЗаполнения()
	
	ПравилаЗаполнения = МодульОбъекта().Перечисление_ПравилаЗаполненияРеквизитов();
	СписокВыбора = Элементы.ТаблицаРеквизитовПравилоЗаполнения.СписокВыбора;
	
	ЗначенияСписка = Новый Массив;
	Для Каждого Элемент Из ПравилаЗаполнения Цикл
		Если Элемент.Значение = ПравилаЗаполнения.НеЗаполнять Тогда
			Продолжить;
		КонецЕсли;
		ЗначенияСписка.Добавить(Элемент.Значение);
	КонецЦикла;
	
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаСервере
Функция ЗаполненныеЗначенияНастроекРеквизитов()
	
	Возврат МодульОбъекта().МассивСтруктурИзТаблицыЗначений(ТаблицаРеквизитов.Выгрузить(Новый Структура("Пометка", Истина)));
	
КонецФункции

&НаСервере
Функция ПроверитьНастройкиЗаполненияРеквизитов()
	
	ЕстьОшибки = Ложь;
	
	ТаблицаФормы = Элементы.ТаблицаРеквизитов;
	
	Для Каждого Элемент Из ТипыДокументов Цикл
		ТипДокумента = Элемент.Значение;
		Для Каждого Стр Из ТаблицаРеквизитов Цикл
			ИндексСтроки = ТаблицаРеквизитов.Индекс(Стр);
			Если Стр.Пометка И Не МодульОбъекта().ПроверитьЗначениеНастройкиЗаполненияРеквизита(
				Стр, ТипДокумента, УникальныйИдентификатор, ТаблицаФормы, ИндексСтроки) Тогда
				ЕстьОшибки = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Не ЕстьОшибки;
	
КонецФункции

// #КонецОбласти // СлужебныеПроцедурыИФункции
