
&НаКлиенте
Перем КэшМодуляКлиента;

&НаКлиенте
Перем РезультатЗапроса;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		Результат = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		Результат = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

&НаКлиенте
Функция ВидКлиента()
	
	Результат = "";
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Результат = "Толстый клиент (обычное приложение)";
	#КонецЕсли
	
	#Если ТолстыйКлиентУправляемоеПриложение Тогда
		Результат = "Толстый клиент (управляемое приложение)";
	#КонецЕсли
	
	#Если ТонкийКлиент  Тогда
		Результат = "Тонкий клиент";
	#КонецЕсли
	
	#Если ВебКлиент   Тогда
		Результат = "Веб-клиент";
	#КонецЕсли
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТехИнформация = ТекстИнформацииДляТехПоддержки();
	МодульКлиента().Метрика_Функциональность_ОткрытиеФормыИнформацииДляТехПоддержки();
	
КонецПроцедуры

&НаКлиенте
Функция ТекстИнформацииДляТехПоддержки()
	
	ДанныеДляТехподдержки = ИнформацияДляПоддержкиНаСервере();
	
	ИнформацияОМодуле        = ДанныеДляТехподдержки.ИнформацияОМодуле;
	ИнформацияОКонфигурации  = ДанныеДляТехподдержки.ИнформацияОКонфигурации;
	ИнформацияОНастройках    = ДанныеДляТехподдержки.ИнформацияОНастройкахМодуля;
	ТекстИнформацииОбОшибках = ДанныеДляТехподдержки.ТекстИнформацииОбОшибках;
	ИнформацияОСистеме       = МодульКлиента().ИнформацияОСистеме();
	ИнформацияОПлагинах      = ДанныеДляТехподдержки.ИнформацияОПлагинах;
	
	ТекстИнформации = НСтр(
	"ru = 'Техническая информация:
	|
	|Версия модуля: %ВерсияМодуля%
	|Версия подсистемы: %ВерсияПодсистемы%
	|Версия плагина: %ВерсияПлагина%
	|Расположение модуля: %РасположениеМодуля%
	|Имя модуля: %ИмяМодуля%
	|Модуль доработан: %МодульДоработан%
	|Лицензия на модуль: %ЛицензияНаМодуль%
	|Подключаемый модуль: %ПодключаемыйМодуль%
	|
	|Конфигурация: %Конфигурация%
	|Версия конфигурации: %ВерсияКонфигурации%
	|Тип платформы: %ТипПлатформы%
	|Версия платформы: %ВерсияПриложения%
	|Версия ОС: %ВерсияОС%
	|Вид клиента: %ВидКлиента%
	|Основной режим запуска: %ОсновнойРежимЗапуска%
	|Строка соединения: %СтрокаСоединения%
	|Режим совместимости: %ВерсияРежимаСовместимости%
	|
	|Настройки модуля:
	|Идентификатор экземпляра модуля: %ИдентификаторЭкземпляраМодуля%
	|Используется подпись на сервере: %РазрешитьПодписьНаСервере%
	|Используется прокси: %Прокси_Использовать%
	|
	|Контур плагины:
	|%ИнформацияОПлагинах%
	|
	|%ТекстИнформацииОбОшибках%'");
	
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%ВерсияМодуля%", ИнформацияОМодуле.ВерсияМодуля);
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%ВерсияПодсистемы%", ИнформацияОМодуле.ВерсияПодсистемы);
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%ВерсияПлагина%", ИнформацияОМодуле.ВерсияПлагина);
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%РасположениеМодуля%", ИнформацияОМодуле.РасположениеМодуля);
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%ИмяМодуля%", ИнформацияОМодуле.ИмяМодуля);
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%МодульДоработан%", ИнформацияОМодуле.МодульДоработан);
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%ЛицензияНаМодуль%", ИнформацияОМодуле.ЛицензияНаМодуль);
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%ПодключаемыйМодуль%", ИнформацияОНастройках.ПодключаемыйМодуль);
	
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%Конфигурация%", ИнформацияОКонфигурации.Конфигурация);
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%ВерсияКонфигурации%", ИнформацияОКонфигурации.ВерсияКонфигурации);
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%ТипПлатформы%", ИнформацияОСистеме.ТипПлатформы);
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%ВерсияПриложения%", ИнформацияОСистеме.ВерсияПриложения);
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%ВерсияОС%", ИнформацияОСистеме.ВерсияОС);
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%ВидКлиента%", ВидКлиента());
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%ОсновнойРежимЗапуска%", ИнформацияОКонфигурации.ОсновнойРежимЗапуска);
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%СтрокаСоединения%", ИнформацияОКонфигурации.СтрокаСоединения);
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%ВерсияРежимаСовместимости%", ИнформацияОКонфигурации.ВерсияРежимаСовместимости);
	
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%ИдентификаторЭкземпляраМодуля%", ИнформацияОНастройках.ИдентификаторЭкземпляраМодуля);
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%РазрешитьПодписьНаСервере%", ИнформацияОНастройках.РазрешитьПодписьНаСервере);
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%Прокси_Использовать%", ИнформацияОНастройках.Прокси_Использовать);
	
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%ИнформацияОПлагинах%", ИнформацияОПлагинахСтрокой(ИнформацияОПлагинах));
	
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%ТекстИнформацииОбОшибках%", ТекстИнформацииОбОшибках);
	
	Возврат ТекстИнформации;
	
КонецФункции

&НаСервере
Функция ИнформацияДляПоддержкиНаСервере()
	Возврат МодульОбъекта().ИнформацияДляТехПоддержки();
КонецФункции

&НаКлиенте
Функция ИнформацияОПлагинахСтрокой(ИнформацияОПлагинах)
	
	ИспользоватьПлагины = ИнформацияОПлагинах.ИспользоватьПлагины;
	Плагины = ИнформацияОПлагинах.Плагины;
	
	ПредставленияПлагинов = Новый Массив;
	Шаблон = НСтр("ru = ' - %1 вер. %2 (%3)'");
	Для Каждого Плагин Из Плагины Цикл
		
		ПредставлениеПлагина = МодульКлиента().ПараметрыВСтроку(
			Шаблон,
			Плагин.Идентификатор,
			Плагин.Версия,
			Плагин.Состояние
		);
		ПредставленияПлагинов.Добавить(ПредставлениеПлагина);
		
	КонецЦикла;
	
	Результат = МодульКлиента().ПараметрыВСтроку(НСтр("ru = 'Использовать плагины: %1'"), ИспользоватьПлагины);
	Если ЗначениеЗаполнено(ПредставленияПлагинов) Тогда
		Результат = Результат + Символы.ПС + МодульКлиента().СоединитьСтроку(ПредставленияПлагинов, Символы.ПС);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


