// Copyright (C) 2012-2025 Engineer Mareev Enterprises
// Модуль для ERP 2.5

#Область ЛокальныеСлужебныеПроцедурыИФункции

// Функция возвращает ссылку на драйвер актуальной конфигурации, или неопределено
Функция ПолучитьДрайвер()  
	
	МетаданныеИмя	 = Метаданные.Имя;
	МетаданныеВерсия = Лев(Метаданные.Версия, 4);
	
	Если МетаданныеИмя = "УправлениеПредприятием" И МетаданныеВерсия = "2.5." Тогда
		Возврат EmeWmsДрайверERP25;	
	ИначеЕсли МетаданныеИмя = "УправлениеТорговлей" И МетаданныеВерсия = "11.4" Тогда
		Возврат EmeWmsДрайверУТ114;	
	ИначеЕсли МетаданныеИмя = "КомплекснаяАвтоматизация" И Лев(МетаданныеВерсия,3) = "1.1" Тогда
		Возврат EmeWmsДрайверКА1_1;
	Иначе
		Возврат Неопределено;
	КонецЕсли;   
	
КонецФункции  

#КонецОбласти  

 #Область ЭкспортныеСлужебныеПроцедурыИФункции

// Функция возвращает выборку с группами номенклатурами контрагента
Функция ПолучитьГруппыНоменклатурКонтрагента(ПартнерСсылка) Экспорт 
	
	Драйвер = ПолучитьДрайвер();
	Если Драйвер <> Неопределено Тогда
		Возврат Драйвер.ПолучитьГруппыНоменклатурКонтрагента(ПартнерСсылка);
	Иначе       
		Возврат Неопределено;
	КонецЕсли;		
	
КонецФункции

// Функция возвращает тип штрихкода для маркированных товаров
Функция ПолучитьТипШтрихкодаМаркированногоТовара() Экспорт
	Если Метаданные.Перечисления.ТипыШтрихкодов.ЗначенияПеречисления.Найти("GS1_DataMatrix") <> Неопределено Тогда
		Возврат Перечисления.ТипыШтрихкодов.GS1_DataMatrix;
	ИначеЕсли Метаданные.Перечисления.ТипыШтрихкодов.ЗначенияПеречисления.Найти("GS1_128") <> Неопределено Тогда
		Возврат Перечисления.ТипыШтрихкодов.GS1_128;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

#КонецОбласти

#Область РаботаСМодулямиОсновнойКонфигурации

#Область ЗаполнениеПересчетТЧТовары

//	Процедура заполняет статусы указания серий в строках ТЧ товары
Процедура ЗаполнитьСтатусыУказанияСерий(Объект, Менеджер) Экспорт
	
	// ПолучитьДрайвер() используем только когда различаются вызываемые модули
	//ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(Объект, Менеджер));	
	//НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
	
КонецПроцедуры

//	Обрабатывает строку табличной части
Процедура ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт

	// ПолучитьДрайвер() используем только когда различаются вызываемые модули
	//ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры

//	Пересчет сумм документа штатным алгоритмом
Процедура ПересчитатьСуммыРеализации(ДокументОбъект) Экспорт

	// ПолучитьДрайвер() используем только когда различаются вызываемые модули
	
	// Заполним ставку с учетом текущей даты документа. Пересчитываем связанные реквизиты табличной части.
	//СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВТЧ(ДокументОбъект);
	//СтруктураДействий = Новый Структура;
	//СтруктураДействий.Вставить("СкорректироватьСтавкуНДС", ОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтавкиНДС(ДокументОбъект));
	//СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	//СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	//СтруктураДействий.Вставить("ПересчитатьСумму");
	//СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать, ПересчитыватьСуммуРучнойСкидки", Ложь, Ложь));
	//СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Ложь));
	//ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(ДокументОбъект.Товары, СтруктураДействий, Неопределено);

КонецПроцедуры      

//	Пересчет сумм документа Возврат товаров от клиента штатным алгоритмом
Процедура ПересчитатьСуммыВозврата(ДокументОбъект) Экспорт

	// ПолучитьДрайвер() используем только когда различаются вызываемые модули
	
	// Заполним ставку с учетом текущей даты документа. Пересчитываем связанные реквизиты табличной части.
	//СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВТЧ(ДокументОбъект);
	//СтруктураДействий = Новый Структура;
	//СтруктураДействий.Вставить("СкорректироватьСтавкуНДС", ОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтавкиНДС(ДокументОбъект));
	//СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	//СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	//СтруктураДействий.Вставить("ПересчитатьСумму");
	//ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(ДокументОбъект.Товары, СтруктураДействий, Неопределено);

КонецПроцедуры      

// Процедура пересчитывает сумму в строке табличной части "Расшифровка платежа" при изменении суммы в шапке документа.
Процедура ПересчитатьСуммыВСтрокеРасшифровкиПлатежа(Объект) Экспорт

  	// ПолучитьДрайвер() используем только когда различаются вызываемые модули
	СуммаТоваров = ?(Объект.ПредусмотренЗалогЗаТару ИЛИ Не Объект.ВозвратПринятойМногооборотнойТары,
	Объект.Товары.Итог("СуммаСНДС"),
	Объект.Товары.Итог("СуммаСНДСБезВозвратнойТары"));
	
	//ФинансыКлиентСервер.ПересчитатьСуммыВСтрокеРасшифровкиПлатежа(Объект, СуммаТоваров);
	
КонецПроцедуры

#КонецОбласти

#Область ПараметрыЗаполненияПересчета

// Возвращает структуру параметров для заполнения налогообложения НДС продажи или возврата товаров от покупателя.
Функция ПараметрыЗаполненияНалогообложенияНДСПродажи() Экспорт
		
	//Возврат УчетНДСУПКлиентСервер.ПараметрыЗаполненияНалогообложенияНДСПродажи();
	
КонецФункции

// Возвращает структуру, содержащую параметры для заполнения ставки НДС
Функция ПараметрыЗаполненияСтавкиНДС(Объект = Неопределено, ПоДатеОтгрузки = Ложь, ВернутьМногооборотнуюТару = Ложь) Экспорт

	Драйвер = ПолучитьДрайвер();
	Если Драйвер <> Неопределено Тогда
		Возврат Драйвер.ПараметрыЗаполненияСтавкиНДС(Объект, ПоДатеОтгрузки, ВернутьМногооборотнуюТару);
	Иначе       
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции

// Возвращает структуру, содержащую поля значений, используемых для заполнения цен в строках табличной части документа.
Функция ПараметрыЗаполненияЦеныВСтрокеТЧ(Объект, ВидЦеныВШапке = Ложь) Экспорт

	Драйвер = ПолучитьДрайвер();
	Если Драйвер <> Неопределено Тогда
		Возврат Драйвер.ПараметрыЗаполненияЦеныВСтрокеТЧ(Объект, ВидЦеныВШапке);
	Иначе       
		Возврат Неопределено;
	КонецЕсли;	

КонецФункции

// Возвращает структуру, содержащую поля значений, используемых для пересчета сумм НДС в строках табличной части 
Функция ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект) Экспорт
	
	//Возврат ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
КонецФункции

#КонецОбласти

#Область ПолучениеЗаполнениеРеквизита

// Заполняет вид деятельности НДС
Процедура ЗаполнитьВидДеятельностиНДС(ДокументОбъект) Экспорт
	
	// ПолучитьДрайвер() используем только когда различаются вызываемые модули
	ПараметрыЗаполнения = Документы.СписаниеНедостачТоваров.ПараметрыЗаполненияВидаДеятельностиНДС(ДокументОбъект);	
	//УчетНДСУП.ЗаполнитьВидДеятельностиНДС(ДокументОбъект.ВидДеятельностиНДС, ПараметрыЗаполнения);							
	
КонецПроцедуры

// Проверяет соответствие указанного в документе продажи Налогообложения НДС настройкам учета НДС и операции документа. 
Процедура ЗаполнитьНалогообложениеНДСПродажи(НалогообложениеНДС, ПараметрыЗаполнения, КэшированныеЗначенияПараметров = Неопределено) Экспорт
		
	//УчетНДСУП.ЗаполнитьНалогообложениеНДСПродажи(НалогообложениеНДС, ПараметрыЗаполнения, КэшированныеЗначенияПараметров);
	
КонецПроцедуры

//	Заполнение ТЧ документа ценами и пересчет сумм
Функция ЗаполнитьЦеныПоВидуЦен(ДокументОбъект) Экспорт 
	
	Драйвер = ПолучитьДрайвер();
	Если Драйвер <> Неопределено Тогда
		Возврат Драйвер.ЗаполнитьЦеныПоВидуЦен(ДокументОбъект);
	Иначе       
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции

// Возвращает валюту управленческого учета
Функция ПолучитьВалютуУправленческогоУчета(Знач ВидЦены = Неопределено) Экспорт
	
	// ПолучитьДрайвер() используем только когда различаются вызываемые модули
	//Возврат ДоходыИРасходыСервер.ПолучитьВалютуУправленческогоУчета(
	//				Справочники.ВидыЦен.ПолучитьРеквизитыВидаЦены(ВидЦены).ВалютаЦены);
КонецФункции

#КонецОбласти

#Область ПолучениеКонтактнойИнформации

//	Возвращает таблицу, содержащую контактную информацию объекта.
Функция КонтактнаяИнформацияОбъекта(СсылкаИлиОбъект, ВидИлиТипКонтактнойИнформации = Неопределено, Дата = Неопределено, ТолькоПредставление = Истина) Экспорт

	// ПолучитьДрайвер() используем только когда различаются вызываемые модули
	Возврат УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(СсылкаИлиОбъект, ВидИлиТипКонтактнойИнформации, Дата);
	
КонецФункции

//	Функция находит актуальное значение адреса в контактной информации.
Функция ПолучитьАдресИзКонтактнойИнформации(Объект, ТипАдреса = "", Дата = Неопределено) Экспорт

	// ПолучитьДрайвер() используем только когда различаются вызываемые модули
	Возврат ФормированиеПечатныхФорм.ПолучитьАдресИзКонтактнойИнформации(Объект, ТипАдреса, Дата);	
	
КонецФункции

//	Функция находит актуальное значение телефона в контактной информации.
Функция ПолучитьТелефонИзКонтактнойИнформации(Объект) Экспорт       

	// ПолучитьДрайвер() используем только когда различаются вызываемые модули
	Возврат ФормированиеПечатныхФорм.ПолучитьТелефонИзКонтактнойИнформации(Объект); 
	
КонецФункции

#КонецОбласти

#Область МаркиЧЗ

//	Возвращает число маркируемых товаров в документе (штук, пар)
Функция КоличествоМаркируемыхТоваровВРаспоряжении(ДокументСсылка, РаспоряжениеИмяОбъектаМетаданных) Экспорт

	Если НЕ (РаспоряжениеИмяОбъектаМетаданных = "Документ.ЗаказПоставщику"
		     	ИЛИ РаспоряжениеИмяОбъектаМетаданных = "Документ.ПриобретениеТоваровУслуг"
					ИЛИ РаспоряжениеИмяОбъектаМетаданных = "Документ.ВозвратТоваровОтКлиента") Тогда
		Возврат 0;	
	КонецЕсли;
		
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СУММА(ЗаказПоставщикуТовары.Количество) КАК КоличествоТоваров
		|ИЗ
		|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		|ГДЕ
		|	НЕ ЗаказПоставщикуТовары.Отменено
		|	И ЗаказПоставщикуТовары.Номенклатура.ПродукцияМаркируемаяДляГИСМ
		|	И ЗаказПоставщикуТовары.Ссылка = &ДокументСсылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПоставщикуТовары.Ссылка";                     
	
	Если РаспоряжениеИмяОбъектаМетаданных = "Документ.ПриобретениеТоваровУслуг" Тогда   
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "НЕ ЗаказПоставщикуТовары.Отменено", "ИСТИНА");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЗаказПоставщику", "ПриобретениеТоваровУслуг");  
		
	ИначеЕсли РаспоряжениеИмяОбъектаМетаданных = "Документ.ВозвратТоваровОтКлиента" Тогда    
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "НЕ ЗаказПоставщикуТовары.Отменено", "ИСТИНА");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЗаказПоставщику", "ВозвратТоваровОтКлиента");	
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.КоличествоТоваров;

КонецФункции

//	Получить число марок товаров по приобретениям по данному распоряжению
Функция ЧислоМарокТоваровВРаспоряжении(ДокументСсылка, РаспоряжениеИмяОбъектаМетаданных, СтрокаНомеров) Экспорт
	
	ЧислоМаркированныхТоваров = 0;
	ТаблицаПриобретений = ВыбратьПриобретенияПоРаспоряжению(ДокументСсылка, РаспоряжениеИмяОбъектаМетаданных);
	Для каждого СтрокаТаблицы из ТаблицаПриобретений Цикл 
		СтрокаНомеров = СтрокаНомеров + ?(СтрокаНомеров = "", "", ", ") + СтрокаТаблицы.ПриобретениеНомер;
		ЧислоМаркированныхТоваров = ЧислоМаркированныхТоваров + ЧислоМаркированныхТоваровВПриобретении(СтрокаТаблицы.ПриобретениеСсылка);
	КонецЦикла;
	
	Возврат ЧислоМаркированныхТоваров; 
	
КонецФункции

//	Собрать в таблицу марки, полученные по распоряжению
Функция СобратьМаркиПоРаспоряжению(ДокументСсылка, РаспоряжениеИмяОбъектаМетаданных) Экспорт
	
	ТаблицаМарок = Новый ТаблицаЗначений;   
	ТаблицаМарок.Колонки.Добавить("Номенклатура");
	ТаблицаМарок.Колонки.Добавить("Характеристика");
	ТаблицаМарок.Колонки.Добавить("Серия");
	ТаблицаМарок.Колонки.Добавить("Упаковка");
	ТаблицаМарок.Колонки.Добавить("ЗначениеШтрихкода");
			
	Если НЕ (РаспоряжениеИмяОбъектаМетаданных = "Документ.ЗаказПоставщику"
		     	ИЛИ РаспоряжениеИмяОбъектаМетаданных = "Документ.ПриобретениеТоваровУслуг"
					ИЛИ РаспоряжениеИмяОбъектаМетаданных = "Документ.ВозвратТоваровОтКлиента") Тогда
		Возврат ТаблицаМарок;	
	КонецЕсли;
	
	ТаблицаПриобретений = ВыбратьПриобретенияПоРаспоряжению(ДокументСсылка, РаспоряжениеИмяОбъектаМетаданных);	
	Для каждого СтрокаТаблицы из ТаблицаПриобретений Цикл        
		ВыбратьМаркиПоПриобретению(СтрокаТаблицы.ПриобретениеСсылка, ТаблицаМарок);
	КонецЦикла;
	
	Возврат ТаблицаМарок; 
	
КонецФункции

//	Собрать в таблицу марки, полученные по приобретению товаров
Функция СобратьМаркиПоПриобретениюТоваров(ДокументСсылка) Экспорт
	
	ТаблицаМарок = Новый ТаблицаЗначений;   
	ТаблицаМарок.Колонки.Добавить("Номенклатура");
	ТаблицаМарок.Колонки.Добавить("Характеристика");
	ТаблицаМарок.Колонки.Добавить("Серия");
	ТаблицаМарок.Колонки.Добавить("Упаковка");
	ТаблицаМарок.Колонки.Добавить("ЗначениеШтрихкода");
	ТаблицаМарок.Колонки.Добавить("ЗначениеШтрихкодаУпаковки");
			
	ВыбратьМаркиПоПриобретению(ДокументСсылка, ТаблицаМарок);
	
	Возврат ТаблицаМарок; 
	
КонецФункции

//	Собрать в таблицу серии и количества по документу
Функция СобратьСерииИКоличестваПоДокументу(ДокументСсылка) Экспорт
	
	ТаблицаСерий = Новый ТаблицаЗначений;   
	ТаблицаСерий.Колонки.Добавить("Номенклатура");
	ТаблицаСерий.Колонки.Добавить("Серия");
	ТаблицаСерий.Колонки.Добавить("Количество");
			
	Для каждого СтрокаТовара из ДокументСсылка.Товары Цикл        
		Если ЗначениеЗаполнено(СтрокаТовара.Серия) И СтрокаТовара.Количество > 0 Тогда
			СтрокаСерий = ТаблицаСерий.Добавить();
			СтрокаСерий.Номенклатура = СтрокаТовара.Номенклатура;
			СтрокаСерий.Серия = СтрокаТовара.Серия;
			СтрокаСерий.Количество = СтрокаТовара.Количество;
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаСерий.Свернуть("Номенклатура,Серия", "Количество");

	Возврат ТаблицаСерий; 
	
КонецФункции

//	Получить доступную серию по номенклатуре из таблицы количеств по сериям
//  Черновой вариант метода
Функция ПолучитьСериюПоТаблицеСерий(ТаблицаСерий, Номенклатура) Экспорт

	Серия = Неопределено;
	Для каждого СтрокаСерий из ТаблицаСерий Цикл        
		Если СтрокаСерий.Номенклатура = Номенклатура И СтрокаСерий.Количество > 0 Тогда
			Серия = СтрокаСерий.Серия;
			СтрокаСерий.Количество = СтрокаСерий.Количество - 1;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Возврат Серия; 
	
КонецФункции

//	Выбрать документы приобретения с марками, возвращает (Таблица значений)
Функция ВыбратьПриобретенияПоРаспоряжению(ДокументСсылка, РаспоряжениеИмяОбъектаМетаданных)

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Приобретение.Ссылка КАК ПриобретениеСсылка,
		|   Приобретение.Номер КАК ПриобретениеНомер
		|ИЗ
		|	
		|Документ.ПриобретениеТоваровУслуг КАК Приобретение
		|ГДЕ
		|	Приобретение.ЗаказПоставщику = &ДокументСсылка
		|	И НЕ Приобретение.ПометкаУдаления";
	
	Если РаспоряжениеИмяОбъектаМетаданных = "Документ.ПриобретениеТоваровУслуг" Тогда     
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Приобретение.ЗаказПоставщику", "Приобретение.Ссылка");     
		
	ИначеЕсли РаспоряжениеИмяОбъектаМетаданных = "Документ.ВозвратТоваровОтКлиента" Тогда   
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.ПриобретениеТоваровУслуг", "Документ.ПриходныйОрдерНаТовары"); 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Приобретение.ЗаказПоставщику", 
							"Приобретение.Распоряжение ССЫЛКА Документ.ВозвратТоваровОтКлиента И Приобретение.Распоряжение");    
		
	КонецЕсли;
		
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

//	Возвращает число маркированных товаров в приобретении (штук, пар)
Функция ЧислоМаркированныхТоваровВПриобретении(ПриобретениеСсылка) Экспорт
	
	ЧислоТоваров = 0;
	Для каждого СтрокаШтрихкода из ПриобретениеСсылка.ШтрихкодыУпаковок Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаШтрихкода.ШтрихкодУпаковки) Тогда
			Продолжить;
		КонецЕсли;
		
		ШтрихкодУпаковки = СтрокаШтрихкода.ШтрихкодУпаковки;
		ТипУпаковки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ШтрихкодУпаковки, "ТипУпаковки");
		
		Если ТипУпаковки = Перечисления.ТипыУпаковок.МонотоварнаяУпаковка Тогда
			ЧислоТоваров = ЧислоТоваров + ШтрихкодУпаковки.ВложенныеШтрихкоды.Количество();
		Иначе
			ЧислоТоваров = ЧислоТоваров + 1;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЧислоТоваров;
	
КонецФункции     

//	Возвращает число маркируемых товаров в приобретении (штук, пар)
Функция КоличествоМаркируемыхТоваровВПриобретении(ПриобретениеСсылка) Экспорт
	
	ЧислоТоваров = 0;
	Для каждого СтрокаТовара из ПриобретениеСсылка.Товары Цикл
		Если СтрокаТовара.Номенклатура.ПродукцияМаркируемаяДляГИСМ Тогда
			ЧислоТоваров = ЧислоТоваров + СтрокаТовара.Количество;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЧислоТоваров;
	
КонецФункции     

// #IBS 10.08.2023 Выбрать марки в таблицу с колонками значение штрихкода, номенклатура, характеристика, упаковка из ТЧ ШтрихкодыУпаковок
Функция ВыбратьМаркиПоПриобретению(ДокументСсылка, ТаблицаМарок) Экспорт
	Для каждого стр1 из ДокументСсылка.ШтрихкодыУпаковок Цикл
		ШКСсылка = стр1.ШтрихкодУпаковки;
		Если НЕ ШКСсылка.Пустая() Тогда  
			ТипУпаковки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ШКСсылка, "ТипУпаковки"); 
			
			Если ТипУпаковки = Перечисления.ТипыУпаковок.МонотоварнаяУпаковка ИЛИ 
				ТипУпаковки = Перечисления.ТипыУпаковок.МультитоварнаяУпаковка Тогда 
				// #IBS Ширяев 31.01.2025 Надо выгружать агрегированные марки (коробов)
				ЗначениеШтрихкодаУпаковки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ШКСсылка, "ЗначениеШтрихкода");
				Для каждого Строка из ШКСсылка.ВложенныеШтрихкоды Цикл
					РеквизитыШтрихкода = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Строка.Штрихкод,
															"Номенклатура,Характеристика,Серия,Упаковка,ЗначениеШтрихкода");
					
					СтрШК = ТаблицаМарок.Добавить();
					ЗаполнитьЗначенияСвойств(СтрШК,РеквизитыШтрихкода); 
					СтрШК.ЗначениеШтрихкодаУпаковки = ЗначениеШтрихкодаУпаковки;
				КонецЦикла;
			Иначе
				СтрШК = ТаблицаМарок.Добавить();
				СтрШК.Номенклатура 		= ШКСсылка.Номенклатура;
				СтрШК.Характеристика 	= ШКСсылка.Характеристика;
				СтрШК.Серия 			= ШКСсылка.Серия;
				СтрШК.Упаковка 			= ШКСсылка.Упаковка;
				СтрШК.ЗначениеШтрихкода = ШКСсылка.ЗначениеШтрихкода;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;		
КонецФункции	

//	Добавляет марки в ТЧ ШтрихкодыУпаковок документа
Процедура ДобавитьМаркиВТЧШтрихкодыУпаковок(ТЧШтрихкодыУпаковок, ТаблицаМарок) Экспорт
	
	Для Каждого СтрокаМарок Из ТаблицаМарок Цикл
		ШтрихкодУпаковки = НайтиСоздатьШтрихкодУпаковки(СтрокаМарок);
		
		// Поиск Штрихкода в Штрихкодах упаковки проверяемого документа
		Отбор = Новый Структура();
		Отбор.Вставить("ШтрихкодУпаковки", ШтрихкодУпаковки);
			
		МассивСтрок = ТЧШтрихкодыУпаковок.НайтиСтроки(Отбор);
		Если МассивСтрок.Количество() > 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		СтрокаШтрихкода = ТЧШтрихкодыУпаковок.Добавить();
		СтрокаШтрихкода.ШтрихкодУпаковки = ШтрихкодУпаковки.Ссылка;
	КонецЦикла;
	
КонецПроцедуры

//  Получить таблицу марок
Процедура ПолучитьТаблицуМарокИзСтрокSSCC(Параметры) Экспорт
	
	ERPData		 = Параметры.ERPData;
	ТаблицаМарок = РазметитьТаблицуМарок();
	НаименованияРеквизитов = "ВидНоменклатуры, ЕдиницаИзмерения, ИспользованиеХарактеристик, ПродукцияМаркируемаяДляГИСМ";
	
	EmeWmsERPEngine.SelectChild(ERPData, "sscc");
	Пока EmeWmsERPEngine.NextChildLine(ERPData) Цикл  
		ТоварСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаТовар(ERPData.sscc.goods_id);
		Если ТоварСсылка.Пустая() Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "GDSBAD");
			Продолжить
		КонецЕсли;            
		
		РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТоварСсылка, НаименованияРеквизитов);
		
		// Можно закомментарить, если есть проблема с настройком вида товара
		Если НЕ РеквизитыНоменклатуры.ПродукцияМаркируемаяДляГИСМ Тогда 
			Продолжить;
		КонецЕсли;
		
		СерияНоменклатуры 		   	= Неопределено;
		ХарактеристикаНоменклатуры 	= Неопределено;
		
		// Серия или Характеристика			
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыНоменклатуры.ВидНоменклатуры, "ИспользоватьСерии") Тогда   
			СерияНоменклатуры = EmeWmsУтилиты.ПолучитьСериюПоНомеруИВидуНоменклатуры(ERPData.sscc.lot_no, ТоварСсылка, РеквизитыНоменклатуры.ВидНоменклатуры);	
		Иначе                  
			Если РеквизитыНоменклатуры.ИспользованиеХарактеристик <> Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать Тогда      
				ХарактеристикаНоменклатуры = EmeWmsУтилиты.ПолучитьХарактеристикуПоНаименованию(ERPData.sscc.lot_no, ТоварСсылка);
			КонецЕсли;                           
		КонецЕсли;                           
					
		КодМарки = ERPData.sscc.true_sign;
		Если ЗначениеЗаполнено(КодМарки) Тогда
			СтрокаМарки = ТаблицаМарок.Добавить();
			СтрокаМарки.Номенклатура 	  = ТоварСсылка;
			СтрокаМарки.Характеристика 	  = ХарактеристикаНоменклатуры;
			СтрокаМарки.Серия 			  = СерияНоменклатуры;
			СтрокаМарки.Упаковка 		  = РеквизитыНоменклатуры.ЕдиницаИзмерения;
			СтрокаМарки.Количество		  = ERPData.sscc.quantity;
			СтрокаМарки.ЗначениеШтрихкода = EmeWmsУтилиты.КодМаркиВЗначениеСоСкобками(КодМарки);
		КонецЕсли;
	КонецЦикла;	
	
	Параметры.Вставить("ТаблицаМарок", ТаблицаМарок);
	
КонецПроцедуры

//	Создает таблицу для марок ЧЗ из таблицы SSCC сообщения
Функция РазметитьТаблицуМарок() 
	
	ТаблицаМарок = Новый ТаблицаЗначений;
	ТаблицаМарок.Колонки.Добавить("Номенклатура");
	ТаблицаМарок.Колонки.Добавить("Характеристика");
	ТаблицаМарок.Колонки.Добавить("Серия");
	ТаблицаМарок.Колонки.Добавить("Упаковка");
	ТаблицаМарок.Колонки.Добавить("Количество");
	ТаблицаМарок.Колонки.Добавить("ЗначениеШтрихкода");
	
	Возврат ТаблицаМарок; 
	
КонецФункции

//	Находит или создает новую строку в справочнике ШтрикодыУпаковокТовара
Функция НайтиСоздатьШтрихкодУпаковки(СтрокаМарок)
	
	Штрихкод = Справочники.ШтрихкодыУпаковокТоваров.НайтиПоРеквизиту("ЗначениеШтрихкода", СокрЛП(СтрокаМарок.ЗначениеШтрихкода));
	Если Штрихкод.Пустая() Тогда
		Штрихкод = Справочники.ШтрихкодыУпаковокТоваров.СоздатьЭлемент(); 
		ЗаполнитьЗначенияСвойств(Штрихкод, СтрокаМарок, , "Количество");
		
		Штрихкод.ТипШтрихкода 	= ПолучитьТипШтрихкодаМаркированногоТовара();
		Штрихкод.ТипУпаковки 	= Перечисления.ТипыУпаковок.МаркированныйТовар; 
		Штрихкод.Количество 	= 1;
		Штрихкод.ДатаУпаковки 	= ТекущаяДата();
		
		Штрихкод.Записать();
	КонецЕсли;
	
	Возврат Штрихкод.Ссылка;   
	
КонецФункции

#КонецОбласти

#КонецОбласти

