
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("GTIN");
	Поля.Добавить("НаименованиеТовара");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = ПредставлениеТовара(Данные.GTIN, Данные.НаименованиеТовара);
	
КонецПроцедуры

// Формирует рабочее представление номенклатуры маркировки
//
// Параметры:
//  GTIN               - Строка - GTIN;
//  НаименованиеТовара - Строка - наименование товара;
// 
// Возвращаемое значение:
//  Строка
//
Функция ПредставлениеТовара(GTIN, НаименованиеТовара) Экспорт
	
	Если ЗначениеЗаполнено(GTIN) Тогда
		
		Результат = GTIN;
		
		Если ЗначениеЗаполнено(НаименованиеТовара) Тогда
			Результат = Результат + " (" + НаименованиеТовара + ")";
		КонецЕсли;
		
	Иначе
		
		Результат = НаименованиеТовара;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции