
// #Область СлужебныеПеременныеИМетодыФормы

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		Результат = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		Результат = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

// #КонецОбласти

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ИдентификаторОпроса", ИдентификаторОпроса);
	Параметры.Свойство("КлючСценария", КлючСценария);
	Параметры.Свойство("ТекстОпроса", ТекстОпроса);
	
	НастроитьЭлементыФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы = Ложь)
	
	Если Не ЗавершениеРаботы Тогда
		СохранитьРезультатОпроса();
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РассчитатьОценку(Команда)
	
	Оценка = Число(СтрЗаменить(ТекущийЭлемент.Имя, "Оценка", ""));
	
	Для Сч = 1 По 5 Цикл
		Если Сч > Оценка Тогда
			Элементы["Оценка" + Сч].Картинка = Элементы.ПустаяЗвезда.Картинка;
		Иначе
			Элементы["Оценка" + Сч].Картинка = Элементы.Звезда.Картинка;
		КонецЕсли;
	КонецЦикла;
	
	НастроитьЭлементыФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьОтзыв(Команда)
	
	ОпросПройден = Истина;
	
	Закрыть();
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьЭлементыФормы(Форма)
	
	Элементы = Форма.Элементы;
	
	ЕстьОценка = ЗначениеЗаполнено(Форма.Оценка);
	Элементы.Комментарий.Доступность = ЕстьОценка;
	Элементы.Кнопка_ОтправитьОтзыв.Доступность = ЕстьОценка;
	
	Если ЗначениеЗаполнено(Форма.ТекстОпроса) Тогда
		Элементы.ТекстОпроса.Заголовок = Форма.ТекстОпроса;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьРезультатОпроса()
	
	ОписаниеРезультата = МодульОбъекта().Новый_РезультатОпросаПользователя();
	ЗаполнитьЗначенияСвойств(ОписаниеРезультата, ЭтаФорма);
	
	МодульОбъекта().Метрика_РезультатОпросаПользователя(ОписаниеРезультата);
	
	Если ЗначениеЗаполнено(ИдентификаторОпроса) Тогда
		МодульОбъекта().ЗафиксироватьИдентификаторПройденногоОпроса(ОписаниеРезультата.ИдентификаторОпроса);
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти
