//	Copyright (C) 2012-2025 Engineer Mareev Enterprises
//	Модуль для КА 1.1 Экспортирует сообщения orders из документа Реализация товаров услуг
//	Экспортирует ORDERS c характеристиками или сериями товара. 

//	$Отгрузка товаров (неордерная схема) 
//  Экспорт сообщений ORDERS:
//	 - В 1С оператор (руч.) оформляет документ "Реализация товаров услуг", который при проведении (авт.) помечается к Экспорту.
//	 - 1С (авт.) экспортирует сообщение ORDERS.

#Область ПрограммныйИнтерфейс

// Процедура экспортирует один документ "Реализация товаров услуг"
Процедура Экспортировать(ERPData, Реализация) Экспорт
	
	АктуализироватьУИДыСтрок(Реализация.Ссылка);   
	
	//	Заголовок заказа
	EmeWmsERPEngine.AppendHeaderLine(ERPData);

	ERPData.header.order_id       	= Реализация.УникальныйИдентификатор();
	Если Константы.EmeWmsСоздаватьУникальныеСообщения.Получить() Тогда
		ERPData.header.id	  		= Новый УникальныйИдентификатор;
	Иначе
		ERPData.header.id	  		= ERPData.header.order_id;
	КонецЕсли;
	
	ERPData.header.order_no			= СокрЛП(Реализация.Номер)+"/"+Формат(Год(Реализация.Дата),"ЧГ=4");
	ERPData.header.order_date		= Реализация.Дата;
	
	ERPData.header.erp_doc_type	  	= ПолучитьМетаданные().Имя;
	ERPData.header.whs_code 	  	= EmeWmsУтилиты.ПолучитьКодСкладаEMEПоСсылке(Реализация.Склад, Реализация.Организация);  

	ERPData.header.vendor_code 		= EmeWmsУтилиты.ПолучитьКодОрганизацииEMEПоСсылке(Реализация.Организация);
	
	ГоловнойКонтрагент				= Реализация.Контрагент.ГоловнойКонтрагент;
	//Контрагент						= ?(ЗначениеЗаполнено(ГоловнойКонтрагент), ГоловнойКонтрагент, Реализация.Контрагент);
	
	ERPData.header.customer_id    	= Реализация.Контрагент.УникальныйИдентификатор();
	ERPData.header.customer_code  	= СокрЛП(Реализация.Контрагент.Код);
	ERPData.header.customer_name  	= Реализация.Контрагент.Наименование;
	
	СведенияОПокупателе 			= УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Реализация.Контрагент, Реализация.Дата);

	АдресКлиента 					= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе, "ФактическийАдрес");
	АдресДоставки					= УправлениеКонтактнойИнформацией.ПолучитьПредставлениеАдресаПоСтрока(Реализация.АдресДоставки);
	Если НЕ ЗначениеЗаполнено(АдресДоставки) Тогда
		АдресДоставки = АдресКлиента;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(АдресДоставки) Тогда
		АдресДоставки = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе, "ЮридическийАдрес");
	КонецЕсли;
	ERPData.header.customer_addr	= АдресКлиента;
	
	ERPData.header.delivery_id    	= Реализация.Контрагент.УникальныйИдентификатор();
	ERPData.header.delivery_code  	= СокрЛП(Реализация.Контрагент.Код);	
	ERPData.header.delivery_name  	= Реализация.Контрагент.Наименование;
	ERPData.header.delivery_addr  	= АдресДоставки;

	ERPData.header.despatch_date 	= Реализация.ДатаДоставки;
	Если Не ЗначениеЗаполнено(ERPData.header.despatch_date) Тогда
		ERPData.header.despatch_date = Реализация.Дата;
	КонецЕсли;
	
	//	Заполнение полей: время в DESPATCH_DATE, ROUTE_NO, PRIORITY
	Если ЗначениеЗаполнено(Реализация.ЗонаДоставки) Тогда
		ЗонаДоставки = Реализация.ЗонаДоставки; 
		Попытка
			ERPData.header.despatch_date = Дата(Формат(ERPData.header.despatch_date, "ДФ=ггггММдд")
												+ Формат(ЗонаДоставки.ВремяОтправления, "ДФ=ччммсс"));
		Исключение
		КонецПопытки;
		
		ERPData.header.route_no = ЗонаДоставки.Код;
		ERPData.header.priority = ЗонаДоставки.ПриоритетЗоныДоставки;
	КонецЕсли;
	
	//	Комментарий
	ERPData.header.comment        	= Лев(Реализация.Комментарий, 128);
																				  
	//	Экспорт контрагента
	EmeWmsЭкспортКонтрагентов.РазрешитьЭкспорт(Реализация.Контрагент);
	
	//	Использование серий в интеграции
	ИспользоватьСерии = Константы.EmeWmsИспользоватьСерии.Получить();	
	
	//	Строки заказа
	EmeWmsERPEngine.SelectChild(ERPData, "lines");
	Для Каждого СтрокаТовара Из Реализация.Товары Цикл
		Если Не ЗначениеЗаполнено(СтрокаТовара.Номенклатура)
			ИЛИ Не ЗначениеЗаполнено(СтрокаТовара.ЕдиницаИзмерения)
			ИЛИ СтрокаТовара.Количество = 0 Тогда
			
			Продолжить;
		КонецЕсли;
		
		РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТовара.Номенклатура, "БазоваяЕдиницаИзмерения, Код, 
																			|ВестиУчетПоСериям, ВестиУчетПоХарактеристикам");
		
		Если Не ЗначениеЗаполнено(РеквизитыНоменклатуры.БазоваяЕдиницаИзмерения) Тогда
			Продолжить;
		КонецЕсли;  
		
		EmeWmsERPEngine.AppendChildLine(ERPData);

		ERPData.lines.id			= СтрокаТовара.EmeWmsУИДСтроки;
		ERPData.lines.order_line_no	= СтрокаТовара.НомерСтроки;
		ERPData.lines.goods_id		= СтрокаТовара.Номенклатура.УникальныйИдентификатор();
		ERPData.lines.goods_code	= СокрЛП(РеквизитыНоменклатуры.Код);
		ERPData.lines.quantity		= EmeWmsУтилиты.ПересчетВДругуюЕдиницу(СтрокаТовара.Количество, 
															 			   СтрокаТовара.ЕдиницаИзмерения,
															 			   РеквизитыНоменклатуры.БазоваяЕдиницаИзмерения);
																		   
		Если ЗначениеЗаполнено(РеквизитыНоменклатуры.БазоваяЕдиницаИзмерения) Тогда
			ERPData.lines.mu_code = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыНоменклатуры.БазоваяЕдиницаИзмерения, "Код"); 
		КонецЕсли;															   
		
		// Серии или серийные номера
		Если Не ИспользоватьСерии Тогда
			РеквизитыНоменклатуры.ВестиУчетПоСериям = Ложь;
		КонецЕсли;
		
		Если РеквизитыНоменклатуры.ВестиУчетПоСериям Тогда // Серии
			Если НЕ СтрокаТовара.СерияНоменклатуры.Пустая() Тогда  
				РеквизитыСерии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТовара.СерияНоменклатуры, "Наименование,СрокГодности");
				
				// Когда Серия - это партия, укажем Серию из документа
				Если ЗначениеЗаполнено(РеквизитыСерии.Наименование) Тогда   
					ERPData.lines.lot_no = РеквизитыСерии.Наименование;      
					ERPData.lines.bbd	 = РеквизитыСерии.СрокГодности;  
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли РеквизитыНоменклатуры.ВестиУчетПоХарактеристикам Тогда // Характеристики
			Если НЕ СтрокаТовара.ХарактеристикаНоменклатуры.Пустая() Тогда
				ERPData.lines.lot_no 	 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовара.ХарактеристикаНоменклатуры, "Наименование");
			КонецЕсли;
		КонецЕсли;
		
		// Поставщик из строки табличной части Товары Заказа покупателя
		Если НЕ Реализация.Склад = Справочники.Склады.НайтиПоКоду("Т00000010") Тогда 
			
			ПоставщикСсылка = НайтиПоставщикаСтрокиРеализации(СтрокаТовара);
			Если ЗначениеЗаполнено(ПоставщикСсылка) Тогда
				ERPData.lines.supplier_id =	ПоставщикСсылка.УникальныйИдентификатор();
				Если Не EmeWmsЭкспортКонтрагентов.Экспортирован(ПоставщикСсылка) Тогда
					EmeWmsЭкспортКонтрагентов.ПометитьКЭкспорту(ПоставщикСсылка);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если СтрокаТовара.Номенклатура.ПометкаУдаления Тогда
			EmeWmsЭкспортНоменклатуры.ПометитьКЭкспортуБезусловно(СтрокаТовара.Номенклатура);
		ИначеЕсли НЕ EmeWmsЭкспортНоменклатуры.Экспортирован(СтрокаТовара.Номенклатура) Тогда
			EmeWmsЭкспортНоменклатуры.РазрешитьЭкспортСГруппами(СтрокаТовара.Номенклатура);
		КонецЕсли;
	КонецЦикла;		
	
КонецПроцедуры

#КонецОбласти

#Область ЭкспортныеСлужебныеПроцедурыИФункции

//	Процедура ОтменитьЭкспорт отменяет экспорт документа
Процедура ОтменитьЭкспорт(Документ) Экспорт

	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуРеализацийТоваровУслуг.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.РеализацияТоваровУслуг.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Ложь;
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
КонецПроцедуры

//	Функция ПолучитьИмяСообщения возвращает имя сообщения
Функция ПолучитьИмяСообщения() Экспорт
	Возврат "orders";
КонецФункции

//	Функция ПолучитьМетаданные возвращает метаданные сообщения
Функция ПолучитьМетаданные() Экспорт
	Возврат Метаданные.Документы.РеализацияТоваровУслуг;
КонецФункции

//	Функция ПолучитьВыборкуСсылок возвращает выборку ссылок документов для экспорта
Функция ПолучитьВыборкуСсылок() Экспорт
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	EmeWmsПометкиКЭкспортуРеализацийТоваровУслуг.РеализацияТоваровУслуг КАК Ссылка
		|ИЗ
		|	РегистрСведений.EmeWmsПометкиКЭкспортуРеализацийТоваровУслуг КАК EmeWmsПометкиКЭкспортуРеализацийТоваровУслуг
		|ГДЕ
		|	EmeWmsПометкиКЭкспортуРеализацийТоваровУслуг.КЭкспорту";
		
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции

//	Процедура ПометитьКЭкспорту помечает документ к экспорту.
Процедура ПометитьКЭкспорту(Документ) Экспорт

	Если Не РазрешенКЭкспорту(Документ) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуРеализацийТоваровУслуг.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.РеализацияТоваровУслуг.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Истина;
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsПометкиКЭкспортуРеализацийТоваровУслуг.СоздатьМенеджерЗаписи();
	НоваяЗапись.РеализацияТоваровУслуг = Документ.Ссылка;
	НоваяЗапись.КЭкспорту = Истина;
    НоваяЗапись.Записать();  
	
КонецПроцедуры

//	Функция ПомеченКЭкспорту возвращает Истина, если документ помечен к экспорту.
Функция ПомеченКЭкспорту(Документ) Экспорт
	
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуРеализацийТоваровУслуг.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.РеализацияТоваровУслуг.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Возврат Запись.КЭкспорту;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

//	Процедура ПодтвердитьЭкспорт подтверждает экспорт документа
Процедура ПодтвердитьЭкспорт(Документ) Экспорт
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуРеализацийТоваровУслуг.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.РеализацияТоваровУслуг.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Ложь;
		Запись.ДатаЭкспорта = ТекущаяДата();
		НаборЗаписей.Записать();
	КонецЦикла;
КонецПроцедуры

//	Процедура ПометитьКЭкспорту помечает документ на событии при записи
Процедура ПометитьКЭкспортуПриЗаписиРеализацииТоваровУслуг(Источник, Отказ) Экспорт
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//	Помечать, если включен режим пометок к экспорту
	Если Константы.EmeWmsПометкаВключена.Получить() Тогда
		ПометитьКЭкспорту(Источник);
	КонецЕсли;		 
КонецПроцедуры

//	Функция РазрешенКЭкспорту возвращает Истина, если документ РТУ разрешен к экспорту.
Функция РазрешенКЭкспорту(Документ) Экспорт

	ДатаЗапускаИнтеграции = Константы.EmeWmsДатаЗапускаИнтеграции.Получить();
	Если ЗначениеЗаполнено(ДатаЗапускаИнтеграции)
			И Документ.Дата < ДатаЗапускаИнтеграции Тогда
		ОтменитьЭкспорт(Документ);
		Возврат Ложь;
	КонецЕсли;	

	Если Документ.ПометкаУдаления Тогда
		ОтменитьЭкспорт(Документ);
		Возврат Ложь;
	КонецЕсли;

	Если Не Документ.Проведен Тогда
		ОтменитьЭкспорт(Документ);
		Возврат Ложь;
	КонецЕсли; 

	// Экспорт только когда склада-отправитель из EME.WMS (это может быть и группа складов)
	Если EmeWmsУтилиты.ПолучитьКодСкладаEMEПоСсылке(Документ.Склад, Документ.Организация) = неопределено Тогда 
		ОтменитьЭкспорт(Документ);
		Возврат Ложь;
	КонецЕсли;

	// Экспортируются только реализации без заказа
	Если Не ЗначениеЗаполнено(Документ.Сделка) Тогда
		ОтменитьЭкспорт(Документ);
		Возврат ложь;
	КонецЕсли;

	// Чтобы не было повторного экспорта despatch
	Если ДокументРеализацияТоваровУслугИмпортирован(Документ.Ссылка) Тогда
		// Это нужно, чтобы после импорта не пытались экспортироваться от события ПриЗаписи
		ОтменитьЭкспорт(Документ.Ссылка); 
		Возврат ложь;
	КонецЕсли;

	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область ЛокальныеСлужебныеПроцедурыИФункции

// Находит поставщика из заказа покупателя по строке реализации (связь строк по ключу)
Функция НайтиПоставщикаСтрокиРеализации(СтрокаРеализации)
	
	Если ЗначениеЗаполнено(СтрокаРеализации.ЗаказПокупателя) Тогда
		ЗаказПокупателя = СтрокаРеализации.ЗаказПокупателя.ПолучитьОбъект();   
		
		// Если заполнен ключ строки, поищем по нему.
		Если ЗначениеЗаполнено(СтрокаРеализации.КлючСтроки) Тогда
			СтрокаЗаказа = ЗаказПокупателя.Товары.Найти(СтрокаРеализации.КлючСтроки, "КлючСтроки");
		Иначе
		// Если пустой ключ строки, поищем по номенклатуре
			СтрокаЗаказа = ЗаказПокупателя.Товары.Найти(СтрокаРеализации.Номенклатура, "Номенклатура");
		КонецЕсли;
		
		Если СтрокаЗаказа <> Неопределено Тогда
			Если ЗначениеЗаполнено(СтрокаЗаказа.Поставщик) Тогда
				ГоловнойКонтрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаЗаказа.Поставщик, "ГоловнойКонтрагент");
				
				Если ЗначениеЗаполнено(ГоловнойКонтрагент) Тогда
					Возврат ГоловнойКонтрагент;
				Иначе
					Возврат СтрокаЗаказа.Поставщик;	
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;

	Возврат Неопределено;	
КонецФункции

// Проверяет, был ли этот документ импортирован (по сообщению despatch), в этом случае возвращает истина
Функция ДокументРеализацияТоваровУслугИмпортирован(ДокументСсылка)
	Перем НаборЗаписей;
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеРеализацийТоваровУслуг.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(ДокументСсылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Возврат истина;
	КонецЦикла;
	
	возврат ложь; 
КонецФункции

//	Создать новые УИДы строк и исправить дубли, если возникли (В ТЧ Товары по распоряжениям)
Процедура АктуализироватьУИДыСтрок(ДокументСсылка)  
	
	//	Проверим наличие строк к заполнению реквизита EmeWmsУИДСтроки, прежде чем получать Объект
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИСТИНА КАК ИзменятьEmeWmsУИДСтроки
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК ТЧТовары
		|ГДЕ
		|	ТЧТовары.Ссылка = &Ссылка
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(ТЧТовары.EmeWmsУИДСтроки) 
		|	<> КОЛИЧЕСТВО(РАЗЛИЧНЫЕ 
		|		ВЫБОР
		|			КОГДА ТЧТовары.EmeWmsУИДСтроки > """"
		|				ТОГДА ТЧТовары.EmeWmsУИДСтроки
		|			ИНАЧЕ NULL
		|		КОНЕЦ)";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	// Для исключения дублей УИД в строках ТЧ
	КлючиСтрок 					= Новый Соответствие;
	БылиСозданыИдентификаторы 	= Ложь;

	Документ = ДокументСсылка.ПолучитьОбъект();
	Для Каждого СтрокаТовара Из Документ.Товары Цикл 
		// Генерация специальных UID строк документа при выгрузке
		Если НЕ ЗначениеЗаполнено(СтрокаТовара.EmeWmsУИДСтроки) ИЛИ КлючиСтрок.Получить(СтрокаТовара.EmeWmsУИДСтроки) <> Неопределено Тогда
			СтрокаТовара.EmeWmsУИДСтроки = Новый УникальныйИдентификатор();
			БылиСозданыИдентификаторы 	 = Истина;
		КонецЕсли;
		КлючиСтрок.Вставить(СтрокаТовара.EmeWmsУИДСтроки, 0);
	КонецЦикла;	
	
	Если БылиСозданыИдентификаторы Тогда
		Если Не ЗначениеЗаполнено(Документ.EmeWmsСтатус) Тогда
			Документ.EmeWmsСтатус = "В работе";
		КонецЕсли;
		
		// При записи не перепроводить, не регистрировать по подписке к Эксопрту
		Документ.ОбменДанными.Загрузка = Истина;
		Документ.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

