// 	Copyright (C) 2012-2025 Engineer Mareev Enterprises
//	Модуль для УТ10.3 не ордерная схема

//	$Списание товаров (по инициативе 1C)
// 	Импорт сообщений OFFWRITE:
//	- Оператор EME.WMS (руч.) оформляет документ списания товаров, закрывает его.
//	- После закрытия документа списания EME.WMS (авт.) экспортирует сообщение OFFWRITE.
//	- 1C (авт.) импортирует сообщение OFFWRITE. 
// 	- 1C (авт.) Корректирует документ Списание товаров, проводит его.
//	- В комментарий документа записывается номер документа списания WMS.

#Область ПрограммныйИнтерфейс

//	Функция ПолучитьИмяСообщения возвращает имя сообщения
Функция ПолучитьИмяСообщения() Экспорт
	Возврат "offwrite";
КонецФункции

//	Функция ПолучитьМетаданные возвращает метаданные сообщения
Функция ПолучитьМетаданные() Экспорт
	Возврат Метаданные.Документы.СписаниеТоваров;
КонецФункции

// Импортирует сообщение Offwrite в документ Списание товаров
Процедура Импортировать(ERPData, Трассировка, ТемаСообщения) Экспорт
	
	// Списания по инициативе WMS здесь не обрабатываем
	Если ERPData.header.erp_doc_type <> ПолучитьМетаданные().Имя Тогда 
		Возврат;
	КонецЕсли;

	//	Идентификатор документа WMS
	ИдЕМЕ = ERPData.header.offwrite_id;
	// Номер документа EME для комментариев
	НомерЕМЕ = ERPData.header.offwrite_reg_no;
	
	// Получим Организацию по коду EME
	КодОрганизации = ERPData.header.vendor_code;
	ОрганизацияСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаОрганизациюПоКодуEME(КодОрганизации);
	Если ОрганизацияСсылка.Пустая() Тогда
		EmeWmsERPEngine.ErrorHeader(ERPData, "VNDBAD");
		Возврат;
	КонецЕсли;
	
	//	Получим склад-отправитель по коду EME
	КодСклада = ERPData.header.whs_code;
	СкладСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаСкладПоКодуEME(КодСклада,,КодОрганизации);
	Если СкладСсылка.Пустая() Тогда
		EmeWmsERPEngine.ErrorHeader(ERPData, "WHSBAD");
		Возврат;
	КонецЕсли;
	
	//	Ссылка на документ Списание товаров по идентификатору документа 1С
	СписаниеСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаСписаниеТоваров(ERPData.header.po_id);
	Если СписаниеСсылка.Пустая() Тогда
		EmeWmsERPEngine.ErrorHeader(ERPData, "POBAD"); // Ошибка отсутствия документа
		Возврат;
	КонецЕсли;
	
	//	Если были ошибки
	Если EmeWmsERPEngine.HasErrors(ERPData) Тогда
		Возврат;
	КонецЕсли;

	//	Соберем товары и количества
	КартаТоваровСписания = Новый Соответствие;
	ПолучитьКоличестваТоваров(ERPData, КартаТоваровСписания);

	//*** Проверки сделали, пишем в базу данных 1C ***
	Параметры = Новый Структура;
	Параметры.Вставить("ERPData", 					ERPData);    
	Параметры.Вставить("ИдЕМЕ", 					ИдЕМЕ);
	Параметры.Вставить("НомерЕМЕ", 					НомерЕМЕ);
	Параметры.Вставить("ОрганизацияСсылка", 		ОрганизацияСсылка);
	Параметры.Вставить("СкладСсылка", 				СкладСсылка);
	Параметры.Вставить("ПересчетТоваровСсылка", 	Неопределено);
	Параметры.Вставить("ИспользоватьОрдернуюСхему", Ложь);
	Параметры.Вставить("ИмпортироватьМаркиЧЗ", 		Константы.EmeWmsИмпортироватьМаркиЧЗ.Получить());
	Параметры.Вставить("КартаТоваровСписания", 		КартаТоваровСписания);
	Параметры.Вставить("СписаниеСсылка", 			СписаниеСсылка);
	
	СоздатьИзменитьДокументСписанияТоваров(Параметры);
	
	EmeWmsERPEngine.Success(ERPData);
КонецПроцедуры

#КонецОбласти

#Область ЛокальныеСлужебныеПроцедурыИФункции

//	Получить карту товаров списания из строк сообщения
// 	Карта товаров: ключ = UID товара + UID серии + UID характеристики, значение = количество в ед.хранения
Процедура ПолучитьКоличестваТоваров(ERPData, КартаТоваровСписания)	
	
	//	Использование серий в интеграции
	ИспользоватьСерии = Константы.EmeWmsИспользоватьСерии.Получить();	

	// Весь товар в сообщении
	EmeWmsERPEngine.SelectChild(ERPData, "lines");
	Пока EmeWmsERPEngine.NextChildLine(ERPData) Цикл
		
		Если ERPData.lines.quantity > 0.0 Тогда //	Выберем строки со спиcанием
			УИДТовара = ERPData.lines.goods_id;
			УИДЕдиницы = ERPData.lines.pack_id;
			Если УИДТовара = "" Тогда
				EmeWmsERPEngine.ErrorChild(ERPData, "GDSNUL");
				Продолжить
			КонецЕсли;
		
			ТоварСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаТовар(УИДТовара);
			Если ТоварСсылка.Пустая() Тогда
				EmeWmsERPEngine.ErrorChild(ERPData, "GDSBAD");
				Продолжить
			КонецЕсли;
		
			ЕдиницаИзмерения = EmeWmsУтилиты.ПолучитьСсылкуНаЕдиницуИзмерения(УИДЕдиницы);
			Если ЕдиницаИзмерения.Пустая() Тогда
				EmeWmsERPEngine.ErrorChild(ERPData, "PCKBAD");
				Продолжить
			КонецЕсли;
		
			РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТоварСсылка, "ВестиУчетПоСериям, ВестиУчетПоХарактеристикам"); 

			Если Не ИспользоватьСерии Тогда
				РеквизитыНоменклатуры.ВестиУчетПоСериям = Ложь;
			КонецЕсли;

			СерияНоменклатуры 		   	= Неопределено;
			ХарактеристикаНоменклатуры 	= Неопределено;
			
			Если РеквизитыНоменклатуры.ВестиУчетПоСериям Тогда   
				// Серии, если их нет при списании - создавать.
				СерияНоменклатуры = EmeWmsУтилиты.ПолучитьСериюПоНаименованию(ERPData.lines.lot_no, ТоварСсылка, Истина);
			ИначеЕсли РеквизитыНоменклатуры.ВестиУчетПоХарактеристикам Тогда
				ХарактеристикаНоменклатуры = EmeWmsУтилиты.ПолучитьХарактеристикуПоНаименованию(ERPData.lines.lot_no, ТоварСсылка);
			КонецЕсли;
			
			КодЗоны = ERPData.lines.zone_code;
			КлючТовара = EmeWmsУтилиты.СоздатьКлючТовара(ТоварСсылка, СерияНоменклатуры, ХарактеристикаНоменклатуры);
			БазоваяЕдиницаИзмерения = ?(ЗначениеЗаполнено(ТоварСсылка.ЕдиницаХраненияОстатков), ТоварСсылка.ЕдиницаХраненияОстатков, ТоварСсылка.БазоваяЕдиницаИзмерения);
			КоличествоВБазовой = EmeWmsУтилиты.ПересчетВДругуюЕдиницу(ERPData.lines.quantity, ЕдиницаИзмерения, БазоваяЕдиницаИзмерения);
			КоличествоПоКарте = ?(КартаТоваровСписания.Получить(КлючТовара) = неопределено, 0.0, КартаТоваровСписания.Получить(КлючТовара));
			КартаТоваровСписания.Вставить(КлючТовара, КоличествоПоКарте + КоличествоВБазовой);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//	Получить серию товара по номеру или создать новую
Функция ПолучитьСериюПоНомеру(СерийныйНомер, Товар, ВидНоменклатуры)
	Если НЕ ЗначениеЗаполнено(СерийныйНомер) Тогда
		Возврат Справочники.СерииНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	СерияСсылка = Справочники.СерииНоменклатуры.НайтиПоРеквизиту("Номер", СерийныйНомер,, ВидНоменклатуры);
	Если СерияСсылка.Пустая() Тогда
		Серия = Справочники.СерииНоменклатуры.СоздатьЭлемент();
		Серия.ВидНоменклатуры 	= ВидНоменклатуры;
		Серия.Наименование 		= СерийныйНомер;
		Серия.Номер 			= СерийныйНомер;
		Серия.Записать();
		СерияСсылка = Серия.Ссылка;
	КонецЕсли;
	
	Возврат СерияСсылка;
КонецФункции

#КонецОбласти 

#Область ПоискСсылокНаОбъектыПоКодуEME

//	Создать или изменить документ списания недостач товаров
Процедура СоздатьИзменитьДокументСписанияТоваров(Параметры)  
	
	Если Параметры.СписаниеСсылка.Пустая() Тогда
		Списание = Документы.СписаниеТоваров.СоздатьДокумент();
		Списание.Дата 			   = ТекущаяДата();
		Списание.Склад 			   = Параметры.СкладСсылка;
		Списание.Организация 	   = Параметры.ОрганизацияСсылка;
		Списание.Подразделение 	   = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.СкладСсылка, "Подразделение");
		Списание.Комментарий 	   = "Создан на основании документа списания EME: " +
			Параметры.НомерЕМЕ + " (" + Параметры.ERPData.header.comment + ")";
		Списание.ОтражатьВБухгалтерскомУчете = Истина;
		Списание.ОтражатьВУправленческомУчете = Истина;
		Списание.ВидОперации = Перечисления.ВидыОперацийСписаниеТоваров.ТоварыПродукция;  
		Списание.НДСвСтоимостиТоваров = Перечисления.ДействиеНДСВСтоимостиТоваров.НеИзменять;
		
		// Вид деятельности	
		//EmeWmsДрайвер.ЗаполнитьВидДеятельностиНДС(Списание);
	Иначе
		Списание = Параметры.СписаниеСсылка.ПолучитьОбъект();
		Списание.Комментарий = "Документ скорректирован на основании документа списания EME: " +
			Параметры.НомерЕМЕ + " (" + Параметры.ERPData.header.comment + ")";
	КонецЕсли;    
	
	EmeWmsУтилиты.СкорректироватьТабличнуюЧасть(Списание, Параметры.КартаТоваровСписания, Истина);	  
	EmeWmsДрайвер.ЗаполнитьСтатусыУказанияСерий(Списание, Документы.СписаниеТоваров);
	
	//	Валюта регламентированного учета
	мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	мВалютаУпрУчета    		= глЗначениеПеременной("ВалютаУправленческогоУчета");
	СтруктураКурса     		= МодульВалютногоУчета.ПолучитьКурсВалюты(мВалютаУпрУчета, Списание.Дата);
	мКурсУпрУчета      		= СтруктураКурса.Курс;
	мКратностьУпрУчета 		= СтруктураКурса.Кратность;
	мТекущийСтатусПартии 	= Перечисления.СтатусыПартийТоваров.Купленный;
	Качество 		   		= Справочники.Качество.Новый;
	СпособЗаполненияЦен 	= Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатуры;
	УчитыватьНДС 		    = Списание.ОтражатьВБухгалтерскомУчете;

	// 	Установим цены в документе по виду цены
	ТипЦен = Справочники.ТипыЦенНоменклатуры.НайтиПоНаименованию("Плановая цена"); 
	ВалютаЦены			 = ТипЦен.ВалютаЦены;
	ЦенаВключаетНДС		 = ТипЦен.ЦенаВключаетНДС;
	
	// Если есть цена и тип цен, но нет валюты, тогда в качестве валюты документа возьмем валюту регламентированного учета.
	ВалютаДокумента    = мВалютаРегламентированногоУчета;
	КурсДокумента      = 1;
	КратностьДокумента = 1;

	//	Рассчитываем реквизиты табличной части.
	Для каждого СтрокаТовара из Списание.Товары Цикл
		СтрокаТовара.Качество = Качество;

		Цена = Ценообразование.ПолучитьЦенуНоменклатуры(СтрокаТовара.Номенклатура, СтрокаТовара.ХарактеристикаНоменклатуры,
										ТипЦен, Списание.Дата, СтрокаТовара.ЕдиницаИзмерения,
										ВалютаДокумента, КурсДокумента, КратностьДокумента, , Неопределено, Неопределено);

		//	Пересчитаем цену в валюту документа.
		Цена = Ценообразование.ПересчитатьЦенуПриИзмененииВалюты(Цена, ВалютаЦены, мВалютаУпрУчета, мКурсУпрУчета, мКратностьУпрУчета, Списание.Дата);

		//	В документе цена со всеми налогами
		СуммаВключаетНДС = Истина;

		//	Получим ставки из справочника.
		СтавкаНДС = УчетНДС.ПолучитьСтавкуНДС(СтрокаТовара.Номенклатура.СтавкаНДС);

		СтрокаТовара.Цена = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(Цена,
		                                                 СпособЗаполненияЦен,
		                                                 ЦенаВключаетНДС,
		                                                 УчитыватьНДС,
		                                                 СуммаВключаетНДС,
		                                                 СтавкаНДС);

		// 	Отладка: Установим цена = 1 руб., при нулевой цене документ не проводится
		Если СтрокаТовара.Цена = 0 Тогда			
			СтрокаТовара.Цена = 1;			
		КонецЕсли;   
		
		//	Рассчитываем реквизиты табличной части.
		ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуМестТабЧасти(СтрокаТовара, Списание, Ложь);
		СтрокаТовара.Коэффициент = СтрокаТовара.ЕдиницаИзмерения.Коэффициент;
		
		ОбработкаТабличныхЧастей.ЗаполнитьПроцентРозничнойНаценкиТабЧасти(СтрокаТовара, Списание);
		ОбработкаТабличныхЧастей.РассчитатьРозничнуюЦенуТабЧасти(СтрокаТовара, Списание, мВалютаРегламентированногоУчета);
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТовара, Списание);
		
		СтрокаТовара.Сумма	   = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТовара.Сумма, мВалютаУпрУчета, 
													 мВалютаРегламентированногоУчета, мКурсУпрУчета, 1, мКратностьУпрУчета, 1);
								
		Если НЕ ЗначениеЗаполнено(СтрокаТовара.Качество) Тогда
			ОбработкаТабличныхЧастей.ЗаполнитьКачествоНоменклатурыТабЧасти(СтрокаТовара, Списание);
		КонецЕсли;
	КонецЦикла;	
	
	Списание.Записать(РежимЗаписиДокумента.Запись);  

	Если Параметры.ИмпортироватьМаркиЧЗ Тогда
		//	Добавляем марки в ТЧ ШтрихкодыУпаковок документа списание товаров
		ПараметрыМарок = Новый Структура;
		ПараметрыМарок.Вставить("ERPData",		Параметры.ERPData);
		ПараметрыМарок.Вставить("ЗаказОбъект",	Списание);
		ПолучитьТаблицуМарокСписанных(ПараметрыМарок);
		
		Списание.ШтрихкодыУпаковок.Очистить(); 
		ДобавитьМаркиВТЧШтрихкодыУпаковок(Списание.ШтрихкодыУпаковок, ПараметрыМарок.ТаблицаМарок);
		Списание.Записать(РежимЗаписиДокумента.Запись); 
	КонецЕсли;        	
	
	ОтменитьЭкспортСписанияТоваров(Списание.Ссылка);   
	
	СоздатьОтметкуОбИмпортеДокументаСписанияТоваров(Списание.Ссылка, Параметры.ИдЕМЕ);
	
	EmeWmsПроведениеДокументов.ПометитьДокументКПроведению(Списание.Ссылка);  
	
КонецПроцедуры

//	Создает в регистре отметку об импорте документа Списание товаров с номером EME
Процедура СоздатьОтметкуОбИмпортеДокументаСписанияТоваров(Документ, ИдЕМЕ)
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеСписанийТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.ДатаИмпорта = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsОтметкиОбИмпортеСписанийТоваров.СоздатьМенеджерЗаписи();
	НоваяЗапись.ID = ИдЕМЕ;
	НоваяЗапись.Ссылка = Документ.Ссылка;
	НоваяЗапись.ДатаИмпорта = ТекущаяДата();
    НоваяЗапись.Записать(); 
КонецПроцедуры  

//	Процедура ОтменитьЭкспорт отменяет экспорт документа.
Процедура ОтменитьЭкспортСписанияТоваров(Документ)
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуСписанийТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.СписаниеТоваров.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Ложь;
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
КонецПроцедуры
 
//	Найти ссылку на списание товаров по идентификатору импортированного документа EME
Функция НайтиДокументСписанияТоваров(ИдЕМЕ)
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	EmeWmsОтметкиСписаний.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрСведений.EmeWmsОтметкиОбИмпортеСписанийТоваров КАК EmeWmsОтметкиСписаний
		|ГДЕ
		|	EmeWmsОтметкиСписаний.ID = &ИдЕМЕ";
	Запрос.УстановитьПараметр("ИдЕМЕ", ИдЕМЕ);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Документы.СписаниеТоваров.ПустаяСсылка();
КонецФункции

#КонецОбласти

 #Область МаркиЧЗ 

//	Добавляет марки в ТЧ ШтрихкодыУпаковок документа
Процедура ДобавитьМаркиВТЧШтрихкодыУпаковок(ТЧШтрихкодыУпаковок, ТаблицаМарок)  
	
	Для Каждого СтрокаМарок Из ТаблицаМарок Цикл
		//	Штрихкод марки
		ШтрихкодУпаковки = НайтиСоздатьШтрихкодУпаковки(СтрокаМарок);
		
		//  Штрихкод упаковки
		Если ЗначениеЗаполнено(СтрокаМарок.ШтрихкодКороба) Тогда
			ШтрихкодУпаковки = НайтиСоздатьШтрихкодМонотоварнойУпаковки(СтрокаМарок, СтрокаМарок.ШтрихкодКороба, ШтрихкодУпаковки);
			
			//	Штрихкод паллеты
			Если ЗначениеЗаполнено(СтрокаМарок.ШтрихкодПаллеты) Тогда
				ШтрихкодУпаковки = НайтиСоздатьШтрихкодМонотоварнойУпаковки(СтрокаМарок, СтрокаМарок.ШтрихкодПаллеты, ШтрихкодУпаковки);				
			КонецЕсли;
		КонецЕсли;
		
		//	Поиск Штрихкода в Штрихкодах упаковки проверяемого документа
		Отбор = Новый Структура();
		Отбор.Вставить("ШтрихкодУпаковки", ШтрихкодУпаковки);
		
		МассивСтрок = ТЧШтрихкодыУпаковок.НайтиСтроки(Отбор);
		Если МассивСтрок.Количество() > 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		СтрокаШтрихкода = ТЧШтрихкодыУпаковок.Добавить();
		СтрокаШтрихкода.ШтрихкодУпаковки = ШтрихкодУпаковки;
	КонецЦикла;
	
КонецПроцедуры   

//	Находит или создает новую строку в справочнике ШтрикодыУпаковокТовара
Функция НайтиСоздатьШтрихкодМонотоварнойУпаковки(СтрокаМарок, ЗначениеШтрихкода, ВложенныйШтрихкод)
	
	Штрихкод = Справочники.ШтрихкодыУпаковокТоваров.НайтиПоРеквизиту("ЗначениеШтрихкода", ЗначениеШтрихкода);
	Если Штрихкод.Пустая() Тогда
		ШтрихкодОбъект = Справочники.ШтрихкодыУпаковокТоваров.СоздатьЭлемент();
		ШтрихкодОбъект.ЗначениеШтрихкода  = ЗначениеШтрихкода;
		ШтрихкодОбъект.ТипШтрихкода 	  = Перечисления.ТипыШтрихкодов.GS1_DataMatrix;
		ШтрихкодОбъект.ТипУпаковки 		  = Перечисления.ТипыУпаковок.МонотоварнаяУпаковка;
		ШтрихкодОбъект.Количество	   	  = 1;
		ШтрихкодОбъект.ДатаУпаковки 	  = ТекущаяДата();
	Иначе
		ШтрихкодОбъект = Штрихкод.ПолучитьОбъект();
		
		//	Поиск Штрихкода в Штрихкодах упаковки проверяемого документа
		Отбор = Новый Структура();
		Отбор.Вставить("Штрихкод", ВложенныйШтрихкод);
			
		МассивСтрок = ШтрихкодОбъект.ВложенныеШтрихкоды.НайтиСтроки(Отбор);
		Если МассивСтрок.Количество() > 0 Тогда 
			Возврат ШтрихкодОбъект.Ссылка;
		КонецЕсли;		
	КонецЕсли;
			
	НоваяСтрока = ШтрихкодОбъект.ВложенныеШтрихкоды.Добавить();
	НоваяСтрока.Штрихкод = ВложенныйШтрихкод;
	
	ШтрихкодОбъект.Записать();
	
	Возврат ШтрихкодОбъект.Ссылка;   	
	
КонецФункции

//	Находит или создает новую строку в справочнике ШтрикодыУпаковокТовара
Функция НайтиСоздатьШтрихкодУпаковки(СтрокаМарок)
	
	Штрихкод = Справочники.ШтрихкодыУпаковокТоваров.НайтиПоРеквизиту("ЗначениеШтрихкода", СтрокаМарок.ЗначениеШтрихкода);
	Если Не Штрихкод.Пустая() Тогда
		Возврат Штрихкод;
	КонецЕсли;
	
	Штрихкод = Справочники.ШтрихкодыУпаковокТоваров.СоздатьЭлемент(); 
	ЗаполнитьЗначенияСвойств(Штрихкод, СтрокаМарок, , "Количество");
	
	Штрихкод.ТипШтрихкода 	= Перечисления.ТипыШтрихкодов.GS1_DataMatrix;
	Штрихкод.ТипУпаковки 	= Перечисления.ТипыУпаковок.МаркированныйТовар;
	Штрихкод.Количество	    = 1;
	Штрихкод.ДатаУпаковки 	= ТекущаяДата();
	
	Штрихкод.Записать(); 
	
	Возврат Штрихкод.Ссылка;   	
	
КонецФункции

//  Получить таблицу марок
Процедура ПолучитьТаблицуМарокСписанных(Параметры)
	
	ERPData		 = Параметры.ERPData;
	ТаблицаМарок = РазметитьТаблицуМарок();
	НаименованияРеквизитов = "ВестиУчетПоСериям, ВестиУчетПоХарактеристикам";
	
	EmeWmsERPEngine.SelectChild(ERPData, "sscc");
	Пока EmeWmsERPEngine.NextChildLine(ERPData) Цикл  
		ТоварСсылка = EmeWmsУтилиты.ПолучитьСсылкуНаТовар(ERPData.sscc.goods_id);
		Если ТоварСсылка.Пустая() Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "GDSBAD");
			Продолжить
		КонецЕсли;            
		
		РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТоварСсылка, НаименованияРеквизитов);
		
		Если НЕ EmeWmsУтилиты.ПродукцияМаркируемаяДляГИСМ(ТоварСсылка) Тогда 
			Продолжить;
		КонецЕсли;
		
		СерияНоменклатуры 		   	= Неопределено;
		ХарактеристикаНоменклатуры 	= Неопределено;
		
		// Серия или Характеристика			
		Если РеквизитыНоменклатуры.ВестиУчетПоСериям Тогда   
			СерияНоменклатуры = EmeWmsУтилиты.ПолучитьСериюПоНомеру(ERPData.sscc.lot_no, ТоварСсылка);
		Иначе                  
			Если РеквизитыНоменклатуры.ВестиУчетПоХарактеристикам Тогда      
				ХарактеристикаНоменклатуры = EmeWmsУтилиты.ПолучитьХарактеристикуПоНаименованию(ERPData.sscc.lot_no, ТоварСсылка);
			КонецЕсли;                           
		КонецЕсли;                           
					
		КодМарки = ERPData.sscc.true_sign;
		Если ЗначениеЗаполнено(КодМарки) Тогда
			СтрокаМарки = ТаблицаМарок.Добавить();
			СтрокаМарки.Номенклатура 	  = ТоварСсылка;
			СтрокаМарки.Характеристика 	  = ХарактеристикаНоменклатуры;
			СтрокаМарки.Серия 			  = СерияНоменклатуры;
			СтрокаМарки.Упаковка 		  = EmeWmsУтилиты.ПолучитьБазовуюЕдиницуИзмерения(ТоварСсылка);
			СтрокаМарки.Количество		  = ERPData.sscc.quantity;
			СтрокаМарки.ЗначениеШтрихкода = EmeWmsУтилиты.КодМаркиВЗначениеСоСкобками(КодМарки);
			СтрокаМарки.ШтрихкодКороба	  = EmeWmsУтилиты.КодМаркиВЗначениеСоСкобками(ERPData.sscc.box_sscc);
			СтрокаМарки.ШтрихкодПаллеты   = EmeWmsУтилиты.КодМаркиВЗначениеСоСкобками(ERPData.sscc.pallet_sscc);			
		КонецЕсли;
	КонецЦикла;	
		
	Параметры.Вставить("ТаблицаМарок", ТаблицаМарок);

	// Тестирование Интеграции марок, подберем случайным образом необходиоме количество марок по Номенклатуре
	// ТестированиеИмпортаМарок(Параметры);
	
КонецПроцедуры

//	Создает таблицу для отгруженных марок ЧЗ из sscc сообщения despatch
Функция РазметитьТаблицуМарок()
	ТаблицаМарок = Новый ТаблицаЗначений;
	ТаблицаМарок.Колонки.Добавить("Номенклатура");
	ТаблицаМарок.Колонки.Добавить("Характеристика");
	ТаблицаМарок.Колонки.Добавить("Упаковка");
	ТаблицаМарок.Колонки.Добавить("Серия");
	ТаблицаМарок.Колонки.Добавить("Количество");
	ТаблицаМарок.Колонки.Добавить("ЗначениеШтрихкода");
	ТаблицаМарок.Колонки.Добавить("ШтрихкодКороба");
	ТаблицаМарок.Колонки.Добавить("ШтрихкодПаллеты");
	
	Возврат ТаблицаМарок;
КонецФункции

#КонецОбласти

#Область ТестированиеМарокЧЗ 

//	Сгенерировать штрихкоды упаковок
Процедура СгенерироватьШтрихкодыУпаковкок(Параметры)         
	
	ГСЧ = Новый ГенераторСлучайныхЧисел(День(ТекущаяДата())*84600 + Час(ТекущаяДата())*3600 + Минута(ТекущаяДата())*60 + Секунда(ТекущаяДата()));	
	
	//	Минимальное количество генерируемых марок
	Количество  = ?(Параметры.СтрокаТовара.Количество > 10, 10, Параметры.СтрокаТовара.Количество * Параметры.СтрокаТовара.Коэффициент);
		
	//	Значение штрихкода короба должно быть уникальным (15 попыток получить уникальный ШК)
	Для н = 1 По 15 Цикл
		ШККороба = СоздатьРандомныйШК(ГСЧ);				
		ШКСсылка = Справочники.ШтрихкодыУпаковокТоваров.НайтиПоРеквизиту("ЗначениеШтрихкода", ШККороба);
		
		Если НЕ ЗначениеЗаполнено(ШКСсылка) Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла; 

	
	Для МаркаПоТовару = 1 По Количество Цикл
		
		Если Не EmeWmsУтилиты.ПродукцияМаркируемаяДляГИСМ(Параметры.СтрокаТовара.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		//	Значение штрихкода должно быть уникальным (15 попыток получить уникальный ШК)
		Для н = 1 По 15 Цикл
			ШКМарки  = СоздатьРандомныйШК(ГСЧ);				
			ШКСсылка = Справочники.ШтрихкодыУпаковокТоваров.НайтиПоРеквизиту("ЗначениеШтрихкода", ШКМарки);
			
			Если НЕ ЗначениеЗаполнено(ШКСсылка) Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла; 
		
		Если ЗначениеЗаполнено(ШКСсылка) Тогда
			ТекстСообщения = НСтр("ru='Штрихкоды упаковок не заполнены, дублируются номера Штрихкода'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		Параметры.Вставить("ЗначениеШтрихкода", ШКМарки);
		
		//	Пераые три марки упакуем в короб
		Если МаркаПоТовару < 4 Тогда
			Параметры.Вставить("ШтрихкодКороба", ШККороба);
		Иначе
			Параметры.Вставить("ШтрихкодКороба", "");
		КонецЕсли;
		
		СоздатьНовыйШКВСправочнике(Параметры);		
		
	КонецЦикла;
	
	Параметры.Удалить("ЗначениеШтрихкода");
	Параметры.Удалить("ШтрихкодКороба");
		
КонецПроцедуры

//	Записать в справочник новый штрихкод упаковки
Процедура СоздатьНовыйШКВСправочнике(Параметры)
	
	НовыйЭлемент = Справочники.ШтрихкодыУпаковокТоваров.СоздатьЭлемент(); 

	ЗаполнитьЗначенияСвойств(НовыйЭлемент, Параметры.СтрокаТовара);
	
	Если ЗначениеЗаполнено(Параметры.СтрокаТовара.ЕдиницаИзмерения) Тогда
		НовыйЭлемент.Упаковка = Параметры.СтрокаТовара.ЕдиницаИзмерения;
	Иначе
		НовыйЭлемент.Упаковка = EmeWmsУтилиты.ПолучитьБазовуюЕдиницуИзмерения(Параметры.СтрокаТовара.Номенклатура);
	КонецЕсли;

	НовыйЭлемент.ЗначениеШтрихкода	= Параметры.ЗначениеШтрихкода;
	НовыйЭлемент.ТипШтрихкода		= Перечисления.ТипыШтрихкодов.GS1_DataMatrix;
	НовыйЭлемент.ТипУпаковки        = Перечисления.ТипыУпаковок.МаркированныйТовар;
	НовыйЭлемент.Количество			= 1;
	НовыйЭлемент.ДатаУпаковки 	 	= ТекущаяДата();
	НовыйЭлемент.Записать();	

	СтрокаМарки = Параметры.ТаблицаМарок.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаМарки, НовыйЭлемент);
	СтрокаМарки.ШтрихкодКороба = Параметры.ШтрихкодКороба; 
	
КонецПроцедуры

//	Сгенерировать случайный штрихкод
Функция СоздатьРандомныйШК(ГСЧ)
	
	СтрокаЦифр = "0123456789";
	СтрокаБукв = "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWYZ,-.!?%></;*'_+=()";
	
	// (01)04602443466045(21)P=uxqUQfzw'Ut
	СтрокаШК = "(01)";
	Для инд1 = 1 По 14 Цикл                         
		Позиция1 = ГСЧ.СлучайноеЧисло(1,10);
		СтрокаШК = СтрокаШК + Сред(СтрокаЦифр, Позиция1, 1);
	КонецЦикла;
	СтрокаШК = СтрокаШК + "(21)";
	Для инд1 = 1 По 13 Цикл
		Позиция1 = ГСЧ.СлучайноеЧисло(1, СтрДлина(СтрокаБукв));
		СтрокаШК = СтрокаШК + Сред(СтрокаБукв, Позиция1, 1);
	КонецЦикла; 
	
	Возврат СтрокаШК;
	
КонецФункции    

//	Тестирование Интеграции марок, подберем случайным образом необходиоме количество марок по Номенклатуре
Процедура ТестированиеИмпортаМарок(Параметры)
	
	Если ЗначениеЗаполнено(Параметры.ТаблицаМарок) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТовара Из Параметры.ЗаказОбъект.Товары Цикл
		Если Не EmeWmsУтилиты.ПродукцияМаркируемаяДляГИСМ(СтрокаТовара.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;  
		
		Если ЗначениеЗаполнено(СтрокаТовара.ЕдиницаИзмерения) Тогда
			Упаковка = СтрокаТовара.ЕдиницаИзмерения;
		Иначе
			Упаковка = EmeWmsУтилиты.ПолучитьБазовуюЕдиницуИзмерения(СтрокаТовара.Номенклатура);
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписаниеТоваровШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки
		|ПОМЕСТИТЬ ВТ_ШтрихкодыУпаковок
		|ИЗ
		|	Документ.СписаниеТоваров.ШтрихкодыУпаковок КАК СписаниеТоваровШтрихкодыУпаковок
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ШтрихкодУпаковки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ &КоличествоМарок
		|	ШтрихкодыУпаковокТоваров.Номенклатура КАК Номенклатура,
		|	ШтрихкодыУпаковокТоваров.Характеристика КАК Характеристика,
		|	ШтрихкодыУпаковокТоваров.Упаковка КАК Упаковка,
		|	ШтрихкодыУпаковокТоваров.Серия КАК Серия,
		|	ШтрихкодыУпаковокТоваров.Количество КАК Количество,
		|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода КАК ЗначениеШтрихкода
		|ИЗ
		|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ШтрихкодыУпаковок КАК ВТ_ШтрихкодыУпаковок
		|		ПО ШтрихкодыУпаковокТоваров.Ссылка = ВТ_ШтрихкодыУпаковок.ШтрихкодУпаковки
		|ГДЕ
		|	ВТ_ШтрихкодыУпаковок.ШтрихкодУпаковки ЕСТЬ NULL
		|	И НЕ ШтрихкодыУпаковокТоваров.ПометкаУдаления
		|	И ШтрихкодыУпаковокТоваров.Номенклатура = &Номенклатура
		|	И ШтрихкодыУпаковокТоваров.Характеристика = &Характеристика
		|	И ШтрихкодыУпаковокТоваров.Упаковка = &Упаковка
		|	И ШтрихкодыУпаковокТоваров.Серия = &Серия
		|	И ШтрихкодыУпаковокТоваров.ТипУпаковки = &ТипУпаковки
		|	И ШтрихкодыУпаковокТоваров.ТипШтрихкода = &ТипШтрихкода";
				
		КоличествоМарок = ?(СтрокаТовара.Количество > 10, 10, СтрокаТовара.Количество * СтрокаТовара.Коэффициент);                		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&КоличествоМарок", СтрЗаменить(Строка(КоличествоМарок), Символы.НПП, "")); 
		
		Запрос.УстановитьПараметр("Номенклатура", 	 СтрокаТовара.Номенклатура);
		Запрос.УстановитьПараметр("Характеристика",  СтрокаТовара.ХарактеристикаНоменклатуры);
		Запрос.УстановитьПараметр("Упаковка", 		 Упаковка);
		Запрос.УстановитьПараметр("Серия", 			 СтрокаТовара.СерияНоменклатуры);
		Запрос.УстановитьПараметр("ТипУпаковки", 	 Перечисления.ТипыУпаковок.МаркированныйТовар);
		Запрос.УстановитьПараметр("ТипШтрихкода", 	 Перечисления.ТипыШтрихкодов.GS1_DataMatrix);
	
		РезультатЗапроса = Запрос.Выполнить();   
		
		Если РезультатЗапроса.Пустой() Тогда         
			Параметры.Вставить("СтрокаТовара", СтрокаТовара);
			СгенерироватьШтрихкодыУпаковкок(Параметры);
			Продолжить;
		КонецЕсли;
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтрокаМарки = Параметры.ТаблицаМарок.Добавить();
            ЗаполнитьЗначенияСвойств(СтрокаМарки, ВыборкаДетальныеЗаписи);
		КонецЦикла;
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти



