
// #Область СлужебныеПеременныеИМетодыФормы

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		Результат = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		Результат = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

// #КонецОбласти // СлужебныеПеременныеИМетодыФормы

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьКонтекстФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	МодульКлиента().СохранитьИзмененияНаФорме("ЗаписатьИЗакрыть", ЭтаФорма, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

// #КонецОбласти // ОбработчикиСобытийФормы

// #Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура БлокиПриАктивизацииСтроки(Элемент)
	
	ТекСтрока = Элементы.Блоки.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДеталиБлокаУстановитьОтбор(ТекСтрока.КлючБлока);
	
КонецПроцедуры

// #КонецОбласти // ОбработчикиСобытийЭлементовФормы

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДеталиБлокаУстановитьФлажки(Команда)
	
	ТекСтрока = Элементы.Блоки.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиЭлементовБлока = ЭлементыБлока.НайтиСтроки(Новый Структура("КлючБлока", ТекСтрока.КлючБлока));
	УстановитьЗначенияФлажков(СтрокиЭлементовБлока, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеталиБлокаСнятьФлажки(Команда)
	
	ТекСтрока = Элементы.Блоки.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиЭлементовБлока = ЭлементыБлока.НайтиСтроки(Новый Структура("КлючБлока", ТекСтрока.КлючБлока));
	УстановитьЗначенияФлажков(СтрокиЭлементовБлока, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	Если Не ПроверитьЗаполнениеРеквизитов() Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		ЗаписатьНаСервере();
		Оповестить("КонтурМаркировка_ИзмененыНастройкиРабочегоСтола");
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

// #КонецОбласти // ОбработчикиКомандФормы

// #Область ПроверкиЗаполнения

&НаКлиенте
Функция ПроверитьЗаполнениеРеквизитов()
	
	ЕстьОшибки = Ложь;
	
	ПроверитьЗаполнениеТиповДокументовУчета(ЕстьОшибки);
	
	Возврат Не ЕстьОшибки;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьЗаполнениеТиповДокументовУчета(ЕстьОшибки)
	
	Если Не ЗначениеЗаполнено(ТипыДокументовУчета) Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьОшибки = Истина;
	Для Каждого Элемент Из ТипыДокументовУчета Цикл
		Если Элемент.Пометка Тогда
			ЕстьОшибки = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьОшибки Тогда
		ТекстОшибки = НСтр("ru = 'Не выбрано ни одного типа документа'");
		МодульКлиента().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор, "ТипыДокументовУчета");
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти // ПроверкиЗаполнения

// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьКонтекстФормы()
	
	ОписаниеНастроек = МодульОбъекта().НастройкиРабочегоСтола_Прочитать();
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ОписаниеНастроек);
	
	// Настройки блоков
	Для Каждого НастройкаБлока Из ОписаниеНастроек.БлокиРабочегоСтола Цикл
		
		КлючБлока = НастройкаБлока.Ключ;
		СодержаниеБлока = НастройкаБлока.Значение;
		
		СтрокаБлока = Блоки.Добавить();
		СтрокаБлока.КлючБлока = КлючБлока;
		ЗаполнитьЗначенияСвойств(СтрокаБлока, СодержаниеБлока);
		
		Для Каждого НастройкаЭлементаБлока Из СодержаниеБлока.ЭлементыБлока Цикл
			
			КлючЭлементаБлока = НастройкаЭлементаБлока.Ключ;
			СодержаниеЭлементаБлока = НастройкаЭлементаБлока.Значение;
			
			СтрокаДеталейБлока = ЭлементыБлока.Добавить();
			СтрокаДеталейБлока.КлючБлока = КлючБлока;
			СтрокаДеталейБлока.КлючЭлементаБлока = КлючЭлементаБлока;
			ЗаполнитьЗначенияСвойств(СтрокаДеталейБлока, СодержаниеЭлементаБлока);
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Настройки типов документов
	ЕстьОтборПоТипуДокумента = ЗначениеЗаполнено(ОписаниеНастроек.ТипыДокументов);
	Для Каждого НастройкаДокумента Из МодульОбъекта().ДействующиеНастройкиДокументовУчета() Цикл
		НоваяСтрока = ТипыДокументовУчета.Добавить(НастройкаДокумента.ТипДокумента, НастройкаДокумента.Наименование);
		Если ЕстьОтборПоТипуДокумента Тогда
			НоваяСтрока.Пометка = ОписаниеНастроек.ТипыДокументов.Найти(НастройкаДокумента.Ссылка) <> Неопределено;
		Иначе
			НоваяСтрока.Пометка = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	ОписаниеНастроек = ОписаниеНастроекПоКонтексту();
	МодульОбъекта().НастройкиРабочегоСтола_Записать(ОписаниеНастроек);
	Модифицированность = Ложь;
	
	Действие = МодульОбъекта().Перечисление_ДействияМетрики().ЗаписьВБазу;
	МодульОбъекта().Метрика_НастройкиРабочегоСтола(Действие);
	
КонецПроцедуры

&НаСервере
Функция ОписаниеНастроекПоКонтексту()
	
	Результат = МодульОбъекта().Новый_НастройкиРабочегоСтола();
	
	ЗаполнитьЗначенияСвойств(Результат, ЭтаФорма);
	ЗаполнитьЗначенияСвойств(Результат, Блоки);
	
	Для Каждого СтрокаБлока Из Блоки Цикл
		
		КлючБлока = СтрокаБлока.КлючБлока;
		НастройкаБлока = Результат.БлокиРабочегоСтола[КлючБлока];
		ЗаполнитьЗначенияСвойств(НастройкаБлока, СтрокаБлока);
		
		СтрокиЭлементов = ЭлементыБлока.НайтиСтроки(Новый Структура("КлючБлока", КлючБлока));
		Для Каждого СтрокаЭлементаБлока Из СтрокиЭлементов Цикл
			КлючЭлементаБлока = СтрокаЭлементаБлока.КлючЭлементаБлока;
			НастройкаЭлементаБлока = НастройкаБлока.ЭлементыБлока[КлючЭлементаБлока];
			ЗаполнитьЗначенияСвойств(НастройкаЭлементаБлока, СтрокаЭлементаБлока);
		КонецЦикла;
		
	КонецЦикла;
	
	Если ТипыДокументовУчета_ЕстьОтключенные() Тогда
		Для Каждого Элемент Из ТипыДокументовУчета Цикл
			Если Элемент.Пометка Тогда
				НастройкаДокумента = МодульОбъекта().НастройкиДокументовУчета_НайтиПоТипуДокумента(Элемент.Значение);
				Результат.ТипыДокументов.Добавить(НастройкаДокумента);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ТипыДокументовУчета_ЕстьОтключенные()
	
	Для Каждого Элемент Из ТипыДокументовУчета Цикл
		Если Не Элемент.Пометка Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ДеталиБлокаУстановитьОтбор(КлючБлока)
	
	Элементы.ДеталиБлока.ОтборСтрок = Новый ФиксированнаяСтруктура("КлючБлока", КлючБлока);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначенияФлажков(Строки, Значение)
	
	Для Каждого Стр Из Строки Цикл
		Стр.Видимость = Значение;
	КонецЦикла;
	
КонецПроцедуры

// #КонецОбласти // СлужебныеПроцедурыИФункции

