//	Copyright (C) 2012-2024 Engineer Mareev Enterprises
//	Модуль для ERP 2.5

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//	СООБЩЕНИЯ
	ТаблицаЗаголовковСообщений = Новый ТаблицаЗначений;
	ТаблицаЗаголовковСообщений.Колонки.Добавить("id");
	ТаблицаЗаголовковСообщений.Колонки.Добавить("what_to_do");
	ТаблицаЗаголовковСообщений.Колонки.Добавить("state");
	ТаблицаЗаголовковСообщений.Колонки.Добавить("created_at");
	ТаблицаЗаголовковСообщений.Колонки.Добавить("processed_at");
	ТаблицаЗаголовковСообщений.Колонки.Добавить("error_code");
	ТаблицаЗаголовковСообщений.Колонки.Добавить("total_childs");
	СоздатьТаблицуЗаголовковСообщений(ТаблицаЗаголовковСообщений);

	ТаблицаСтрокСообщения = Новый ТаблицаЗначений;
	ТаблицаСтрокСообщения.Колонки.Добавить("id");
	ТаблицаСтрокСообщения.Колонки.Добавить("header_id");
	ТаблицаСтрокСообщения.Колонки.Добавить("error_code");
	СоздатьТаблицуСтрокСообщения("childs", ТаблицаСтрокСообщения);
	
	//	НАСТРОЙКИ
	Настройки.EmeWmsПутьДоERPEngine = Константы.EmeWmsПутьДоERPEngine.Получить();
	Настройки.EmeWmsДатаЗапускаИнтеграции 				= Константы.EmeWmsДатаЗапускаИнтеграции.Получить();
	Настройки.EmeWmsУчетнаяЗаписьЭлектроннойПочты = Константы.EmeWmsУчетнаяЗаписьЭлектроннойПочты.Получить();
	Настройки.EmeWmsСписокРассылкиДиагностики = Константы.EmeWmsСписокРассылкиДиагностики.Получить();
	Настройки.EmeWmsСписокРассылкиДокументов = Константы.EmeWmsСписокРассылкиДокументов.Получить();
	Настройки.EmeWmsПользовательДляОповещений1 = Константы.EmeWmsПользовательДляОповещений1.Получить();
	Настройки.EmeWmsПользовательДляОповещений2 = Константы.EmeWmsПользовательДляОповещений2.Получить();
	Настройки.EmeWmsЭкспортироватьМаркиЧЗ = Константы.EmeWmsЭкспортироватьМаркиЧЗ.Получить();
	Настройки.EmeWmsОбменВключен = Константы.EmeWmsОбменВключен.Получить();
	Настройки.EmeWmsПометкаВключена = Константы.EmeWmsПометкаВключена.Получить();
	Настройки.EmeWmsИмпортироватьМаркиЧЗ = Константы.EmeWmsИмпортироватьМаркиЧЗ.Получить();
	Настройки.EmeWmsИспользоватьСерии = Константы.EmeWmsИспользоватьСерии.Получить();
	Настройки.EmeWmsФормироватьОрдераПриИнвентаризации = Константы.EmeWmsФормироватьОрдераПриИнвентаризации.Получить();
	Настройки.EmeWmsСоздаватьУникальныеСообщения = Константы.EmeWmsСоздаватьУникальныеСообщения.Получить();
	Настройки.EmeWmsЕдиницаИзмеренияДлины = Константы.EmeWmsЕдиницаИзмеренияДлины.Получить();
	Настройки.EmeWmsЕдиницаИзмеренияВеса = Константы.EmeWmsЕдиницаИзмеренияВеса.Получить();
	Настройки.EmeWmsЕдиницаИзмеренияОбъема = Константы.EmeWmsЕдиницаИзмеренияОбъема.Получить();
	ЭтаФорма.Элементы.СохранитьНастройки.Доступность = Ложь;
	ЭкспортОстатковНаДату = ТекущаяДата();
	
	//	УТИЛИТЫ
	СписокУтилитТаблица = Новый ТаблицаЗначений;
	EmeWmsУтилиты.ПолучитьСписокУтилит(СписокУтилитТаблица);
	СписокУтилит.Загрузить(СписокУтилитТаблица);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если ЭтаФорма.Элементы.СохранитьНастройки.Доступность Тогда
		Выбор = Вопрос("Сохранить настройки?", РежимДиалогаВопрос.ДаНетОтмена);
		Если Выбор = КодВозвратаДиалога.Да Тогда
			СохранитьВсеНастройки();
		ИначеЕсли Выбор = КодВозвратаДиалога.Отмена Тогда
			Отказ = Истина;
		КонецЕсли
	КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтруктуруСообщений(Команда)
	Текст = Новый ЧтениеТекста(Настройки.EmeWmsПутьДоERPEngine);

	СтрокаИсходная = ПолучитьСодержимоеФайлаНастроекНаСервере();
	Если Текст.ПрочитатьСтроку() <> СтрокаИсходная Тогда
		СтрокаНовая = Текст.Прочитать();
		УстановитьСтруктуруСообщенийНаСервере(СтрокаНовая);	
		СодержимоеФайлаНастроек = СтрокаНовая;
		ПоказатьПредупреждение(,НСтр("ru='Установлены настройки сообщений из файла'") + Настройки.EmeWmsПутьДоERPEngine);
		ЭтаФорма.Элементы.СохранитьНастройки.Доступность = Истина;
	Иначе
		ПоказатьПредупреждение(,НСтр("ru='Настройки сообщений не изменились.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСтруктуруСообщенийНаСервере(СтрокаНовая)
	EmeWmsУтилиты.СохранитьСодержимоеФайлаНастроек(СтрокаНовая);	
КонецПроцедуры

&НаСервере
Функция ПолучитьСодержимоеФайлаНастроекНаСервере()
	Возврат EmeWmsУтилиты.ПолучитьСодержимоеФайлаНастроек();	
КонецФункции

&НаКлиенте
Процедура СодержимоеФайлаНастроекНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СодержимоеФайлаНастроек);

	ПостроительDOM = Новый ПостроительDOM;
	ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);

	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку(Новый ПараметрыЗаписиXML(, , Истина, Истина));//содержится явное указание 1С отформатировать XML при записи

	ЗаписьDOM = Новый ЗаписьDOM;
	ЗаписьDOM.Записать(ДокументDOM, ЗаписьXML);
	ИсходныйТекстXML= ЗаписьXML.Закрыть();	
	
	ТекстовыйДокумент = новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(ИсходныйТекстXML);
	ТекстовыйДокумент.Показать("Файл настроек ERPEngine.xml");
	// Вставить содержимое обработчика.
КонецПроцедуры

//	СООБЩЕНИЯ

//	Команда "Обновить"
&НаСервере
Процедура ОбновитьДеревоСообщенийНаСервере()
	
	//	Получим статистику по сообщениям
	СтатистикаСообщений = Новый ТаблицаЗначений;
	
	ERPData = Новый Структура;
	EmeWmsERPEngine.Create(ERPData);
	
	// #IBS 01.03.2024 Получить текст файла из регистра настроек
	ERPData.ERPEngine = EmeWmsУтилиты.ПолучитьСодержимоеФайлаНастроек();
	Если ERPData.ERPEngine = Неопределено Или ERPData.ERPEngine = "" Тогда
		Возврат;
	КонецЕсли;
	
	Ошибка = EmeWmsERPEngine.Connect(ERPData);
	Если Ошибка <> "" Тогда
		Сообщить(Ошибка);
		Возврат;
	КонецЕсли;
	
	EmeWmsERPEngine.GetStatistics(ERPData, СтатистикаСообщений);
	EmeWmsERPEngine.Disconnect(ERPData);
	
	//	Заполняем дерево сообщений
	ВсеСообщения = ДеревоСообщений.ПолучитьЭлементы();
	ВсеСообщения.Очистить();
	
	ВеткаОткудаКуда = ВсеСообщения.Добавить();
	ВеткаОткудаКуда.Сообщение = "Сообщения 1C->EME";
	ВеткаОткудаКуда.Картинка = Новый Картинка(РеквизитФормыВЗначение("Объект").ПолучитьМакет("Картинка1С"));
	ДобавитьТипыСообщений(ВеткаОткудаКуда, "erp", "wms", СтатистикаСообщений);
	
	ВеткаОткудаКуда = ВсеСообщения.Добавить();
	ВеткаОткудаКуда.Сообщение = "Сообщения EME->1C";
	ВеткаОткудаКуда.Картинка = Новый Картинка(РеквизитФормыВЗначение("Объект").ПолучитьМакет("КартинкаEME"));
	ДобавитьТипыСообщений(ВеткаОткудаКуда, "wms", "erp", СтатистикаСообщений);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДеревоСообщений(Команда)
	Состояние("Обновляем дерево сообщений...");
	ОбновитьДеревоСообщенийНаСервере();
	РаскрытьДеревоСообщений();
КонецПроцедуры

//	Команда "Экспортировать"
&НаСервере
Процедура ЭкспортироватьВсеСообщенияНаСервере()
	EmeWmsЭкспорт.Экспортировать();
КонецПроцедуры

&НаКлиенте
Процедура ЭкспортироватьВсеСообщения(Команда)
	Состояние("Экспортируем сообщения...");
	ЭкспортироватьВсеСообщенияНаСервере();
	ОбновитьДеревоСообщенийНаСервере();
	РаскрытьДеревоСообщений();
КонецПроцедуры

//	Команда "Импортировать"
&НаСервереБезКонтекста
Процедура ИмпортироватьВсеСообщенияНаСервере()
	EmeWmsИмпорт.Импортировать();
КонецПроцедуры

&НаКлиенте
Процедура ИмпортироватьВсеСообщения(Команда)
	Состояние("Импортируем сообщения...");
	ИмпортироватьВсеСообщенияНаСервере();
	ОбновитьДеревоСообщенийНаСервере();
	РаскрытьДеревоСообщений();
КонецПроцедуры

//	Команда "Откатить"
&НаСервере
Процедура ОткатитьВыделенныеСообщенияНаСервере(ВыделенныеСтроки)
	
	ИдентификаторыСообщений = Новый Массив;
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		ИдентификаторыСообщений.Добавить(ЭтаФорма.ЗаголовкиСообщений.НайтиПоИдентификатору(ВыделеннаяСтрока).id);
	КонецЦикла;
	
	ERPData = Новый Структура;
	EmeWmsERPEngine.Create(ERPData);
	
	// #IBS 01.03.2024 Получить текст файла из регистра настроек
	ERPData.ERPEngine = EmeWmsУтилиты.ПолучитьСодержимоеФайлаНастроек();
	Если ERPData.ERPEngine = Неопределено Или ERPData.ERPEngine = "" Тогда
		Возврат;
	КонецЕсли;
	
	Ошибка = EmeWmsERPEngine.Connect(ERPData);
	Если Ошибка <> "" Тогда
		Сообщить(Ошибка);
		Возврат;
	КонецЕсли;
	
	Ошибка = EmeWmsERPEngine.UndoImport(ERPData, СообщениеОткуда, СообщениеКуда, СообщениеИмя, ИдентификаторыСообщений);
	EmeWmsERPEngine.Disconnect(ERPData);
	
	Если Ошибка <> "" Тогда
		Сообщить(Ошибка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткатитьВыделенныеСообщения(Команда) 
	
	ВыделенныеСтроки = ЭтаФорма.Элементы.ЗаголовкиСообщений.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Вопрос(НСтр("ru = 'Откатить выделенные сообщения " + СообщениеИмя + " (" 
	                           + ВыделенныеСтроки.Количество() + "шт) на статус Новые?'"), 
			РежимДиалогаВопрос.ДаНетОтмена) = КодВозвратаДиалога.Да Тогда
			
		ОткатитьВыделенныеСообщенияНаСервере(ВыделенныеСтроки);
	КонецЕсли;
КонецПроцедуры

//	Команда "Удалить"
&НаСервере
Процедура УдалитьВыделенныеСообщенияНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВыделенныеСообщения(Команда)
	УдалитьВыделенныеСообщенияНаСервере();
КонецПроцедуры

//	Команда "Выгрузить"
&НаСервере
Процедура ВыгрузитьВыделенныеСообщенияНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВыделенныеСообщения(Команда)
	ВыгрузитьВыделенныеСообщенияНаСервере();
КонецПроцедуры

//	Команда "Загрузить"
&НаСервере
Процедура ЗагрузитьСообщенияНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСообщения(Команда)
	ЗагрузитьСообщенияНаСервере();
КонецПроцедуры

//	Оформление формы
&НаСервере
Процедура ОформитьФорму()
	
	ЖирныйШрифт = Новый Шрифт(,,Истина);

	ЭтаФорма.УсловноеОформление.Элементы.Очистить();
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоСообщений");
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоСообщений.Имя");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = СообщениеИмя;
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоСообщений.Откуда");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = СообщениеОткуда;
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоСообщений.Куда");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = СообщениеКуда;
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоСообщений.Статус");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = СообщениеСтатус;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", ЖирныйШрифт);	
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЗаголовкиСообщений");
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЗаголовкиСообщений.id");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = СообщениеИдентификатор;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", ЖирныйШрифт);	
	
КонецПроцедуры

//	Дерево сообщений
&НаСервере
Процедура ДобавитьТипыСообщений(ВеткаОткудаКуда, Откуда, Куда, СтатистикаСообщений)
	
	СообщенияНовые = ВеткаОткудаКуда.ПолучитьЭлементы().Добавить();
	СообщенияНовые.Сообщение = "Новые";
	ДобавитьСообщения(СообщенияНовые, Откуда, Куда, "NEW", СтатистикаСообщений, "КартинкаНовые");
	
	СообщенияВОжидании = ВеткаОткудаКуда.ПолучитьЭлементы().Добавить();
	СообщенияВОжидании.Сообщение = "В ожидании";
	ДобавитьСообщения(СообщенияВОжидании, Откуда, Куда, "WRN", СтатистикаСообщений, "КартинкаНовые");
	
	СообщенияСОшибками = ВеткаОткудаКуда.ПолучитьЭлементы().Добавить();
	СообщенияСОшибками.Сообщение = "С ошибками";
	ДобавитьСообщения(СообщенияСОшибками, Откуда, Куда, "ERR", СтатистикаСообщений, "КартинкаСОшибками");
	
	СообщенияОбработанные = ВеткаОткудаКуда.ПолучитьЭлементы().Добавить();
	СообщенияОбработанные.Сообщение = "Обработанные";
	ДобавитьСообщения(СообщенияОбработанные, Откуда, Куда, "OK", СтатистикаСообщений, "КартинкаОбработанные");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСообщения(ТипСообщения, Откуда, Куда, Статус, СтатистикаСообщений, ИмяКартинки)
	
	ТипСообщения.Картинка = Новый Картинка(РеквизитФормыВЗначение("Объект").ПолучитьМакет("КартинкаПапка"));
	Для Каждого СтатистикаСообщения Из СтатистикаСообщений Цикл
		Если Откуда = СтатистикаСообщения.Source И
			Куда = СтатистикаСообщения.Target И
			Статус = СтатистикаСообщения.State Тогда
			
			Сообщение = ТипСообщения.ПолучитьЭлементы().Добавить();
			Сообщение.Сообщение = СтатистикаСообщения.Name + " (" + СтатистикаСообщения.Count + ")";
			Сообщение.Откуда = Откуда;
			Сообщение.Куда = Куда;
			Сообщение.Имя = СтатистикаСообщения.Name;
			Сообщение.Статус = Статус;
			Сообщение.Картинка = Новый Картинка(РеквизитФормыВЗначение("Объект").ПолучитьМакет(ИмяКартинки));
			
		КонецЕсли
	КонецЦикла
	
КонецПроцедуры

&НаКлиенте
Процедура РаскрытьДеревоСообщений()
	ВеткиОткудаКуда = ДеревоСообщений.ПолучитьЭлементы();
	Для Каждого ВеткаОткудаКуда Из ВеткиОткудаКуда Цикл
		ЭтаФорма.Элементы.ДеревоСообщений.Развернуть(ВеткаОткудаКуда.ПолучитьИдентификатор(),Истина);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ДеревоСообщенийВыборНаСервере()
	
	//	Получим заголовки сообщений
	ТаблицаЗаголовковСообщений = Новый ТаблицаЗначений;
	
	ERPData = Новый Структура;
	EmeWmsERPEngine.Create(ERPData);
	
	//ERPData.Config = Настройки.EmeWmsПутьДоERPEngine;
	//Если ERPData.Config = Неопределено Или ERPData.Config = "" Тогда
	//	Возврат
	//КонецЕсли;
	// #IBS 01.03.2024 Получить текст файла из регистра настроек
	ERPData.ERPEngine = EmeWmsУтилиты.ПолучитьСодержимоеФайлаНастроек();
	Если ERPData.ERPEngine = Неопределено Или ERPData.ERPEngine = "" Тогда
		Возврат;
	КонецЕсли;
	
	Ошибка = EmeWmsERPEngine.Connect(ERPData);
	Если Ошибка <> "" Тогда
		Сообщить(Ошибка);
		Возврат;
	КонецЕсли;
	
	EmeWmsERPEngine.GetHeaders(ERPData, СообщениеОткуда, СообщениеКуда, СообщениеИмя, СообщениеСтатус, ТаблицаЗаголовковСообщений);
	EmeWmsERPEngine.Disconnect(ERPData);
	
	СоздатьТаблицуЗаголовковСообщений(ТаблицаЗаголовковСообщений);
	СоздатьТаблицыСтрокСообщений(ТаблицаЗаголовковСообщений[0]);
	
	ОформитьФорму();

КонецПроцедуры

&НаКлиенте
Процедура ДеревоСообщенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Состояние("Обновляем заголовки сообщений...");
	Сообщение = ДеревоСообщений.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если Сообщение.Имя <> "" Тогда
		СообщениеОткуда = Сообщение.Откуда;
		СообщениеКуда = Сообщение.Куда;
		СообщениеИмя = Сообщение.Имя;
		СообщениеСтатус = Сообщение.Статус;
		ДеревоСообщенийВыборНаСервере();
	КонецЕсли
КонецПроцедуры

//	Таблица заголовков сообщений
&НаСервере
Процедура СоздатьТаблицуЗаголовковСообщений(ТаблицаЗаголовковСообщений)
	
	МассивТипаТЗ = Новый Массив;
	МассивТипаТЗ.Добавить(Тип("ТаблицаЗначений"));
	ОписаниеТипаТЗ = Новый ОписаниеТипов(МассивТипаТЗ);
	
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ЗаголовкиСообщений", ОписаниеТипаТЗ));
	
	Для Каждого Колонка Из ТаблицаЗаголовковСообщений.Колонки Цикл
		МассивРеквизитов.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "ЗаголовкиСообщений"));
	КонецЦикла;
	
	МассивРеквизитовДляУдаления = Новый Массив();
	Для Каждого РеквизитФормы Из ЭтаФорма.ПолучитьРеквизиты() Цикл
		Если РеквизитФормы.Имя = "ЗаголовкиСообщений" Тогда
			МассивРеквизитовДляУдаления.Добавить(РеквизитФормы.Имя);
			Прервать
		КонецЕсли
	КонецЦикла;
	
	ИзменитьРеквизиты(МассивРеквизитов, МассивРеквизитовДляУдаления);

	Пока Элементы.ГруппаЗаголовковСообщений.ПодчиненныеЭлементы.Количество() <> 0 Цикл
		Для Каждого ЭлементГруппы Из Элементы.ГруппаЗаголовковСообщений.ПодчиненныеЭлементы Цикл
			Элементы.Удалить(ЭлементГруппы);
		КонецЦикла;
	КонецЦикла;

	ТаблицаФормыЗаголовковСообщений = Элементы.Добавить("ЗаголовкиСообщений", Тип("ТаблицаФормы"), Элементы.ГруппаЗаголовковСообщений);
	ТаблицаФормыЗаголовковСообщений.ПутьКДанным = "ЗаголовкиСообщений";
	ТаблицаФормыЗаголовковСообщений.Отображение = ОтображениеТаблицы.Список;
	ТаблицаФормыЗаголовковСообщений.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	ТаблицаФормыЗаголовковСообщений.ТолькоПросмотр = Истина;
	ТаблицаФормыЗаголовковСообщений.УстановитьДействие("Выбор", "ЗаголовкиСообщенийВыбор");

	Для Каждого Колонка Из ТаблицаЗаголовковСообщений.Колонки Цикл
		НовыйЭлемент = Элементы.Добавить("header_" + Колонка.Имя, Тип("ПолеФормы"), ТаблицаФормыЗаголовковСообщений);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "ЗаголовкиСообщений." + Колонка.Имя;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ТаблицаЗаголовковСообщений, "ЗаголовкиСообщений");
	
КонецПроцедуры

&НаСервере
Процедура ЗаголовкиСообщенийВыборНаСервере(ВыбраннаяСтрока)
	Сообщение = ЭтаФорма.ЗаголовкиСообщений.НайтиПоИдентификатору(ВыбраннаяСтрока);
	СоздатьТаблицыСтрокСообщений(Сообщение);
	ОформитьФорму();
КонецПроцедуры

&НаКлиенте
Процедура ЗаголовкиСообщенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Состояние("Обновляем строки сообщения...");
	ЗаголовкиСообщенийВыборНаСервере(ВыбраннаяСтрока);
КонецПроцедуры

//	Таблицы строк сообщения
&НаСервере
Процедура СоздатьТаблицуСтрокСообщения(ИмяДочернейТаблицы, ТаблицаСтрокСообщения)
	
	СтраницаСтрокСообщения = Элементы.Добавить("Страница_" + ИмяДочернейТаблицы, Тип("ГруппаФормы"), Элементы.ГруппаСтрокСообщения);
 	СтраницаСтрокСообщения.Вид = ВидГруппыФормы.Страница;
   	СтраницаСтрокСообщения.Заголовок = ИмяДочернейТаблицы;
	
	МассивТипаТЗ = Новый Массив;
	МассивТипаТЗ.Добавить(Тип("ТаблицаЗначений"));
	ОписаниеТипаТЗ = Новый ОписаниеТипов(МассивТипаТЗ);
	
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить(Новый РеквизитФормы("СтрокиСообщения_" + ИмяДочернейТаблицы, ОписаниеТипаТЗ));
	
	Для Каждого Колонка Из ТаблицаСтрокСообщения.Колонки Цикл
		МассивРеквизитов.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "СтрокиСообщения_" + ИмяДочернейТаблицы));
	КонецЦикла;
	
	ИзменитьРеквизиты(МассивРеквизитов);
	
	ТаблицаФормыСтрокСообщения = Элементы.Добавить("Таблица_" + ИмяДочернейТаблицы, Тип("ТаблицаФормы"), СтраницаСтрокСообщения);
	ТаблицаФормыСтрокСообщения.ПутьКДанным = "СтрокиСообщения_" + ИмяДочернейТаблицы;
	ТаблицаФормыСтрокСообщения.Отображение = ОтображениеТаблицы.Список;
	ТаблицаФормыСтрокСообщения.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	ТаблицаФормыСтрокСообщения.ТолькоПросмотр = Истина;
	Для Каждого Колонка Из ТаблицаСтрокСообщения.Колонки Цикл
		НовыйЭлемент = Элементы.Добавить(ИмяДочернейТаблицы + "_" + Колонка.Имя, Тип("ПолеФормы"), ТаблицаФормыСтрокСообщения);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "СтрокиСообщения_" + ИмяДочернейТаблицы + "." + Колонка.Имя;
	КонецЦикла;

	ЗначениеВРеквизитФормы(ТаблицаСтрокСообщения, "СтрокиСообщения_" + ИмяДочернейТаблицы);

КонецПроцедуры

&НаСервере
Процедура СоздатьТаблицыСтрокСообщений(Сообщение)

	СообщениеИдентификатор = Сообщение.id;
	
	МассивИменДочернихТаблиц = Новый Массив;
	ERPData = Новый Структура;
	EmeWmsERPEngine.Create(ERPData);
	
	//ERPData.Config = Настройки.EmeWmsПутьДоERPEngine;
	//Если ERPData.Config = Неопределено Или ERPData.Config = "" Тогда
	//	Возврат
	//КонецЕсли;
	// #IBS 01.03.2024 Получить текст файла из регистра настроек
	ERPData.ERPEngine = EmeWmsУтилиты.ПолучитьСодержимоеФайлаНастроек();
	Если ERPData.ERPEngine = Неопределено Или ERPData.ERPEngine = "" Тогда
		Возврат;
	КонецЕсли;
	
	Ошибка = EmeWmsERPEngine.Connect(ERPData);
	Если Ошибка <> "" Тогда
		Сообщить(Ошибка);
		Возврат;
	КонецЕсли;
	
	EmeWmsERPEngine.GetChilds(ERPData, СообщениеОткуда, СообщениеКуда, СообщениеИмя, МассивИменДочернихТаблиц);
	
	Пока Элементы.ГруппаСтрокСообщения.ПодчиненныеЭлементы.Количество() <> 0 Цикл
		Для Каждого ЭлементГруппы Из Элементы.ГруппаСтрокСообщения.ПодчиненныеЭлементы Цикл
			Элементы.Удалить(ЭлементГруппы);
		КонецЦикла;
	КонецЦикла;
	
	МассивРеквизитовДляУдаления = Новый Массив();
	Для Каждого РеквизитФормы Из ЭтаФорма.ПолучитьРеквизиты() Цикл
		Если Найти(РеквизитФормы.Имя, "СтрокиСообщения_") > 0 Тогда
			МассивРеквизитовДляУдаления.Добавить(РеквизитФормы.Имя);
		КонецЕсли
	КонецЦикла;
	ИзменитьРеквизиты(, МассивРеквизитовДляУдаления);
	
	Для Каждого ИмяДочернейТаблицы Из МассивИменДочернихТаблиц Цикл
		
		ТаблицаСтрокСообщения = Новый ТаблицаЗначений;
		EmeWmsERPEngine.GetChildLines(ERPData, СообщениеОткуда, СообщениеКуда, СообщениеИмя, ИмяДочернейТаблицы, СообщениеИдентификатор, ТаблицаСтрокСообщения);
		
		СоздатьТаблицуСтрокСообщения(ИмяДочернейТаблицы, ТаблицаСтрокСообщения);

	КонецЦикла;
	
	EmeWmsERPEngine.Disconnect(ERPData);
	
КонецПроцедуры

//	НАСТРОЙКИ
&НаСервере
Процедура СохранитьВсеНастройки()
	Константы.EmeWmsПутьДоERPEngine.Установить(Настройки.EmeWmsПутьДоERPEngine);
	Константы.EmeWmsДатаЗапускаИнтеграции.Установить(Настройки.EmeWmsДатаЗапускаИнтеграции);
	Константы.EmeWmsУчетнаяЗаписьЭлектроннойПочты.Установить(Настройки.EmeWmsУчетнаяЗаписьЭлектроннойПочты);
	Константы.EmeWmsСписокРассылкиДиагностики.Установить(Настройки.EmeWmsСписокРассылкиДиагностики);
	Константы.EmeWmsСписокРассылкиДокументов.Установить(Настройки.EmeWmsСписокРассылкиДокументов);
	Константы.EmeWmsПользовательДляОповещений1.Установить(Настройки.EmeWmsПользовательДляОповещений1);
	Константы.EmeWmsПользовательДляОповещений2.Установить(Настройки.EmeWmsПользовательДляОповещений2);
	Константы.EmeWmsЭкспортироватьМаркиЧЗ.Установить(Настройки.EmeWmsЭкспортироватьМаркиЧЗ);
	Константы.EmeWmsИмпортироватьМаркиЧЗ.Установить(Настройки.EmeWmsИмпортироватьМаркиЧЗ);
	Константы.EmeWmsИспользоватьСерии.Установить(Настройки.EmeWmsИспользоватьСерии);
	Константы.EmeWmsОбменВключен.Установить(Настройки.EmeWmsОбменВключен);
	Константы.EmeWmsПометкаВключена.Установить(Настройки.EmeWmsПометкаВключена);
	Константы.EmeWmsФормироватьОрдераПриИнвентаризации.Установить(Настройки.EmeWmsФормироватьОрдераПриИнвентаризации);
	Константы.EmeWmsСоздаватьУникальныеСообщения.Установить(Настройки.EmeWmsСоздаватьУникальныеСообщения);
	Константы.EmeWmsЕдиницаИзмеренияДлины.Установить(Настройки.EmeWmsЕдиницаИзмеренияДлины);
	Константы.EmeWmsЕдиницаИзмеренияВеса.Установить(Настройки.EmeWmsЕдиницаИзмеренияВеса);
	Константы.EmeWmsЕдиницаИзмеренияОбъема.Установить(Настройки.EmeWmsЕдиницаИзмеренияОбъема);	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	СохранитьВсеНастройки();
	ЭтаФорма.Элементы.СохранитьНастройки.Доступность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПутьДоERPEngineНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// Создать новый диалог для открытия файлов.
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	// Какие типы файлов будут предложены для выбора.
	ДиалогВыбораФайла.Фильтр = "Описатель (ERPEngine.xml)|ERPEngine.xml";
	ДиалогВыбораФайла.Заголовок = "Выберите файл";                                         
	
	// В диалоге будет открыт предварительный просмотр файлов
	ДиалогВыбораФайла.ПредварительныйПросмотр = Истина;
	
	// При открытии диалога сначала для выбора будут предложены файлы
	// первого типа, из типов, перечисленных в свойстве "Фильтр".
	ДиалогВыбораФайла.ИндексФильтра = 0;
	
	Если Настройки.EmeWmsПутьДоERPEngine <> "" Тогда
		ДиалогВыбораФайла.ПолноеИмяФайла = Настройки.EmeWmsПутьДоERPEngine;
	КонецЕсли;

	// Открыть диалог выбора файла.
	Если ДиалогВыбораФайла.Выбрать() Тогда
		// Действия, выполняемые тогда, когда файл выбран.
		Если Настройки.EmeWmsПутьДоERPEngine <> ДиалогВыбораФайла.ПолноеИмяФайла Тогда
	   		Настройки.EmeWmsПутьДоERPEngine = ДиалогВыбораФайла.ПолноеИмяФайла;
			ЭтаФорма.Элементы.СохранитьНастройки.Доступность = Истина;
		КонецЕсли
   	КонецЕсли;
   
КонецПроцедуры

&НаКлиенте
Процедура ПутьДоERPEngineИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ЭтаФорма.Элементы.СохранитьНастройки.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура УчетнаяЗаписьЭлектроннойПочтыПриИзменении(Элемент)
	ЭтаФорма.Элементы.СохранитьНастройки.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокРассылкиДиагностикиИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ЭтаФорма.Элементы.СохранитьНастройки.Доступность = Истина;
КонецПроцедуры

//	УТИЛИТЫ
&НаСервере
Процедура ВыполнитьУтилитуНаСервере(ИмяУтилиты)
	Выполнить("EmeWmsУтилиты." + ИмяУтилиты + "()");
КонецПроцедуры

&НаКлиенте
Процедура СписокУтилитВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 

	ПараметрыВопроса = Новый Структура;
	ПараметрыВопроса.Вставить("Команда", "ВыполнитьУтилиту");
	ПараметрыВопроса.Вставить("ИмяУтилиты", СписокУтилит.НайтиПоИдентификатору(ВыбраннаяСтрока).Утилита);
	
	Если Вопрос(НСтр("ru = 'Выполнить утилиту " + ПараметрыВопроса.ИмяУтилиты + "?'"), 
			РежимДиалогаВопрос.ДаНетОтмена) = КодВозвратаДиалога.Да Тогда
		ВыполнитьУтилитуНаСервере(ПараметрыВопроса.ИмяУтилиты);			
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	Перем Команда;
	
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
	
	Если НЕ Параметры.Свойство("Команда", Команда) Тогда
		Возврат;
	КонецЕсли;
	
	Если 	  Команда = "ВыполнитьУтилиту" Тогда
		
		ВыполнитьУтилитуНаСервере(Параметры.ИмяУтилиты); 

		//Состояние(НСтр("ru = 'Выполняется утилита... '"), , Параметры.ИмяУтилиты, БиблиотекаКартинок.ДлительнаяОперация48);
		//НастроитьПараметрыПодключенияАвтоматически(Параметры.ИмяУтилиты);	
		
	ИначеЕсли Команда = "ОткатитьВыделенныеСообщения" Тогда
		
		ВыделенныеСтроки = ЭтаФорма.Элементы.ЗаголовкиСообщений.ВыделенныеСтроки;
		
		Состояние("Экспортируем сообщения...");
		ОткатитьВыделенныеСообщенияНаСервере(ВыделенныеСтроки);
		ОбновитьДеревоСообщенийНаСервере();
		РаскрытьДеревоСообщений();
		
	КонецЕсли;

КонецПроцедуры

//	ОСТАТКИ
&НаСервереБезКонтекста
Процедура ЭкспортироватьОстаткиНаДатуВSQLНаСервере(ДатаВыгрузки)
	EmeWmsЭкспортОстатковТоваров.ЭкспортОстатковНаДатуВSQL(ДатаВыгрузки);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИмяФайлаОстатков(Дата)
	Возврат "erp_wms_remains." + EmeWmsЭкспортОстатковТоваров.ПолучитьИдентификаторСообщения(Дата) + ".xml";
КонецФункции

&НаСервереБезКонтекста
Функция ЭкспортироватьОстаткиНаДатуВXMLНаСервере(ДатаВыгрузки)
	Возврат EmeWmsЭкспортОстатковТоваров.ЭкспортОстатковНаДатуВXML(ДатаВыгрузки);
КонецФункции

&НаКлиенте
Процедура ЭкспортироватьОстаткиТоваров(Команда)
	Если ЭкспортОстатковВXMLФайл Тогда
		
		// Создать новый диалог для открытия файлов.
		ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		
		// Какие типы файлов будут предложены для выбора.
		ДиалогВыбораФайла.Фильтр = "Сообщения (*.xml)|*.xml";
		ДиалогВыбораФайла.Заголовок = "Сохранить в файл";                                         
		
		ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Истина;
		
		ДиалогВыбораФайла.ПолноеИмяФайла = ПолучитьИмяФайлаОстатков(ЭкспортОстатковНаДату);
		
		// Открыть диалог выбора файла.
		Если ДиалогВыбораФайла.Выбрать() Тогда
			// Действия, выполняемые тогда, когда файл выбран.
			Файл = Новый ЗаписьТекста(ДиалогВыбораФайла.ПолноеИмяФайла, КодировкаТекста.ANSI);
			Файл.ЗаписатьСтроку(ЭкспортироватьОстаткиНаДатуВXMLНаСервере(ЭкспортОстатковНаДату));
			Файл.Закрыть();
		КонецЕсли;
		
	Иначе
		ЭкспортироватьОстаткиНаДатуВSQLНаСервере(ЭкспортОстатковНаДату);
	КонецЕсли
		
КонецПроцедуры

// IBS 31.03.2021 Редактировать регистр маппинга складов
&НаКлиенте
Процедура ОтобразитьМаппингСкладов(Команда)
	Форма = ПолучитьФорму("РегистрСведений.EmeWmsМаппингСкладов.ФормаСписка");
	Форма.Открыть();
	ЭтаФорма.Элементы.СохранитьНастройки.Доступность = Истина;
КонецПроцедуры

// IBS 31.03.2021 Редактировать регистр маппинга организаций
&НаКлиенте
Процедура ОтобразитьМаппингОрганизаций(Команда)
	Форма = ПолучитьФорму("РегистрСведений.EmeWmsМаппингОрганизаций.ФормаСписка");
	Форма.Открыть();
	ЭтаФорма.Элементы.СохранитьНастройки.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокРассылкиДокументовПриИзменении(Элемент)
	ЭтаФорма.Элементы.СохранитьНастройки.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПользовательДляОповещений1ПриИзменении(Элемент)
	ЭтаФорма.Элементы.СохранитьНастройки.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПользовательДляОповещений2ПриИзменении(Элемент)
	ЭтаФорма.Элементы.СохранитьНастройки.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокРассылкиДиагностикиПриИзменении(Элемент)
	ЭтаФорма.Элементы.СохранитьНастройки.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЭкспортироватьМаркиЧЗВЗаказНаОтгрузкуПриИзменении(Элемент)
	ЭтаФорма.Элементы.СохранитьНастройки.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ИмпортироватьМаркиЧЗПриИзменении(Элемент)
	ЭтаФорма.Элементы.СохранитьНастройки.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьСерииПриИзменении(Элемент)
	ЭтаФорма.Элементы.СохранитьНастройки.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ФормироватьОрдераПриИнвентаризацииПриИзменении(Элемент)
	ЭтаФорма.Элементы.СохранитьНастройки.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЭкспортироватьОстаткиВCSVФайл(Команда) 
	
	ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение); 
	ДиалогСохраненияФайла.ПолноеИмяФайла 	 = "ОстаткиТоваровВЯчейках_" + Формат(ТекущаяДата(), "ДФ=""дд-ММ-гг""") + ".txt";
	ДиалогСохраненияФайла.Фильтр 			 = "Текст(*.txt)|*.txt"; 
	ДиалогСохраненияФайла.МножественныйВыбор = Ложь; 
	ДиалогСохраненияФайла.Заголовок 		 = НСтр("ru='Выберите файл'"); 
	
	Если НЕ ДиалогСохраненияФайла.Выбрать() Тогда 
		Возврат;
	КонецЕсли;  
	
	ПутьКФайлу = ДиалогСохраненияФайла.ПолноеИмяФайла; 
	ТекстовыйДокумент = EmeWmsУтилиты.ОстаткиВЯчейках(ЭкспортОстатковНаДату);
	ТекстовыйДокумент.Записать(ПутьКФайлу);   
	
КонецПроцедуры


&НаСервере
// #IBS 12.10.2023 Экспорт марок ЧЗ в текстовый файл
Функция ПолучитьМаркиЧЗНаСервере() 
	Возврат EmeWmsУтилиты.ПолучитьМаркиЧЗТоваров();
КонецФункции

&НаКлиенте
// #IBS 12.10.2023 Экспорт марок ЧЗ в текстовый файл
Процедура ЭкспортироватьМаркиЧЗ(Команда) 
	ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение); 
	ДиалогСохраненияФайла.ПолноеИмяФайла = "СписокМарокЧЗ_" + Формат(ТекущаяДата(), "ДФ=""дд-ММ-гг""") + ".txt";
	Фильтр = "Текст(*.txt)|*.txt";                 
	ДиалогСохраненияФайла.Фильтр = Фильтр; 
	ДиалогСохраненияФайла.МножественныйВыбор = Ложь; 
	ДиалогСохраненияФайла.Заголовок = "Выберите файл"; 
	Если НЕ ДиалогСохраненияФайла.Выбрать() Тогда 
		Возврат;
	КонецЕсли;  
	
	ПутьКФайлу = ДиалогСохраненияФайла.ПолноеИмяФайла; 
	ТекстовыйДокумент = ПолучитьМаркиЧЗНаСервере();
	ТекстовыйДокумент.Записать(ПутьКФайлу);   
КонецПроцедуры

&НаСервере
// #IBS 14.10.2023 Экспорт характеристик товаров в текстовый файл
Функция ПолучитьХарактеристикиНаСервере() 
	Возврат EmeWmsУтилиты.ПолучитьХарактеристикиТоваров();
КонецФункции

&НаКлиенте
Процедура ЭкспортироватьХарактеристики(Команда)
	ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение); 
	ДиалогСохраненияФайла.ПолноеИмяФайла = "СписокХарактеристикТоваров_" + Формат(ТекущаяДата(), "ДФ=""дд-ММ-гг""") + ".txt";
	Фильтр = "Текст(*.txt)|*.txt";                 
	ДиалогСохраненияФайла.Фильтр = Фильтр; 
	ДиалогСохраненияФайла.МножественныйВыбор = Ложь; 
	ДиалогСохраненияФайла.Заголовок = "Выберите файл"; 
	Если НЕ ДиалогСохраненияФайла.Выбрать() Тогда 
		Возврат;
	КонецЕсли;  
	
	ПутьКФайлу = ДиалогСохраненияФайла.ПолноеИмяФайла; 
	ТекстовыйДокумент = ПолучитьХарактеристикиНаСервере();
	ТекстовыйДокумент.Записать(ПутьКФайлу);   
КонецПроцедуры

&НаКлиенте
Процедура ОбменВключенПриИзменении(Элемент)
	ЭтаФорма.Элементы.СохранитьНастройки.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПометкаКЭкспортуВключенаПриИзменении(Элемент)
	ЭтаФорма.Элементы.СохранитьНастройки.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмеренияДлиныПриИзменении(Элемент)
	ЭтаФорма.Элементы.СохранитьНастройки.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмеренияВесаПриИзменении(Элемент)
	ЭтаФорма.Элементы.СохранитьНастройки.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмеренияОбъемаПриИзменении(Элемент)
	ЭтаФорма.Элементы.СохранитьНастройки.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПутьДоERPEngineПриИзменении(Элемент)
	ЭтаФорма.Элементы.СохранитьНастройки.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура EmeWmsДатаЗапускаИнтеграцииПриИзменении(Элемент)
	ЭтаФорма.Элементы.СохранитьНастройки.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СоздаватьУникальныеСообщенияПриИзменении(Элемент)
	ЭтаФорма.Элементы.СохранитьНастройки.Доступность = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ПометитьВсеГруппыКЭкспорту(Команда)
	Если Вопрос("Пометить все группы номенклатур к экспорту ?", РежимДиалогаВопрос.ДаНетОтмена) = КодВозвратаДиалога.Да Тогда
		ПометитьВсеГруппыКЭкспортуНаСервере();
	КонецЕсли;
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПометитьВсеГруппыКЭкспортуНаСервере()
	EmeWmsУтилиты.ПометитьВсюНоменклатуруКЭкспорту();
КонецПроцедуры

