// Copyright (C) 2012-2025 Engineer Mareev Enterprises
// Модуль для ERP 2.5

//	Функция ПутьДоERPEngine возвщает путь до файла ERPEngin.xml
Функция ПутьДоERPEngine() Экспорт
	
	Возврат Константы.EmeWmsПутьДоERPEngine.Получить();
		
КонецФункции

// Для получения данных ERPEngine.xml из регистра  
Функция ПолучитьСодержимоеФайлаНастроек() Экспорт
	//НаборЗаписей = РегистрыСведений.EmeWmsERPEngine.СоздатьНаборЗаписей();
	//НаборЗаписей.Прочитать();
	//Для Каждого Запись Из НаборЗаписей Цикл
	//	Возврат Запись.СодержимоеФайлаНастроек;
	//КонецЦикла;
	
	//Возврат "";
	Возврат Константы.EmeWmsERPEngine.Получить();
КонецФункции 

// Для сохранения данных ERPEngine.xml в регистр   
Процедура СохранитьСодержимоеФайлаНастроек(СодержимоеФайлаНастроек) Экспорт
	Константы.EmeWmsERPEngine.Установить(СодержимоеФайлаНастроек);
	
	//НаборЗаписей = РегистрыСведений.EmeWmsERPEngine.СоздатьНаборЗаписей();
	//НаборЗаписей.Прочитать();
	//Для Каждого Запись Из НаборЗаписей Цикл
	//	Запись.СодержимоеФайлаНастроек = СодержимоеФайлаНастроек;
	//	НаборЗаписей.Записать();
	//	Возврат;
	//КонецЦикла;

	//НоваяЗапись = РегистрыСведений.EmeWmsERPEngine.СоздатьМенеджерЗаписи();
	//НоваяЗапись.Измерение1 = "";
	//НоваяЗапись.СодержимоеФайлаНастроек = СодержимоеФайлаНастроек;
	//НоваяЗапись.Записать();
КонецПроцедуры
	
//	Функция ПолучитьКод возвращает код объекта справочника. 
Функция ПолучитьКод(ОбъектСправочника) Экспорт
	
	Возврат СокрЛП(ОбъектСправочника.Код);
	
КонецФункции

//	Функция ПолучитьБазовуюЕдиницуИзмерения возращает базовую единицу измерения номенклатуры
Функция ПолучитьБазовуюЕдиницуИзмерения(Знач Номенклатура) Экспорт
	
	Выборка = Справочники.ЕдиницыИзмерения.Выбрать(,Номенклатура);
	Пока Выборка.Следующий() Цикл
		Если Выборка.ПометкаУдаления Тогда
			Продолжить
		КонецЕсли;
		Если Выборка.ЕдиницаПоКлассификатору = Номенклатура.БазоваяЕдиницаИзмерения И Выборка.Коэффициент = 1 Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли
	КонецЦикла;
	
	Выборка = Справочники.ЕдиницыИзмерения.Выбрать(,Номенклатура);
	Пока Выборка.Следующий() Цикл
		Если Выборка.ПометкаУдаления Тогда
			Продолжить
		КонецЕсли;
		Если Выборка.Коэффициент = 1 Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли
	КонецЦикла;
	
	Возврат Справочники.ЕдиницыИзмерения.ПустаяСсылка();
	
КонецФункции

//	Функция ПолучитьСсылкуНаТовар возращает ссылку на товар по его УИД
Функция ПолучитьСсылкуНаТовар(СтрокаУИДТовара) Экспорт
	
	Попытка
		УИД = Новый УникальныйИдентификатор(СтрокаУИДТовара);
		Ссылка = Справочники.Номенклатура.ПолучитьСсылку(УИД);
		Если Ссылка.ПолучитьОбъект() = Неопределено Тогда
			Возврат Справочники.Номенклатура.ПустаяСсылка();
		Иначе
			Возврат Ссылка;
		КонецЕсли
	Исключение
		Возврат Справочники.Номенклатура.ПустаяСсылка();
	КонецПопытки
	
КонецФункции

//	Функция ПолучитьСсылкуНаЕдиницуИзмерения возращает ссылку на единицу измерения по ее УИД
Функция ПолучитьСсылкуНаЕдиницуИзмерения(Знач СтрокаУИДЕдиницыИзмерения) Экспорт
	
	Попытка
		УИД = Новый УникальныйИдентификатор(СтрокаУИДЕдиницыИзмерения);
		Ссылка = Справочники.ЕдиницыИзмерения.ПолучитьСсылку(УИД);
		Если Ссылка.ПолучитьОбъект() = Неопределено Тогда
			Возврат Справочники.ЕдиницыИзмерения.ПустаяСсылка();
		Иначе
			Возврат Ссылка;
		КонецЕсли
	Исключение
		Возврат Справочники.ЕдиницыИзмерения.ПустаяСсылка();
	КонецПопытки
	
КонецФункции

//	Функция НоменклатураРазрешенаКОбмену возвращает истину, если номенклатура учитывается на складах: товар, тара или комплект
Функция НоменклатураРазрешенаКОбмену(Номенклатура) Экспорт
	Если Номенклатура = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Номенклатура.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ВидНоменклатуры");
	ТипНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидНоменклатуры, "ТипНоменклатуры");
	Если ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар	ИЛИ
		ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Комплект ИЛИ
		ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Набор Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат ложь
КонецФункции

//	Фукнция ПолучитьГТД возвращает ссылку на ГТД, при необходимости создает её
Функция ПолучитьГТД(НомерГТД) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НомераГТД.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.НомераГТД КАК НомераГТД
		|ГДЕ
		|	НомераГТД.Код = &НомерГТД И
		|	НЕ НомераГТД.ПометкаУдаления";
	Запрос.УстановитьПараметр("НомерГТД", НомерГТД);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;

	ГТД = Справочники.НомераГТД.СоздатьЭлемент();
	ГТД.Код = НомерГТД;
	ГТД.Записать();
	
	Возврат ГТД.Ссылка;
	
КонецФункции

//	Фукнция ПолучитьСтрану возвращает ссылку на страну
Функция ПолучитьСтрану(КодСтраны) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Страна.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КлассификаторСтранМира КАК Страна
		|ГДЕ
		|	Страна.Код = &КодСтраны И
		|	НЕ Страна.ПометкаУдаления";
	Запрос.УстановитьПараметр("КодСтраны", КодСтраны);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Справочники.КлассификаторСтранМира.ПустаяСсылка();
	
КонецФункции

//	Фукнция ПолучитьСерию возвращает ссылку на серию, при необходимости создает её
Функция ПолучитьСерию(ТоварСсылка, ГТДСсылка, СтранаСсылка) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Серия.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СерииНоменклатуры КАК Серия
		|ГДЕ
		|	Серия.Владелец = &ТоварСсылка И
		|	Серия.НомерГТД = &ГТДСсылка И
		|	НЕ Серия.ПометкаУдаления";
	Запрос.УстановитьПараметр("ТоварСсылка", ТоварСсылка);
	Запрос.УстановитьПараметр("ГТДСсылка", ГТДСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;

	Серия = Справочники.СерииНоменклатуры.СоздатьЭлемент();
	Серия.Владелец = ТоварСсылка;
	Серия.НомерГТД = ГТДСсылка;
	Серия.СтранаПроисхождения = СтранаСсылка;
	Серия.Записать();
	Серия.Наименование = Серия.СформироватьНаименование();
	Серия.Записать();
	
	Возврат Серия.Ссылка;
	
КонецФункции

// Получить ссылку на серию номенклатур по номеру серии
Функция ПолучитьСсылкуНаСериюНоменклатурПоНомеру(НомерСерии, НоменклатураСсылка) Экспорт
	Если НЕ НоменклатураСсылка.ВестиСерийныеНомера Тогда
		Возврат Справочники.СерииНоменклатуры.ПустаяСсылка();
	Иначе
		Возврат Справочники.СерииНоменклатуры.НайтиПоРеквизиту("Номер", Лев(НомерСерии,15),,НоменклатураСсылка);
	КонецЕсли;
КонецФункции

//	Функция ПолучитьСсылкуНаОрганизацию возращает ссылку на организацию
Функция ПолучитьСсылкуНаОрганизацию() Экспорт
	//Возврат Справочники.Организации.НайтиПоНаименованию("ИП Дубов Борис Львович");
	Возврат справочники.Организации.ОрганизацияПоУмолчанию().Ссылка;
	
КонецФункции

//	Функция ПолучитьСсылкуНаОрганизациюПоКодуEME возращает ссылку на организацию
Функция ПолучитьСсылкуНаОрганизациюПоКодуEME(КодОрганизации) Экспорт
	Перем Запрос, Выборка;
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Организации.Организация КАК Ссылка
		|ИЗ
		|	РегистрСведений.EmeWmsМаппингОрганизаций КАК Организации
		|ГДЕ
		|	Организации.КодОрганизацииEME = &КодОрганизации";
	Запрос.УстановитьПараметр("КодОрганизации", КодОрганизации);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.Организации.ПустаяСсылка();
КонецФункции

//	Функция возращает ссылку на организацию по УИД
Функция ПолучитьСсылкуНаОрганизациюПоСтрокеУИД(СтрокаУИДОрганизации) Экспорт
	
	Попытка
		УИД = Новый УникальныйИдентификатор(СтрокаУИДОрганизации);
		Ссылка = Справочники.Организации.ПолучитьСсылку(УИД);
		Если Ссылка.ПолучитьОбъект() = Неопределено Тогда
			Возврат Справочники.Организации.ПустаяСсылка();
		Иначе
			Возврат Ссылка;
		КонецЕсли
	Исключение
		Возврат Справочники.Организации.ПустаяСсылка();
	КонецПопытки
	
КонецФункции

//	Функция возращает код основной организации
Функция ПолучитьКодEMEОсновнойОрганизации() Экспорт
	ОснОрг = справочники.Организации.ОрганизацияПоУмолчанию().Ссылка;
	Возврат ПолучитьКодОрганизацииEMEПоСсылке(ОснОрг);
	
КонецФункции

//	Функция ПолучитьСсылкуНаКонтрагента возращает ссылку на контрагента
Функция ПолучитьСсылкуНаКонтрагента(СтрокаУИДКонтрагента) Экспорт
	
	Попытка
		УИД = Новый УникальныйИдентификатор(СтрокаУИДКонтрагента);
		Ссылка = Справочники.Контрагенты.ПолучитьСсылку(УИД);
		Если Ссылка.ПолучитьОбъект() = Неопределено Тогда
			Возврат Справочники.Контрагенты.ПустаяСсылка();
		Иначе
			Возврат Ссылка;
		КонецЕсли
	Исключение
		Возврат Справочники.Контрагенты.ПустаяСсылка();
	КонецПопытки
	
КонецФункции

//	#IBS 07.02.2024 Функция возвращает код EME по ссылке на склад
Функция ПолучитьКодСкладаEMEПоСсылке(СкладСсылка, ОрганизацияСсылка = Неопределено, СтатусТовара = Неопределено) Экспорт
	Перем Запрос, Выборка;

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Склады.КодСкладаEME КАК КодСклада
		|ИЗ
		|	РегистрСведений.EmeWmsМаппингСкладов КАК Склады
		|ГДЕ
		|	Склады.Склад = &СкладСсылка И
		|	Склады.Сторона1С И
		|	((НЕ Склады.ИспользоватьОрганизации) ИЛИ Склады.Организация = &ОрганизацияСсылка ИЛИ &ПустаяОрганизация) И
		|	((НЕ Склады.ИспользоватьСтатусы) ИЛИ Склады.СтоковыйСтатус = &СтатусТовара ИЛИ &ПустойСтатус)";
	
	Запрос.УстановитьПараметр("СкладСсылка", СкладСсылка);
	Запрос.УстановитьПараметр("ОрганизацияСсылка", ОрганизацияСсылка);
	Запрос.УстановитьПараметр("ПустаяОрганизация", ?(ЗначениеЗаполнено(ОрганизацияСсылка), Ложь, Истина));
	Запрос.УстановитьПараметр("СтатусТовара", СтатусТовара);
	Запрос.УстановитьПараметр("ПустойСтатус", ?(ЗначениеЗаполнено(СтатусТовара), Ложь, Истина));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.КодСклада) Тогда
			Возврат Выборка.КодСклада;
		Иначе
			Возврат неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Возврат неопределено;
КонецФункции

//	#IBS 07.04.2025 Функция возвращает признак использование ордерной схемы в приходе по ссылке на склад
Функция ПолучитьИспользованиеОрдернойСхемыВПриходеДляСклада(СкладСсылка) Экспорт
	Перем Запрос, Выборка;

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Склады.ИспользоватьОрдернуюСхемуВПриходе КАК ИспользоватьОрдернуюСхемуВПриходе
		|ИЗ
		|	РегистрСведений.EmeWmsМаппингСкладов КАК Склады
		|ГДЕ
		|	Склады.Склад = &СкладСсылка И
		|	Склады.Сторона1С";
	
	Запрос.УстановитьПараметр("СкладСсылка", СкладСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ИспользоватьОрдернуюСхемуВПриходе;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

//	#IBS 07.04.2025 Функция возвращает признак использование ордерной схемы в отгрузке по ссылке на склад
Функция ПолучитьИспользованиеОрдернойСхемыВОтгрузкеДляСклада(СкладСсылка) Экспорт
	Перем Запрос, Выборка;

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Склады.ИспользоватьОрдернуюСхемуВОтгрузке КАК ИспользоватьОрдернуюСхемуВОтгрузке
		|ИЗ
		|	РегистрСведений.EmeWmsМаппингСкладов КАК Склады
		|ГДЕ
		|	Склады.Склад = &СкладСсылка И
		|	Склады.Сторона1С";
	
	Запрос.УстановитьПараметр("СкладСсылка", СкладСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ИспользоватьОрдернуюСхемуВПриходе;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

//	#IBS 07.04.2025 Функция возвращает ссылку на склад недостач по ссылке на склад 1С
Функция ПолучитьСкладНедостачДляСклада(СкладСсылка) Экспорт
	Перем Запрос, Выборка;

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Склады.СкладНедостачи КАК СкладНедостач
		|ИЗ
		|	РегистрСведений.EmeWmsМаппингСкладов КАК Склады
		|ГДЕ
		|	Склады.Склад = &СкладСсылка
		|	И Склады.Сторона1С";
	
	Запрос.УстановитьПараметр("СкладСсылка", СкладСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СкладНедостач;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

//	#IBS 07.04.2025 Функция возвращает ссылку на склад брака по ссылке на склад 1С
Функция ПолучитьСкладБракаДляСклада(СкладСсылка) Экспорт
	Перем Запрос, Выборка;

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Склады.СкладБрака КАК СкладБрака
		|ИЗ
		|	РегистрСведений.EmeWmsМаппингСкладов КАК Склады
		|ГДЕ
		|	Склады.Склад = &СкладСсылка И
		|	Склады.Сторона1С";
	
	Запрос.УстановитьПараметр("СкладСсылка", СкладСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СкладБрака;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

//	#IBS 07.04.2025 Функция возвращает таблицу серий из документа для номенклатуры и количества (в базовых, из ТЧ Товары)
Функция ПолучитьПодборкуСерийИзДокумента(Документ, НоменклатураСсылка, Количество) Экспорт

	ТаблицаСерий = Новый ТаблицаЗначений;
	ТаблицаСерий.Колонки.Добавить("СерияСсылка");
	ТаблицаСерий.Колонки.Добавить("Количество");
	
	КоличествоОстаток = Количество;
	Для каждого СтрокаТовара из Документ.Товары Цикл
		Если СтрокаТовара.Номенклатура = НоменклатураСсылка Тогда
			Если КоличествоОстаток > 0.0 Тогда
				Если КоличествоОстаток <= СтрокаТовара.Количество Тогда
					СтрокаСерий = ТаблицаСерий.Добавить();
					СтрокаСерий.СерияСсылка = СтрокаТовара.СерияНоменклатуры;
					СтрокаСерий.Количество = КоличествоОстаток;
					Прервать;
				Иначе
					СтрокаСерий = ТаблицаСерий.Добавить();
					СтрокаСерий.СерияСсылка = СтрокаТовара.СерияНоменклатуры;
					СтрокаСерий.Количество = СтрокаТовара.Количество;
					КоличествоОстаток = КоличествоОстаток - СтрокаТовара.Количество;
				КонецЕсли;
			Иначе
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;     
	// Если нераспределенное количество по сериями, записать пустое значение
	Если КоличествоОстаток > 0.0 Тогда
		СтрокаСерий = ТаблицаСерий.Добавить();
		СтрокаСерий.СерияСсылка = Неопределено;
		СтрокаСерий.Количество = СтрокаТовара.Количество;
	КонецЕсли;

	ТаблицаСерий.Свернуть.Добавить("СерияСсылка", "Количество");
	
	Возврат ТаблицаСерий;
КонецФункции

//	#IBS 07.04.2025 Процедура заполняет ссылки на серии товара по документу-основанию
Процедура ЗаполнитьСерииТоваровПоДокументуОснованию(ТЧТовары, ДокументОснование) Экспорт

	// Построим общую карту использования серий
	КартаНоменклатур = Новый Соответствие;
	Для каждого СтрокаТовара из ДокументОснование.Товары Цикл
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовара.Номенклатура, "ВестиУчетПоСериям") Тогда
			ТаблицаСерий = КартаНоменклатур.Получить(СтрокаТовара.Номенклатура);
			Если ТаблицаСерий = Неопределено Тогда
				ТаблицаСерий = Новый ТаблицаЗначений;
				ТаблицаСерий.Колонки.Добавить("СерияСсылка");
				ТаблицаСерий.Колонки.Добавить("Количество");
			КонецЕсли;
			СтрокаСерий = ТаблицаСерий.Добавить();
			СтрокаСерий.СерияСсылка = СтрокаТовара.СерияНоменклатуры;
			СтрокаСерий.Количество = СтрокаТовара.Количество;
		КонецЕсли;
	КонецЦикла;
	
	// Запишем серии в заполняемый документ
	Для каждого СтрокаТовара из ТЧТовары Цикл
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовара.Номенклатура, "ВестиУчетПоСериям") Тогда
			ТаблицаСерий = КартаНоменклатур.Получить(СтрокаТовара.Номенклатура);
			// Подберем серию (из минимально подходящей по количеству)
			СтрокаСерийПодобранная = Неопределено;
			КоличествоПодобранное = 1000000000;
			Если ТаблицаСерий <> Неопределено Тогда
				Для каждого СтрокаСерий Из ТаблицаСерий Цикл
					Если СтрокаСерий.Количество >= СтрокаТовара.Количество И КоличествоПодобранное > СтрокаСерий.Количество Тогда
						КоличествоПодобранное = СтрокаСерий.Количество;
						СтрокаСерийПодобранная = СтрокаСерий;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			// Запишем подобранную серия
			Если СтрокаСерийПодобранная <> Неопределено Тогда
				СтрокаТовара.СерияНоменклатуры = СтрокаСерийПодобранная.СерияСсылка;
				СтрокаСерийПодобранная.Количество = СтрокаСерийПодобранная.Количество - СтрокаТовара.Количество;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
	
//	#IBS 07.02.2024 Функция возращает ссылку на склад по кодам EME, статус по умолчанию - N
Функция ПолучитьСсылкуНаСкладПоКодуEME(КодСклада, КодЗоны = Неопределено, КодОрганизации = Неопределено, КодСтатуса = "N") Экспорт
	Перем Запрос, Выборка;
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Склады.Склад КАК Ссылка
		|ИЗ
		|	РегистрСведений.EmeWmsМаппингСкладов КАК Склады
		|ГДЕ                                  
		| 	Склады.СторонаWMS И 
		|	(Склады.КодСкладаEME = &КодСклада) И
		|	(Склады.КодЗоны = &КодЗоны ИЛИ Склады.ИспользоватьЗоны = ЛОЖЬ) И
		|	(Склады.КодОрганизации = &КодОрганизации ИЛИ Склады.ИспользоватьОрганизации = ЛОЖЬ) И
		|	(Склады.СтоковыйСтатус = &КодСтатуса ИЛИ Склады.ИспользоватьСтатусы = ЛОЖЬ)";
	
	Запрос.УстановитьПараметр("КодСклада", КодСклада);
	Запрос.УстановитьПараметр("КодЗоны", КодЗоны);
	Запрос.УстановитьПараметр("КодОрганизации", КодОрганизации);
	Запрос.УстановитьПараметр("КодСтатуса", КодСтатуса);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Справочники.Склады.ПустаяСсылка();
КонецФункции

//	#IBS 06.04.2023 Функция возвращает код зоны EME по ссылке на склад
Функция ПолучитьКодЗоныEMEПоСсылке(СкладСсылка) Экспорт
	Перем Запрос, Выборка;

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Склады.КодЗоны КАК КодЗоны,
		|	Склады.ИспользоватьЗоны КАК ИспользоватьЗоны
		|ИЗ
		|	РегистрСведений.EmeWmsМаппингСкладов КАК Склады
		|ГДЕ
		| 	Склады.Сторона1С И 
		|	Склады.Склад = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", СкладСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если НЕ Выборка.ИспользоватьЗоны Тогда
			Возврат неопределено;
		ИначеЕсли ЗначениеЗаполнено(Выборка.КодЗоны) Тогда
			Возврат Выборка.КодЗоны;
		Иначе
			Возврат неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Возврат неопределено;
КонецФункции

//	#IBS 29.11.2024 Функция возвращает код статуса товара по ссылке на склад
Функция ПолучитьКодСтатусаТовараПоСсылкеНаСклад(СкладСсылка) Экспорт
	Перем Запрос, Выборка;

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Склады.СтоковыйСтатус КАК КодСтатуса,
		| 	Склады.ИспользоватьСтатусы КАК ИспользоватьСтатусы
		|ИЗ
		|	РегистрСведений.EmeWmsМаппингСкладов КАК Склады
		|ГДЕ
		| 	Склады.Сторона1С И 
		| 	Склады.ИспользоватьСтатусы И 
		|	(Склады.Склад = &Ссылка)";
	Запрос.УстановитьПараметр("Ссылка", СкладСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.КодСтатуса) Тогда
			Возврат Выборка.КодСтатуса;
		КонецЕсли;
	КонецЕсли;
	
	Возврат неопределено;
КонецФункции

//	Функция возвращает код EME по ссылке на организацию 
Функция ПолучитьКодОрганизацииEMEПоСсылке(ОрганизацияСсылка) Экспорт
	Перем Запрос, Выборка;

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Организации.КодОрганизацииEME КАК КодОрганизации
		|ИЗ
		|	РегистрСведений.EmeWmsМаппингОрганизаций КАК Организации
		|ГДЕ
		|	Организации.Организация = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ОрганизацияСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КодОрганизации;
	КонецЕсли;
	
	Возврат неопределено;
КонецФункции

//	Функция ПолучитьЗаказПоставщику возращает ссылку на заказ поставщику по его УИД
Функция ПолучитьЗаказПоставщику(СтрокаУИДЗаказа) Экспорт
	
	Попытка
		УИД = Новый УникальныйИдентификатор(СтрокаУИДЗаказа);
		Ссылка = Документы.ЗаказПоставщику.ПолучитьСсылку(УИД);
		Если Ссылка.ПолучитьОбъект() = Неопределено Тогда
			Возврат Документы.ЗаказПоставщику.ПустаяСсылка();
		Иначе
			Возврат Ссылка;
		КонецЕсли
	Исключение
		Возврат Документы.ЗаказПоставщику.ПустаяСсылка();
	КонецПопытки
	
КонецФункции

//	Функция ПолучитьЗаказПокупателя возращает ссылку на заказ поставщику по его УИД
Функция ПолучитьЗаказПокупателя(СтрокаУИДЗаказа) Экспорт
	
	Попытка
		УИД = Новый УникальныйИдентификатор(СтрокаУИДЗаказа);
		Ссылка = Документы.ЗаказКлиента.ПолучитьСсылку(УИД);
		Если Ссылка.ПолучитьОбъект() = Неопределено Тогда
			Возврат Документы.ЗаказКлиента.ПустаяСсылка();
		Иначе
			Возврат Ссылка;
		КонецЕсли
	Исключение
		Возврат Документы.ЗаказКлиента.ПустаяСсылка();
	КонецПопытки
	
КонецФункции

//	Функция ПолучитьПеремещениеТоваров возращает ссылку на перемещение товаров по его УИД
Функция ПолучитьПеремещениеТоваров(СтрокаУИДПеремещения) Экспорт
	
	Попытка
		УИД = Новый УникальныйИдентификатор(СтрокаУИДПеремещения);
		Ссылка = Документы.ПеремещениеТоваров.ПолучитьСсылку(УИД);
		Если Ссылка.ПолучитьОбъект() = Неопределено Тогда
			Возврат Документы.ПеремещениеТоваров.ПустаяСсылка();
		Иначе
			Возврат Ссылка;
		КонецЕсли
	Исключение
		Возврат Документы.ПеремещениеТоваров.ПустаяСсылка();
	КонецПопытки
	
КонецФункции

//	Функция ПолучитьВозвратТоваровОтКлиента возращает ссылку на возврат по его УИД
Функция ПолучитьВозвратТоваровОтКлиента(СтрокаУИДВозврата) Экспорт
	
	Попытка
		УИД = Новый УникальныйИдентификатор(СтрокаУИДВозврата);
		Ссылка = Документы.ВозвратТоваровОтКлиента.ПолучитьСсылку(УИД);
		Если Ссылка.ПолучитьОбъект() = Неопределено Тогда
			Возврат Документы.ВозвратТоваровОтКлиента.ПустаяСсылка();
		Иначе
			Возврат Ссылка;
		КонецЕсли
	Исключение
		Возврат Документы.ВозвратТоваровОтКлиента.ПустаяСсылка();
	КонецПопытки
	
КонецФункции

//	Функция ПолучитьКомплектациюНоменклатуры возращает ссылку на комплектацию номенклатуры по ее УИД
Функция ПолучитьКомплектациюТовара(СтрокаУИДКомплектации) Экспорт
	
	Попытка
		УИД = Новый УникальныйИдентификатор(СтрокаУИДКомплектации);
		Ссылка = Документы.КомплектацияНоменклатуры.ПолучитьСсылку(УИД);
		Если Ссылка.ПолучитьОбъект() = Неопределено Тогда
			Возврат Документы.КомплектацияНоменклатуры.ПустаяСсылка();
		Иначе
			Возврат Ссылка;
		КонецЕсли
	Исключение
		Возврат Документы.КомплектацияНоменклатуры.ПустаяСсылка();
	КонецПопытки
	
КонецФункции

//	Функция ПолучитьПриобретениеТоваровУслуг возращает ссылку на документ по УИД
Функция ПолучитьПриобретениеТоваровУслуг(СтрокаУИДПриобретения) Экспорт
	
	Попытка
		УИД = Новый УникальныйИдентификатор(СтрокаУИДПриобретения);
		Ссылка = Документы.ПриобретениеТоваровУслуг.ПолучитьСсылку(УИД);
		Если Ссылка.ПолучитьОбъект() = Неопределено Тогда
			Возврат Документы.ПриобретениеТоваровУслуг.ПустаяСсылка();
		Иначе
			Возврат Ссылка;
		КонецЕсли
	Исключение
		Возврат Документы.ПриобретениеТоваровУслуг.ПустаяСсылка();
	КонецПопытки
	
КонецФункции

//	Функция ПолучитьПоступлениеУслугПоПереработке возращает ссылку на документ по УИД
Функция ПолучитьПоступлениеУслугПоПереработке(СтрокаУИДПоступления) Экспорт
	
	Попытка
		УИД = Новый УникальныйИдентификатор(СтрокаУИДПоступления);
		Ссылка = Документы.ПолучениеУслугПоПереработке.ПолучитьСсылку(УИД);
		Если Ссылка.ПолучитьОбъект() = Неопределено Тогда
			Возврат Документы.ПолучениеУслугПоПереработке.ПустаяСсылка();
		Иначе
			Возврат Ссылка;
		КонецЕсли
	Исключение
		Возврат Документы.ПолучениеУслугПоПереработке.ПустаяСсылка();
	КонецПопытки
	
КонецФункции

//	Функция ПолучитьКорректировкуРеализации возращает ссылку на документ по УИД
Функция ПолучитьКорректировкуРеализации(СтрокаУИД) Экспорт
	
	Попытка
		УИД = Новый УникальныйИдентификатор(СтрокаУИД);
		Ссылка = Документы.КорректировкаРеализации.ПолучитьСсылку(УИД);
		Если Ссылка.ПолучитьОбъект() = Неопределено Тогда
			Возврат Документы.КорректировкаРеализации.ПустаяСсылка();
		Иначе
			Возврат Ссылка;
		КонецЕсли
	Исключение
		Возврат Документы.КорректировкаРеализации.ПустаяСсылка();
	КонецПопытки
	
КонецФункции

//	Функция ПолучитьКорректировкуПриобретения возращает ссылку на документ по УИД
Функция ПолучитьКорректировкуПриобретения(СтрокаУИД) Экспорт
	
	Попытка
		УИД = Новый УникальныйИдентификатор(СтрокаУИД);
		Ссылка = Документы.КорректировкаПриобретения.ПолучитьСсылку(УИД);
		Если Ссылка.ПолучитьОбъект() = Неопределено Тогда
			Возврат Документы.КорректировкаПриобретения.ПустаяСсылка();
		Иначе
			Возврат Ссылка;
		КонецЕсли
	Исключение
		Возврат Документы.КорректировкаПриобретения.ПустаяСсылка();
	КонецПопытки
	
КонецФункции

//	Функция ПолучитьПТУ возращает ссылку на ПТУ
Функция ПолучитьПТУ(ЗаказПоставщикуСсылка, НомерПриходаEME) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПоступлениеТоваровУслуг.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|ГДЕ
		|	ПоступлениеТоваровУслуг.Сделка = &ЗаказПоставщику И
		|	ПоступлениеТоваровУслуг.EmeWmsНомер = &НомерПриходаEME И
		|	НЕ ПоступлениеТоваровУслуг.ПометкаУдаления";
	Запрос.УстановитьПараметр("ЗаказПоставщику", ЗаказПоставщикуСсылка);
	Запрос.УстановитьПараметр("НомерПриходаEME", НомерПриходаEME);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Документы.ПоступлениеТоваровУслуг.ПустаяСсылка();

КонецФункции

Функция ПолучитьПТУПоЗаказуНаКомплектующие(ЗаказПоставщикуСсылка, НомерПриходаEME) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПоступлениеТоваровУслуг.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслуг
		|ГДЕ
		|	ПоступлениеТоваровУслуг.Заказ = &ЗаказПоставщику И
		|	ПоступлениеТоваровУслуг.Ссылка.EmeWmsНомер = &НомерПриходаEME И
		|	НЕ ПоступлениеТоваровУслуг.Ссылка.ПометкаУдаления";
	Запрос.УстановитьПараметр("ЗаказПоставщику", ЗаказПоставщикуСсылка);
	Запрос.УстановитьПараметр("НомерПриходаEME", НомерПриходаEME);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Документы.ПоступлениеТоваровУслуг.ПустаяСсылка();

КонецФункции

//	Функция ПолучитьСчетПокупателю возращает ссылку на счет на оплату покупателю
Функция ПолучитьСчетПокупателю(ЗаказПокупателяСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СчетПокупателю.Ссылка
		|ИЗ
		|	Документ.СчетНаОплатуПокупателю КАК СчетПокупателю
		|ГДЕ
		|	СчетПокупателю.ЗаказПокупателя = &ЗаказПокупателя
		|	И НЕ СчетПокупателю.ПометкаУдаления";
	Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателяСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Документы.СчетНаОплатуПокупателю.ПустаяСсылка();

КонецФункции

//	Функция ПолучитьРТУ возращает ссылку на РТУ
Функция ПолучитьРТУ(ЗаказПокупателяСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.ЗаказКлиента = &Заказ
		|	И НЕ РеализацияТоваровУслуг.ПометкаУдаления";
	Запрос.УстановитьПараметр("Заказ", ЗаказПокупателяСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Документы.РеализацияТоваровУслуг.ПустаяСсылка();

КонецФункции

//	Функция ПолучитьРасходныйОрдер возвращает ссылку на расходный ордер
Функция ПолучитьРасходныйОрдер(РТУСсылка) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
       |	РасходныйОрдерНаТовары.Ссылка
       |ИЗ
       |	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
       |ГДЕ
       |	РасходныйОрдерНаТовары.ДокументПередачи = &ДокументПередачи
       |	И НЕ РасходныйОрдерНаТовары.ПометкаУдаления";
	Запрос.УстановитьПараметр("ДокументПередачи", РТУСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
		
	Возврат Документы.РасходныйОрдерНаТовары.ПустаяСсылка();

КонецФункции
				
//	Функция ПолучитьПеремещениеВнутриСклада для заказа покупателя возвращает перемещение СкладEME->СкладEME
Функция ПолучитьПеремещениеВнутриСклада(ЗаказПокупателяСсылка) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПеремещениеТоваров.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
		|ГДЕ
		|	Не ПеремещениеТоваров.ПометкаУдаления И
		|	ПеремещениеТоваров.адмЗаказПокупателя = &ЗаказПокупателяСсылка";
		
	Запрос.УстановитьПараметр("ЗаказПокупателяСсылка", ЗаказПокупателяСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПеремещениеТоваров = Выборка.Ссылка;
		Если ПеремещениеТоваров.СкладОтправитель.EmeWmsУчет И ПеремещениеТоваров.СкладПолучатель.EmeWmsУчет Тогда
			Возврат ПеремещениеТоваров;
		КонецЕсли
	КонецЦикла;
	
	Возврат Документы.ПеремещениеТоваров.ПустаяСсылка();
	
КонецФункции

//	Функция ПолучитьСписаниеТоваров возвращает ссылку на списание по номеру EME
Функция ПолучитьСписаниеТоваров(НомерEME) Экспорт
	Перем Запрос, док1;
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СписаниеТоваров.Ссылка КАК Ссылка
		|ИЗ
		|	
		|РегистрСведений.EmeWmsОтметкиОбИмпортеСписанийТоваров КАК СписаниеТоваров
		|ГДЕ
		|	СписаниеТоваров.ID = &НомерEME";
	Запрос.УстановитьПараметр("НомерEME", НомерEME);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		док1 = Выборка.Ссылка.ПолучитьОбъект();
		Если НЕ док1.ПометкаУдаления Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Документы.СписаниеТоваров.ПустаяСсылка();
КонецФункции

//	Функция ПолучитьОприходованиеТоваров возвращает ссылку на оприходование по номеру EME
Функция ПолучитьОприходованиеТоваров(НомерEME) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОприходованиеТоваров.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ОприходованиеТоваров КАК ОприходованиеТоваров
		|ГДЕ
		|	ОприходованиеТоваров.EmeWmsНомер = &НомерEME И
		|	НЕ ОприходованиеТоваров.ПометкаУдаления";
	Запрос.УстановитьПараметр("НомерEME", НомерEME);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;

	Возврат Документы.ОприходованиеТоваров.ПустаяСсылка();

КонецФункции

//	Функция ПолучитьПеремещениеТоваровПоНомеруEME возвращает ссылку на перемещение товаров по номеру EME
Функция ПолучитьПеремещениеТоваровПоНомеруEME(НомерEME) Экспорт
	Перем Запрос, док1;
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Перемещение.Ссылка КАК Ссылка
		|ИЗ
		|	
		|РегистрСведений.EmeWmsОтметкиОбИмпортеПеремещенийТоваров КАК Перемещение
		|ГДЕ
		|	Перемещение.ID = &НомерEME";
	Запрос.УстановитьПараметр("НомерEME", НомерEME);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		док1 = Выборка.Ссылка.ПолучитьОбъект();
		Если НЕ док1.ПометкаУдаления Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Документы.ПеремещениеТоваров.ПустаяСсылка();
КонецФункции

//	Функция ПолучитьПриобретениеТоваровУслуг возвращает ссылку на приобретение по номеру EME на непомеченный к удалению док.
Функция ПолучитьПриобретениеТоваровУслугНепомеченный(НомерEME) Экспорт
	Перем Запрос, док1;
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПриобретениеТоваровУслуг.Ссылка КАК Ссылка
		|ИЗ
		|	
		|РегистрСведений.EmeWmsОтметкиОбИмпортеПриобретенийТоваровУслуг КАК ПриобретениеТоваровУслуг
		|ГДЕ
		|	ПриобретениеТоваровУслуг.ID = &НомерEME";
	Запрос.УстановитьПараметр("НомерEME", НомерEME);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		док1 = Выборка.Ссылка.ПолучитьОбъект();
		Если НЕ док1.ПометкаУдаления Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Документы.ПриобретениеТоваровУслуг.ПустаяСсылка();

КонецФункции

//	Функция ПолучитьПоступлениеТоваровНаСкладНепомеченный возвращает ссылку на приобретение по номеру EME на непомеченный к удалению док.
Функция ПолучитьПоступлениеТоваровНаСкладНепомеченный(НомерEME) Экспорт
	Перем Запрос, док1;
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПоступлениеТоваровНаСклад.Ссылка КАК Ссылка
		|ИЗ
		|	
		|РегистрСведений.EmeWmsОтметкиОбИмпортеПоступленийТоваровНаСклад КАК ПоступлениеТоваровНаСклад
		|ГДЕ
		|	ПоступлениеТоваровНаСклад.ID = &НомерEME";
	Запрос.УстановитьПараметр("НомерEME", НомерEME);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		док1 = Выборка.Ссылка.ПолучитьОбъект();
		Если НЕ док1.ПометкаУдаления Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Документы.ПоступлениеТоваровНаСклад.ПустаяСсылка();

КонецФункции

//	Функция ПолучитьПоступлениеТоваровНаСкладНепомеченный возвращает ссылку на не помеченнй док. Пересчет товаров по номеру EME
Функция ПолучитьПересчетТоваровНепомеченный(НомерEME) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПересчетТоваров.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрСведений.EmeWmsОтметкиОбИмпортеПересчетовТоваров КАК ПересчетТоваров
		|ГДЕ
		|	ПересчетТоваров.ID = &НомерEME
		|	И НЕ ПересчетТоваров.Ссылка.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("НомерEME", НомерEME);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Документы.ПересчетТоваров.ПустаяСсылка();
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий(); 
	
	Возврат Выборка.Ссылка;
	
КонецФункции

//	Функция ПолучитьРеализациТоваровУслуг возвращает ссылку на реализацию по номеру EME на непомеченный к удалению док.
Функция ПолучитьРеализациюТоваровУслуг(НомерEME) Экспорт
	Перем Запрос, док1;
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
		|ИЗ
		|	
		|РегистрСведений.EmeWmsОтметкиОбИмпортеРеализацийТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.ID = &НомерEME";
	Запрос.УстановитьПараметр("НомерEME", НомерEME);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	
	Возврат Документы.РеализацияТоваровУслуг.ПустаяСсылка();

КонецФункции

//	Функция ПолучитьПередачуТоваровИзПроизводства возвращает ссылку на реализацию по номеру EME на непомеченный к удалению док.
Функция ПолучитьПередачуТоваровИзПроизводстваНепомеченный(НомерEME) Экспорт
	Перем Запрос, док1;
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПередачаТоваров.Ссылка КАК Ссылка
		|ИЗ
		|	
		|РегистрСведений.EmeWmsОтметкиОбИмпортеПередачПродукцииИзПроизводства КАК ПередачаТоваров
		|ГДЕ
		|	ПередачаТоваров.ID = &НомерEME";
	Запрос.УстановитьПараметр("НомерEME", НомерEME);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		док1 = Выборка.Ссылка.ПолучитьОбъект();
		Если НЕ док1.ПометкаУдаления Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Документы.ДвижениеПродукцииИМатериалов.ПустаяСсылка();

КонецФункции

//	Функция ПолучитьВозвратТоваровОтПокупателяНепомеченный возвращает ссылку на непомеченный к удалению документ по номеру EME.
Функция ПолучитьВозвратТоваровОтПокупателяНепомеченный(НомерEME) Экспорт
	Перем Запрос, док1;
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВозвратТоваров.Ссылка КАК Ссылка
		|ИЗ
		|	
		|РегистрСведений.EmeWmsОтметкиОбИмпортеВозвратовТоваровОтКлиента КАК ВозвратТоваров
		|ГДЕ
		|	ВозвратТоваров.ID = &НомерEME";
	Запрос.УстановитьПараметр("НомерEME", НомерEME);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		док1 = Выборка.Ссылка.ПолучитьОбъект();
		Если НЕ док1.ПометкаУдаления Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Документы.ДвижениеПродукцииИМатериалов.ПустаяСсылка();

КонецФункции

//	Функция ПолучитьСсылкуНаРеализациТоваровУслуг возвращает ссылку на документ по строке УИД
Функция ПолучитьСсылкуНаРеализациюТоваровУслуг(СтрокаУИД) Экспорт
	Перем УИД, Ссылка;
	
	Попытка
		УИД = Новый УникальныйИдентификатор(СтрокаУИД);
		Ссылка = Документы.РеализацияТоваровУслуг.ПолучитьСсылку(УИД);
		Если Ссылка.ПолучитьОбъект() = Неопределено Тогда
			Ссылка = Документы.РеализацияТоваровУслуг.ПустаяСсылка();;
		КонецЕсли;
	Исключение
		Ссылка = Документы.РеализацияТоваровУслуг.ПустаяСсылка(); // На случай когда в строке нелегитимное значение
	КонецПопытки;

	Возврат Ссылка;
КонецФункции

//	Функция ПолучитьСсылкуНаКорректировкуПоступления возвращает ссылку на документ по строке УИД
Функция ПолучитьСсылкуНаКорректировкуПоступления(СтрокаУИД) Экспорт
	Перем УИД, Ссылка;
	
	Попытка
		УИД = Новый УникальныйИдентификатор(СтрокаУИД);
		Ссылка = Документы.КорректировкаПоступления.ПолучитьСсылку(УИД);
		Если Ссылка.ПолучитьОбъект() = Неопределено Тогда
			Ссылка = Документы.КорректировкаПоступления.ПустаяСсылка();;
		КонецЕсли;
	Исключение
		Ссылка = Документы.КорректировкаПоступления.ПустаяСсылка(); // На случай когда в строке нелегитимное значение
	КонецПопытки;

	Возврат Ссылка;
КонецФункции

//	Функция ПолучитьСсылкуНаКорректировкуРеализации возвращает ссылку на документ по строке УИД
Функция ПолучитьСсылкуНаКорректировкуРеализации(СтрокаУИД) Экспорт
	Перем УИД, Ссылка;
	
	Попытка
		УИД = Новый УникальныйИдентификатор(СтрокаУИД);
		Ссылка = Документы.КорректировкаРеализации.ПолучитьСсылку(УИД);
		Если Ссылка.ПолучитьОбъект() = Неопределено Тогда
			Ссылка = Документы.КорректировкаРеализации.ПустаяСсылка();;
		КонецЕсли;
	Исключение
		Ссылка = Документы.КорректировкаРеализации.ПустаяСсылка(); // На случай когда в строке нелегитимное значение
	КонецПопытки;

	Возврат Ссылка;
КонецФункции

//	Функция ПолучитьСсылкуНаПеремещениеТоваров возвращает ссылку на документ по строке УИД
Функция ПолучитьСсылкуНаПеремещениеТоваров(СтрокаУИД) Экспорт
	Перем УИД, Ссылка;
	
	Попытка
		УИД = Новый УникальныйИдентификатор(СтрокаУИД);
		Ссылка = Документы.ПеремещениеТоваров.ПолучитьСсылку(УИД);
		Если Ссылка.ПолучитьОбъект() = Неопределено Тогда
			Ссылка = Документы.ПеремещениеТоваров.ПустаяСсылка();;
		КонецЕсли;
	Исключение
		Ссылка = Документы.ПеремещениеТоваров.ПустаяСсылка(); // На случай когда в строке нелегитимное значение
	КонецПопытки;

	Возврат Ссылка;
КонецФункции

//	Функция ПолучитьСсылкуНаЗаказКлиента возвращает ссылку на документ по строке УИД
Функция ПолучитьСсылкуНаЗаказКлиента(СтрокаУИД) Экспорт
	Перем УИД, Ссылка;
	
	Попытка
		УИД = Новый УникальныйИдентификатор(СтрокаУИД);
		Ссылка = Документы.ЗаказКлиента.ПолучитьСсылку(УИД);
		Если Ссылка.ПолучитьОбъект() = Неопределено Тогда
			Ссылка = Документы.ЗаказКлиента.ПустаяСсылка();;
		КонецЕсли;
	Исключение
		Ссылка = Документы.ЗаказКлиента.ПустаяСсылка(); // На случай когда в строке нелегитимное значение
	КонецПопытки;

	Возврат Ссылка;
КонецФункции

//	Функция возвращает ссылку на Расходный ордер на товары по УИД
Функция ПолучитьСсылкуНаРасходныйОрдерНаТовары(СтрокаУИД) Экспорт
	Перем УИД, Ссылка;
	
	Попытка
		УИД = Новый УникальныйИдентификатор(СтрокаУИД);
		Ссылка = Документы.РасходныйОрдерНаТовары.ПолучитьСсылку(УИД);
		Если Ссылка.ПолучитьОбъект() = Неопределено Тогда
			Ссылка = Документы.РасходныйОрдерНаТовары.ПустаяСсылка();;
		КонецЕсли;
	Исключение
		Ссылка = Документы.РасходныйОрдерНаТовары.ПустаяСсылка(); // На случай когда в строке нелегитимное значение
	КонецПопытки;

	Возврат Ссылка;
КонецФункции

//	Функция возвращает ссылку на Задание на доставку по УИД
Функция ПолучитьСсылкуНаЗаданиеНаДоставку(СтрокаУИД) Экспорт
	Перем УИД, Ссылка;
	
	Попытка
		УИД = Новый УникальныйИдентификатор(СтрокаУИД);
		Ссылка = Документы.ЗаданиеНаДоставку_ЛА.ПолучитьСсылку(УИД);
		Если Ссылка.ПолучитьОбъект() = Неопределено Тогда
			Ссылка = Документы.ЗаданиеНаДоставку_ЛА.ПустаяСсылка();;
		КонецЕсли;
	Исключение
		Ссылка = Документы.ЗаданиеНаДоставку_ЛА.ПустаяСсылка(); // На случай когда в строке нелегитимное значение
	КонецПопытки;

	Возврат Ссылка;
КонецФункции

//	Функция возвращает ссылку на Заявку на перевозку по строке УИД
Функция ПолучитьСсылкуНаЗаявкуНаПеревозку(СтрокаУИД) Экспорт
	Перем УИД, Ссылка;
	
	Попытка
		УИД = Новый УникальныйИдентификатор(СтрокаУИД);
		Ссылка = Документы.ЗаявкаНаПеревозкуЯндексМагистрали.ПолучитьСсылку(УИД);
		Если Ссылка.ПолучитьОбъект() = Неопределено Тогда
			Ссылка = Документы.ЗаявкаНаПеревозкуЯндексМагистрали.ПустаяСсылка();;
		КонецЕсли;
	Исключение
		Ссылка = Документы.ЗаявкаНаПеревозкуЯндексМагистрали.ПустаяСсылка();
	КонецПопытки;

	Возврат Ссылка;
КонецФункции

//	Функция ПолучитьСсылкуНаВозвратТоваровОтПокупателя возвращает ссылку на документ по строке УИД
Функция ПолучитьСсылкуНаВозвратТоваровОтПокупателя(СтрокаУИД) Экспорт
	Перем УИД, Ссылка;
	
	Попытка
		УИД = Новый УникальныйИдентификатор(СтрокаУИД);
		Ссылка = Документы.ВозвратТоваровОтПокупателя.ПолучитьСсылку(УИД);
		Если Ссылка.ПолучитьОбъект() = Неопределено Тогда
			Ссылка = Документы.ВозвратТоваровОтПокупателя.ПустаяСсылка();;
		КонецЕсли;
	Исключение
		Ссылка = Документы.ВозвратТоваровОтПокупателя.ПустаяСсылка(); // На случай когда в строке нелегитимное значение
	КонецПопытки;

	Возврат Ссылка;
КонецФункции

//	Функция ПолучитьСсылкуНаВозвратТоваровПоставщику возвращает ссылку на документ по строке УИД
Функция ПолучитьСсылкуНаВозвратТоваровПоставщику(СтрокаУИД) Экспорт
	Перем УИД, Ссылка;
	
	Попытка
		УИД = Новый УникальныйИдентификатор(СтрокаУИД);
		Ссылка = Документы.ВозвратТоваровПоставщику.ПолучитьСсылку(УИД);
		Если Ссылка.ПолучитьОбъект() = Неопределено Тогда
			Ссылка = Документы.ВозвратТоваровПоставщику.ПустаяСсылка();;
		КонецЕсли;
	Исключение
		Ссылка = Документы.ВозвратТоваровПоставщику.ПустаяСсылка(); // На случай когда в строке нелегитимное значение
	КонецПопытки;

	Возврат Ссылка;
КонецФункции

//	Функция ПолучитьСсылкуНаЗаказНаПеремещение возвращает ссылку на документ по строке УИД
Функция ПолучитьСсылкуНаЗаказНаПеремещение(СтрокаУИД) Экспорт
	Перем УИД, Ссылка;
	
	Попытка
		УИД = Новый УникальныйИдентификатор(СтрокаУИД);
		Ссылка = Документы.ЗаказНаПеремещение.ПолучитьСсылку(УИД);
		Если Ссылка.ПолучитьОбъект() = Неопределено Тогда
			Ссылка = Документы.ЗаказНаПеремещение.ПустаяСсылка();;
		КонецЕсли;
	Исключение
		Ссылка = Документы.ЗаказНаПеремещение.ПустаяСсылка(); // На случай когда в строке нелегитимное значение
	КонецПопытки;

	Возврат Ссылка;
КонецФункции

//	Функция ПолучитьСсылкуНаПриобретениеТоваровУслуг возвращает ссылку на документ по строке УИД
Функция ПолучитьСсылкуНаПриобретениеТоваровУслуг(СтрокаУИД) Экспорт
	Перем УИД, Ссылка;
	
	Попытка
		УИД = Новый УникальныйИдентификатор(СтрокаУИД);
		Ссылка = Документы.ПриобретениеТоваровУслуг.ПолучитьСсылку(УИД); // На случай когда в строке нелегитимное значение
		Если Ссылка.ПолучитьОбъект() = Неопределено Тогда
			Ссылка = Документы.ПриобретениеТоваровУслуг.ПустаяСсылка();;
		КонецЕсли;
	Исключение
		Ссылка = Документы.ПриобретениеТоваровУслуг.ПустаяСсылка();
	КонецПопытки;

	Возврат Ссылка;
КонецФункции

//	#IBS 05.05.2023 Функция ПолучитьСсылкуНаПриходныйОрдерНаТовары возвращает ссылку по строке УИД
Функция ПолучитьСсылкуНаПриходныйОрдерНаТовары(СтрокаУИД) Экспорт
	Перем УИД, Ссылка;
	
	Попытка
		УИД = Новый УникальныйИдентификатор(СтрокаУИД);
		Ссылка = Документы.ПриходныйОрдерНаТовары.ПолучитьСсылку(УИД); // На случай когда в строке нелегитимное значение
		Если Ссылка.ПолучитьОбъект() = Неопределено Тогда
			Ссылка = Документы.ПриходныйОрдерНаТовары.ПустаяСсылка();;
		КонецЕсли;
	Исключение
		Ссылка = Документы.ПриходныйОрдерНаТовары.ПустаяСсылка();
	КонецПопытки;

	Возврат Ссылка;
КонецФункции

//	#IBS 09.04.2025 Функция ПолучитьСсылкуНаПоступлениеТоваровУслуг возвращает ссылку по строке УИД
Функция ПолучитьСсылкуНаПоступлениеТоваровУслуг(СтрокаУИД) Экспорт
	Перем УИД, Ссылка;
	
	Попытка
		УИД = Новый УникальныйИдентификатор(СтрокаУИД);
		Ссылка = Документы.ПоступлениеТоваровУслуг.ПолучитьСсылку(УИД); // На случай когда в строке нелегитимное значение
		Если Ссылка.ПолучитьОбъект() = Неопределено Тогда
			Ссылка = Документы.ПоступлениеТоваровУслуг.ПустаяСсылка();;
		КонецЕсли;
	Исключение
		Ссылка = Документы.ПоступлениеТоваровУслуг.ПустаяСсылка();
	КонецПопытки;

	Возврат Ссылка;
КонецФункции

//	#IBS 04.03.2025 Функция ПолучитьСсылкуНаСписаниеТоваров возвращает ссылку по строке УИД
Функция ПолучитьСсылкуНаСписаниеТоваров(СтрокаУИД) Экспорт
	Перем УИД, Ссылка;
	
	Попытка
		УИД = Новый УникальныйИдентификатор(СтрокаУИД);
		Ссылка = Документы.СписаниеТоваров.ПолучитьСсылку(УИД); // На случай когда в строке нелегитимное значение
		Если Ссылка.ПолучитьОбъект() = Неопределено Тогда
			Ссылка = Документы.СписаниеТоваров.ПустаяСсылка();
		КонецЕсли;
	Исключение
		Ссылка = Документы.СписаниеТоваров.ПустаяСсылка();
	КонецПопытки;

	Возврат Ссылка;
КонецФункции

//	Функция ПолучитьСсылкуНаЗаказПоставщику возвращает ссылку на приобретение по номеру EME
Функция ПолучитьСсылкуНаЗаказПоставщику(НомерEME) Экспорт
	Перем УИД, Ссылка;
	
	Попытка
		УИД = Новый УникальныйИдентификатор(НомерEME);
		Ссылка = Документы.ЗаказПоставщику.ПолучитьСсылку(УИД);
		Если Ссылка.ПолучитьОбъект() = Неопределено Тогда
			Ссылка = Документы.ЗаказПоставщику.ПустаяСсылка();;
		КонецЕсли;
	Исключение
		Ссылка = Документы.ЗаказПоставщику.ПустаяСсылка(); // На случай когда в строке нелегитимное значение
	КонецПопытки;

	Возврат Ссылка;
КонецФункции

//	#IBS 12.02.2024 Возвращает найденную ссылку на документ Передачи товаров по строке UID
Функция ПолучитьСсылкуНаПередачуТоваров(СтрокаУИД) Экспорт
	Перем УИД, Ссылка;
	
	Попытка
		УИД = Новый УникальныйИдентификатор(СтрокаУИД);
		Ссылка = Документы.ПередачаТоваровМеждуОрганизациями.ПолучитьСсылку(УИД);
		Если Ссылка.ПолучитьОбъект() = Неопределено Тогда
			Ссылка = Документы.ПередачаТоваровМеждуОрганизациями.ПустаяСсылка();
		КонецЕсли;
	Исключение
		Ссылка = Документы.ПередачаТоваровМеждуОрганизациями.ПустаяСсылка(); // На случай когда в строке нелегитимное значение
	КонецПопытки;

	Возврат Ссылка;
	
КонецФункции

//	Процедура ПолучитьКоличестваТоваров заполняет карту соответствий КоличестваТоваров:
//	ключ - ссылка на товар, значение - количество
Процедура ПолучитьКоличестваТоваров(ERPData, КоличестваТоваров, ПолеКоличества, ТолькоEMEСклад) Экспорт
	
	Пока EmeWmsERPEngine.NextChildLine(ERPData) Цикл
		
		Если ТолькоEMEСклад Тогда
			Если ERPData.lines.lot_no <> "-" Тогда
				Продолжить
			КонецЕсли
		КонецЕсли;
		
		УИДТовара = ERPData.lines.goods_id;
		Если УИДТовара = "" Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "GDSNUL");
			Продолжить
		КонецЕсли;
		
		ТоварСсылка = ПолучитьСсылкуНаТовар(УИДТовара);
		Если ТоварСсылка.Пустая() Тогда
			EmeWmsERPEngine.ErrorChild(ERPData, "GDSBAD");
			Продолжить
		КонецЕсли;
		
		Количество = ERPData.lines[ПолеКоличества];
		СтароеКоличество = КоличестваТоваров.Получить(ТоварСсылка);
		Если СтароеКоличество = Неопределено Тогда
			НовоеКоличество = Количество;
		Иначе
			НовоеКоличество = СтароеКоличество + Количество;
		КонецЕсли;
		
		КоличестваТоваров.Вставить(ТоварСсылка, НовоеКоличество);
		
	КонецЦикла;		
	
КонецПроцедуры

//	Процедура ВычестьКоличестваТоваровПоДокументу вычитает из таблицы соответствий
//	КоличестваТоваров количества товаров из табличной части документа
Процедура ВычестьКоличестваТоваровПоДокументу(КоличестваТоваров, ТабличнаяЧастьТоваров) Экспорт
	
	Для Каждого СтрокаТовара Из ТабличнаяЧастьТоваров Цикл
		
		//	Получим количество товара из сообщения
		СтароеКоличество = КоличестваТоваров.Получить(СтрокаТовара.Номенклатура);
		Если СтароеКоличество = Неопределено Тогда
			СтароеКоличество = 0;
		КонецЕсли;
		
		Количество = СтрокаТовара.Количество * СтрокаТовара.Коэффициент;
		
		//	Изменим остаток
		НовоеКоличество = СтароеКоличество - Количество;
		Если НовоеКоличество = 0 Тогда
			КоличестваТоваров.Удалить(СтрокаТовара.Номенклатура);
		Иначе
			КоличестваТоваров.Вставить(СтрокаТовара.Номенклатура, НовоеКоличество);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//	Процедура ТрассировкаКоличествТоваров распечатывает таблицу количеств товара
Процедура ТрассировкаКоличествТоваров(Трассировка, КоличестваТоваров) Экспорт
	
	Для Каждого КоличествоТовара Из КоличестваТоваров Цикл
		ТоварСсылка = КоличествоТовара.Ключ;
		Трассировка = Трассировка + СокрЛП(ТоварСсылка.Код) + " [" + СокрЛП(ТоварСсылка.Наименование) + "] = " +
			КоличествоТовара.Значение + ПолучитьБазовуюЕдиницуИзмерения(ТоварСсылка) + Символы.ПС;
	КонецЦикла
	
КонецПроцедуры

//	Процедура ТрассировкаТабличнойЧастиТоваров распечатывает таблицу количеств товара
Процедура ТрассировкаТабличнойЧастиТоваров(Трассировка, ТабличнаяЧастьТоваров) Экспорт
	
	Для Каждого СтрокаТовара Из ТабличнаяЧастьТоваров Цикл
		Количество = СтрокаТовара.Количество * СтрокаТовара.Коэффициент;
		ТоварСсылка = СтрокаТовара.Номенклатура;
		Трассировка = Трассировка + СокрЛП(ТоварСсылка.Код) + " [" + СокрЛП(ТоварСсылка.Наименование) + "] = " +
			Количество + ПолучитьБазовуюЕдиницуИзмерения(ТоварСсылка) + Символы.ПС;
	КонецЦикла;
	
КонецПроцедуры

// Процедура СообщитьПоПочте отправляет сообщение по E-mail
Процедура СообщитьПоПочте(Тема, Текст) Экспорт
	
	УчетнаяЗапись = Константы.EmeWmsУчетнаяЗаписьЭлектроннойПочты.Получить();
	
	Если Не УчетнаяЗапись.Пустая() Тогда
		//	Создадим почтовый профиль
		Профиль = Новый ИнтернетПочтовыйПрофиль;
		
		//	Создадим почтовое сообщение
		Письмо = Новый ИнтернетПочтовоеСообщение;
		Текст = Письмо.Тексты.Добавить(Текст +
			"
			|--
			|Письмо создано автоматически, отвечать на него не надо.");
		Текст.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;
		Письмо.Тема = Тема; 
		Письмо.Отправитель = УчетнаяЗапись.АдресЭлектроннойПочты;
		Письмо.ИмяОтправителя = УчетнаяЗапись.Наименование;
		
		СписокРассылки = СокрЛП(Константы.EmeWmsСписокРассылкиДиагностики.Получить());
		Если СписокРассылки = "" Тогда
			Возврат
		КонецЕсли;
		МногострочнаяСтрока = СтрЗаменить(СписокРассылки, ";", Символы.ПС);
		Для Счетчик = 1 По СтрЧислоСтрок(МногострочнаяСтрока) Цикл
   			Письмо.Получатели.Добавить(СтрПолучитьСтроку(МногострочнаяСтрока, Счетчик));
		КонецЦикла;

		//	Отправим почтовое сообщение
		Соединение = Новый ИнтернетПочта;
		Попытка
			Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗапись);
			
			ПротоколПолученияПочты = ПротоколИнтернетПочты.POP3;
			Если ИспользоватьIMAPПриОтправкеПисем(Профиль) Тогда
				ПротоколПолученияПочты = ПротоколИнтернетПочты.IMAP;
			КонецЕсли;

			ОбрабатыватьТекстСообщения = ОбработкаТекстаИнтернетПочтовогоСообщения.НеОбрабатывать;
			Соединение.Подключиться(Профиль, ПротоколПолученияПочты);
			Сообщить("Подключено");
			Соединение.Послать(Письмо, ОбрабатыватьТекстСообщения, ПротоколИнтернетПочты.SMTP);
			Сообщить("Письма отправлены");
		Исключение
			Сообщить("Не удалось подключиться к серверу");
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	    
		Соединение.Отключиться();
	    Сообщить("Соединение завершено");
	КонецЕсли
	
КонецПроцедуры

// Процедура СообщитьПоПочте отправляет сообщение по E-mail менеджеру и по списку рассылки
Процедура СообщитьПоПочтеМенеджеру(Менеджер, Тема, Текст) Экспорт
	
	УчетнаяЗапись = Константы.EmeWmsУчетнаяЗаписьЭлектроннойПочты.Получить();
	
	Если Не УчетнаяЗапись.Пустая() Тогда
		//	Создадим почтовый профиль
		Профиль = Новый ИнтернетПочтовыйПрофиль;
		
		//	Создадим почтовое сообщение
		Письмо = Новый ИнтернетПочтовоеСообщение;
		Текст = Письмо.Тексты.Добавить(Текст +
			"
			|--
			|Письмо создано автоматически, отвечать на него не надо.");
		Текст.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;
		Письмо.Тема = Тема; 
		Письмо.Отправитель = УчетнаяЗапись.АдресЭлектроннойПочты;
		Письмо.ИмяОтправителя = УчетнаяЗапись.Наименование;
		
		Если ЗначениеЗаполнено(Менеджер) Тогда
			СписокРассылки = ПолучитьАдресЭППользователя(Менеджер);	// Это ссылка на справочник Пользователи
		Иначе
			СписокРассылки = СокрЛП(Константы.EmeWmsСписокРассылкиДиагностики.Получить());
		КонецЕсли;
		Если СписокРассылки = "" Тогда
			Возврат
		КонецЕсли;
		
		МногострочнаяСтрока = СтрЗаменить(СписокРассылки, ";", Символы.ПС);
		Для Счетчик = 1 По СтрЧислоСтрок(МногострочнаяСтрока) Цикл
   			Письмо.Получатели.Добавить(СтрПолучитьСтроку(МногострочнаяСтрока, Счетчик));
		КонецЦикла;

		//	Отправим почтовое сообщение
		Соединение = Новый ИнтернетПочта;
		Попытка
			Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗапись);
			
			ПротоколПолученияПочты = ПротоколИнтернетПочты.POP3;
			Если ИспользоватьIMAPПриОтправкеПисем(Профиль) Тогда
				ПротоколПолученияПочты = ПротоколИнтернетПочты.IMAP;
			КонецЕсли;

			ОбрабатыватьТекстСообщения = ОбработкаТекстаИнтернетПочтовогоСообщения.НеОбрабатывать;
			Соединение.Подключиться(Профиль, ПротоколПолученияПочты);
			Сообщить("Подключено");
			Соединение.Послать(Письмо, ОбрабатыватьТекстСообщения, ПротоколИнтернетПочты.SMTP);
			Сообщить("Письма отправлены");
		Исключение
			Сообщить("Не удалось подключиться к серверу");
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	    
		Соединение.Отключиться();
	    Сообщить("Соединение завершено");
	КонецЕсли
	
КонецПроцедуры

// Процедура СообщитьПоПочте отправляет сообщение по адресу рассылки для документов
Процедура СообщитьПоПочтеРассылки(Тема, Текст) Экспорт
	
	УчетнаяЗапись = Константы.EmeWmsУчетнаяЗаписьЭлектроннойПочты.Получить();
	
	Если Не УчетнаяЗапись.Пустая() Тогда
		//	Создадим почтовый профиль
		Профиль = Новый ИнтернетПочтовыйПрофиль;
		
		//	Создадим почтовое сообщение
		Письмо = Новый ИнтернетПочтовоеСообщение;
		Текст = Письмо.Тексты.Добавить(Текст +
			"
			|--
			|Письмо создано автоматически, отвечать на него не надо.");
		Текст.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;
		Письмо.Тема = Тема; 
		Письмо.Отправитель = УчетнаяЗапись.АдресЭлектроннойПочты;
		Письмо.ИмяОтправителя = УчетнаяЗапись.Наименование;
		
		СписокРассылки = СокрЛП(Константы.EmeWmsСписокРассылкиДокументов.Получить());
		Если СписокРассылки = "" Тогда
			Возврат
		КонецЕсли;
		
		МногострочнаяСтрока = СтрЗаменить(СписокРассылки, ";", Символы.ПС);
		Для Счетчик = 1 По СтрЧислоСтрок(МногострочнаяСтрока) Цикл
   			Письмо.Получатели.Добавить(СтрПолучитьСтроку(МногострочнаяСтрока, Счетчик));
		КонецЦикла;

		//	Отправим почтовое сообщение
		Соединение = Новый ИнтернетПочта;
		Попытка
			Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗапись);
			
			ПротоколПолученияПочты = ПротоколИнтернетПочты.POP3;
			Если ИспользоватьIMAPПриОтправкеПисем(Профиль) Тогда
				ПротоколПолученияПочты = ПротоколИнтернетПочты.IMAP;
			КонецЕсли;

			ОбрабатыватьТекстСообщения = ОбработкаТекстаИнтернетПочтовогоСообщения.НеОбрабатывать;
			Соединение.Подключиться(Профиль, ПротоколПолученияПочты);
			Сообщить("Подключено");
			Соединение.Послать(Письмо, ОбрабатыватьТекстСообщения, ПротоколИнтернетПочты.SMTP);
			Сообщить("Письма отправлены");
		Исключение
			Сообщить("Не удалось подключиться к серверу");
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	    
		Соединение.Отключиться();
	    Сообщить("Соединение завершено");
	КонецЕсли
	
КонецПроцедуры

// Функция возращает адрес ЭП пользователя из контактной информации
Функция ПолучитьАдресЭППользователя(Пользователь)
	Для каждого стр1 из Пользователь.КонтактнаяИнформация Цикл
		Если ЗначениеЗаполнено(стр1.АдресЭП) Тогда
			Возврат стр1.АдресЭП;
		КонецЕсли;
	КонецЦикла;
	
	Возврат "";
КонецФункции

// Из служебногоо модуля ERP
Функция ИспользоватьIMAPПриОтправкеПисем(Профиль)
	
	Возврат Не ПочтовыйСерверХранитПисьмаОтправленныеПоSMTP(Профиль)
		И ЗначениеЗаполнено(Профиль.АдресСервераIMAP)
		И ЗначениеЗаполнено(Профиль.ПортIMAP)
		И ЗначениеЗаполнено(Профиль.ПользовательIMAP)
		И Профиль.ПарольIMAP <> "";
	
КонецФункции

// Из служебногоо модуля ERP
Функция ПочтовыйСерверХранитПисьмаОтправленныеПоSMTP(ИнтернетПочтовыйПрофиль)
	
	Возврат НРег(ИнтернетПочтовыйПрофиль.АдресСервераSMTP) = "smtp.gmail.com";
	
КонецФункции

//	Процедура ПолучитьСписокРеквизитовСПОметками заполняет СписокРеквизитов реквизитами с пометками к экспорту
Процедура ПолучитьСписокРеквизитовСПометками(СписокРеквизитов)
	
	СписокРеквизитов.Колонки.Добавить("Реквизит");
	СписокРеквизитов.Добавить().Реквизит = РегистрыСведений.EmeWmsПометкиКЭкспортуНоменклатуры;
	СписокРеквизитов.Добавить().Реквизит = РегистрыСведений.EmeWmsПометкиКЭкспортуЗаказовПоставщикам;
	СписокРеквизитов.Добавить().Реквизит = РегистрыСведений.EmeWmsПометкиКЭкспортуЗаказовПокупателей;
	СписокРеквизитов.Добавить().Реквизит = РегистрыСведений.EmeWmsПометкиКЭкспортуПеремещенийТоваров;
	СписокРеквизитов.Добавить().Реквизит = РегистрыСведений.EmeWmsПометкиКЭкспортуВозвратовТоваровОтКлиента;
	//СписокРеквизитов.Добавить().Реквизит = РегистрыСведений.EmeWmsПометкиКЭкспортуКомплектацийНоменклатуры;
	СписокРеквизитов.Добавить().Реквизит = РегистрыСведений.EmeWmsПометкиКЭкспортуЗаказовНаКомплектующие;
	СписокРеквизитов.Добавить().Реквизит = РегистрыСведений.EmeWmsПометкиКЭкспортуКонтрагентов;
	
КонецПроцедуры

//	#IBS 04.03.2024 Процедура ПолучитьСписокУтилит заполняет СписокУтилит доступными утилитами
Процедура ПолучитьСписокУтилит(СписокУтилит) Экспорт
	
	СписокУтилит.Колонки.Добавить("Утилита");
	СписокУтилит.Добавить().Утилита = "ПротестироватьОтсылкуДиагностики";
	СписокУтилит.Добавить().Утилита = "ПометитьВсюНоменклатуруКЭкспорту";
	СписокУтилит.Добавить().Утилита = "ПометитьВсеГруппыНоменклатурКЭкспорту";
	СписокУтилит.Добавить().Утилита = "РазрешитьЭкспортВсехНоменклатур";
	СписокУтилит.Добавить().Утилита = "ЗапретитьЭкспортВсехНоменклатур";
	СписокУтилит.Добавить().Утилита = "ПометитьВсехКонтрагентовКЭкспорту";
	//СписокУтилит.Добавить().Утилита = "ПометитьВсеВозвратыТоваровОтПокупателейКЭкспорту";
	//СписокУтилит.Добавить().Утилита = "ПометитьВсеКомплектацииНоменклатурыКЭкспорту";
	СписокУтилит.Добавить().Утилита = "УдалитьВсеПометкиКЭкспорту";
	СписокУтилит.Добавить().Утилита = "УдалитьСтарыеПометкиКЭкспорту";
	СписокУтилит.Добавить().Утилита = "СтрессТестЭкспортаОстатков";
	СписокУтилит.Добавить().Утилита = "ОчисткаРегистровИмпортаДокументов";
	СписокУтилит.Добавить().Утилита = "ОчисткаРегистровЭкспортаНоменклатуры";
	СписокУтилит.Добавить().Утилита = "СнятьПометкиНоменклатурыКЭкспорту";
	СписокУтилит.Добавить().Утилита = "СнятьПометкиКонтрагентовКЭкспорту";  
	СписокУтилит.Добавить().Утилита = "ТестОбработкиПроведения";
	
КонецПроцедуры

Процедура ПротестироватьОтсылкуДиагностики() Экспорт
	EmeWmsУтилиты.СообщитьПоПочте("Тест диагностики", "Тест диагностики");
КонецПроцедуры

// #IBS 12.03.2025 УТ10.3
Процедура ПометитьВсеГруппыНоменклатурКЭкспорту() Экспорт
	Перем Запрос, Выборка, ТЗ;
	
	Счетчик2 = 0;
	
	Сообщить("Начинаем выборку ссылок групп");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ 
		|	Номенклатура.Ссылка КАК Ссылка
        |ИЗ
        |	Справочник.Номенклатура КАК Номенклатура
        //|ГДЕ (НЕ Номенклатура.ПометкаУдаления) И Номенклатура.ЭтоГруппа
        |ГДЕ Номенклатура.ЭтоГруппа
		|ИТОГИ ПО
    	|Ссылка ТОЛЬКО ИЕРАРХИЯ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Сообщить("Начинаем пометку групп номенклатуры к экспорту");
	Пока Выборка.Следующий() Цикл
		ТоварСсылка = Выборка.Ссылка;
		Если ТоварСсылка <> Неопределено И ТоварСсылка <> Справочники.Номенклатура.ПустаяСсылка() Тогда
			// #IBS Ширяев 21.11.2024 Выбирать только группы с товаром, без услуг и работ
			//Если EmeWmsЭкспортГруппНоменклатуры.ВГруппеЕстьМатериальныйТовар(ТоварСсылка) Тогда
				//Товар = Выборка.Ссылка.ПолучитьОбъект();
				Если EmeWmsЭкспортГруппНоменклатуры.РазрешенКЭкспорту(ТоварСсылка) Тогда
					// Помечается при разрешении экспорта
					EmeWmsЭкспортГруппНоменклатуры.РазрешитьЭкспорт(ТоварСсылка);
					//EmeWmsЭкспортГруппНоменклатуры.ПометитьКЭкспорту(Товар);
					Счетчик2 = Счетчик2 + 1;
				КонецЕсли;
			//КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Сообщить("Завершили пометку групп номенклатуры к экспорту (" + Счетчик2 + "шт)");
	
КонецПроцедуры

// #IBS 12.03.2025
Процедура ПометитьВсюНоменклатуруКЭкспорту() Экспорт
	Перем Запрос, Выборка, ТЗ;

	//Сообщить("Начинаем пометку номенклатуры к экспорту");
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	Номенклатура.Ссылка
	//	|ИЗ
	//	|	Справочник.Номенклатура КАК Номенклатура
	//	|ГДЕ
    //    |	НЕ Номенклатура.ПометкаУдаления
    //    |	И НЕ Номенклатура.ЭтоГруппа";
			
	//РезультатЗапроса = Запрос.Выполнить();
	//Выборка = РезультатЗапроса.Выбрать();
			
	//Пока Выборка.Следующий() И Счетчик1 < 15000 Цикл
	//	Если EmeWmsЭкспортНоменклатуры.ЭтоМатериальныйТовар(Выборка.Ссылка) И 
	//		НЕ EmeWmsЭкспортНоменклатуры.ПомеченКЭкспорту(Выборка.Ссылка) Тогда
        
	//		EmeWmsЭкспортНоменклатуры.ПометитьКЭкспорту(Выборка.Ссылка);
	//		Счетчик1 = Счетчик1 + 1;
	//	КонецЕсли;
	//КонецЦикла;   
	
	Сообщить("Начинаем пометку номенклатуры (имеющейся на остатках) к экспорту");
	ТаблицаОстатков = ПолучитьТаблицуОстатков();
	Счетчик1 = 0;
	Для Каждого СтрокаТовара Из ТаблицаОстатков Цикл                    
		ТоварСсылка = СтрокаТовара.Номенклатура;
		Если НЕ EmeWmsЭкспортНоменклатуры.ПомеченКЭкспорту(ТоварСсылка) Тогда
			EmeWmsЭкспортНоменклатуры.ПометитьКЭкспорту(ТоварСсылка);
			Счетчик1 = Счетчик1 + 1;
		КонецЕсли;
	КонецЦикла;   
	Сообщить("Завершили пометку номенклатуры к экспорту (" + Счетчик1 + "шт)");
	
КонецПроцедуры

// Возвращает остатки товаров по складам из маппинга (алгоритм из выгрузки остатков)
Функция ПолучитьТаблицуОстатков()
		Запрос			= Новый Запрос;
	Запрос.Текст	= "
		  |ВЫБРАТЬ РАЗЛИЧНЫЕ
		  |	Склады.Ссылка КАК Склад,
		  | EmeWmsМаппингСкладов.КодСкладаEME КАК СкладEME,
		  | ВЫБОР 
		  |		КОГДА EmeWmsМаппингСкладов.ИспользоватьЗоны ТОГДА EmeWmsМаппингСкладов.КодЗоны
		  |		ИНАЧЕ НЕОПРЕДЕЛЕНО
		  |	КОНЕЦ КАК ЗонаEME,
		  | EmeWmsМаппингСкладов.СтоковыйСтатус КАК СтоковыйСтатус,
		  |	EmeWmsМаппингСкладов.КодОрганизации КАК КодОрганизацииEME
		  |ПОМЕСТИТЬ ВТ_Склады
		  |ИЗ
		  |	Справочник.Склады КАК Склады
		  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.EmeWmsМаппингСкладов КАК EmeWmsМаппингСкладов
		  |		ПО (EmeWmsМаппингСкладов.Сторона1С И EmeWmsМаппингСкладов.КодСкладаEME > """" И Склады.Ссылка = EmeWmsМаппингСкладов.Склад)
		  |ГДЕ
		  |	НЕ Склады.ПометкаУдаления
		  |;
		  |
		  |////////////////////////////////////////////////////////////////////////////////
		  |ВЫБРАТЬ РАЗЛИЧНЫЕ
		  |	ВТ_Склады.СкладEME КАК СкладEME,
		  |	ВТ_Склады.ЗонаEME КАК ЗонаEME
		  |ИЗ
	 	  |	ВТ_Склады КАК ВТ_Склады
		  |УПОРЯДОЧИТЬ ПО
		  | СкладEME,
		  |	ЗонаEME		   
		  |;
	      |
		  |////////////////////////////////////////////////////////////////////////////////
		  |ВЫБРАТЬ
		  |	Остатки.Склад КАК Склад,
		  |	Остатки.Номенклатура КАК Номенклатура,
		  |	Остатки.СерияНоменклатуры КАК Серия,
		  |	СУММА(Остатки.КоличествоОстаток) КАК ВНаличии
		  |ПОМЕСТИТЬ ВТ_Остатки
		  |ИЗ
		  |	РегистрНакопления.ТоварыНаСкладах.Остатки(
		  |			&КонецПериода,
		  |			Склад В
		  |				(ВЫБРАТЬ
		  |					вт_Склады.Склад
		  |				ИЗ
		  |					вт_Склады)) КАК Остатки
		  |ГДЕ 
       	  |	НЕ Остатки.Номенклатура.Услуга
		  |	И НЕ Остатки.Номенклатура.ПометкаУдаления
		  |
		  |СГРУППИРОВАТЬ ПО
		  |	Остатки.Склад,
		  |	Остатки.Номенклатура,
		  |	Остатки.СерияНоменклатуры 
		  |ИМЕЮЩИЕ
		  |	СУММА(Остатки.КоличествоОстаток) > 0
		  |;
		  |
		  |////////////////////////////////////////////////////////////////////////////////
		  |ВЫБРАТЬ
		  |	Склады.СкладEME КАК СкладEME,
		  | Склады.ЗонаEME КАК ЗонаEME, 
		  | Склады.СтоковыйСтатус КАК СтоковыйСтатус,		  
		  |	Склады.КодОрганизацииEME КАК КодОрганизацииEME,
		  |	ВТ_Остатки.Номенклатура КАК Номенклатура,
		  |	ВТ_Остатки.Номенклатура.Код КАК НоменклатураКод,
		  |	ВТ_Остатки.Номенклатура.ЕдиницаХраненияОстатков КАК НоменклатураЕдиницаИзмерения,
		  |	ВТ_Остатки.Номенклатура.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору.Код КАК НоменклатураЕдиницаИзмеренияКод,
		  |	ВТ_Остатки.Серия КАК Серия,
		  |	ВТ_Остатки.ВНаличии КАК ВНаличии,
		  |	ВТ_Остатки.Номенклатура.ВестиУчетПоСериям КАК ИспользоватьСерии,
		  | ЕСТЬNULL(СправочникСерииНоменклатуры.СерийныйНомер, """") КАК СерияНомер,
		  | ЕСТЬNULL(СправочникСерииНоменклатуры.СрокГодности, ДАТАВРЕМЯ(1, 1, 1)) КАК СерияГоденДо,
		  | ДАТАВРЕМЯ(1, 1, 1) КАК СерияДатаПроизводства
		  |ИЗ
		  |	ВТ_Остатки КАК ВТ_Остатки  
		  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Склады КАК Склады
		  |     	ПО (ВТ_Остатки.Склад = Склады.Склад)
		  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
		  |     	ПО (СправочникНоменклатура.Ссылка = ВТ_Остатки.Номенклатура)		  		
		  |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК СправочникВидыНоменклатуры
		  |     ПО СправочникВидыНоменклатуры.Ссылка = СправочникНоменклатура.ВидНоменклатуры		  
		  |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СправочникСерииНоменклатуры
		  |     ПО СправочникСерииНоменклатуры.Ссылка = ВТ_Остатки.Серия
		  |;
		  |
		  |////////////////////////////////////////////////////////////////////////////////
		  |ВЫБРАТЬ
		  |	Обороты.Склад КАК Склад,
		  |	Обороты.Регистратор КАК Регистратор,
		  |	Обороты.Номенклатура КАК Номенклатура,
		  |	Обороты.СерияНоменклатуры КАК Серия,
		  |	СУММА(Обороты.КоличествоПриход) КАК ПриходТовара,
		  |	СУММА(Обороты.КоличествоРасход) КАК РасходТовара
		  |ПОМЕСТИТЬ ВТ_Обороты
		  |ИЗ
		  |	РегистрНакопления.ТоварыНаСкладах.Обороты(
		  |			&НачалоПериода,
		  |			&КонецПериода,
		  |			Регистратор,
		  |			Склад В
		  |				(ВЫБРАТЬ
		  |					вт_Склады.Склад
		  |				ИЗ
		  |					вт_Склады)
		  |			И Номенклатура В 
		  |				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		  |					ВТ_Остатки.Номенклатура
		  |			ИЗ
		  |					ВТ_Остатки)) КАК Обороты
		  |ГДЕ
       	  |	НЕ Обороты.Номенклатура.Услуга
		  |	И НЕ Обороты.Номенклатура.ПометкаУдаления
		  |
		  |СГРУППИРОВАТЬ ПО
		  |	Обороты.Склад,
		  |	Обороты.Регистратор,
		  |	Обороты.Номенклатура,
		  |	Обороты.СерияНоменклатуры
		  |;
		  |
		  |////////////////////////////////////////////////////////////////////////////////
		  |УНИЧТОЖИТЬ ВТ_Остатки
		  |;
		  |
		  |////////////////////////////////////////////////////////////////////////////////
		  |ВЫБРАТЬ
		  |	Склады.СкладEME КАК СкладEME,
		  | Склады.ЗонаEME КАК ЗонаEME,     
		  | Склады.СтоковыйСтатус КАК СтоковыйСтатус,		  
		  |	Склады.КодОрганизацииEME КАК КодОрганизацииEME,
		  |	ВТ_Обороты.Регистратор КАК Регистратор,
		  |	ВТ_Обороты.Регистратор.Дата КАК РегистраторДата,
		  |	ВТ_Обороты.Регистратор.Номер КАК РегистраторНомер,
		  |	ВТ_Обороты.Номенклатура КАК Номенклатура,
		  |	ВТ_Обороты.Номенклатура.Код КАК НоменклатураКод,
		  |	ВТ_Обороты.Номенклатура.ЕдиницаХраненияОстатков КАК НоменклатураЕдиницаИзмерения,
		  |	ВТ_Обороты.Номенклатура.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору.Код КАК НоменклатураЕдиницаИзмеренияКод,
		  |	ВТ_Обороты.Серия КАК Серия,
		  |	ВТ_Обороты.ПриходТовара КАК ПриходТовара,
		  |	ВТ_Обороты.РасходТовара КАК РасходТовара,
		  |	ВТ_Обороты.Номенклатура.ВестиУчетПоСериям КАК ИспользоватьСерии,
		  | ЕСТЬNULL(СправочникСерииНоменклатуры.СерийныйНомер, """") КАК СерияНомер,
		  | ЕСТЬNULL(СправочникСерииНоменклатуры.СрокГодности, ДАТАВРЕМЯ(1, 1, 1)) КАК СерияГоденДо,
		  | ДАТАВРЕМЯ(1, 1, 1) КАК СерияДатаПроизводства
		  |ИЗ
		  |	ВТ_Обороты КАК ВТ_Обороты
		  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Склады КАК Склады
		  |     	ПО (ВТ_Обороты.Склад = Склады.Склад)
		  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
		  |     	ПО (СправочникНоменклатура.Ссылка = ВТ_Обороты.Номенклатура)		  		
		  |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК СправочникВидыНоменклатуры
		  |     ПО СправочникВидыНоменклатуры.Ссылка = СправочникНоменклатура.ВидНоменклатуры		  
		  |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СправочникСерииНоменклатуры
		  |     ПО СправочникСерииНоменклатуры.Ссылка = ВТ_Обороты.Серия
		  |;
		  |
		  |////////////////////////////////////////////////////////////////////////////////
		  |УНИЧТОЖИТЬ ВТ_Склады
		  |;
		  |
		  |////////////////////////////////////////////////////////////////////////////////
		  |УНИЧТОЖИТЬ ВТ_Обороты";
	
	НачалоПериода =	НачалоДня(ТекущаяДата());
	КонецПериода =	КонецДня(ТекущаяДата());
	Запрос.УстановитьПараметр("НачалоПериода",	НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",	КонецПериода);
	
	РезультатЗапроса	= Запрос.ВыполнитьПакет();
	ТаблицаСкладов		= РезультатЗапроса[1].Выгрузить();
	ТаблицаОстатков		= РезультатЗапроса[3].Выгрузить();
	ТаблицаДвижений		= РезультатЗапроса[6].Выгрузить();
	
	ТаблицаОстатков.Свернуть("Номенклатура");
	
	Возврат ТаблицаОстатков;
КонецФункции

// #IBS 12.03.2025 Процедура снимает пометки номенклатур к экспорту и разрешение к экспорту
Процедура СнятьПометкиНоменклатурыКЭкспорту() Экспорт

	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
КонецПроцедуры

//	IBS 12.03.2025 Процедура снимает пометки контрагентов к экспорту 
Процедура СнятьПометкиКонтрагентовКЭкспорту() Экспорт
	
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуКонтрагентов.СоздатьНаборЗаписей();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
КонецПроцедуры

// #IBS Новая процедура, простым обходом справочника
Процедура ПометитьВсюНоменклатуруКЭкспорту2() Экспорт
	Перем Счетчик1, Счетчик2, Запрос, Выборка;
	
	Сообщить("Начинаем пометку номенклатуры к экспорту");
	Счетчик1 = 0;
	Счетчик2 = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.ЭтоГруппа КАК ЭтоГруппа
        |ИЗ
        |	Справочник.Номенклатура КАК Номенклатура
        |ГДЕ
		|	НЕ Номенклатура.ПометкаУдаления";
	
	Отбор = новый Структура;
	Отбор.Вставить("ПометкаУдаления", ложь);
	Отбор.Вставить("ЭтоГруппа", истина);
	
	Выборка = Справочники.Номенклатура.ВыбратьИерархически(,,Отбор);
	
	Пока Выборка.Следующий() цикл
		Если НЕ Выборка.ЭтоГруппа Тогда
			Если Не EmeWmsЭкспортНоменклатуры.ПомеченКЭкспорту(Выборка.Ссылка) Тогда
				EmeWmsЭкспортНоменклатуры.ПометитьКЭкспорту(Выборка.Ссылка.ПолучитьОбъект());
				Счетчик2 = Счетчик2 + 1;
				Если Счетчик2%10 = 0 Тогда
					Сообщить("Помечаем к экспорту "+Строка(Счетчик2));
				КонецЕсли
			КонецЕсли
		Иначе
			Если Не EmeWmsЭкспортГруппНоменклатуры.ПомеченКЭкспорту(Выборка.Ссылка) Тогда
				EmeWmsЭкспортГруппНоменклатуры.ПометитьКЭкспорту(Выборка.Ссылка.ПолучитьОбъект());
				Счетчик1 = Счетчик1 + 1;
				Если Счетчик1%10 = 0 Тогда
					Сообщить("Помечаем к экспорту "+Строка(Счетчик1));
				КонецЕсли
			КонецЕсли
		КонецЕсли;
	КонецЦикла;
	Сообщить("Завершили пометку групп номенклатуры к экспорту (" + Счетчик1 + "шт)");
	Сообщить("Завершили пометку номенклатуры к экспорту (" + Счетчик2 + "шт)");
	
КонецПроцедуры

// #IBS 12.03.2025 
Процедура РазрешитьЭкспортВсехНоменклатур() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Номенклатура.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	НЕ Номенклатура.ПометкаУдаления
	               |	И НЕ Номенклатура.ЭтоГруппа
	               |	И НЕ Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга),
				   |										 ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Сообщить("Начинаем пометку номенклатуры к экспорту");
	Пока Выборка.Следующий() Цикл
		EmeWmsЭкспортНоменклатуры.РазрешитьЭкспорт(Выборка.Ссылка);
	КонецЦикла;
	Сообщить("Завершили разрешение всех номенклатур к экспорту (" + Выборка.Количество() + "шт)");
	
КонецПроцедуры

// #IBS 12.03.2025 
Процедура ЗапретитьЭкспортВсехНоменклатур() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
        |ИЗ
        |	Справочник.Номенклатура КАК Номенклатура
        |ГДЕ
        |	НЕ Номенклатура.ЭтоГруппа И 
		|	НЕ Номенклатура.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Сообщить("Начинаем пометку номенклатуры к экспорту");
	Счетчик = 0;
	Пока Выборка.Следующий() Цикл
		Если Не EmeWmsЭкспортНоменклатуры.ПомеченКЭкспорту(Выборка.Ссылка) Тогда
			EmeWmsЭкспортНоменклатуры.ЗапретитьЭкспорт(Выборка.Ссылка.ПолучитьОбъект());
			Счетчик = Счетчик + 1;
		КонецЕсли
	КонецЦикла;
	Сообщить("Завершили разрешение всех номенклатур к экспорту (" + Счетчик + "шт)");
	
КонецПроцедуры

Процедура ПометитьВсехКонтрагентовКЭкспорту() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка
        |ИЗ
        |	Справочник.Контрагенты КАК Контрагенты
        |ГДЕ
		|	НЕ Контрагенты.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Сообщить("Начинаем пометку контрагентов к экспорту");
	Счетчик = 0;
	Пока Выборка.Следующий() Цикл
		Если Не EmeWmsЭкспортКонтрагентов.ПомеченКЭкспорту(Выборка.Ссылка) Тогда
			EmeWmsЭкспортКонтрагентов.ПометитьКЭкспорту(Выборка.Ссылка.ПолучитьОбъект());
			Счетчик = Счетчик + 1;
		КонецЕсли
	КонецЦикла;
	Сообщить("Завершили пометку контрагентов к экспорту (" + Счетчик + "шт)");
	
КонецПроцедуры

Процедура ПометитьВсеВозвратыТоваровОтПокупателейКЭкспорту() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	ВозвратТоваровОтКлиента.Ссылка КАК Ссылка
	    |ИЗ
	    |	Документ.ВозвратТоваровОтКлиента КАК ВозвратТоваровОтКлиента
	    |ГДЕ
		|	НЕ ВозвратТоваровОтКлиента.ПометкаУдаления И
		|	ВозвратТоваровОтКлиента.Дата > &ДатаВозврата";
		
	Запрос.УстановитьПараметр("ДатаВозврата", ДобавитьМесяц(ТекущаяДата(), -3));
	Выборка = Запрос.Выполнить().Выбрать();
	
	Сообщить("Начинаем пометку возвратов товаров от покупателей для экспорта");
	Счетчик = 0;
	Пока Выборка.Следующий() Цикл
//		Если Не EmeWmsЭкспортВозвратовТоваровОтКлиента.ПомеченКЭкспорту(Выборка.Ссылка) Тогда
//			EmeWmsЭкспортВозвратовТоваровОтКлиента.ПометитьКЭкспорту(Выборка.Ссылка.ПолучитьОбъект());
//			Счетчик = Счетчик + 1;
//		КонецЕсли
	КонецЦикла;
	Сообщить("Завершили пометку возвратов товаров от покупателей для экспорта (" + Счетчик + "шт)");
	
КонецПроцедуры

Процедура ПометитьВсеКомплектацииНоменклатурыКЭкспорту() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	КомплектацияНоменклатуры.Ссылка КАК Ссылка
	    |ИЗ
	    |	Документ.КомплектацияНоменклатуры КАК КомплектацияНоменклатуры
	    |ГДЕ
		|	НЕ КомплектацияНоменклатуры.ПометкаУдаления И
		|	КомплектацияНоменклатуры.Дата > &ДатаКомплектации";
		
	Запрос.УстановитьПараметр("ДатаКомплектации", ДобавитьМесяц(ТекущаяДата(), -3));
	Выборка = Запрос.Выполнить().Выбрать();
	
	Сообщить("Начинаем пометку комплектаций номенклатуры от покупателей для экспорта");
	Счетчик = 0;
	Пока Выборка.Следующий() Цикл
//		Если Не EmeWmsЭкспортКомплектацийНоменклатуры.ПомеченКЭкспорту(Выборка.Ссылка) Тогда
//			EmeWmsЭкспортКомплектацийНоменклатуры.ПометитьКЭкспорту(Выборка.Ссылка.ПолучитьОбъект());
//			Счетчик = Счетчик + 1;
//		КонецЕсли
	КонецЦикла;
	Сообщить("Завершили пометку комплектаций номенклатуры для экспорта (" + Счетчик + "шт)");
	
КонецПроцедуры

Процедура УдалитьВсеПометкиКЭкспорту() Экспорт
	
	СписокРеквизитов = Новый ТаблицаЗначений;
	ПолучитьСписокРеквизитовСПометками(СписокРеквизитов);
	Для Каждого Реквизит Из СписокРеквизитов Цикл
		НаборЗаписей = Реквизит.Реквизит.СоздатьНаборЗаписей();
		НаборЗаписей.Записать();
	КонецЦикла;
	Сообщить("Удалены все пометки к экспорту");

КонецПроцедуры

Процедура УдалитьСтарыеПометкиКЭкспорту() Экспорт
	
	СписокРеквизитов = Новый ТаблицаЗначений;
	ПолучитьСписокРеквизитовСПометками(СписокРеквизитов);
	НетПометокДляУдаления = Истина;
	Для Каждого Реквизит Из СписокРеквизитов Цикл
		Счетчик = 0;
		Выборка = Реквизит.Реквизит.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.Дата < ДобавитьМесяц(ТекущаяДата(), -1) Тогда
				Выборка.ПолучитьМенеджерЗаписи().Удалить();
				Счетчик = Счетчик + 1;
			КонецЕсли;
		КонецЦикла;
		Если Счетчик <> 0 Тогда
			НетПометокДляУдаления = Ложь;
			Сообщить("Удалено в " + Реквизит.Реквизит + " " + Счетчик + "шт.");
		КонецЕсли
	КонецЦикла;
	Если НетПометокДляУдаления Тогда
		Сообщить("Нет пометок для удаления");
	КонецЕсли
	
КонецПроцедуры

Процедура СтрессТестЭкспортаОстатков() Экспорт
	
	ERPData = Новый Структура;
	EmeWmsERPEngine.Create(ERPData);
	
	// #IBS 01.03.2024 Получить текст файла из регистра настроек
	ERPData.ERPEngine = EmeWmsУтилиты.ПолучитьСодержимоеФайлаНастроек();
	Если ERPData.ERPEngine = Неопределено Или ERPData.ERPEngine = "" Тогда
		Возврат;
	КонецЕсли;
	
	НачалоСтрессТеста = ТекущаяДата();
	Сообщить(НачалоСтрессТеста);
	ВсегоРегистров = 10000;

	Ошибка = EmeWmsERPEngine.Connect(ERPData);
	Если Ошибка <> "" Тогда
		Сообщить(Ошибка);
		ЗаписьЖурналаРегистрации("Экспорт в EME.WMS",,,,"Подключение к SQL базе данных: " + Ошибка);
		Возврат;
	КонецЕсли;
	
	EmeWmsERPEngine.BeginExport(ERPData, "erp", "wms", "remains");
	Попытка
		EmeWmsERPEngine.AppendHeaderLine(ERPData);
		ERPData.header.id			= "TEST" + "." + Формат(ТекущаяДата(), "ДФ=гггг-ММ-дд");
		ERPData.header.whs_code		= "TEST";
		ERPData.header.formed_at	= Формат(КонецДня(ТекущаяДата()), "ДФ=ггггММддЧЧммсс");
		ERPData.header.is_manually	= Истина;
		
		Выборка = Справочники.Номенклатура.Выбрать();
		Выборка.Следующий();
		Номенклатура = Выборка.Ссылка;

		//	Строки по остаткам.
		EmeWmsERPEngine.SelectChild(ERPData, "registers");
		Для Счетчик = 1 По ВсегоРегистров Цикл
			EmeWmsERPEngine.AppendChildLine(ERPData);
			ERPData.registers.id 			= Счетчик;
			ERPData.registers.goods_id		= Номенклатура.УникальныйИдентификатор();
			ERPData.registers.goods_code	= СокрЛП(Номенклатура.Код);
			ERPData.registers.remains_qty	= 1.;
			ERPData.registers.mu_code 		= СокрЛП(EmeWmsУтилиты.ПолучитьБазовуюЕдиницуИзмерения(Номенклатура).ЕдиницаПоКлассификатору.Код);
			ERPData.registers.lot_no		= "-";
			ERPData.registers.vendor_code	= "ORG";
			Если НЕ Выборка.Следующий() Тогда 
				Прервать;
			КонецЕсли;
		КонецЦикла;		

		EmeWmsERPEngine.CommitExport(ERPData);
		
		КонецСтрессТеста = ТекущаяДата();
		Сообщить(КонецСтрессТеста);
		Период = КонецСтрессТеста - НачалоСтрессТеста;
		Сообщить("Остатки проэкспортированы за " + Период + "сек на " + ВсегоРегистров + " регистров");
		
	Исключение
		EmeWmsERPEngine.RollbackExport(ERPData);
		ВызватьИсключение(ОписаниеОшибки());
	КонецПопытки;
	
	EmeWmsERPEngine.Disconnect(ERPData);
	
КонецПроцедуры

// #IBS 04.03.2024 Актуализированный список регистров импорта
Процедура ОчисткаРегистровИмпортаДокументов() Экспорт
	Кол1 = 0;
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеПриходныхОрдеровНаТовары.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();	
	Кол1 = Кол1 + НаборЗаписей.Количество();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеРасходныхОрдеровНаТовары.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();	
	Кол1 = Кол1 + НаборЗаписей.Количество();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеВозвратовТоваровОтКлиента.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();	
	Кол1 = Кол1 + НаборЗаписей.Количество();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеПересчетовТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();	
	Кол1 = Кол1 + НаборЗаписей.Количество();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеПеремещенийТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();	
	Кол1 = Кол1 + НаборЗаписей.Количество();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуСписанийТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();	
	Кол1 = Кол1 + НаборЗаписей.Количество();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеОприходованийТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();	
	Кол1 = Кол1 + НаборЗаписей.Количество();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуПриобретенийТоваровУслуг.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();	
	Кол1 = Кол1 + НаборЗаписей.Количество();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуРеализацийТоваровУслуг.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();	
	Кол1 = Кол1 + НаборЗаписей.Количество();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеОрдераНаОтражениеИзлишковТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();	
	Кол1 = Кол1 + НаборЗаписей.Количество();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеОрдераНаОтражениеНедостачТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();	
	Кол1 = Кол1 + НаборЗаписей.Количество();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеОрдераНаОтражениеПересортаТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();	
	Кол1 = Кол1 + НаборЗаписей.Количество();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеОрдераНаОтражениеПорчиТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();	
	Кол1 = Кол1 + НаборЗаписей.Количество();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеПередачТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();	
	Кол1 = Кол1 + НаборЗаписей.Количество();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеЗаказовКлиента.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();	
	Кол1 = Кол1 + НаборЗаписей.Количество();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
	Сообщить("Удалены записи регистров импорта документов, в количестве "+Строка(Кол1));
КонецПроцедуры

Процедура ОчисткаРегистровЭскпортаНоменклатуры() Экспорт
	Кол1 = 0;
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();	
	Кол1 = Кол1 + НаборЗаписей.Количество();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
	Сообщить("Удалены записи регистра эскпорта номенклатуры, в количестве "+Строка(Кол1));
КонецПроцедуры

Процедура ТестОбработкиПроведения() Экспорт 
	EmeWmsПроведениеДокументов.ПровестиДокументы();
КонецПроцедуры

//	Сравнение количеств по товарам с сериями в ТЧ товаров с картой товаров
Функция ПроверитьТоварыНаСоответствие(Документ, КартаТоваров) Экспорт
	
	ИспользоватьСерии = Константы.EmeWmsИспользоватьСерии.Получить();
	
    QtyMap = КопироватьСоответствие(КартаТоваров);

    // Расчет разностей по количествам товаров
    Для Каждого СтрДок Из Документ.Товары Цикл
        ТоварСсылка 			= СтрДок.Номенклатура;
		СерияСсылка 			= ?(ИспользоватьСерии, СтрДок.СерияНоменклатуры, Неопределено);
		ХарактеристикаСсылка 	= СтрДок.ХарактеристикаНоменклатуры;
		КлючТовара 				= СоздатьКлючТовара(ТоварСсылка, СерияСсылка, ХарактеристикаСсылка);

		КоличествоДокумента = ПересчетВДругуюЕдиницу(СтрДок.Количество, 
													 СтрДок.ЕдиницаИзмерения, 
													 EmeWmsУтилиты.ПолучитьБазовуюЕдиницуИзмерения(СтрДок.Номенклатура));
			
        Если QtyMap.Получить(КлючТовара) <> Неопределено Тогда
            QtyMap.Вставить(КлючТовара, QtyMap.Получить(КлючТовара) - КоличествоДокумента);
        Иначе
            Если (КоличестваТовараНеРавны(КоличествоДокумента, 0.0)) Тогда
                Возврат Ложь;
            КонецЕсли;
        КонецЕсли;
    КонецЦикла;

    // Проверка на разности количеств товаров
	Для каждого Элемент1 из QtyMap цикл
        Если (КоличестваТовараНеРавны(Элемент1.Значение, 0.0)) Тогда
            Возврат ложь;
        КонецЕсли;
    КонецЦикла;

    Возврат Истина;
КонецФункции

// #IBS 27.04.2023 Сравнить товары в таблице и ТЧ документа по количествам без серий возвращает истина, если ОК
Функция ПроверитьТоварыНаСоответствиеБезСерий(Документ, ТаблицаТоваров) Экспорт
	QtyMap = Новый Соответствие;
	Для каждого СтрокаТовара из ТаблицаТоваров Цикл
		Количество1 = ?(QtyMap.Получить(СтрокаТовара.Номенклатура) = Неопределено, 0.0, QtyMap.Получить(СтрокаТовара.Номенклатура));
		QtyMap.Вставить(СтрокаТовара.Номенклатура, Количество1 + СтрокаТовара.Количество);
	КонецЦикла;
		
	// Расчет разностей по количествам товаров
	Для каждого СтрДок из Документ.Товары цикл
		КлючТовара = СтрДок.Номенклатура;
		Если СтрДок.Упаковка.Пустая() Тогда
			КоличествоДокумента = СтрДок.КоличествоУпаковок;
		Иначе
			КоличествоДокумента = ПересчетВДругуюЕдиницу(СтрДок.КоличествоУпаковок, СтрДок.Упаковка, СтрДок.Номенклатура.ЕдиницаИзмерения);
		КонецЕсли;
        Если QtyMap.Получить(СтрДок.Номенклатура) <> Неопределено Тогда
            // Количество в единицах строки документа приводим к базовой ЕИ
            QtyMap.Вставить(КлючТовара, QtyMap.Получить(КлючТовара) - КоличествоДокумента);
        Иначе
            Если (КоличестваТовараНеРавны(КоличествоДокумента, 0.0)) Тогда
                Возврат Ложь;
            КонецЕсли;
        КонецЕсли;
    КонецЦикла;

    // Проверка на разности количеств товаров
	Для каждого Элемент1 из QtyMap цикл
        Если (КоличестваТовараНеРавны(Элемент1.Значение, 0.0)) Тогда
            Возврат ложь;
        КонецЕсли;
    КонецЦикла;
	
	Возврат Истина;
КонецФункции

// #IBS 15.12.2021 Проверка на неравенство количеств товара с погрешностью
Функция КоличестваТовараНеРавны(Значение1, Значение2)
	Разность = Значение1 - Значение2;
	Если Макс(-Разность, Разность) > 0.000001 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции	

// #IBS 27.04.2023 Создать ключ по товару, серии  и характеристике
Функция СоздатьКлючТовара(ТоварСсылка, СерияСсылка, ХарактеристикаСсылка) Экспорт
	Если ТоварСсылка = Неопределено Тогда
		КлючТовара = "NULL#";
	Иначе		                                    
		Если ТоварСсылка.Пустая() Тогда
			КлючТовара = "NULL#";
		Иначе
			КлючТовара = "" + ТоварСсылка.УникальныйИдентификатор()+"#";
		КонецЕсли;	
	КонецЕсли;	
	
	Если СерияСсылка = Неопределено Тогда
		КлючТовара = КлючТовара + "NULL#";
	Иначе
		Если СерияСсылка.Пустая() Тогда
			КлючТовара = КлючТовара + "NULL#";
		Иначе
			КлючТовара = КлючТовара + СерияСсылка.УникальныйИдентификатор()+"#";
		КонецЕсли;		
	КонецЕсли;		
	
	Если ХарактеристикаСсылка = Неопределено Тогда
		КлючТовара = КлючТовара + "NULL#";
	Иначе
		Если ХарактеристикаСсылка.Пустая() Тогда
			КлючТовара = КлючТовара + "NULL#";
		Иначе
			КлючТовара = КлючТовара + ХарактеристикаСсылка.УникальныйИдентификатор()+"#";
		КонецЕсли;		
	КонецЕсли;		

	Возврат КлючТовара;
КонецФункции	

// #IBS 19.02.2025 Получить карту товаров документа, свернутую по товарам, сериям и характеристикам (для КА1.1)
Функция ПолучитьКартуТоваровДокумента(Документ) Экспорт
	КартаТоваров 	  = Новый Соответствие;
	//ИспользоватьСерии = Константы.EmeWmsИспользоватьСерии.Получить();
	
	Для Каждого СтрокаТЧ из Документ.Товары Цикл
		ТоварСсылка			= СтрокаТЧ.Номенклатура;
		ТоварСерия 			= Неопределено;
		ТоварХарактеристика = Неопределено;
		
		РеквизитыТовара = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТоварСсылка, "ВестиУчетПоСериям, ВестиУчетПоХарактеристикам");
		Если РеквизитыТовара.ВестиУчетПоСериям Тогда
			ТоварСерия = СтрокаТЧ.СерияНоменклатуры;
		ИначеЕсли РеквизитыТовара.ВестиУчетПоХарактеристикам Тогда
			ТоварХарактеристика = СтрокаТЧ.ХарактеристикаНоменклатуры;
		КонецЕсли;                                          
		
		КлючТовара = EmeWmsУтилиты.СоздатьКлючТовара(СтрокаТЧ.Номенклатура, ТоварСерия, ТоварХарактеристика);
		КоличествоПоКарте = ?(КартаТоваров.Получить(КлючТовара) = неопределено, 0.0, КартаТоваров.Получить(КлючТовара));
		КоличествоДокумента = СтрокаТЧ.Количество;
		КартаТоваров.Вставить(КлючТовара, КоличествоПоКарте + КоличествоДокумента);
	КонецЦикла;
	
	Возврат КартаТоваров;
КонецФункции

// #IBS 27.04.2023 Получить карту товаров табличной части документа, свернутую по товарам и сериям (количество плюсом или минусом)
Функция ПолучитьКартуТоваровТЧДокумента(ТЧДокумента, ИнверсияЗнака) Экспорт
	КартаТоваров = Новый Соответствие;
	
	Для Каждого СтрокаТЧ из ТЧДокумента Цикл
		КлючТовара = EmeWmsУтилиты.СоздатьКлючТовара(СтрокаТЧ.Номенклатура, СтрокаТЧ.Серия, СтрокаТЧ.Характеристика);
		КоличествоПоКарте = ?(КартаТоваров.Получить(КлючТовара) = неопределено, 0.0, КартаТоваров.Получить(КлючТовара));
		Если СтрокаТЧ.Упаковка.Пустая() Тогда
			КоличествоДокумента = СтрокаТЧ.КоличествоУпаковок;
		Иначе
			КоличествоДокумента = ПересчетВДругуюЕдиницу(СтрокаТЧ.КоличествоУпаковок, СтрокаТЧ.Упаковка, СтрокаТЧ.Номенклатура.ЕдиницаИзмерения);
		КонецЕсли;
		КартаТоваров.Вставить(КлючТовара, КоличествоПоКарте + ?(ИнверсияЗнака, -КоличествоДокумента, КоличествоДокумента));
	КонецЦикла;
	
	Возврат КартаТоваров;
КонецФункции

// #IBS 28.04.2023 Получить карту товаров табличной части документа, свернутую по товарам и сериям
Функция ПолучитьКартуТоваровИзТЧДокумента(ТЧДокумента) Экспорт
	КартаТоваров = Новый Соответствие;
	
	Для Каждого СтрокаТЧ из ТЧДокумента Цикл
		КлючТовара = EmeWmsУтилиты.СоздатьКлючТовара(СтрокаТЧ.Номенклатура, СтрокаТЧ.Серия, СтрокаТЧ.Характеристика);
		КоличествоПоКарте = ?(КартаТоваров.Получить(КлючТовара) = неопределено, 0.0, КартаТоваров.Получить(КлючТовара));
		Если СтрокаТЧ.Упаковка.Пустая() Тогда
			КоличествоДокумента = СтрокаТЧ.КоличествоУпаковок;
		Иначе
			КоличествоДокумента = ПересчетВДругуюЕдиницу(СтрокаТЧ.КоличествоУпаковок, СтрокаТЧ.Упаковка, СтрокаТЧ.Номенклатура.ЕдиницаИзмерения);
		КонецЕсли;
		КартаТоваров.Вставить(КлючТовара, КоличествоПоКарте + КоличествоДокумента);
	КонецЦикла;
	
	Возврат КартаТоваров;
КонецФункции

// #IBS 28.04.2023 Сравнение количеств по товарам с сериями в ТЧ документа с картой товаров
Функция ПроверитьТоварыНаСоответствиеТЧДокумента(ТЧДокумента, КартаТоваров) Экспорт

    QtyMap = КопироватьСоответствие(КартаТоваров);

    // Расчет разностей по количествам товаров
    Для каждого СтрДок из ТЧДокумента цикл
        ТоварСсылка = 	СтрДок.Номенклатура;
		СерияСсылка = 	СтрДок.Серия;
		ХарактеристикаСсылка = 	СтрДок.Серия;
		КлючТовара = СоздатьКлючТовара(ТоварСсылка, СерияСсылка, ХарактеристикаСсылка);
		Если СтрДок.Упаковка.Пустая() Тогда
			КоличествоДокумента = СтрДок.КоличествоУпаковок;
		Иначе
			КоличествоДокумента = ПересчетВДругуюЕдиницу(СтрДок.КоличествоУпаковок, СтрДок.Упаковка, СтрДок.Номенклатура.ЕдиницаИзмерения);
		КонецЕсли;
		
        Если QtyMap.Получить(КлючТовара) <> Неопределено Тогда
            QtyMap.Вставить(КлючТовара, QtyMap.Получить(КлючТовара) - КоличествоДокумента);
        Иначе
            Если (КоличестваТовараНеРавны(КоличествоДокумента, 0.0)) Тогда
                Возврат Ложь;
            КонецЕсли;
        КонецЕсли;
    КонецЦикла;

    // Проверка на разности количеств товаров
	Для каждого Элемент1 из QtyMap цикл
        Если (КоличестваТовараНеРавны(Элемент1.Значение, 0.0)) Тогда
            Возврат ложь;
        КонецЕсли;
    КонецЦикла;

    Возврат Истина;
КонецФункции

// #IBS 19.10.2023 Сравнение количеств по товарам с сериями в ТЧ отгружаемые товары с картой товаров только по строкам действием Отгрузить
Функция ПроверитьТоварыНаСоответствиеТЧОтгружаемыеТовары(ТЧДокумента, КартаТоваров) Экспорт

    QtyMap = КопироватьСоответствие(КартаТоваров);

    // Расчет разностей по количествам товаров
    Для каждого СтрДок из ТЧДокумента цикл
 		Если СтрДок.Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отгрузить Тогда
	       	ТоварСсылка = 	СтрДок.Номенклатура;
			СерияСсылка = 	СтрДок.Серия;
			ХарактеристикаСсылка = 	СтрДок.Серия;
			КлючТовара = СоздатьКлючТовара(ТоварСсылка, СерияСсылка, ХарактеристикаСсылка);
			Если СтрДок.Упаковка.Пустая() Тогда
				КоличествоДокумента = СтрДок.КоличествоУпаковок;
			Иначе
				КоличествоДокумента = ПересчетВДругуюЕдиницу(СтрДок.КоличествоУпаковок, СтрДок.Упаковка, СтрДок.Номенклатура.ЕдиницаИзмерения);
			КонецЕсли;
			
	        Если QtyMap.Получить(КлючТовара) <> Неопределено Тогда
	            QtyMap.Вставить(КлючТовара, QtyMap.Получить(КлючТовара) - КоличествоДокумента);
	        Иначе
	            Если (КоличестваТовараНеРавны(КоличествоДокумента, 0.0)) Тогда
	                Возврат Ложь;
	            КонецЕсли;
	        КонецЕсли;
        КонецЕсли;
    КонецЦикла;

    // Проверка на разности количеств товаров
	Для каждого Элемент1 из QtyMap цикл
        Если (КоличестваТовараНеРавны(Элемент1.Значение, 0.0)) Тогда
            Возврат ложь;
        КонецЕсли;
    КонецЦикла;

    Возврат Истина;
КонецФункции

// #IBS 11.05.2023 Получить таблицу различий количеств товара по двух картам
Функция ПолучитьТаблицуРазличий(КартаТоваровДокумента, КартаТоваров) Экспорт
	ТаблицаРазличий = Новый ТаблицаЗначений;
	ТаблицаРазличий.Колонки.Добавить("Номенклатура");
	ТаблицаРазличий.Колонки.Добавить("Серия");
	ТаблицаРазличий.Колонки.Добавить("Характеристика");
	ТаблицаРазличий.Колонки.Добавить("ЕдиницаИзмерения");
	ТаблицаРазличий.Колонки.Добавить("КоличествоПоERP");
	ТаблицаРазличий.Колонки.Добавить("КоличествоПоWMS");
	ТоварСсылка 			= Неопределено;
	СерияСсылка 			= Неопределено;
	ХарактеристикаСсылка 	= Неопределено;

	Для Каждого Элемент1 Из КартаТоваровДокумента Цикл
		КоличествоПоWMS = КартаТоваров.Получить(Элемент1.Ключ);
		РазобратьКлючНаСсылки(Элемент1.Ключ, ТоварСсылка, СерияСсылка, ХарактеристикаСсылка);
		
		Если КоличествоПоWMS <> Неопределено Тогда
			Если Элемент1.Значение <> КоличествоПоWMS Тогда
				Строка = ТаблицаРазличий.Добавить();  
				Строка.Номенклатура 	= ТоварСсылка;
				Строка.Серия 			= СерияСсылка;
				Строка.Характеристика 	= ХарактеристикаСсылка;
				Строка.ЕдиницаИзмерения = Строка.Номенклатура.БазоваяЕдиницаИзмерения;
				Строка.КоличествоПоERP 	= Элемент1.Значение;
				Строка.КоличествоПоWMS 	= КоличествоПоWMS;
			КонецЕсли;
		Иначе
			Строка = ТаблицаРазличий.Добавить();  
			Строка.Номенклатура 		= ТоварСсылка;
			Строка.Серия 				= СерияСсылка;
			Строка.Характеристика 		= ХарактеристикаСсылка;
			Строка.ЕдиницаИзмерения 	= Строка.Номенклатура.БазоваяЕдиницаИзмерения;
			Строка.КоличествоПоERP 		= Элемент1.Значение;
			Строка.КоличествоПоWMS 		= 0.0;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Элемент1 Из КартаТоваров Цикл
		КоличествоПоERP = КартаТоваровДокумента.Получить(Элемент1.Ключ);
		Если КоличествоПоERP = Неопределено Тогда
			РазобратьКлючНаСсылки(Элемент1.Ключ, ТоварСсылка, СерияСсылка, ХарактеристикаСсылка);
			Строка 						= ТаблицаРазличий.Добавить();
			Строка.Номенклатура 		= ТоварСсылка;
			Строка.Серия 				= СерияСсылка;
			Строка.Характеристика 		= ХарактеристикаСсылка;
			Строка.ЕдиницаИзмерения 	= Строка.Номенклатура.БазоваяЕдиницаИзмерения;
			Строка.КоличествоПоERP 		= 0.0;
			Строка.КоличествоПоWMS 		= Элемент1.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаРазличий;
КонецФункции

// #IBS 15.12.2021 ДополнитьСтрокуПробелами
Функция ДополнитьСтрокуПробелами(Строка, ПолнаяДлина)
	Счетчик1 = ПолнаяДлина - СтрДлина(Строка);
	Пока Счетчик1 > 0 Цикл
		Строка = Строка + Символы.НПП;		
		Счетчик1 = Счетчик1 - 1;
	КонецЦикла;
	
	Возврат Строка;
КонецФункции	

// #IBS 19.02.2025 Пересчет количеств товара из одной единицы в другую (для КА1.1)
Функция ПересчетВДругуюЕдиницу(Количество, Единица1, Единица2) Экспорт
	Если Единица1.Пустая() ИЛИ Единица2.Пустая() Тогда
		Возврат неопределено; // Ошибка
	КонецЕсли; 
	
	Если Единица1 = Единица2 Тогда
		Возврат Количество;
	КонецЕсли;
	
	// #IBS 19.02.2025 Если ссылка на классификатор - то это пересчет в базовую или из базовой (код 868, 796), берем коэффициент 1
	Если ТипЗнч(Единица1) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		Коэффициент1 = 1.0;
	Иначе
		Коэффициент1 = Единица1.Коэффициент; 
	КонецЕсли;
	
	Если ТипЗнч(Единица2) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		Коэффициент2 = 1.0;
	Иначе
    	Коэффициент2 = Единица2.Коэффициент;
	КонецЕсли;

    Если Коэффициент2 <> 0.0 Тогда
        Возврат (Количество * Коэффициент1) / Коэффициент2;
    Иначе
        Возврат Количество; // #IBS 18.10.2023 есть кривые единицы штук, чтобы не было ошибки исключения
    КонецЕсли;
КонецФункции

// #IBS 01.02.2024 Пересчет количеств товара из Единицыв1 в базовую Единицу2
Функция ПересчетВБазовуюЕдиницу(Количество, Единица1, Единица2) Экспорт
	Если Единица1.Пустая() ИЛИ Единица2.Пустая() Тогда
		Возврат неопределено; // Ошибка
	КонецЕсли; 
	
	// Если единица не меняется, количество тоже.
	Если Единица1 = Единица2 Тогда
		Возврат Количество;
	КонецЕсли;
	
   	Коэффициент1 = ?(Единица1.Знаменатель = 0, Единица1.Числитель, Единица1.Числитель/Единица1.Знаменатель);

	// Для базовой по умолчанию коэффициент = 1
	Коэффициент2 = 1.0;

    Если Коэффициент2 <> 0.0 Тогда
        Возврат (Количество * Коэффициент1) / Коэффициент2;
    Иначе
        Возврат Количество; // На случай кривизны без коэффициента
    КонецЕсли;
КонецФункции

Функция КопироватьСоответствие(Карта1) Экспорт
    Карта2 = Новый Соответствие;
	Для каждого Элемент1 из Карта1 цикл
    	Карта2.Вставить(Элемент1.Ключ, Элемент1.Значение);
	КонецЦикла;

	Возврат Карта2;
КонецФункции

//	Изменить количества в строках документа сообразно карте количеств товаров
//	Карта товаров имеет составной ключ UID товара + UID серии
Процедура СкорректироватьТабличнуюЧасть(Документ, КартаТоваров, УдалятьСтроки = Истина) Экспорт
             
    QtyMap 				= КопироватьСоответствие(КартаТоваров);
	КартаЦен 			= Новый Соответствие;
	КартаУдалений 		= Новый Соответствие;
	ТабЧасть 			= Документ.Метаданные().ТабличныеЧасти.Найти("Товары");
    ЕстьУпаковки 		= ТабЧасть <> Неопределено И ТабЧасть.Реквизиты.Найти("ЕдиницаИзмеренияМест") <> Неопределено;  
	ЕстьСумма	 		= ТабЧасть <> Неопределено И ТабЧасть.Реквизиты.Найти("Сумма") <> Неопределено;
	ЕстьСуммаНДС 		= ТабЧасть <> Неопределено И ТабЧасть.Реквизиты.Найти("СуммаНДС") <> Неопределено;	
	ТоварСсылка 		= Неопределено;
	СерияСсылка 		= Неопределено;
	ХарактеристикаСсылка = Неопределено;
	ТипЗнчДокумент		= ТипЗнч(Документ);
	НеИзменятьКоличество = Ложь;
	
	Если ТипЗнчДокумент = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		Если ЗначениеЗаполнено(Документ.Контрагент) Тогда
			НеИзменятьКоличество = Документ.Контрагент.НеУдалятьКратность;
		КонецЕсли;
	КонецЕсли;    
	
	//	Использование серий в интеграции
	ИспользоватьСерии = Константы.EmeWmsИспользоватьСерии.Получить();	
	
    // Если карта пустая - во все строки кол-во ноль, иначе методы MAP дают ошибку
	Если QtyMap.Количество() = 0 Тогда 
		Для Каждого СтрокаТовара Из Документ.Товары Цикл 
			Если НеИзменятьКоличество Тогда
				СтрокаТовара.EmeWmsКорректировка = Истина;
			Иначе			
	            СтрокаТовара.Количество = 0.0;
			КонецЕсли;
		КонецЦикла;
    Иначе
        // Минимальное кол-во записываем в строку документа и вычитаем из карты.
        Для Каждого СтрокаТовара Из Документ.Товары Цикл
            ТоварСсылка			 = СтрокаТовара.Номенклатура;
			СерияСсылка			 = ?(ИспользоватьСерии, СтрокаТовара.СерияНоменклатуры, Неопределено);
			ХарактеристикаСсылка = СтрокаТовара.ХарактеристикаНоменклатуры;
			// + #COA Чепиков 21.02.2025 количество с учетом коэффициента в строке документа
			//КартаЦен.Вставить(СтрокаТовара.Номенклатура, ПолучитьЦенуСтроки(ТипЗнчДокумент, СтрокаТовара));
			Коэффициент 		 = ?(СтрокаТовара.Коэффициент > 0, СтрокаТовара.Коэффициент, 1);			
			КартаЦен.Вставить(СтрокаТовара.Номенклатура, ПолучитьЦенуСтроки(ТипЗнчДокумент, СтрокаТовара)/Коэффициент);			
			// - 						
			КлючТовара			 = СоздатьКлючТовара(ТоварСсылка, СерияСсылка, ХарактеристикаСсылка);
			Если QtyMap.Получить(КлючТовара) <> Неопределено Тогда
				// +
                //МинКол = Мин(СтрокаТовара.Количество, QtyMap.Получить(КлючТовара));
				КолвоЕИ = Цел(QtyMap.Получить(КлючТовара)/Коэффициент);				
                МинКол = Мин(СтрокаТовара.Количество, КолвоЕИ);        				
				// -
                НовоеКоличество = МинКол;
				Если СтрокаТовара.Количество <> НовоеКоличество Тогда
					Если НеИзменятьКоличество Тогда
						СтрокаТовара.EmeWmsКорректировка = Истина;
					Иначе
                		СтрокаТовара.Количество = НовоеКоличество;
					КонецЕсли;
					// +
					//Если ЕстьУпаковки Тогда
					//	Если СтрокаТовара.ЕдиницаИзмеренияМест.Пустая() Тогда
					//		КоличествоУпаковок = СтрокаТовара.Количество;
					//	Иначе
					//		КоличествоУпаковок = ПересчетВДругуюЕдиницу(СтрокаТовара.Количество, 
					//													СтрокаТовара.ЕдиницаИзмерения,
					//													СтрокаТовара.ЕдиницаИзмеренияМест);
					//	КонецЕсли;
					//	СтрокаТовара.КоличествоМест = КоличествоУпаковок;
					//КонецЕсли;
					ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТовара, Документ);					
					// - 
					ПриИзмененииКоличестваТовары(СтрокаТовара, Документ, ЕстьУпаковки, ЕстьСумма, ЕстьСуммаНДС);
				КонецЕсли;
				// +
                //QtyMap.Вставить(КлючТовара, QtyMap.Получить(КлючТовара) - МинКол);
                QtyMap.Вставить(КлючТовара, QtyMap.Получить(КлючТовара) - МинКол*Коэффициент);				
				// -
			Иначе   
				Если НеИзменятьКоличество Тогда
					СтрокаТовара.EmeWmsКорректировка = Истина;					
				Иначе				
	                СтрокаТовара.Количество = 0.0;
				КонецЕсли;
				ПриИзмененииКоличестваТовары(СтрокаТовара, Документ, ЕстьУпаковки, ЕстьСумма, ЕстьСуммаНДС);
			КонецЕсли;
			Если СтрокаТовара.Количество = 0.0 Тогда 
				КартаУдалений.Вставить(СтрокаТовара, СтрокаТовара);
            КонецЕсли;
        КонецЦикла;

        // Добавляем остаточные количества из карты в строку документа. Обнуляем кол-во в карте.
        Для Каждого СтрокаТовара Из Документ.Товары Цикл
            ТоварСсылка 		 = СтрокаТовара.Номенклатура;
			СерияСсылка 		 = ?(ИспользоватьСерии, СтрокаТовара.СерияНоменклатуры, Неопределено);
			ХарактеристикаСсылка = СтрокаТовара.ХарактеристикаНоменклатуры;
			КлючТовара 			 = СоздатьКлючТовара(ТоварСсылка, СерияСсылка, ХарактеристикаСсылка);
            КоличествоПоКарте 	 = ?(QtyMap.Получить(КлючТовара) = Неопределено, 0.0, QtyMap.Получить(КлючТовара));
			// +
			//Если КоличествоПоКарте > 0.0000001 Тогда
			//    НовоеКоличество = КоличествоПоКарте;
			Коэффициент 		 = ?(СтрокаТовара.Коэффициент > 0, СтрокаТовара.Коэффициент, 1);			
			КолвоЕИ 			 = Цел(КоличествоПоКарте/Коэффициент); 
			Если КолвоЕИ > 0.0000001 Тогда				
                НовоеКоличество = КолвоЕИ;
			// -			           
				Если НеИзменятьКоличество Тогда
					СтрокаТовара.EmeWmsКорректировка = Истина;
				Иначе				
	                СтрокаТовара.Количество = СтрокаТовара.Количество + НовоеКоличество;
				КонецЕсли;
			
				// +
				//Если ЕстьУпаковки Тогда
				//	Если СтрокаТовара.ЕдиницаИзмеренияМест.Пустая() Тогда
				//		КоличествоУпаковок = СтрокаТовара.Количество;
				//	Иначе
				//		КоличествоУпаковок = ПересчетВДругуюЕдиницу(СтрокаТовара.Количество, 
				//													СтрокаТовара.ЕдиницаИзмерения,
				//													СтрокаТовара.ЕдиницаИзмеренияМест);
				//	КонецЕсли;
				//   	СтрокаТовара.КоличествоМест = КоличествоУпаковок;
				//КонецЕсли;
				ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТовара, Документ);				
				// -
				ПриИзмененииКоличестваТовары(СтрокаТовара, Документ, ЕстьУпаковки, ЕстьСумма, ЕстьСуммаНДС);
				// +
				//QtyMap.Вставить(КлючТовара, 0.0);
                QtyMap.Вставить(КлючТовара, КоличествоПоКарте - НовоеКоличество*Коэффициент);				
				// -
            КонецЕсли;
		КонецЦикла;
		
		Если НеИзменятьКоличество Тогда		
			Возврат;
		КонецЕсли;
		
        // Бежим по карте. Для ненулевых кол-во добавляем новые строки.
		ТЧТовары = Документ.Товары;
        Для Каждого Элемент1 Из QtyMap Цикл
            КоличествоПоКарте= Элемент1.Значение;
			РазобратьКлючНаСсылки(Элемент1.Ключ, ТоварСсылка, СерияСсылка, ХарактеристикаСсылка);
            Если (НЕ ТоварСсылка.Пустая()) И (КоличествоПоКарте > 0.0000001) Тогда
                // Добавить новую строку для товара, которого не было в документе
				СтрокаТовара = ТЧТовары.Добавить();
				СтрокаТовара.Номенклатура 				= ТоварСсылка;
				// +
				СтрокаТовара.ЕдиницаИзмерения 			= ПолучитьБазовуюЕдиницуИзмерения(ТоварСсылка);
				СтрокаТовара.Коэффициент 				= СтрокаТовара.ЕдиницаИзмерения.Коэффициент;
				// -
				ПриИзмененииНоменклатурыСтрокиТЧ(СтрокаТовара, Документ); // Вызывать только до записи серий и количеств!
                СтрокаТовара.СерияНоменклатуры 			= СерияСсылка;
                СтрокаТовара.ХарактеристикаНоменклатуры = ХарактеристикаСсылка;
                СтрокаТовара.Количество 				= КоличествоПоКарте;
				// +
				//Если ЕстьУпаковки Тогда
				//	Если СтрокаТовара.ЕдиницаИзмеренияМест.Пустая() Тогда
				//		КоличествоУпаковок = СтрокаТовара.Количество;
				//	Иначе
				//		КоличествоУпаковок = ПересчетВДругуюЕдиницу(СтрокаТовара.Количество, 
				//													СтрокаТовара.ЕдиницаИзмерения,
				//													СтрокаТовара.ЕдиницаИзмеренияМест);
				//	КонецЕсли;
				//   	СтрокаТовара.КоличествоМест = КоличествоУпаковок;
				//КонецЕсли;
				//СтрокаТовара.ЕдиницаИзмеренияМест 		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТоварСсылка, "ЕдиницаИзмеренияМест");
				ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТовара, Документ);									
				// -
				УстановитьЦенуСтроки(Документ, СтрокаТовара, КартаЦен.Получить(ТоварСсылка));
				ПриИзмененииКоличестваТовары(СтрокаТовара, Документ, ЕстьУпаковки, ЕстьСумма, ЕстьСуммаНДС);
            КонецЕсли;
		КонецЦикла;
		
		// Корректно удалить строки с количеством ноль
		Если УдалятьСтроки Тогда
			Для каждого Элемент1 из КартаУдалений Цикл
				Документ.Товары.Удалить(Элемент1.Значение);
			КонецЦикла;		
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// #IBS 19.02.2025 Изменить количества в строках ТЧ документа сообразно карте количеств товаров (для КА1.1)
// Карта товаров имеет составной ключ UID товара + UID серии + UID характеристики
Процедура СкорректироватьТЧДокумента(ТЧДокумента, КартаТоваров, УдалятьСтроки = Истина, ЕстьУпаковки = Истина) Экспорт
             
	//	Использование серий в интеграции
	ИспользоватьСерии 	 = Константы.EmeWmsИспользоватьСерии.Получить();	
	
	QtyMap = КопироватьСоответствие(КартаТоваров);
	КартаУдалений 		 = Новый Соответствие; 
	ТоварСсылка 		 = Неопределено;
	СерияСсылка 		 = Неопределено;
	ХарактеристикаСсылка = Неопределено;
	
    // Если карта пустая - во все строки кол-во ноль, иначе методы MAP дают ошибку
    Если QtyMap.Количество() = 0 Тогда
        Для каждого СтрокаТовара из ТЧДокумента Цикл 
            СтрокаТовара.Количество = 0.0; 
        КонецЦикла;
    Иначе
        // Минимальное кол-во записываем в строку документа и вычитаем из карты.
        Для каждого СтрокаТовара из ТЧДокумента цикл
            ТоварСсылка = СтрокаТовара.Номенклатура;
			СерияСсылка = ?(ИспользоватьСерии, СтрокаТовара.СерияНоменклатуры, Неопределено);
			ХарактеристикаСсылка = 	СтрокаТовара.ХарактеристикаНоменклатуры;
			КлючТовара = СоздатьКлючТовара(ТоварСсылка, СерияСсылка, ХарактеристикаСсылка);
            Если QtyMap.Получить(КлючТовара) <> неопределено Тогда
                МинКол = Мин(СтрокаТовара.Количество, QtyMap.Получить(КлючТовара));
                НовоеКоличество = МинКол;
				Если СтрокаТовара.Количество <> НовоеКоличество Тогда
                	СтрокаТовара.Количество = НовоеКоличество;
					Если ЕстьУпаковки Тогда
						Если СтрокаТовара.ЕдиницаИзмеренияМест.Пустая() Тогда
							КоличествоУпаковок = СтрокаТовара.Количество;
						Иначе
							КоличествоУпаковок = ПересчетВДругуюЕдиницу(СтрокаТовара.Количество, СтрокаТовара.ЕдиницаИзмерения, СтрокаТовара.ЕдиницаИзмеренияМест);
						КонецЕсли;
	                	СтрокаТовара.КоличествоМест = КоличествоУпаковок;
					КонецЕсли;
				КонецЕсли;
                QtyMap.Вставить(КлючТовара, QtyMap.Получить(КлючТовара) - МинКол);
            Иначе
                СтрокаТовара.Количество = 0.0;
			КонецЕсли;
			Если СтрокаТовара.Количество = 0.0 Тогда 
				КартаУдалений.Вставить(СтрокаТовара, СтрокаТовара);
            КонецЕсли;
        КонецЦикла;

        // Добавляем остаточные количества из карты в строку документа. Обнуляем кол-во в карте.
        Для каждого СтрокаТовара из ТЧДокумента цикл
            ТоварСсылка = СтрокаТовара.Номенклатура;
			СерияСсылка = ?(ИспользоватьСерии, СтрокаТовара.СерияНоменклатуры, Неопределено);
			ХарактеристикаСсылка = 	СтрокаТовара.ХарактеристикаНоменклатуры;
			КлючТовара = СоздатьКлючТовара(ТоварСсылка, СерияСсылка, ХарактеристикаСсылка);
            КоличествоПоКарте = ?(QtyMap.Получить(КлючТовара) = неопределено, 0.0, QtyMap.Получить(КлючТовара));
            Если КоличествоПоКарте > 0.0000001 Тогда
                НовоеКоличество = КоличествоПоКарте;
                СтрокаТовара.Количество = СтрокаТовара.Количество + НовоеКоличество;
				Если ЕстьУпаковки Тогда
					Если СтрокаТовара.ЕдиницаИзмеренияМест.Пустая() Тогда
						КоличествоУпаковок = СтрокаТовара.Количество;
					Иначе
						КоличествоУпаковок = ПересчетВДругуюЕдиницу(СтрокаТовара.Количество, СтрокаТовара.ЕдиницаИзмерения, СтрокаТовара.ЕдиницаИзмеренияМест);
					КонецЕсли;
	               	СтрокаТовара.КоличествоМест = КоличествоУпаковок;
				КонецЕсли;
                QtyMap.Вставить(КлючТовара, 0.0);
            КонецЕсли;
		КонецЦикла;

        // Бежим по карте. Для ненулевых кол-во добавляем новые строки.
        Для каждого Элемент1 из QtyMap Цикл
            КоличествоПоКарте= Элемент1.Значение;    
			РазобратьКлючНаСсылки(Элемент1.Ключ, ТоварСсылка, СерияСсылка, ХарактеристикаСсылка);
            Если (НЕ ТоварСсылка.Пустая()) И (КоличествоПоКарте > 0.0000001) Тогда
                // Добавить новую строку для товара, которого не было в документе
				СтрокаТовара = ТЧДокумента.Добавить();
				СтрокаТовара.Номенклатура = ТоварСсылка;
                СтрокаТовара.СерияНоменклатуры = СерияСсылка;
                СтрокаТовара.ХарактеристикаНоменклатуры = ХарактеристикаСсылка;
                СтрокаТовара.Количество = КоличествоПоКарте;
                СтрокаТовара.ЕдиницаИзмерения = ТоварСсылка.ЕдиницаХраненияОстатков;
				Если ЕстьУпаковки Тогда
					Если СтрокаТовара.ЕдиницаИзмеренияМест.Пустая() Тогда
						КоличествоУпаковок = СтрокаТовара.Количество;
					Иначе
						КоличествоУпаковок = ПересчетВДругуюЕдиницу(СтрокаТовара.Количество, СтрокаТовара.ЕдиницаИзмерения, СтрокаТовара.ЕдиницаИзмеренияМест);
					КонецЕсли;
	               	СтрокаТовара.КоличествоМест = КоличествоУпаковок;
				КонецЕсли;
            КонецЕсли;
		КонецЦикла;
		
		// Корректно удалить строки с количеством ноль
		Если УдалятьСтроки Тогда
			Для каждого Элемент1 из КартаУдалений Цикл
				ТЧДокумента.Удалить(Элемент1.Значение);
			КонецЦикла;		
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// #IBS Ширяев 25.04.2024 Заполнить поле КоличествоФакт по строкам ТЧ по EmeWmsУИДСтроки из карты количеств
//	Возвращает нераспределенный остаток (ошибка) или неопределено
Функция ЗаполнитьКоличестваФактПоСтрокамТЧ(ТЧТовары, КартаСтрок) Экспорт
	Для каждого СтрокаТЧ из ТЧТовары Цикл
		КлючСтроки = СтрокаТЧ.EmeWmsУИДСтроки;
		СтрокаТЧ.КоличествоФакт = ?(КартаСтрок.Получить(КлючСтроки) = неопределено, 0.0, КартаСтрок.Получить(КлючСтроки));
		КартаСтрок.Вставить(КлючСтроки, 0.0);
	КонецЦикла;
	
	// Проверки остатка распределения
	ОписаниеОшибки = Неопределено;
    Для каждого Элемент1 из КартаСтрок Цикл
		Если Элемент1.Значение > 0.0 Тогда
			ОписаниеОшибки = "Нераспределено количество " + Элемент1.Значение + " для строки c УИД = " + Элемент1.Ключ;
			прервать;
		КонецЕсли;
	КонецЦикла;

	Возврат ОписаниеОшибки;
КонецФункции
	
// #IBS 21.03.2025 Декомпозиция ключа товара на ссылки
Процедура РазобратьКлючНаСсылки(Ключ, ТоварСсылка, СерияСсылка, ХарактеристикаСсылка) Экспорт
	МассивКлючей = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Ключ, "#");  
	ТоварСсылка = ПолучитьСсылкуНаТовар(МассивКлючей[0]);
	СерияСсылка = ПолучитьСсылкуНаСериюНоменклатур(МассивКлючей[1]);
	ХарактеристикаСсылка = 	ПолучитьСсылкуНаХарактеристикуНоменклатур(МассивКлючей[2]);
КонецПроцедуры

// #IBS 038.05.2023 Изменить количества в строках ТЧ Отгружаемые товары расходного ордера без удаления строк, с изменением статуса, по карте количеств товаров
// Карта товаров имеет составной ключ UID товара + UID серии
Процедура СкорректироватьТЧОтгружаемыеТовары(ТЧДокумента, КартаТоваров, УдалятьСтроки = Истина, ЕстьУпаковки = Истина) Экспорт
             
    QtyMap = КопироватьСоответствие(КартаТоваров);
	КартаУдалений = Новый Соответствие; 
	ТаблицаДобавлений = Новый ТаблицаЗначений;
	РазметитьТаблицуДобавлений(ТаблицаДобавлений);
    // Если карта пустая - во все строки кол-во ноль, иначе методы MAP дают ошибку
    Если QtyMap.Количество() = 0 Тогда
		Для каждого СтрокаТовара из ТЧДокумента Цикл   
			СтрокаДобавлений = ТаблицаДобавлений.Добавить();
			СкопироватьСтрокуДобавлений(СтрокаДобавлений, СтрокаТовара);
			СтрокаДобавлений.Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.НеОтгружать;
			// В ТЧ отгружаемые товары поставить на всех строках действие НеОтгружать
            // СтрокаТовара.Количество = 0.0;
			СтрокаТовара.Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.НеОтгружать;
        КонецЦикла;
    Иначе
        // Минимальное кол-во записываем в строку документа и вычитаем из карты.
		Для каждого СтрокаТовара из ТЧДокумента цикл
			// #IBS 03.05.2023 по умолчанию для всех строк действие Отрузить
			СтрокаТовара.Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отгрузить;
            ТоварСсылка = СтрокаТовара.Номенклатура;
			СерияСсылка = 	СтрокаТовара.Серия;
			ХарактеристикаСсылка = 	СтрокаТовара.Характеристика;
			КлючТовара = СоздатьКлючТовара(ТоварСсылка, СерияСсылка, ХарактеристикаСсылка);
            Если QtyMap.Получить(КлючТовара) <> неопределено Тогда
                МинКол = Мин(СтрокаТовара.Количество, QtyMap.Получить(КлючТовара));
                НовоеКоличество = МинКол;     
				
				// #IBS 03.05.2023 Делить строку
				Если СтрокаТовара.Количество > НовоеКоличество Тогда
					СтрокаДобавлений = ТаблицаДобавлений.Добавить();
					СкопироватьСтрокуДобавлений(СтрокаДобавлений, СтрокаТовара);
					СтрокаДобавлений.Количество = СтрокаТовара.Количество - НовоеКоличество;
					Если СтрокаДобавлений.Упаковка.Пустая() Тогда
						КоличествоУпаковок = СтрокаДобавлений.Количество;
					Иначе
						КоличествоУпаковок = ПересчетВДругуюЕдиницу(СтрокаДобавлений.Количество, СтрокаДобавлений.Номенклатура.ЕдиницаИзмерения, СтрокаДобавлений.Упаковка);
					КонецЕсли;
                	СтрокаДобавлений.КоличествоУпаковок = КоличествоУпаковок;
				КонецЕсли;          
				
				Если СтрокаТовара.Количество <> НовоеКоличество Тогда
                	СтрокаТовара.Количество = НовоеКоличество;
					Если ЕстьУпаковки Тогда
						Если СтрокаТовара.Упаковка.Пустая() Тогда
							КоличествоУпаковок = СтрокаТовара.Количество;
						Иначе
							КоличествоУпаковок = ПересчетВДругуюЕдиницу(СтрокаТовара.Количество, СтрокаТовара.Номенклатура.ЕдиницаИзмерения, СтрокаТовара.Упаковка);
						КонецЕсли;
	                	СтрокаТовара.КоличествоУпаковок = КоличествоУпаковок;
					КонецЕсли;
				КонецЕсли;
                QtyMap.Вставить(КлючТовара, QtyMap.Получить(КлючТовара) - МинКол);
            Иначе
				СтрокаДобавлений = ТаблицаДобавлений.Добавить();
				СкопироватьСтрокуДобавлений(СтрокаДобавлений, СтрокаТовара);
				СтрокаДобавлений.Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.НеОтгружать;
                СтрокаТовара.Количество = 0.0;
			КонецЕсли;
			Если СтрокаТовара.Количество = 0.0 Тогда 
				КартаУдалений.Вставить(СтрокаТовара, СтрокаТовара);
            КонецЕсли;
        КонецЦикла;

        // Добавляем остаточные количества из карты в строку документа. Обнуляем кол-во в карте.
        Для каждого СтрокаТовара из ТЧДокумента цикл
            ТоварСсылка = СтрокаТовара.Номенклатура;
			СерияСсылка = 	СтрокаТовара.Серия;
			ХарактеристикаСсылка = 	СтрокаТовара.Характеристика;
			КлючТовара = СоздатьКлючТовара(ТоварСсылка, СерияСсылка, ХарактеристикаСсылка);
            КоличествоПоКарте = ?(QtyMap.Получить(КлючТовара) = неопределено, 0.0, QtyMap.Получить(КлючТовара));
            Если КоличествоПоКарте > 0.0000001 Тогда
                НовоеКоличество = КоличествоПоКарте;
                СтрокаТовара.Количество = СтрокаТовара.Количество + НовоеКоличество;
				Если ЕстьУпаковки Тогда
					Если СтрокаТовара.Упаковка.Пустая() Тогда
						КоличествоУпаковок = СтрокаТовара.Количество;
					Иначе
						КоличествоУпаковок = ПересчетВДругуюЕдиницу(СтрокаТовара.Количество, СтрокаТовара.Номенклатура.ЕдиницаИзмерения, СтрокаТовара.Упаковка);
					КонецЕсли;
	               	СтрокаТовара.КоличествоУпаковок = КоличествоУпаковок;
				КонецЕсли;
                QtyMap.Вставить(КлючТовара, 0.0);
            КонецЕсли;
		КонецЦикла;

        // Бежим по карте. Для ненулевых кол-во добавляем новые строки.
        Для каждого Элемент1 из QtyMap Цикл
            КоличествоПоКарте= Элемент1.Значение;
			РазобратьКлючНаСсылки(Элемент1.Ключ, ТоварСсылка, СерияСсылка, ХарактеристикаСсылка);
            Если (НЕ ТоварСсылка.Пустая()) И (КоличествоПоКарте > 0.0000001) Тогда
                // Добавить новую строку для товара, которого не было в документе
				СтрокаТовара = ТЧДокумента.Добавить();
				СтрокаТовара.Номенклатура = ТоварСсылка;
                СтрокаТовара.Серия = СерияСсылка;
                СтрокаТовара.Характеристика = ХарактеристикаСсылка;
                СтрокаТовара.Количество = КоличествоПоКарте;                                      
				// #IBS 03.05.2023 
				СтрокаТовара.Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отгрузить;
				Если ЕстьУпаковки Тогда
					Если СтрокаТовара.Упаковка.Пустая() Тогда
						КоличествоУпаковок = СтрокаТовара.Количество;
					Иначе
						КоличествоУпаковок = ПересчетВДругуюЕдиницу(СтрокаТовара.Количество, СтрокаТовара.Номенклатура.ЕдиницаИзмерения, СтрокаТовара.Упаковка);
					КонецЕсли;
	               	СтрокаТовара.КоличествоУпаковок = КоличествоУпаковок;
				КонецЕсли;
            КонецЕсли;
		КонецЦикла;
		
		// Корректно удалить строки с количеством ноль
		Если УдалятьСтроки Тогда
			Для каждого Элемент1 из КартаУдалений Цикл
				ТЧДокумента.Удалить(Элемент1.Значение);
			КонецЦикла;		
		КонецЕсли;
		
		// #IBS 03.05.2023 добавить строки со статусом НеОтгружать
		Для каждого СтрокаДобавлений из ТаблицаДобавлений Цикл  
			СтрокаТовара = ТЧДокумента.Добавить();
			СкопироватьСтрокуДобавлений(СтрокаТовара, СтрокаДобавлений);
		КонецЦикла;		
	КонецЕсли;
КонецПроцедуры

Процедура РазметитьТаблицуДобавлений(ТаблицаДобавлений)
	ТаблицаДобавлений.Колонки.Добавить("Номенклатура");
	ТаблицаДобавлений.Колонки.Добавить("Характеристика");
	ТаблицаДобавлений.Колонки.Добавить("Назначение");
	ТаблицаДобавлений.Колонки.Добавить("Серия");
	ТаблицаДобавлений.Колонки.Добавить("СтатусУказанияСерий");
	ТаблицаДобавлений.Колонки.Добавить("Упаковка");
	ТаблицаДобавлений.Колонки.Добавить("Количество");
	ТаблицаДобавлений.Колонки.Добавить("КоличествоУпаковок");
	ТаблицаДобавлений.Колонки.Добавить("Действие");
КонецПроцедуры 

Процедура СкопироватьСтрокуДобавлений(СтрокаДобавлений, СтрокаТЧ)
	СтрокаДобавлений.Номенклатура = СтрокаТЧ.Номенклатура;
	СтрокаДобавлений.Характеристика = СтрокаТЧ.Характеристика;
	СтрокаДобавлений.Назначение = СтрокаТЧ.Назначение;
	СтрокаДобавлений.Серия 	= СтрокаТЧ.Серия;
	СтрокаДобавлений.СтатусУказанияСерий = СтрокаТЧ.СтатусУказанияСерий;
	СтрокаДобавлений.Упаковка = СтрокаТЧ.Упаковка;
	СтрокаДобавлений.Количество = СтрокаТЧ.Количество;
	СтрокаДобавлений.КоличествоУпаковок = СтрокаТЧ.КоличествоУпаковок;
	СтрокаДобавлений.Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.НеОтгружать;
КонецПроцедуры 

//	Получить цену из строки ТЧ сообразно типу документа
Функция ПолучитьЦенуСтроки(ТипЗнчДокумент, СтрокаТЧ)  
	
	Если ТипЗнчДокумент = Тип("ДокументОбъект.ПоступлениеТоваровУслуг") Тогда
		Возврат СтрокаТЧ.Цена;
	ИначеЕсли ТипЗнчДокумент = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		Возврат СтрокаТЧ.Цена;
	ИначеЕсли ТипЗнчДокумент = Тип("ДокументОбъект.ВозвратТоваровОтПокупателя") Тогда
		Возврат СтрокаТЧ.Цена;
	Иначе
		Возврат 0.0;
	КонецЕсли;
	
КонецФункции

// #IBS 06.03.2023 Установить цену в строке ТЧ сообразно типу документа 
// Если в карте цен нет цен (например, новый документ) не устанавливать ничего,
// в цене может быть уже установленная по штатному алгоритму выбора номенклатур
Процедура УстановитьЦенуСтроки(Документ, СтрокаТЧ, Цена)
	Если Цена = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ТипЗнч(Документ) = Тип("ДокументОбъект.ПеремещениеТоваров") Тогда
		// СтрокаТЧ.Цена = Цена;
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		СтрокаТЧ.Цена = Цена;
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументОбъект.ВозвратТоваровОтПокупателя") Тогда
		СтрокаТЧ.Цена = Цена;
	КонецЕсли;
	
КонецПроцедуры

// #IBS 15.12.2021 Инициализация при изменении номенклатуры в строке товаров документа
Процедура ПриИзмененииНоменклатурыСтрокиТЧ(СтрокаТовара, ДокументОбъект)
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПеремещениеТоваров") Тогда
		ПеремещениеПриИзмененииНоменклатурыТовара(СтрокаТовара, ДокументОбъект);
	ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		РеализацияПриИзмененииНоменклатурыТовара(СтрокаТовара, ДокументОбъект);
	//ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ВозвратТоваровОтПокупателя") Тогда
	//	ВозвратТоваровОтПокупателяПриИзмененииНоменклатуры(СтрокаТовара, ДокументОбъект);
	КонецЕсли;
КонецПроцедуры

//	Пересчет упаковок в строке товара
Процедура ПриИзмененииКоличестваТовары(СтрокаТабличнойЧасти, ДокументОбъект, ЕстьУпаковки = Истина, ЕстьСумма = Истина, ЕстьСуммаНДС = Истина)
		
	// Рассчитать реквизиты табличной части.
	ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);

	// Рассчитать реквизиты табличной части.   
	Если ЕстьСумма Тогда
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект); 
		
		Если ЕстьСуммаНДС Тогда
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
		КонецЕсли;
	КонецЕсли;	              
	
КонецПроцедуры // ПриИзмененииКоличестваТовары()

// Процедура выполняет необходимые действия при изменении номенклатуры в ТЧ "Товары".
//
// Параметры:
//  Элемент - ЭУ, для которого вызван обработчик.
//
Процедура РеализацияПриИзмененииНоменклатурыТовара(СтрокаТабличнойЧасти, РТУ)

	// Выполнить общие действия для всех документов при изменении номенклатуры.
	//ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(СтрокаТабличнойЧасти, РТУ);
	ЗаполнитьСчетаУчетаВСтрокеТабЧастиРегл(СтрокаТабличнойЧасти, "Товары", РТУ);
	ПриИзмененииНоменклатурыТоваров(СтрокаТабличнойЧасти, РТУ);

	// Рассчитать реквизиты табличной части.
	//ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, РТУ);
	//ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, РТУ);
	//ОбработкаТабличныхЧастей.ЗаполнитьКодТНВЭД(СтрокаТабличнойЧасти);

	// СчетБУ = СтрокаТабличнойЧасти.СчетДоходовБУ;
	// СчетНУ = СтрокаТабличнойЧасти.СчетДоходовНУ;

	//УчетСерийныхНомеров.ПроверитьСерийныеНомера(СтрокаТабличнойЧасти, РТУ);

	// Ввод состава набора
	//УправлениеЗапасами.ДобавитьСоставНабора(СтрокаТабличнойЧасти, РТУ);

	//СтрокаТабличнойЧасти.ПрослеживаемыйТовар = СтрокаТабличнойЧасти.Номенклатура.КодТНВЭД.ПрослеживаемыйТовар;
	//СтрокаТабличнойЧасти.АвтоподборРНПТ = Истина;

КонецПроцедуры // ПриИзмененииНоменклатурыТовары()

// Процедура - обработчик события "ПриИзменении" поля ввода номенклатуры
// в строке табличной части "Товары".
//
Процедура ПеремещениеПриИзмененииНоменклатурыТовара(СтрокаТабличнойЧасти, ДокументОбъект)

	// Выполнить общие действия для всех документов при изменении номенклатуры.
	//ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);

	// Берем из самого реквизита Номенклатура
	//СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаТабличнойЧасти.Номенклатура.ЕдиницаИзмерения;
	//СтрокаТабличнойЧасти.Коэффициент      = СтрокаТабличнойЧасти.ЕдиницаИзмерения.Коэффициент;

	//ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуМестТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
	
	// УстановитьЦенуНоменклатуры(ДокументОбъект, СтрокаТабличнойЧасти);

	ЗаполнитьСчетаУчетаВСтрокеТабЧастиРегл(СтрокаТабличнойЧасти, "Товары", ДокументОбъект);
	
	//СтрокаТабличнойЧасти.Качество = Справочники.Качество.Новый;

КонецПроцедуры // ТоварыНоменклатураПриИзменении()

// Процедура - обработчик события "ПриИзменении" поля ввода номенклатуры
// в строке табличной части "Товары".
//
Процедура ВозвратТоваровОтПокупателяПриИзмененииНоменклатуры(СтрокаТабличнойЧасти, Документ)

	// Выполнить общие действия для всех документов при изменении номенклатуры.
	//ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(СтрокаТабличнойЧасти, Документ);

	//ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(СтрокаТабличнойЧасти, Документ, "Реализация"); 
	//ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуЦенуПродажиТабЧасти(СтрокаТабличнойЧасти, Документ, глЗначениеПеременной("ВалютаРегламентированногоУчета")); 
	
	// Рассчитываем реквизиты табличной части.
	//ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, Документ);
	//ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, Документ);

	//СчетаУчетаВДокументах.ЗаполнитьСчетаУчетаТабличнойЧасти("Товары", Документ.Товары, Документ, Документ.ОтражатьВБухгалтерскомУчете, Документ.ОтражатьВНалоговомУчете);
	//ТоварыПриАктивизацииСтроки(Элемент);
	
	//УчетСерийныхНомеров.ПроверитьСерийныеНомера(СтрокаТабличнойЧасти, Документ);

	// Ввод состава набора
	//УправлениеЗапасами.ДобавитьСоставНабора(СтрокаТабличнойЧасти, Документ);

	СтрокаТабличнойЧасти.ПрослеживаемыйТовар = СтрокаТабличнойЧасти.Номенклатура.КодТНВЭД.ПрослеживаемыйТовар;
КонецПроцедуры // ТоварыНоменклатураПриИзменении()

// Производит заполнение и установку необходимых полей при изменении товара в табличной части.
// Вызывается из:
//  ТоварыНоменклатураПриИзменении()
//  ВнешнееСобытие()
//
Процедура ПриИзмененииНоменклатурыТоваров(СтрокаТабличнойЧасти, РТУ)

	// Заполняем реквизиты табличной части.
	//ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(СтрокаТабличнойЧасти, РТУ, "Реализация");
	//ОбработкаТабличныхЧастей.ЗаполнитьСпособСписанияОстаткаТоваровТабЧасти(СтрокаТабличнойЧасти, РТУ);

	// Заполнение цены зависит от розничности операции.
	//ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуЦенуПродажиТабЧасти(СтрокаТабличнойЧасти, РТУ, глЗначениеПеременной("ВалютаРегламентированногоУчета")); 

КонецПроцедуры

//Выполняет заполнение счетов учета в переданной строке табличной части
//
Процедура ЗаполнитьСчетаУчетаВСтрокеТабЧастиРегл(СтрокаТЧ, ИмяТабЧасти, РТУ)
	
	ЗаполнитьСчетаУчетаВТабЧасти(СтрокаТЧ, ИмяТабЧасти, РТУ);
	
КонецПроцедуры // ЗаполнитьСчетаУчетаВСтрокеТабЧасти()

// Заполняет счета БУ и НУ в табличной части документа
//
Процедура ЗаполнитьСчетаУчетаВТабЧасти(ТабличнаяЧасть, ИмяТабЧасти, РТУ)
	
	//СчетаУчетаВДокументах.ЗаполнитьСчетаУчетаТабличнойЧасти(ИмяТабЧасти, ТабличнаяЧасть, РТУ, РТУ.ОтражатьВБухгалтерскомУчете, РТУ.ОтражатьВНалоговомУчете);
	
КонецПроцедуры // обЗаполнитьСчетаУчетаВТабЧасти()

// Производит заполнение и установку необходимых полей при изменении товара в табличной части.
// Вызывается из:
//  ТоварыНоменклатураПриИзменении() 
//  ВнешнееСобытие()
//
Процедура УстановитьЦенуНоменклатуры(Документ, СтрокаТабличнойЧасти)

	//Если Не ЕстьНТТ(Документ) Тогда
	//	СтрокаТабличнойЧасти.Цена = 0;
	//ИначеЕсли (Документ.СкладОтправитель.ВидСклада <> Перечисления.ВидыСкладов.НТТ) 
	//	    И (Документ.СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.НТТ) Тогда
	//	ВалютаДокумента    = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	//	КурсДокумента      = 1;
	//	КратностьДокумента = 1;

		// Тип цен устанавливает склад получатель. 
	//	СтрокаТабличнойЧасти.Цена = Ценообразование.ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры,
	//	                              Документ.СкладПолучатель.ТипЦенРозничнойТорговли, Документ.Дата, СтрокаТабличнойЧасти.ЕдиницаИзмерения,
	//	                              ВалютаДокумента, КурсДокумента, КратностьДокумента);
	//ИначеЕсли Документ.СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
	//	ВалютаДокумента    = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	//	КурсДокумента      = 1;
	//	КратностьДокумента = 1;         

		//СтрокаТабличнойЧасти.Цена = УправлениеРозничнойТорговлей.ПолучитьРозничнуюЦену(СтрокаТабличнойЧасти.Номенклатура,, Документ.СкладОтправитель,
		 //                                                 ВалютаДокумента, Документ.Дата,
		  //                                                СтрокаТабличнойЧасти.ЕдиницаИзмерения,
		  //                                                ВалютаДокумента, КурсДокумента, КратностьДокумента);
	//КонецЕсли;

КонецПроцедуры

// Функция проверяет, есть ли НТТ среди склада-отправителя или склад-получателя.
//
// Возвращаемое значение:
//  Булево. Истина, если отправитель или получатель - НТТ.
//
Функция ЕстьНТТ(Документ)

	ВидНТТ = Перечисления.ВидыСкладов.НТТ;

	Возврат (Документ.СкладОтправитель.ВидСклада = ВидНТТ Или Документ.СкладПолучатель.ВидСклада = ВидНТТ);

КонецФункции

// #IBS 22.12.2021 Возвращает пустую строку, если остатки достаточны (сравнение со строками скорректированного, но незаписанного документа)
Функция ПроверитьВозможностьПроведенияРеализации(ДокументОбъект) Экспорт
	Перем стр1;
	
	Для каждого стр1 из ДокументОбъект.Товары Цикл
		КоличествоОстаток = ПолучитьОстаткиНаСкладе(ДокументОбъект.Склад, ДокументОбъект.МоментВремени(), 
													стр1.Номенклатура, стр1.Характеристика, стр1.Серия);
		КоличествоНужно = стр1.Количество * стр1.Коэффициент;
		Если КоличествоНужно > КоличествоОстаток Тогда
			Возврат "" + ДокументОбъект.Ссылка + " " + стр1.Номенклатура + ": нужно "+КоличествоНужно + " остаток " + КоличествоОстаток;
		КонецЕсли;
	КонецЦикла;
	
	Возврат "";
КонецФункции

// #IBS 22.12.2021 Возвращает пустую строку, если остатки достаточны (сравнение со строками скорректированного, но незаписанного документа)
Функция ПроверитьВозможностьПроведенияПеремещения(ДокументОбъект) Экспорт
	Перем стр1;
	
	Для каждого стр1 из ДокументОбъект.Товары Цикл
		КоличествоОстаток = ПолучитьОстаткиНаСкладе(ДокументОбъект.СкладОтправитель, ДокументОбъект.МоментВремени(), 
													стр1.Номенклатура, стр1.Характеристика, стр1.Серия);
		КоличествоНужно = стр1.Количество;
		Если КоличествоНужно > КоличествоОстаток Тогда
			Возврат "" + ДокументОбъект.Ссылка + " " + стр1.Номенклатура + ": нужно " + КоличествоНужно+" остаток " + КоличествоОстаток;
		КонецЕсли;
	КонецЦикла;
	
	Возврат "";
КонецФункции

//	#IBS 21.10.2021 Функция ПолучитьСсылкуНаСериюНоменклатур возращает ссылку на серию номенклатур по ее УИД
Функция ПолучитьСсылкуНаСериюНоменклатур(СтрокаУИДСерии) Экспорт
	
	Попытка
		УИД = Новый УникальныйИдентификатор(СтрокаУИДСерии);
		Ссылка = Справочники.СерииНоменклатуры.ПолучитьСсылку(УИД);
		Если Ссылка.ПолучитьОбъект() = Неопределено Тогда
			Возврат Справочники.СерииНоменклатуры.ПустаяСсылка();
		Иначе
			Возврат Ссылка;
		КонецЕсли
	Исключение
		Возврат Справочники.СерииНоменклатуры.ПустаяСсылка();
	КонецПопытки
	
КонецФункции

//	#IBS 27.04.2023 Функция ПолучитьСсылкуНаХарактеристикуНоменклатур возращает ссылку на характеристику по УИД
Функция ПолучитьСсылкуНаХарактеристикуНоменклатур(СтрокаУИД) Экспорт
	
	Попытка
		УИД = Новый УникальныйИдентификатор(СтрокаУИД);
		Ссылка = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(УИД);
		Если Ссылка.ПолучитьОбъект() = Неопределено Тогда
			Возврат Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		Иначе
			Возврат Ссылка;
		КонецЕсли
	Исключение
		Возврат Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецПопытки
	
КонецФункции

// #IBS 22.12.2021 Получить остатки товара на складе из регистра
Функция ПолучитьОстаткиНаСкладе(Склад, ВремяДок, Номенклатура, Характеристика, Серия)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	| ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	| ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
	| ТоварыНаСкладахОстатки.Серия КАК Серия,
	| СУММА(ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0)) КАК КоличествоОстаток
	|ИЗ
	| РегистрНакопления.ТоварыНаСкладах.Остатки(&ВремяДока, Склад = &Склад) КАК ТоварыНаСкладахОстатки
	|ГДЕ
	| ТоварыНаСкладахОстатки.Номенклатура = &Номенклатура
	| И ТоварыНаСкладахОстатки.Характеристика = &Характеристика
	| И ТоварыНаСкладахОстатки.Серия = &Серия
	|
	|СГРУППИРОВАТЬ ПО
	| ТоварыНаСкладахОстатки.Номенклатура,
	| ТоварыНаСкладахОстатки.Характеристика,
	| ТоварыНаСкладахОстатки.Серия";

	Запрос.УстановитьПараметр("ВремяДока", ВремяДок);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("Серия", Серия);

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.КоличествоОстаток;
	КонецЦикла;
	
	Возврат 0.0;
	
КонецФункции

// #IBS 17.02.2022 Получить описание различий в списке товаров из документа и из сообщения WMS
// Колонки таблицы: Номенклатура, Серия, КоличествоПоERP, КоличествоПоWMS
Функция ПолучитьОписаниеРазличий(Документ, ТаблицаРазличий) Экспорт
	
	Текст = "Между данными о товарах в документе "+Строка(Документ.Ссылка)+Символы.ПС+
			" и данными по принятым (отгруженным) товарам в EME.WMS имеются следующие различия:"+Символы.ПС+Символы.ПС;
	
	Для каждого стр1 из ТаблицаРазличий цикл
		Текст = Текст + "Для товара " + стр1.Номенклатура.Наименование + " код " + СокрЛП(стр1.Номенклатура.Код) + " Серия " + стр1.Серия + Символы.ПС +
		"Количество по 1С  " + Строка(стр1.КоличествоПоERP) + " " + стр1.ЕдиницаИзмерения.Наименование + Символы.ПС +
		"Количество по WMS " + Строка(стр1.КоличествоПоWMS) + " " + стр1.ЕдиницаИзмерения.Наименование + Символы.ПС + Символы.ПС;
	КонецЦикла;			
	
	Текст = Текст + Символ(13)+"Документ скорректирован.";
	
	Возврат Текст;
	
КонецФункции  

// #IBS 31.03.2023 Получить краткое описание различий в списке товаров из документа и WMS
// Колонки таблицы: Номенклатура, Серия, КоличествоПоERP, КоличествоПоWMS
Функция ПолучитьКраткоеОписаниеРазличий(Документ, НомерДокументаWMS, ТаблицаРазличий) Экспорт
	Текст = "Расхождение кол-в 1С " + Строка(Документ.Ссылка) + " и WMS " + НомерДокументаWMS + Символы.ПС;
	Для каждого стр1 из ТаблицаРазличий цикл
		Текст = Текст + стр1.Номенклатура.Наименование + стр1.Номенклатура.Код + " 1С " + Строка(стр1.КоличествоПоERP) + " WMS " + Строка(стр1.КоличествоПоWMS) + " " + стр1.ЕдиницаИзмерения.Наименование + Символы.ПС;
	КонецЦикла;			

	Возврат Текст;
КонецФункции  

// #IBS 11.04.2025 Добавить напоминание (по событиям интеграции) установленным в настройке пользователям
Процедура ДобавитьНапоминаниеИнтеграции(ТекстОписания, ОбъектСсылка) Экспорт
	Пользователь = Константы.EmeWmsПользовательДляОповещений1.Получить();
	Если ЗначениеЗаполнено(Пользователь) Тогда
		ДобавитьНапоминаниеИнтеграцииПользователю(Пользователь, ТекстОписания, ОбъектСсылка);
	КонецЕсли;
	Пользователь = Константы.EmeWmsПользовательДляОповещений2.Получить();
	Если ЗначениеЗаполнено(Пользователь) Тогда
		ДобавитьНапоминаниеИнтеграцииПользователю(Пользователь, ТекстОписания, ОбъектСсылка);
	КонецЕсли;
КонецПроцедуры

// #IBS 11.04.2025 Добавить напоминание пользователю по документу интеграции
Процедура ДобавитьНапоминаниеИнтеграцииПользователю(Пользователь, ТекстОписания, ОбъектСсылка)
  	НоваяЗапись = РегистрыСведений.Напоминания.СоздатьМенеджерЗаписи();
	НоваяЗапись.Получатель = Пользователь;
	НоваяЗапись.Дата = ТекущаяДата();        
	НоваяЗапись.Объект = ОбъектСсылка;
	НоваяЗапись.ТипНапоминания = Перечисления.ТипыНапоминаний.Общее;
	НоваяЗапись.Автор = Неопределено;
	НоваяЗапись.Комментарий = Лев(ТекстОписания, 999); 
    НоваяЗапись.Записать(); 
	
КонецПроцедуры    

// #IBS 19.02.2025 Получить или создать характеристику товара по наименованию (для случая подчиненных товару)
Функция ПолучитьХарактеристикуПоНаименованию(ХарактеристикаНаименование, Товар, СоздаватьНовую = ложь) Экспорт
	Если Товар.ВестиУчетПоХарактеристикам Тогда
		ХарактеристикаСсылка = Справочники.ХарактеристикиНоменклатуры.НайтиПоНаименованию(ХарактеристикаНаименование,,, Товар.Ссылка);
		Если СоздаватьНовую И ХарактеристикаСсылка.Пустая() И ХарактеристикаНаименование <> "-" Тогда
			НоваяХарактеристика = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
			НоваяХарактеристика.Владелец = Товар;
			НоваяХарактеристика.Наименование = ХарактеристикаНаименование;
			НоваяХарактеристика.НаименованиеПолное = ХарактеристикаНаименование;
			НоваяХарактеристика.Активная = Истина;
			НоваяХарактеристика.Записать();
			ХарактеристикаСсылка = НоваяХарактеристика.Ссылка;
		КонецЕсли;
	Иначе
		ХарактеристикаСсылка = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	Возврат ХарактеристикаСсылка;
КонецФункции

// #IBS 03.10.2023 Преобразовать ШК марки ЧЗ в вид без скобок
// например "(01)04670042690437(21).fdTiA;VjC.Y5" в "010467004269043721.fdTiA;VjC.Y5"
// Префикс 01 + 14 символов GTIN + 21 + 13 символов уникальный серийный номер. Криптохвост в WMS не нужен
// Если (01) и (21) нет на месте, код не меняется.
Функция КодМаркиВЗначениеБезСкобок(СтрокаКода) Экспорт
	Если Лев(СтрокаКода, 4) <> "(01)" ИЛИ Сред(СтрокаКода, 19, 4) <> "(21)" Тогда
		Возврат СтрокаКода;
	КонецЕсли;
	
	// Составим строку с идентификаторами без скобок
	Возврат "01" + Сред(СтрокаКода, 5, 14) + "21" + Сред(СтрокаКода, 23, 13);
КонецФункции

// #IBS 06.02.2025 Преобразовать ШК марки короба в вид без префикса (00)
// например "(00)046100639901265873" в "046100639901265873"
// Длиной 18 символов - в соответствии с форматом кода SSCC для WMS
// Если (00) нет на месте, код не меняется.
Функция КодМаркиКоробаВЗначениеБезСкобок(СтрокаКода) Экспорт
	Если Лев(СтрокаКода, 4) = "(00)" Тогда
		Возврат Сред(СтрокаКода, 5);
	Иначе
		Возврат СтрокаКода;
	КонецЕсли;
	
КонецФункции

// #IBS 03.10.2023 Преобразовать ШК марки ЧЗ в вид со скобками, 
// например "010467004269043721.fdTiA;VjC.Y5" в "(01)04670042690437(21).fdTiA;VjC.Y5"
//           1234567890123456789                 12345678901234567890123
// Префикс 01 + 14 символов GTIN + 21 + 13 символов уникальный серийный номер. Криптохвост в WMS не нужен
// Если (01) и (21) нет на месте, код не меняется.
Функция КодМаркиВЗначениеСоСкобками(СтрокаКода) Экспорт
	// #IBS 27.02.2025 Клиент просит значение без скобок
	Возврат СтрокаКода;
	
	Если Лев(СтрокаКода, 2) <> "01" ИЛИ Сред(СтрокаКода, 17, 2) <> "21" Тогда
		Возврат СтрокаКода;
	КонецЕсли;
	
	// Составим строку с идентификаторами со скобками
	Возврат "(01)" + Сред(СтрокаКода, 3, 14) + "(21)" + Сред(СтрокаКода, 19, 13);
КонецФункции

// #IBS 12.10.2023 Выбрать все коды маркировки товаров  
Функция ПолучитьВыборкуКодовМаркировки()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШтрихкодыУпаковок.Номенклатура КАК Номенклатура,
		|	ШтрихкодыУпаковок.Характеристика КАК Характеристика,
		|	ШтрихкодыУпаковок.Серия КАК Серия,
		|	ШтрихкодыУпаковок.Упаковка КАК Упаковка,
		|	ШтрихкодыУпаковок.ЗначениеШтрихкода КАК ЗначениеШтрихкода
		|ИЗ
		|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковок
		|ГДЕ
		|	ШтрихкодыУпаковок.ПометкаУдаления = ЛОЖЬ И
		|	ШтрихкодыУпаковок.ТипУпаковки = &ТипУпаковки";
	
	Запрос.УстановитьПараметр("ТипУпаковки", Перечисления.ТипыУпаковок.МаркированныйТовар);
	
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции
      
//	Выгрузить остатки товаров в ячейках в csv файл
Функция ОстаткиВЯчейках(Знач ДатаОстатков) Экспорт
	
	ТекДок = Новый ТекстовыйДокумент;
	ТекДок.ДобавитьСтроку("whs_code;cell_no;goods_id;goods_code;lot_id;lot_no;producer_id;producer_code;producer_name;producer_inn;producer_kpp;ipmporter_id;ipmporter_code;importer_name;ipmporter_inn;ipmporter_kpp;country_code;bbd;prd;gtd_reg_no;gtd_line_no;form_a_no;form_b_no;сapacity;alc_volume;quantity;mu_code;pallet_sscc;box_sscc;pdf417;data_matrix;true_sign");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыВЯчейках_ЛАОстаткиИОбороты.Номенклатура КАК Номенклатура,
		|	ТоварыВЯчейках_ЛАОстаткиИОбороты.Номенклатура.Код КАК НоменклатураКод,
		|	ТоварыВЯчейках_ЛАОстаткиИОбороты.Ячейка КАК Ячейка,
		|	ТоварыВЯчейках_ЛАОстаткиИОбороты.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
		|	ТоварыВЯчейках_ЛАОстаткиИОбороты.КоличествоКонечныйОстаток КАК КонечныйОстаток,
		|	ТоварыВЯчейках_ЛАОстаткиИОбороты.Номенклатура.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору.Код КАК ЕдиницаПоКлассификаторуКод
		|ИЗ
		|	РегистрНакопления.ТоварыВЯчейках_ЛА.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Авто, ДвиженияИГраницыПериода, Склад = &Склад) КАК ТоварыВЯчейках_ЛАОстаткиИОбороты
		|ГДЕ
		|	ТоварыВЯчейках_ЛАОстаткиИОбороты.КоличествоКонечныйОстаток > 0";
	
	Запрос.УстановитьПараметр("НачалоПериода", КонецДня(ДатаОстатков));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ДатаОстатков));
	Запрос.УстановитьПараметр("Склад", Справочники.Склады.НайтиПоНаименованию("С №1"));
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ТекДок;
	КонецЕсли;
	
	КодСклада = "WRH"; // Здесь подставить нужный склад
   	НомСтр 	  = 0;

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НомСтр 			= НомСтр + 1;
		
		Если ЗначениеЗаполнено(Выборка.Ячейка) Тогда
			КодЯчейки 	= Выборка.Ячейка;
		Иначе	
			КодЯчейки 	= "S888-01-01";
		КонецЕсли;            
		
		ИДТовара 		= Выборка.Номенклатура.УникальныйИдентификатор();
		КодТовара 		= Выборка.НоменклатураКод;
		ИДПартии 		= "";
		НомерПартии 	= "";
		КодЕдиницы 		= Выборка.ЕдиницаПоКлассификаторуКод;
		ЗначениеМарки 	= "";
		Количество		= СтрЗаменить(Строка(Выборка.КонечныйОстаток), Символы.НПП, "");
		
		СтрокаДанных = КодСклада+";"+КодЯчейки+";"+ИДТовара+";"+КодТовара+";"+ИДПартии+";"+НомерПартии+";;;;;;;;;;;;;;;;;;;;"+Количество+";"+КодЕдиницы+";;;;;"+ЗначениеМарки;
		ТекДок.ДобавитьСтроку(СтрокаДанных);
	КонецЦикла;
	
	Возврат ТекДок;
	
КонецФункции

// #IBS 12.10.2023 Получить остатки марок товаров
Функция ПолучитьМаркиЧЗТоваров() Экспорт
	ТекДок = Новый ТекстовыйДокумент;
	ТекДок.ДобавитьСтроку("whs_code;cell_no;goods_id;goods_code;lot_id;lot_no;producer_id;producer_code;producer_name;producer_inn;producer_kpp;ipmporter_id;ipmporter_code;importer_name;ipmporter_inn;ipmporter_kpp;country_code;bbd;prd;gtd_reg_no;gtd_line_no;form_a_no;form_b_no;сapacity;alc_volume;quantity;mu_code;pallet_sscc;box_sscc;pdf417;data_matrix;true_sign");
	
	КодСклада = "WRH"; // Здесь подставить нужный склад
	КодЯчейки = "S888-01-01";
	Количество = "1";
	Выборка = ПолучитьВыборкуКодовМаркировки();
	НомСтр = 0;
	Пока Выборка.Следующий() Цикл
		НомСтр = НомСтр + 1;
		Товар = Выборка.Номенклатура;
		Характеристика = Выборка.Характеристика;
		ИДТовара = Товар.УникальныйИдентификатор();
		КодТовара = СокрЛП(Товар.Код);
		Если ЗначениеЗаполнено(Характеристика) Тогда
			ИДПартии =  Характеристика.УникальныйИдентификатор();
			НомерПартии = Характеристика.Наименование;
		Иначе
			ИДПартии = "";
			НомерПартии = "";
		КонецЕсли;
		КодЕдиницы = Товар.ЕдиницаИзмерения.Код;
		ЗначениеМарки = КодМаркиВЗначениеБезСкобок(Выборка.ЗначениеШтрихкода);
		ЗначениеМарки64 = Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(ЗначениеМарки));
		СтрокаДанных = КодСклада+";"+КодЯчейки+";"+ИДТовара+";"+КодТовара+";"+ИДПартии+";"+НомерПартии+";;;;;;;;;;;;;;;;;;;;"+Количество+";"+КодЕдиницы+";;;;;"+ЗначениеМарки64;
		ТекДок.ДобавитьСтроку(СтрокаДанных);
	КонецЦикла;	
	
	Возврат ТекДок;
КонецФункции    
      
// #IBS 14.10.2023 Получить все характеристики товаров в csv документе
Функция ПолучитьХарактеристикиТоваров() Экспорт
	ТекДок = Новый ТекстовыйДокумент;
	ТекДок.ДобавитьСтроку("goods_code;goods_id;goods_name;is_group;lot_id;lot_no");
	
	Выборка = Справочники.ХарактеристикиНоменклатуры.Выбрать();
	Пока Выборка.Следующий() Цикл
		Товар = Выборка.Владелец;
		КодТовара = СокрЛП(Товар.Код);
		ИДТовара = Товар.УникальныйИдентификатор();
		НаименованиеТовара = Товар.Наименование;

		НомерПартии = Выборка.Наименование;
		ИДПартии = Выборка.Ссылка.УникальныйИдентификатор();     
		ПризнакГруппы = ?(Товар.ЭтоГруппа, 1, 0);
		
		СтрокаДанных = КодТовара + ";" + ИДТовара + ";" + НаименованиеТовара + ";" + ПризнакГруппы + ";" + ИДПартии + ";" + НомерПартии;
		ТекДок.ДобавитьСтроку(СтрокаДанных);
	КонецЦикла;	
	
	Возврат ТекДок;
КонецФункции    

//	Получить серию товара по номеру или создать новую
Функция ПолучитьСериюПоНомеру(СерийныйНомер, ТоварСсылка, СоздаватьСерии = Ложь) Экспорт

	Если НЕ ЗначениеЗаполнено(СерийныйНомер) Тогда
		Возврат Справочники.СерииНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	// Поиск Серии по Номеру серии и Дате производства
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СерииНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|ГДЕ
	|	СерииНоменклатуры.СерийныйНомер = &СерийныйНомер
	|	И СерииНоменклатуры.Владелец = &Номенклатура";
	
	Запрос.УстановитьПараметр("СерийныйНомер", 	СерийныйНомер);
	Запрос.УстановитьПараметр("Номенклатура", 	ТоварСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Если НЕ РезультатЗапроса.Пустой() Тогда		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий(); 
		
		Возврат Выборка.Ссылка;
	КонецЕсли;
		
	Если СоздаватьСерии Тогда 
		// Создаем новую Серию
		Серия = Справочники.СерииНоменклатуры.СоздатьЭлемент();
		Серия.Владелец 			= ТоварСсылка;
		Серия.Наименование 		= СерийныйНомер;
		Серия.Номер 			= СерийныйНомер;
		Серия.Записать();
		
		Возврат Серия.Ссылка;   		
	КонецЕсли;
	
	Возврат Справочники.СерииНоменклатуры.ПустаяСсылка();
	
КонецФункции

//	Получить или создать серию товара по номеру и виду номенклатуры
Функция ПолучитьСериюПоНомеруИВидуНоменклатуры(СерийныйНомер, ВидНоменклатуры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СерийныйНомер) ИЛИ НЕ ЗначениеЗаполнено(ВидНоменклатуры) Тогда
		Возврат Справочники.СерииНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	// Поиск Серии по Номеру серии и Дате производства
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СерииНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|ГДЕ
	|	СерииНоменклатуры.Номер = &СерийныйНомер И
	|	СерииНоменклатуры.ВидНоменклатуры = &ВидНоменклатуры";
	
	Запрос.УстановитьПараметр("СерийныйНомер", 		СерийныйНомер);
	Запрос.УстановитьПараметр("ВидНоменклатуры", 	ВидНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда		
		// Создаем новую Серию
		Серия = Справочники.СерииНоменклатуры.СоздатьЭлемент();
		Серия.ВидНоменклатуры 	= ВидНоменклатуры;
		Серия.Наименование 		= СерийныйНомер;
		Серия.Номер 			= СерийныйНомер;
		Серия.Записать();
		
		Возврат Серия.Ссылка;   		
	Иначе 
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий(); 
		
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
КонецФункции

//	Получить или создать серию товара по номеру и номенклатуре
Функция ПолучитьСериюПоНомеруИНоменклатуре(СерийныйНомер, ТоварСсылка, СоздаватьСерии = Ложь) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СерийныйНомер) ИЛИ НЕ ЗначениеЗаполнено(ТоварСсылка) Тогда
		Возврат Справочники.СерииНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	// Поиск Серии по Номеру серии и Дате производства
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СерииНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|ГДЕ
	|	СерииНоменклатуры.Владелец = &Владелец И
	|	СерииНоменклатуры.СерийныйНомер = &СерийныйНомер";
	
	Запрос.УстановитьПараметр("Владелец", 		ТоварСсылка);
	Запрос.УстановитьПараметр("СерийныйНомер", 	СерийныйНомер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий(); 
		
		Возврат Выборка.Ссылка;
		
	ИначеЕсли СоздаватьСерии Тогда
		// Создаем новую Серию
		Серия = Справочники.СерииНоменклатуры.СоздатьЭлемент();
		Серия.Владелец		= ТоварСсылка;
		Серия.Наименование 	= СерийныйНомер;
		Серия.СерийныйНомер	= СерийныйНомер;
		Серия.Записать();
		
		Возврат Серия.Ссылка;   		
		
	Иначе 
		
		Возврат Справочники.СерииНоменклатуры.ПустаяСсылка();   		
	КонецЕсли;
	
КонецФункции

// #COA 06.12.2023 Получить серию товара по номеру и сроку годности или создать новую
Процедура ПолучитьСериюПоНомеруГоденДо(СерияНоменклатуры, СерийныйНомер, ГоденДо, ВидНоменклатуры, Товар) Экспорт   
	Если СерийныйНомер = Неопределено Тогда
		СерияНоменклатуры = Справочники.СерииНоменклатуры.ПустаяСсылка();
		Возврат;
	КонецЕсли;

	// Поиск Серии по Номеру серии и Годен до
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СерииНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|ГДЕ
	|	СерииНоменклатуры.ГоденДо = &ГоденДо И
	|	СерииНоменклатуры.Номер = &СерийныйНомер
	|	И СерииНоменклатуры.ВидНоменклатуры = &ВидНоменклатуры";
	
	Запрос.УстановитьПараметр("ГоденДо", 			ГоденДо);
	Запрос.УстановитьПараметр("СерийныйНомер", 		СерийныйНомер);
	Запрос.УстановитьПараметр("ВидНоменклатуры", 	ВидНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Если НЕ РезультатЗапроса.Пустой() Тогда		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий(); 		
		СерияНоменклатуры = Выборка.Ссылка;
		
		Возврат;
	КонецЕсли;			

	// Поиск Серии по Номеру серии	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СерииНоменклатуры.Ссылка КАК Ссылка,
		|	СерииНоменклатуры.ГоденДо КАК ГоденДо
		|ИЗ
		|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
		|ГДЕ
		|	СерииНоменклатуры.Номер = &СерийныйНомер
		|	И СерииНоменклатуры.ВидНоменклатуры = &ВидНоменклатуры";
	
	Запрос.УстановитьПараметр("СерийныйНомер", 		СерийныйНомер);
	Запрос.УстановитьПараметр("ВидНоменклатуры", 	ВидНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Если РезультатЗапроса.Пустой() Тогда
		// Создаем новую Серию
		Серия = Справочники.СерииНоменклатуры.СоздатьЭлемент();
		Серия.ВидНоменклатуры 	= ВидНоменклатуры;
		Серия.Наименование 		= СерийныйНомер;
		Серия.Номер 			= СерийныйНомер;
		Серия.ГоденДо 			= ГоденДо;
		Серия.Записать();
		
		СерияНоменклатуры = Серия.Ссылка;   		
	Иначе		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий(); 		
		СерияНоменклатуры = Выборка.Ссылка;
		
		// #COA 14.12.2023 справочное указание Годен до
		Если СерийныйНомер <> "Неизвестная серия" И Выборка.ГоденДо <> ГоденДо Тогда
			Серия = СерияНоменклатуры.ПолучитьОбъект();
			Серия.ГоденДо  	    = ГоденДо;
			Серия.Записать();										
		КонецЕсли;
	КонецЕсли;			
КонецПроцедуры   

// #IBS 05.03.2024 Получить серию товара по номеру и дате производства или создать новую
Функция ПолучитьСериюПоНомеруИДатеПроизводства(СерийныйНомер, ДатаПроизводства, ТоварСсылка) Экспорт   

	Если НЕ ЗначениеЗаполнено(СерийныйНомер) ИЛИ НЕ ЗначениеЗаполнено(ДатаПроизводства)  Тогда
		Возврат Справочники.СерииНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	// Поиск Серии по Номеру серии и Дате производства
	ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТоварСсылка, "ВидНоменклатуры");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СерииНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|ГДЕ
	|	СерииНоменклатуры.ДатаПроизводства = &ДатаПроизводства И
	|	СерииНоменклатуры.Номер = &СерийныйНомер И
	|	СерииНоменклатуры.ВидНоменклатуры = &ВидНоменклатуры";
	
	Запрос.УстановитьПараметр("ДатаПроизводства", 	ДатаПроизводства);
	Запрос.УстановитьПараметр("СерийныйНомер", 		СерийныйНомер);
	Запрос.УстановитьПараметр("ВидНоменклатуры", 	ВидНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Если НЕ РезультатЗапроса.Пустой() Тогда		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий(); 
		
		Возврат Выборка.Ссылка;
	Иначе 
		// Создаем новую Серию
		Серия = Справочники.СерииНоменклатуры.СоздатьЭлемент();
		Серия.ВидНоменклатуры 	= ВидНоменклатуры;
		Серия.Наименование 		= СерийныйНомер;
		Серия.Номер 			= СерийныйНомер;
		Серия.ДатаПроизводства	= ДатаПроизводства;
		Серия.Записать();
		
		Возврат Серия.Ссылка;   		
	КонецЕсли;
КонецФункции   

// #IBS 19.02.2025 Ширяев Получить серию товара по номеру и дате годности (годен до) или создать новую
// Серия подчинена номенклатуре в КА1.1
Функция ПолучитьСериюПоНомеруИДатеГодности(СерийныйНомер, ДатаГодности, ТоварСсылка, СоздаватьСерии = Ложь) Экспорт   

	Если НЕ ЗначениеЗаполнено(СерийныйНомер) ИЛИ НЕ ЗначениеЗаполнено(ДатаГодности)  Тогда
		Возврат Справочники.СерииНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	// Поиск Серии по Номеру серии и Дате производства
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СерииНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|ГДЕ
	|	СерииНоменклатуры.СрокГодности = &СрокГодности И
	|	СерииНоменклатуры.СерийныйНомер = &СерийныйНомер И
	|	СерииНоменклатуры.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("СрокГодности",	ДатаГодности);
	Запрос.УстановитьПараметр("СерийныйНомер",	СерийныйНомер);
	Запрос.УстановитьПараметр("Владелец", 		ТоварСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Если НЕ РезультатЗапроса.Пустой() Тогда		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий(); 
		
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Если СоздаватьСерии Тогда 
		// Создаем новую Серию
		Серия = Справочники.СерииНоменклатуры.СоздатьЭлемент();
		Серия.Владелец			= ТоварСсылка;
		Серия.Наименование 		= СерийныйНомер;
		Серия.СерийныйНомер 	= СерийныйНомер;
		Серия.СрокГодности		= ДатаГодности;
		Серия.Записать();
		
		Возврат Серия.Ссылка;   		
	КонецЕсли;	

	Возврат Справочники.СерииНоменклатуры.ПустаяСсылка();

КонецФункции   

// #IBS 21.03.2025 Ширяев Получить серию товара по наименованию или создать новую
// Серия подчинена номенклатуре в УТ10.3
Функция ПолучитьСериюПоНаименованию(НаименованиеСерии, ТоварСсылка, СоздаватьСерии = Ложь) Экспорт   

	Если НЕ ЗначениеЗаполнено(НаименованиеСерии) Тогда
		Возврат Справочники.СерииНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	// Поиск Серии по Номеру серии и Дате производства
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СерииНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|ГДЕ
	|	СерииНоменклатуры.Наименование = &Наименование И
	|	СерииНоменклатуры.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Наименование",	НаименованиеСерии);
	Запрос.УстановитьПараметр("Владелец", 		ТоварСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Если НЕ РезультатЗапроса.Пустой() Тогда		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий(); 
		
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Если СоздаватьСерии Тогда 
		// Создаем новую Серию
		Серия = Справочники.СерииНоменклатуры.СоздатьЭлемент();
		Серия.Владелец			= ТоварСсылка;
		Серия.Наименование 		= НаименованиеСерии;
		Серия.Записать();
		
		Возврат Серия.Ссылка;   		
	КонецЕсли;	

	Возврат Справочники.СерииНоменклатуры.ПустаяСсылка();

КонецФункции   


// #KSJ 01.12.2023 Процедура заполняет статусы указания серий в строках ТЧ товары
// Пример использования
// ЗаполнитьСтатусыУказанияСерий(Пересчет, Документы.ПересчетТоваров);
Процедура ЗаполнитьСтатусыУказанияСерий(Объект, Менеджер) Экспорт
	
	// #IBS Ширяев 13.02.2025 ВАЖНО! Здесь надо дописать подходящий метод заполнения статуса указания серий для КА1.1
	
	//ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(Объект, Менеджер));
	
	//НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
	
КонецПроцедуры

// #IBS Ширяев 14.02.2025 Функция возвращает УИД товара в системе Меридиан, иди если нет, его собственный УИД.
Функция УИДМеридиан(ТоварСсылка) Экспорт
	ВнешнийУИД = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТоварСсылка, "Ссылка_медидиан");
	Если НЕ ЗначениеЗаполнено(ВнешнийУИД) Тогда
		ВнешнийУИД = ТоварСсылка.УникальныйИдентификатор();
	Иначе                                      
	 	ПозицияКода = Найти(ВнешнийУИД, "?ref=");
		Если ПозицияКода > 0 Тогда
			ВнешнийУИД = Сред(ВнешнийУИД, ПозицияКода + 5);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ВнешнийУИД;
КонецФункции

//	Продукция маркируемая для ГИСМ
Функция ПродукцияМаркируемаяДляГИСМ(Знач ТоварСсылка) Экспорт
	
	Если Не ЗначениеЗаполнено(ТоварСсылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТоварСсылка, "Ссылка_медидиан")) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;  
	
КонецФункции
