
// #Область ПрограммныйИнтерфейс

Процедура ВыполнитьПодключаемуюКомандуИнтеграцииПерейти(Форма) Экспорт
	
	Модуль = ВзаимодействиеКонтурМаркировкаКлиент.МодульКонтурМаркировкаКлиент();
	
	Модуль.КонтурИнтеграция_ВыполнитьПодключаемуюКомандуИнтеграцииПерейти(Форма);
	
КонецПроцедуры

Процедура ВыполнитьПодключаемуюКомандуИнтеграции(Команда, Форма, Источник, ПослеВыполненияКоманды) Экспорт
	
	Документ1С = ДокументИзФормыДокумента(Форма);
	
	Модуль = ВзаимодействиеКонтурМаркировкаКлиент.МодульКонтурМаркировкаКлиент();
	
	Модуль.КонтурИнтеграция_ВыполнитьПодключаемуюКомандуИнтеграции(Команда, Форма, Источник, Документ1С, ПослеВыполненияКоманды);
	
КонецПроцедуры

Процедура ВыполнитьПодключаемуюКомандуИнтеграцииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Документ1С = ДокументИзФормыДокумента(ДополнительныеПараметры.Форма);
	КомандыДокумента = КонтурИнтеграцияМодульМаркировкаВызовСервера.КомандыДокумента1С(Документ1С);
	
	ОбщийМодуль("КонтурИнтеграцияКлиент").ОбновитьКоманды(ДополнительныеПараметры.Форма, КомандыДокумента);
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

Функция ОбщийМодуль(ИмяОбщегоМодуля)
	
	Модуль = Вычислить(ИмяОбщегоМодуля);
	
	#Если Не ВебКлиент Тогда
		Если ТипЗнч(Модуль) <> Тип("ОбщийМодуль") Тогда
			ВызватьИсключение НСтр("ru = 'Общий модуль не существует: '") + ИмяОбщегоМодуля;
		КонецЕсли;
	#КонецЕсли
	
	Возврат Модуль;
	
КонецФункции

Функция ДокументИзФормыДокумента(ФормаДокумента)
	
	Попытка
		Результат = ФормаДокумента.Объект.Ссылка;
	Исключение
		Результат = Неопределено;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти
