
// #Область СлужебныеПеременныеИМетодыФормы

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента()
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		Результат = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		Результат = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

// #КонецОбласти // СлужебныеПеременныеИМетодыФормы

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Операция", Операция);
	
	УстановитьПараметрыОтбора();
	НастроитьЭлементыФормы();
	
КонецПроцедуры

// #КонецОбласти // ОбработчикиСобытийФормы

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ИнтервалОжидания = 0.1;
	ПодключитьОбработчикОжидания("ПоказатьТекущийЗапрос", ИнтервалОжидания, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьЗапросПоказатьВсеНажатие(Элемент)
	
	Элементы.Запрос.АвтоПереносСтрок = Ложь;
	Запрос = ПолныйЗапрос;
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьОтветПоказатьВсеНажатие(Элемент)
	
	Элементы.Ответ.АвтоПереносСтрок = Ложь;
	Ответ = ПолныйОтвет;
	НастроитьЭлементыФормы();
	
КонецПроцедуры

// #КонецОбласти // ОбработчикиСобытийЭлементовФормы

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьНаДиск(Команда)
	
	ФайлыЗапросов = Новый Массив;
	Для Каждого ИдентификаторСтроки Из Элементы.Список.ВыделенныеСтроки Цикл
		ФайлыЗапросов.Добавить(Элементы.Список.ДанныеСтроки(ИдентификаторСтроки).Ссылка);
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ФайлыЗапросов) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ФайлыЗапросов) Тогда
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("СохранитьНаДискПослеВыбораКаталога", ЭтаФорма, ФайлыЗапросов);
		МодульКлиента().ПоказатьДиалогВыбораКаталога(ОписаниеОбработчика, НСтр("ru = 'Выберите папку для сохранения запросов'"));
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти // ОбработчикиКомандФормы

// #Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПоказатьТекущийЗапрос()
	
	ОтключитьОбработчикОжидания("ПоказатьТекущийЗапрос");
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено
		Или ТекущиеДанные.Ссылка = ТекущийФайлЗапроса Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийФайлЗапроса = ТекущиеДанные.Ссылка;
	
	ЗаполнитьДеталиЗапроса();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы()
	
	ДлинаТриТочки = СтрДлина(СтрокаТриТочки());
	
	Если СтрДлина(Запрос) > МаксДлинаАвтоПереносаСтрок() + ДлинаТриТочки Тогда
		Элементы.Запрос.АвтоПереносСтрок = Ложь;
	Иначе
		Элементы.Запрос.АвтоПереносСтрок = Истина;
	КонецЕсли;
	
	Если Запрос <> ПолныйЗапрос Тогда
		Элементы.НадписьЗапрос.Заголовок = "Запрос (сокращен):";
		Элементы.НадписьЗапросПоказатьВсе.Видимость = Истина;
	Иначе
		Элементы.НадписьЗапрос.Заголовок = "Запрос:";
		Элементы.НадписьЗапросПоказатьВсе.Видимость = Ложь;
	КонецЕсли;
	
	Если СтрДлина(Ответ) > МаксДлинаАвтоПереносаСтрок() + ДлинаТриТочки Тогда
		Элементы.Ответ.АвтоПереносСтрок = Ложь;
	Иначе
		Элементы.Ответ.АвтоПереносСтрок = Истина;
	КонецЕсли;
	
	Если Ответ <> ПолныйОтвет Тогда
		Элементы.НадписьОтвет.Заголовок = "Ответ (сокращен):";
		Элементы.НадписьОтветПоказатьВсе.Видимость = Истина;
	Иначе
		Элементы.НадписьОтвет.Заголовок = "Ответ:";
		Элементы.НадписьОтветПоказатьВсе.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыОтбора()
	
	ТипФайла =  МодульОбъекта().Перечисление_ТипыФайлов().ДеталиЗапросаВСервис;
	Список.Параметры.УстановитьЗначениеПараметра("Операция", Операция);
	Список.Параметры.УстановитьЗначениеПараметра("ТипФайла", ТипФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНаДискПослеВыбораКаталога(РезультатВыбора, ФайлыЗапросов) Экспорт
	
	Если Не ЗначениеЗаполнено(РезультатВыбора) Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранныйКаталог = РезультатВыбора[0];
	
	Для Каждого ОписаниеАрхива Из АрхивыЗапросовВСервис(ФайлыЗапросов) Цикл
		ПутьКФайлу = МодульКлиента().ОбъединитьПути(ВыбранныйКаталог, ОписаниеАрхива.ИмяФайла);
		ПолучитьИзВременногоХранилища(ОписаниеАрхива.АдресФайла).Записать(ПутьКФайлу);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеталиЗапроса()
	
	ОбщиеДанные = "";
	ПолныйЗапрос = "";
	ПолныйОтвет = "";
	Запрос = "";
	Ответ = "";
	
	Если Не ЗначениеЗаполнено(ТекущийФайлЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеЗапроса = МодульОбъекта().ДеталиЗапросаВСервис(ТекущийФайлЗапроса);
	Если Не ЗначениеЗаполнено(ОписаниеЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеЗапроса.ДатаЗапроса = ПредставлениеУниверсальнойДаты(ОписаниеЗапроса.ДатаЗапроса);
	
	ЗаполнитьОбщиеДанные(ОписаниеЗапроса);
	ЗаполнитьЗапрос(ОписаниеЗапроса);
	ЗаполнитьОтвет(ОписаниеЗапроса);
	
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОбщиеДанные(ОписаниеЗапроса)
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить("Код ответа: " + ОписаниеЗапроса.КодОтвета);
	МассивСтрок.Добавить("Дата запроса: " + ОписаниеЗапроса.ДатаЗапроса);
	
	МодульОбъекта().ДополнитьМассив(МассивСтрок, ПредставленияПолей(ОписаниеЗапроса.Запрос.Параметры));
	
	МассивСтрок.Добавить("TraceId: " + ОписаниеЗапроса.TraceId);
	МассивСтрок.Добавить("Хост: " + ОписаниеЗапроса.Хост);
	МассивСтрок.Добавить("Метод: " + ОписаниеЗапроса.Метод);
	
	ОбщиеДанные = МодульОбъекта().СоединитьСтроку(МассивСтрок, Символы.ПС);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗапрос(ОписаниеЗапроса)
	
	МассивСтрок = ПредставленияПолей(ОписаниеЗапроса.Запрос, "ТелоЗапроса, Параметры, Заголовки");
	МодульОбъекта().ДополнитьМассив(МассивСтрок, ПредставленияПолей(ОписаниеЗапроса.Запрос.Заголовки));
	ПолныйЗапрос = МодульОбъекта().СоединитьСтроку(МассивСтрок, Символы.ПС);
	
	ТелоЗапроса = ОписаниеЗапроса.Запрос.ТелоЗапроса;
	Если ЗначениеЗаполнено(ТелоЗапроса) Тогда
		ДобавитьВТекстТело(ПолныйЗапрос, ТелоЗапроса, "Тело запроса");
	КонецЕсли;
	
	Запрос = Лев(ПолныйЗапрос, МаксДлинаАвтоПереносаСтрок());
	Если Запрос <> ПолныйЗапрос Тогда
		Запрос = Запрос + СтрокаТриТочки();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтвет(ОписаниеЗапроса)
	
	МассивСтрок = ПредставленияПолей(ОписаниеЗапроса.Ответ, "ТелоОтвета, Заголовки");
	МодульОбъекта().ДополнитьМассив(МассивСтрок, ПредставленияПолей(ОписаниеЗапроса.Ответ.Заголовки));
	ПолныйОтвет = МодульОбъекта().СоединитьСтроку(МассивСтрок, Символы.ПС);
	
	ТелоОтвета = ОписаниеЗапроса.Ответ.ТелоОтвета;
	Если ЗначениеЗаполнено(ТелоОтвета) Тогда
		ДобавитьВТекстТело(ПолныйОтвет, ТелоОтвета, "Тело ответа");
	КонецЕсли;
	
	Ответ = Лев(ПолныйОтвет, МаксДлинаАвтоПереносаСтрок());
	Если СтрДлина(Ответ) <> СтрДлина(ПолныйОтвет) Тогда
		Ответ = Ответ + СтрокаТриТочки();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВТекстТело(Текст, Тело, ТипТела)
	
	Текст = Текст + "
	|
	|" + ТипТела + ":
	|" + Тело;
	
КонецПроцедуры

&НаСервере
Функция ПредставленияПолей(КлючиИЗначения, КлючиИсключения = "")
	
	Результат = Новый Массив;
	
	Для Каждого Элемент Из КлючиИЗначения Цикл
		
		Если Не ЗначениеЗаполнено(Элемент.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Найти(НРег(КлючиИсключения), НРег(Элемент.Ключ)) > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Значение = МодульОбъекта().УдалитьНедопустимыеСимволыXML(Элемент.Значение);
		
		Результат.Добавить(ТРег(Элемент.Ключ) + ": " + Значение);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция АрхивыЗапросовВСервис(ФайлыЗапросов)
	
	Результат = Новый Массив;
	
	Для Каждого ФайлЗапроса Из ФайлыЗапросов Цикл
		Результат.Добавить(МодульОбъекта().АрхивЗапросаВСервис(ФайлЗапроса));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция МаксДлинаАвтоПереносаСтрок()
	
	Возврат 5000;
	
КонецФункции

&НаСервере
Функция ПредставлениеУниверсальнойДаты(Дата)
	
	Возврат Формат(Дата, "ДФ='dd.MM.yyyy HH:mm:ss (UTC+00:00)'");
	
КонецФункции

&НаСервере
Функция СтрокаТриТочки()
	
	Возврат Символы.ПС + "...";
	
КонецФункции

// #КонецОбласти // СлужебныеПроцедурыИФункции
