
// Описание переменных

&НаКлиенте
Перем КэшМодуляКлиента;

// Методы получения модулей

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		Результат = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		Результат = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции


// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("РежимВыбора") Тогда
		Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	КонецЕсли;
	
	Если Параметры.Свойство("Ссылка") Тогда
		Элементы.Список.ТекущаяСтрока = Параметры.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурМаркировка_СервисПровайдер_Изменен" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры


// Команды формы

&НаКлиенте
Процедура Синхронизировать(Команда)
	
	МодульКлиента().СинхронизироватьСервисПровайдеров(ЭтаФорма);
	Оповестить("КонтурМаркировка_СервисПровайдер_Изменен");
	ПровестиОпросПользователя();
	
КонецПроцедуры


// Обработчики событий списка формы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.РежимВыбора Тогда
		ОповеститьОВыборе(ВыбраннаяСтрока);
	Иначе
		МодульКлиента().ОткрытьФормуСервисПровайдера(ВыбраннаяСтрока, ЭтаФорма);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МодульКлиента().ОткрытьФормуСервисПровайдера(ТекущиеДанные.Ссылка, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если Копирование Тогда
		МодульКлиента().ОткрытьФормуСервисПровайдера(ТекущиеДанные.Ссылка, ЭтаФорма, Копирование);
	Иначе
		МодульКлиента().ОткрытьФормуСервисПровайдера(Неопределено, ЭтаФорма, Копирование);
	КонецЕсли;
	
КонецПроцедуры


// Опросы пользователей

&НаКлиенте
Процедура ПровестиОпросПользователя()
	
	КлючиСценариев = МодульКлиента().Перечисление_КлючиСценариевДляОпросов();
	ОписаниеОпроса = МодульКлиента().ОпросПользователяПоСценарию(КлючиСценариев.СервисПровайдеры);
	
	Если Не ЗначениеЗаполнено(ОписаниеОпроса) Тогда
		Возврат;
	КонецЕсли;
	
	МодульКлиента().ОткрытьФормуОпросаПользователя(ОписаниеОпроса, ЭтаФорма);
	
КонецПроцедуры
