
// #Область СлужебныеПеременныеИМетодыФормы

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Возврат Вычислить("ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка()");
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		Результат = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		Результат = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

// #КонецОбласти // СлужебныеПеременныеИМетодыФормы

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Период", Период);
	Параметры.Свойство("Организация", Организация);
	Параметры.Свойство("ТипОперации", ТипОперации);
	
	УстановитьПодзаголовок();
	УстановитьУсловноеОформление();
	ЗаполнитьИнформациюОПодписи();
	СформироватьТаблицуДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьЭлементыФормы();
	УстановитьПодсказкуФормы();
	УстановитьТекстИнформацииОбОшибках();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если МодульКлиента().ЭтоЗавершениеРаботыПрограммы(ЗавершениеРаботы) Тогда
		Возврат; // При завершении работы программы серверный вызов недоступен
	КонецЕсли;
	
	Если ЕстьНеотправленныеОперации() Тогда
		Отказ = Истина;
		ПоказатьВопросОбУдаленииНеотправленныхОпераций();
		Возврат;
	КонецЕсли;
	
	Если ЕстьОтправленныеОперации() Тогда
		ПровестиОпросПользователяИЗакрыть(Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурМаркировка_Операция_Изменен" Тогда
		ПриИзмененииОперации(Параметр);
		НастроитьЭлементыФормы();
		УстановитьТекстИнформацииОбОшибках();
	КонецЕсли;
	
	Если ИмяСобытия = "КонтурМаркировка_ДокументУчета_Удален" Тогда
		ПриУдаленииДокументаУчета(Параметр);
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти // ОбработчикиСобытийФормы

// #Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТаблицаДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ТаблицаДокументов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ДокументУчета) Тогда
		ТекущиеДанные.ДокументУчета = МодульКлиента().ДокументУчета_НайтиИлиСоздать(ТекущиеДанные.Документ1С, ЭтаФорма);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ДокументУчета) Тогда
		МодульКлиента().ОткрытьФормуДокументаУчета(ТекущиеДанные.ДокументУчета, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДокументовПометкаПриИзменении(Элемент)
	
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОперацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле = Элементы.ТаблицаОперацийДокументУчета Тогда
		МодульКлиента().ОткрытьФормуДокументаУчета(ТекущиеДанные.ДокументУчета, ЭтаФорма);
	Иначе
		МодульКлиента().ОткрытьФормуОперации(ТекущиеДанные.Операция, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОперацийПометкаПриИзменении(Элемент)
	
	НастроитьЭлементыФормы();
	
КонецПроцедуры

// #КонецОбласти // ОбработчикиСобытийЭлементовФормы

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	ТекущаяСтраница = ТекущаяСтраницаФормы();
	
	Если ТекущаяСтраница = Элементы.СтраницаДокументы Тогда
		УстановитьЗначенияФлажков(ТаблицаДокументов, Истина);
	КонецЕсли;
	
	Если ТекущаяСтраница = Элементы.СтраницаОперации Тогда
		УстановитьЗначенияФлажков(ТаблицаОпераций, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	ТекущаяСтраница = ТекущаяСтраницаФормы();
	
	Если ТекущаяСтраница = Элементы.СтраницаДокументы Тогда
		УстановитьЗначенияФлажков(ТаблицаДокументов, Ложь);
	КонецЕсли;
	
	Если ТекущаяСтраница = Элементы.СтраницаОперации Тогда
		УстановитьЗначенияФлажков(ТаблицаОпераций, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыОпераций(Команда)
	
	Если КоличествоКОбработке = 0 Тогда
		ТекстПредупреждения = НСтр("ru = 'Необходимо выбрать операции для заполнения полей'");
		МодульКлиента().ПоказатьДиалогПредупреждения(ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	Обработчик = МодульКлиента().ОписаниеОбработчикаОповещения("ЗаполнитьРеквизитыОперацийПослеУказанияЗначений", ЭтаФорма);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТипОперации", ТипОперации);
	ПараметрыФормы.Вставить("ТипыДокументов", СписокТиповДокументовВыбранныхСтрок());
	ПараметрыФормы.Вставить("КоличествоКОбработке", КоличествоКОбработке);
	
	МодульКлиента().ОткрытьФормуОбработкиМодально("Форма_ЗаполнениеРеквизитов", ЭтаФорма, ПараметрыФормы, Обработчик);
	
КонецПроцедуры

&НаКлиенте
Процедура СледующийШаг(Команда)
	
	ТекущаяСтраница = ТекущаяСтраницаФормы();
	
	Если ТекущаяСтраница = Элементы.СтраницаДокументы Тогда
		
		СоздатьДокументыУчетаИОперации();
		
		Возврат;
		
	КонецЕсли;
	
	Если ТекущаяСтраница = Элементы.СтраницаОперации Тогда
		
		Если ЕстьНепомеченныеОперации() Тогда
			ПоказатьВопросОбУдаленииНепомеченныхОпераций();
		Иначе
			ПодписатьИОтправить_ПослеСогласия(КодВозвратаДиалога.Да);
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти // ОбработчикиКомандФормы

// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьПодзаголовок()
	
	Элементы.ТекстПодзаголовка.Заголовок = МодульОбъекта().ПараметрыВСтроку(
	НСтр("ru = 'Создание операций ""%1""'"), ТипОперации);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ПолеУО = ЭлементУО.Поля.Элементы.Добавить();
	ПолеУО.Поле = Новый ПолеКомпоновкиДанных("ТаблицаДокументов");
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаДокументов.ЕстьОшибки");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.СветлоСерый);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ПолеУО = ЭлементУО.Поля.Элементы.Добавить();
	ПолеУО.Поле = Новый ПолеКомпоновкиДанных("ТаблицаДокументовОписаниеОшибки");
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаДокументов.ЕстьОшибки");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ПолеУО = ЭлементУО.Поля.Элементы.Добавить();
	ПолеУО.Поле = Новый ПолеКомпоновкиДанных("ТаблицаОперацийПометка");
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаОпераций.ОтправленаВСервис");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнформациюОПодписи()
	
	Перем Сертификат;
	
	Сертификат = МодульОбъекта().НастройкаПодписания_ПодобратьСертификат(Организация);
	Если ЗначениеЗаполнено(Сертификат) Тогда
		ИнформацияОПодписи = Сертификат.НаименованиеОрганизации + ", " + Сертификат.ФИО;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НастроитьЭлементыФормы()
	
	ОбновитьКоличествоСтрокКОбработке();
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекстИнформацииОбОшибках()
	
	ТекстИнформацииОбОшибках = "";
	
	ТекущаяСтраница = ТекущаяСтраницаФормы();
	
	Если ТекущаяСтраница = Элементы.СтраницаДокументы Тогда
		ТекстИнформацииОбОшибках = ТекстИнформацииОбОшибкахВДокументах();
	КонецЕсли;
	
	Если ТекущаяСтраница = Элементы.СтраницаОперации Тогда
		ТекстИнформацииОбОшибках = ТекстИнформацииОбОшибкахВОперациях();
	КонецЕсли;
	
	Элементы.ТекстИнформацииОбОшибках.Заголовок = ТекстИнформацииОбОшибках;
	Элементы.ТекстИнформацииОбОшибках.Видимость = ЗначениеЗаполнено(ТекстИнформацииОбОшибках);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКоличествоСтрокКОбработке()
	
	ТекущаяСтраница = ТекущаяСтраницаФормы();
	КоличествоКОбработке = 0;
	
	Если ТекущаяСтраница = Элементы.СтраницаДокументы Тогда
		Для Каждого Стр Из ТаблицаДокументов Цикл
			Если Стр.Пометка Тогда
				КоличествоКОбработке = КоличествоКОбработке + 1;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ТекущаяСтраница = Элементы.СтраницаОперации Тогда
		Для Каждого Стр Из ТаблицаОпераций Цикл
			Если Стр.Пометка И Не Стр.ОтправленаВСервис Тогда
				КоличествоКОбработке = КоличествоКОбработке + 1;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	ТекущаяСтраница = ТекущаяСтраницаФормы();
	ТипыОпераций = МодульКлиента().Перечисление_ТипыОпераций();
	ЕстьКОбработке = ЗначениеЗаполнено(КоличествоКОбработке);
	ЕстьОшибки = ЕстьСтрокиСОшибками();
	
	Элементы.КнопкаСледующийШаг.Заголовок = "";
	Элементы.ГиперссылкаУказатьЗначенияПолей.Видимость = Ложь;
	Элементы.КнопкаСнятьФлажки.Видимость = Ложь;
	Элементы.КнопкаУстановитьФлажки.Видимость = Ложь;
	Элементы.ГруппаИнформацияОПодписи.Видимость = Ложь;
	
	Если ТекущаяСтраница = Элементы.СтраницаДокументы Тогда
		Элементы.КнопкаСледующийШаг.Заголовок = "Создать операции";
		Элементы.КнопкаСледующийШаг.Доступность = ЕстьКОбработке;
		Элементы.КнопкаСнятьФлажки.Видимость = Не ЕстьОшибки;
		Элементы.КнопкаУстановитьФлажки.Видимость = Не ЕстьОшибки;
		Элементы.ТаблицаДокументовПометка.Видимость = Не ЕстьОшибки;
		Элементы.ТаблицаДокументовОписаниеОшибки.Видимость = ЕстьОшибки;
	КонецЕсли;
	
	Если ТекущаяСтраница = Элементы.СтраницаОперации Тогда
		Если ТипОперации = ТипыОпераций.ПодборкодовНаТСД Тогда
			Элементы.КнопкаСледующийШаг.Заголовок = "Отправить на ТСД";
		Иначе
			Элементы.КнопкаСледующийШаг.Заголовок = "Подписать и отправить";
			Элементы.ГруппаИнформацияОПодписи.Видимость = Истина;
		КонецЕсли;
		Элементы.КнопкаСледующийШаг.Доступность = ЕстьКОбработке;
		Элементы.КнопкаСнятьФлажки.Видимость = Истина;
		Элементы.КнопкаУстановитьФлажки.Видимость = Истина;
		Элементы.ГиперссылкаУказатьЗначенияПолей.Видимость = Истина;
		Элементы.ОписаниеОшибкиОперации.Видимость = ЕстьОшибки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПодсказкуФормы()
	
	ПодсказкаВыборДокументовУчета = ПодсказкаВыборДокументовУчета();
	ПодсказкаПодготовкаОпераций   = ПодсказкаОтправкаОперацийВСервис();
	
	ТекстПодсказки = "";
	Разделитель = "";
	
	Если ЗначениеЗаполнено(ПодсказкаВыборДокументовУчета) Тогда
		ТекстПодсказки = ТекстПодсказки + Разделитель + ПодсказкаВыборДокументовУчета;
		Разделитель = Символы.ПС;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПодсказкаПодготовкаОпераций) Тогда
		ТекстПодсказки = ТекстПодсказки + Разделитель + ПодсказкаПодготовкаОпераций;
		Разделитель = Символы.ПС;
	КонецЕсли;
	
	Элементы.ТекстПодсказки.Заголовок = ТекстПодсказки;
	Элементы.ГруппаПодсказки.Видимость = ЗначениеЗаполнено(ТекстПодсказки);
	
КонецПроцедуры

&НаКлиенте
Функция ПодсказкаВыборДокументовУчета()
	
	Результат = "";
	
	Если ТекущаяСтраницаФормы() <> Элементы.СтраницаДокументы Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТаблицаДокументов) Тогда
		Результат = НСтр("ru = 'Отметьте документы учета, по которым необходимо создать операции'");
	Иначе
		ТекстПодсказки = "ru = """
		+ "Нет документов, доступных к обработке. Проверьте заполнение настроек документов"
		+ " в общих настройках модуля, выбранный период и отбор по типу документов на рабочем столе""";
		Результат = НСтр(ТекстПодсказки, "ru");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПодсказкаОтправкаОперацийВСервис()
	
	Результат = "";
	
	Если ТекущаяСтраницаФормы() = Элементы.СтраницаОперации Тогда
		ТекстПодсказки = "ru = """
		+ "Заполните или измените поля перед отправкой в сервис."
		+ " Отметьте необходимые операции и нажмите ""Указать значения полей""";
		Результат = НСтр(ТекстПодсказки, "ru");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ТекстИнформацииОбОшибкахВДокументах()
	
	Результат = "";
	
	Если ЕстьСтрокиСОшибками() Тогда
		ТекстОшибки = "ru = """
		+ "Не все документы удалось обработать."
		+ " Исправьте указанные ошибки и повторите обработку или продолжите по документам без ошибок.""";
		Результат = НСтр(ТекстОшибки, "ru");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ТекстИнформацииОбОшибкахВОперациях()
	
	Результат = "";
	
	Если ЕстьСтрокиСОшибками() Тогда
		Результат = НСтр("ru = 'Не все операции удалось обработать. Исправьте указанные ошибки и повторите отправку.'");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ТекущаяСтраницаФормы()
	
	Возврат Элементы.ГруппаСтраницыЭтаповОбработки.ТекущаяСтраница;
	
КонецФункции

&НаКлиенте
Процедура ПерейтиНаСтраницу(Страница)
	
	Элементы.ГруппаСтраницыЭтаповОбработки.ТекущаяСтраница = Страница;
	
	УстановитьПодсказкуФормы();
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначенияФлажков(ТекущаяТаблица, Значение)
	
	Для Каждого Стр Из ТекущаяТаблица Цикл
		Если ТекущаяТаблица = ТаблицаОпераций И Стр.ОтправленаВСервис Тогда
			Продолжить;
		КонецЕсли;
		Стр.Пометка = Значение;
	КонецЦикла;
	
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаСервере
Функция СписокТиповДокументовВыбранныхСтрок()
	
	Результат = Новый СписокЗначений;
	
	СтрокиСПометками = ТаблицаДокументов.НайтиСтроки(Новый Структура("Пометка", Истина));
	Для Каждого Стр Из СтрокиСПометками Цикл
		Если Результат.НайтиПоЗначению(Стр.ДокументУчета.ТипДокумента) = Неопределено Тогда
			Результат.Добавить(Стр.ДокументУчета.ТипДокумента);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЕстьСтрокиСОшибками()
	
	Результат = Ложь;
	
	Если ТекущаяСтраницаФормы() = Элементы.СтраницаДокументы Тогда
		ТекущаяТаблица = ТаблицаДокументов;
	Иначе
		ТекущаяТаблица = ТаблицаОпераций;
	КонецЕсли;
	
	Для Каждого Стр Из ТекущаяТаблица Цикл
		Если Стр.ЕстьОшибки Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЕстьСтрокиСПометками()
	
	Результат = Ложь;
	
	ТекущаяСтраница = ТекущаяСтраницаФормы();
	
	Если ТекущаяСтраница = Элементы.СтраницаДокументы Тогда
		Для Каждого Стр Из ТаблицаДокументов Цикл
			Если Стр.Пометка Тогда
				Результат = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ТекущаяСтраница = Элементы.СтраницаОперации Тогда
		Для Каждого Стр Из ТаблицаОпераций Цикл
			Если Стр.Пометка И Не Стр.ОтправленаВСервис Тогда
				Результат = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЕстьНепомеченныеОперации()
	
	Результат = Ложь;
	
	Для Каждого Стр Из ТаблицаОпераций Цикл
		Если Не Стр.Пометка Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЕстьНеотправленныеОперации()
	
	Результат = Ложь;
	
	Для Каждого Стр Из ТаблицаОпераций Цикл
		Если Не Стр.ОтправленаВСервис Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЕстьОтправленныеОперации()
	
	Результат = Ложь;
	
	Для Каждого Стр Из ТаблицаОпераций Цикл
		Если Стр.ОтправленаВСервис Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура СформироватьТаблицуДокументов()
	
	ТаблицаДокументовУчета = МодульОбъекта().ГрупповаяОбработка_ТаблицаДокументов(Организация, Период, ТипОперации);
	
	Если ЗначениеЗаполнено(ТаблицаДокументовУчета) Тогда
		ТаблицаДокументов.Загрузить(ТаблицаДокументовУчета);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументыУчетаИОперации()
	
	Если СоздатьДокументыУчетаИНачатьРаботу() Тогда
		СоздатьОперацииПоВыбраннымДокументам();
		ПерейтиНаСтраницу(Элементы.СтраницаОперации);
	КонецЕсли;
	
	НастроитьЭлементыФормы();
	УстановитьТекстИнформацииОбОшибках();
	
КонецПроцедуры

&НаСервере
Функция СоздатьДокументыУчетаИНачатьРаботу()
	
	ЕстьОшибки = Ложь;
	
	УдаляемыеСтроки = Новый Массив;
	
	Для Каждого Стр Из ТаблицаДокументов Цикл
		
		Если Не Стр.Пометка Тогда
			УдаляемыеСтроки.Добавить(Стр);
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Стр.ДокументУчета) Тогда
			Стр.ДокументУчета = МодульОбъекта().ДокументУчета_Создать(Стр.Документ1С, Ложь, Ложь);
		КонецЕсли;
		
		Если Не НачатьРаботуСДокументом(Стр) Тогда
			ЕстьОшибки = Истина;
			Стр.Пометка = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Стр Из УдаляемыеСтроки Цикл
		ТаблицаДокументов.Удалить(Стр);
	КонецЦикла;
	
	Возврат Не ЕстьОшибки;
	
КонецФункции

&НаСервере
Функция НачатьРаботуСДокументом(ТекущаяСтрока)
	
	Результат = Ложь;
	
	СтатусВРаботе = МодульОбъекта().Перечисление_СтатусыДокументовУчета().ВРаботе;
	СтатусыДокумента = МодульОбъекта().СтатусыДокументаУчета_Прочитать(ТекущаяСтрока.ДокументУчета);
	
	Если СтатусыДокумента.ОсновнойСтатус = СтатусВРаботе Тогда
		Результат = Истина;
	Иначе
		Если ПроверитьЗаполнениеДокументаУчета(ТекущаяСтрока) Тогда
			СтатусыДокумента.ОсновнойСтатус = СтатусВРаботе;
			МодульОбъекта().СтатусыДокументаУчета_Записать(ТекущаяСтрока.ДокументУчета, СтатусыДокумента);
			Результат = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция СоздатьОперацииПоВыбраннымДокументам()
	
	ТаблицаНовыхОпераций = ТаблицаОпераций.Выгрузить();
	ТаблицаТекДокументов = ТаблицаДокументов.Выгрузить(Новый Структура("Пометка", Истина));
	
	МодульОбъекта().ГрупповаяОбработка_СоздатьОперации(ТаблицаТекДокументов, ТаблицаНовыхОпераций, ТипОперации);
	Если Не ЗначениеЗаполнено(ТаблицаНовыхОпераций) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТаблицаОпераций.Загрузить(ТаблицаНовыхОпераций);
	ОбновитьСтатусыОпераций();
	
	Метрика_ГрупповаяОбработка_СозданиеОпераций();
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ПроверитьЗаполнениеДокументаУчета(ТекущаяСтрока)
	
	ОписаниеДокумента = МодульОбъекта().ДокументУчета_ПрочитатьДокумент(ТекущаяСтрока.ДокументУчета);
	ОшибкиЗаполнения = МодульОбъекта().ДокументУчета_ПроверитьЗаполнениеПолей(ОписаниеДокумента);
	ТекущаяСтрока.ЕстьОшибки = ЗначениеЗаполнено(ОшибкиЗаполнения);
	ТекущаяСтрока.ОписаниеОшибки = "";
	
	Если ТекущаяСтрока.ЕстьОшибки Тогда
		ТекстыОшибок = МодульОбъекта().МассивСтруктур_Выгрузить(ОшибкиЗаполнения, "ТекстОшибки");
		ТекущаяСтрока.ОписаниеОшибки = МодульОбъекта().СоединитьСтроку(ТекстыОшибок, Символы.ПС);
	КонецЕсли;
	
	Возврат Не ТекущаяСтрока.ЕстьОшибки;
	
КонецФункции

&НаСервере
Функция ПроверитьЗаполнениеОперации(ТекущаяСтрока)
	
	ОшибкиЗаполнения = МодульОбъекта().ПроверитьЗаполнениеОперации(ТекущаяСтрока.Операция);
	ТекущаяСтрока.ЕстьОшибки = ЗначениеЗаполнено(ОшибкиЗаполнения);
	ТекущаяСтрока.ОписаниеОшибки = "";
	
	Если ТекущаяСтрока.ЕстьОшибки Тогда
		
		ТекстыОшибок = МодульОбъекта().МассивСтруктур_Выгрузить(ОшибкиЗаполнения, "ТекстОшибки");
		ТекущаяСтрока.ОписаниеОшибки = МодульОбъекта().СоединитьСтроку(ТекстыОшибок, Символы.ПС);
		
		ОсновнойСтатус = МодульОбъекта().Перечисление_СтатусыОпераций().ОшибкаЗаполнения;
		МодульОбъекта().СтатусыОперации_ЗаписатьОсновнойСтатус(ТекущаяСтрока.Операция, ОсновнойСтатус);
		
		ТекущаяСтрока.ИндексКартинки = ИндексКартинкиПоСтатусу(ОсновнойСтатус);
		
	КонецЕсли;
	
	Возврат Не ТекущаяСтрока.ЕстьОшибки;
	
КонецФункции

&НаСервере
Функция СоздатьЗадачиОчередиОбмена()
	
	Результат = Ложь;
	
	УдалитьНенужныеОперации();
	
	Для Каждого Стр Из ТаблицаОпераций Цикл
		
		Если Не Стр.Пометка Или Стр.ОтправленаВСервис Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ПроверитьЗаполнениеОперации(Стр) Тогда
			Продолжить;
		КонецЕсли;
		
		МодульОбъекта().Задача_Создать(Стр.Операция);
		
		Результат = Истина;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОбновитьСтатусыОпераций()
	
	СтатусыОпераций = МодульОбъекта().Перечисление_СтатусыОпераций();
	
	Для Каждого Стр Из ТаблицаОпераций Цикл
		
		Стр.ОсновнойСтатус = МодульОбъекта().Операция_ОсновнойСтатус(Стр.Операция);
		
		Если Стр.ОсновнойСтатус = СтатусыОпераций.ОшибкаОбработки Тогда
			ОписаниеЗадачи = МодульОбъекта().Задача_Прочитать(Стр.Операция);
			Если ЗначениеЗаполнено(ОписаниеЗадачи) Тогда
				Стр.ОписаниеОшибки = ОписаниеЗадачи.ДопРеквизиты.КраткоеОписаниеОшибки;
				Если Не ЗначениеЗаполнено(Стр.ОписаниеОшибки) Тогда
					Стр.ОписаниеОшибки = ОписаниеЗадачи.ОписаниеОшибки;
				КонецЕсли;
			КонецЕсли;
			Стр.ЕстьОшибки = Истина;
		КонецЕсли;
		
		Если ОперацияОтправленаВСервис(Стр.ОсновнойСтатус) Тогда
			Стр.ОтправленаВСервис = Истина;
		КонецЕсли;
		
		Стр.ИндексКартинки = ИндексКартинкиПоСтатусу(Стр.ОсновнойСтатус);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ИндексКартинкиПоСтатусу(ОсновнойСтатус)
	
	СтатусыОпераций = МодульОбъекта().Перечисление_СтатусыОпераций();
	
	Если ОсновнойСтатус = СтатусыОпераций.Новый Тогда
		Результат = 0;
	ИначеЕсли ОсновнойСтатус = СтатусыОпераций.ОперацияЗавершена
		Или ОсновнойСтатус = СтатусыОпераций.ОперацияОтменена
		Или ОсновнойСтатус = СтатусыОпераций.ПринятЧастично Тогда
		Результат = 4;
	ИначеЕсли ОсновнойСтатус = СтатусыОпераций.ОшибкаЗаполнения
		Или ОсновнойСтатус = СтатусыОпераций.ОшибкаОбработки
		Или ОсновнойСтатус = СтатусыОпераций.ОшибкаОтменыОперации Тогда
		Результат = 2;
	Иначе
		Результат = 3;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ОперацияОтправленаВСервис(СтатусОперации) Экспорт
	
	СтатусыОпераций = МодульОбъекта().Перечисление_СтатусыОпераций();
	
	СтатусыНеотправленныхОпераций = Новый Массив;
	СтатусыНеотправленныхОпераций.Добавить(СтатусыОпераций.Новый);
	СтатусыНеотправленныхОпераций.Добавить(СтатусыОпераций.ОшибкаЗаполнения);
	СтатусыНеотправленныхОпераций.Добавить(СтатусыОпераций.ОшибкаОбработки);
	
	Возврат СтатусыНеотправленныхОпераций.Найти(СтатусОперации) = Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьВопросОбУдаленииНепомеченныхОпераций()
	
	ЗаголовокВопроса = НСтр("ru = 'Подписание и отправка'");
	ТекстВопроса = НСтр("ru = 'Непомеченные операции будут удалены. Продолжить?'");
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПодписатьИОтправить_ПослеСогласия", ЭтаФорма);
	МодульКлиента().ПоказатьДиалогВопроса(ОписаниеОбработчика, ТекстВопроса, РежимДиалогаВопрос.ДаНет, ЗаголовокВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьИОтправить_ПослеСогласия(Ответ, ДопПараметры = Неопределено) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если СоздатьЗадачиОчередиОбмена() Тогда
		МодульКлиента().ВыполнитьОбменПоОрганизации(ЭтаФорма, Организация);
	КонецЕсли;
	
	ОбновитьСтатусыОпераций();
	
	НастроитьЭлементыФормы();
	УстановитьТекстИнформацииОбОшибках();
	
	Метрика_ГрупповаяОбработка_ОтправкаВСервис();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросОбУдаленииНеотправленныхОпераций()
	
	ЗаголовокВопроса = НСтр("ru = 'Закрытие групповой обработки'");
	ТекстВопроса = НСтр("ru = 'Не отправленные в сервис операции будут удалены. Продолжить?'");
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("УдалитьНеотправленныеОперацииИЗакрыть_ПослеСогласия", ЭтаФорма);
	МодульКлиента().ПоказатьДиалогВопроса(ОписаниеОбработчика, ТекстВопроса, РежимДиалогаВопрос.ДаНет, ЗаголовокВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьНеотправленныеОперацииИЗакрыть_ПослеСогласия(Ответ, ДопПараметры = Неопределено) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьНенужныеОперации(Истина);
	
	ПодключитьОбработчикОжидания("ЗакрытьФорму", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму()
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура УдалитьНенужныеОперации(УдалятьПомеченные = Ложь)
	
	УдаляемыеСтатусы = МодульОбъекта().УдаляемыеСтатусыОпераций();
	
	ОбновитьСтатусыОпераций();
	
	УдаляемыеСтроки = Новый Массив;
	УдаляемыеОперации = Новый Массив;
	
	Для Каждого Стр Из ТаблицаОпераций Цикл
		Если Стр.Пометка И Не УдалятьПомеченные Или Стр.ОтправленаВСервис Тогда
			Продолжить;
		КонецЕсли;
		Если УдаляемыеСтатусы.Найти(Стр.ОсновнойСтатус) <> Неопределено Тогда
			УдаляемыеСтроки.Добавить(Стр);
			УдаляемыеОперации.Добавить(Стр.Операция);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Стр Из УдаляемыеСтроки Цикл
		ТаблицаОпераций.Удалить(Стр);
	КонецЦикла;
	
	МодульОбъекта().Операции_Удалить(УдаляемыеОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыОперацийПослеУказанияЗначений(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьРеквизитыОперацийПослеУказанияЗначенийНаСервере(Результат);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыОперацийПослеУказанияЗначенийНаСервере(НастройкиРеквизитов) Экспорт
	
	ПерезаполнитьТЧ = ТребуетсяПерезаполнитьТабличнуюЧасть(НастройкиРеквизитов);
	
	НачатьТранзакцию(МодульОбъекта().РежимУправленияБлокировкой());
	Попытка
		
		Для Каждого Стр Из ТаблицаОпераций Цикл
			
			Если Не Стр.Пометка Тогда
				Продолжить;
			КонецЕсли;
			
			ОписаниеОперации = МодульОбъекта().Операция_Прочитать(Стр.Операция);
			МодульОбъекта().Операция_ЗаполнитьШапкуИзНастроекЗаполнения(ОписаниеОперации, НастройкиРеквизитов, Стр.Документ1С, Истина);
			
			Если ПерезаполнитьТЧ Тогда
				ТаблицаКодов = МодульОбъекта().Новый_ТаблицаКодов();
				МодульОбъекта().Операция_ПерезаполнитьТаблицыОперации(ОписаниеОперации, ТаблицаКодов);
				МодульОбъекта().Операция_Записать(ОписаниеОперации);
				МодульОбъекта().КодыОпераций_Записать(ТаблицаКодов, Стр.Операция);
			Иначе
				МодульОбъекта().Операция_Записать(ОписаниеОперации);
			КонецЕсли;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		Ошибка = ИнформацияОбОшибке();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ТребуетсяПерезаполнитьТабличнуюЧасть(НастройкиРеквизитов)
	
	Результат = Ложь;
	
	Реквизиты = МодульОбъекта().Перечисление_РеквизитыОперацийДляАвтозаполнения();
	
	РеквизитыТребующиеПерезаполненияТЧ = Новый Массив;
	РеквизитыТребующиеПерезаполненияТЧ.Добавить(Реквизиты.ПричинаВыводаИзОборота);
	
	Для Каждого ИмяРеквизита Из РеквизитыТребующиеПерезаполненияТЧ Цикл
		Если МодульОбъекта().МассивСтруктур_Найти(НастройкиРеквизитов, ИмяРеквизита, "ИмяРеквизита") <> Неопределено Тогда
			Результат = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПриИзмененииОперации(ДокументУчета)
	
	Отбор = Новый Структура("ДокументУчета", ДокументУчета);
	
	Для каждого Стр Из ТаблицаОпераций.НайтиСтроки(Отбор) Цикл
		Если Стр.Операция.ПолучитьОбъект() = Неопределено Тогда
			ТаблицаОпераций.Удалить(Стр);
		Иначе
			Стр.ОсновнойСтатус = МодульОбъекта().Операция_ОсновнойСтатус(Стр.Операция);
			Если ОперацияОтправленаВСервис(Стр.ОсновнойСтатус) Тогда
				Стр.ОтправленаВСервис = Истина;
				Стр.Пометка = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ТаблицаОпераций.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ПриУдаленииДокументаУчета(Документ1С)
	
	Отбор = Новый Структура("Документ1С", Документ1С);
	
	Для каждого Стр Из ТаблицаДокументов.НайтиСтроки(Отбор) Цикл
		Стр.ДокументУчета = Неопределено;
	КонецЦикла;
	
	Для каждого Стр Из ТаблицаОпераций.НайтиСтроки(Отбор) Цикл
		ТаблицаОпераций.Удалить(Стр);
	КонецЦикла;
	
КонецПроцедуры

// #КонецОбласти // СлужебныеПроцедурыИФункции

// #Область ОпросыПользователей

&НаКлиенте
Процедура ПровестиОпросПользователяИЗакрыть(Отказ)
	
	КлючиСценариев = МодульКлиента().Перечисление_КлючиСценариевДляОпросов();
	ОписаниеОпроса = МодульКлиента().ОпросПользователяПоСценарию(КлючиСценариев.ГрупповаяОбработка);
	
	Если ЗначениеЗаполнено(ОписаниеОпроса) Тогда
		Отказ = Истина;
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПослеОпросаПользователя", ЭтаФорма);
		МодульКлиента().ОткрытьФормуОпросаПользователя(ОписаниеОпроса, ЭтаФорма, ОписаниеОбработчика);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОпросаПользователя(РезультатВыбора, ДопПараметры = Неопределено) Экспорт
	
	ПодключитьОбработчикОжидания("ЗакрытьФорму", 0.1, Истина);
	
КонецПроцедуры

// #КонецОбласти // ОпросыПользователей

// #Область Метрики

&НаСервере
Функция ОписаниеДанныхГрупповойОбработкиДляМетрики(Действие)
	
	Результат = Новый Структура;
	
	ДействияМетрики = МодульОбъекта().Перечисление_ДействияМетрики();
	
	Операции = Новый Массив;
	ДокументыУчета = Новый Массив;
	ВидыПродукции = Новый Массив;
	Для каждого Стр Из ТаблицаОпераций Цикл
		Если Действие = ДействияМетрики.ОтправкаВСервис И Не Стр.ОтправленаВСервис Тогда
			Продолжить;
		КонецЕсли;
		Операции.Добавить(Стр.Операция);
		ДокументыУчета.Добавить(Стр.ДокументУчета);
		ВидыПродукции.Добавить(Стр.Операция.ВидПродукции);
	КонецЦикла;
	
	МодульОбъекта().СвернутьМассив_Марк(Операции);
	МодульОбъекта().СвернутьМассив_Марк(ДокументыУчета);
	МодульОбъекта().СвернутьМассив_Марк(ВидыПродукции);
	
	Результат.Вставить("ТипОперации", ТипОперации);
	Результат.Вставить("КоличествоДокументовУчета", ДокументыУчета.Количество());
	Результат.Вставить("КоличествоОпераций", Операции.Количество());
	Результат.Вставить("ВидПродукции", МодульОбъекта().СоединитьСтроку(ВидыПродукции, ";"));
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура Метрика_ГрупповаяОбработка_СозданиеОпераций()
	
	Если Не ЗначениеЗаполнено(ТаблицаОпераций) Тогда
		Возврат;
	КонецЕсли;
	
	Действие = МодульОбъекта().Перечисление_ДействияМетрики().ЗаписьВБазу;
	ОписаниеДляМетрики = ОписаниеДанныхГрупповойОбработкиДляМетрики(Действие);
	
	МодульОбъекта().Метрика_ГрупповаяОбработка(Действие, Организация, ОписаниеДляМетрики);
	
КонецПроцедуры

&НаСервере
Процедура Метрика_ГрупповаяОбработка_ОтправкаВСервис()
	
	ТаблицаОтправленныхОпераций = Таблицаопераций.Выгрузить(Новый Структура("ОтправленаВСервис", Истина));
	Если Не ЗначениеЗаполнено(ТаблицаОтправленныхОпераций) Тогда
		Возврат;
	КонецЕсли;
	
	Действие = МодульОбъекта().Перечисление_ДействияМетрики().ОтправкаВСервис;
	ОписаниеДляМетрики = ОписаниеДанныхГрупповойОбработкиДляМетрики(Действие);
	
	МодульОбъекта().Метрика_ГрупповаяОбработка(Действие, Организация, ОписаниеДляМетрики);
	
КонецПроцедуры

// #КонецОбласти // Метрики

