
// #Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		
		НоваяСсылка = ПолучитьСсылкуНового();
		
		Если Не ЗначениеЗаполнено(НоваяСсылка) Тогда
			НоваяСсылка = Справочники.КонтурМаркировка_КлючиНоменклатуры1С.ПолучитьСсылку(Новый УникальныйИдентификатор);
			УстановитьСсылкуНового(НоваяСсылка);
		КонецЕсли;
		
		Идентификатор = Строка(НоваяСсылка.УникальныйИдентификатор());
		
	Иначе
		Если Не ДополнительныеСвойства.Свойство("ОтключитьЗаписьАналитики") Тогда
			УдалитьСтаруюЗаписьКлючейАналитикиНоменклатуры1С();
		КонецЕсли;
	КонецЕсли;
	
	// Для поддержки платформы 8.2
	Наименование = Справочники.КонтурМаркировка_КлючиНоменклатуры1С.ПредставлениеНоменклатуры1С(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка
		Или ДополнительныеСвойства.Свойство("ОтключитьЗаписьАналитики") Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьКлючиАналитикиНоменклатуры1С();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Идентификатор = Неопределено;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	УдалитьСтаруюЗаписьКлючейАналитикиНоменклатуры1С();
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьКлючиАналитикиНоменклатуры1С()
	
	Набор = РегистрыСведений.КонтурМаркировка_КлючиАналитикиНоменклатуры1С.СоздатьНаборЗаписей();
	Набор.ДополнительныеСвойства.Вставить("ОтключитьЗаполнениеКлюча");
	
	Набор.Отбор.КлючНоменклатуры.Установить(КлючНоменклатуры);
	Набор.Отбор.КлючХарактеристики.Установить(КлючХарактеристики);
	Набор.Отбор.КлючУпаковки.Установить(КлючУпаковки);
	Набор.Отбор.КлючСерии.Установить(КлючСерии);
	
	Запись = Набор.Добавить();
	ЗаполнитьЗначенияСвойств(Запись, ЭтотОбъект);
	Запись.КлючНоменклатуры1С = Ссылка;
	
	Набор.Записать(Ложь);
	
КонецПроцедуры

Процедура УдалитьСтаруюЗаписьКлючейАналитикиНоменклатуры1С()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	РС.КлючНоменклатуры КАК КлючНоменклатуры,
	|	РС.КлючХарактеристики КАК КлючХарактеристики,
	|	РС.КлючУпаковки КАК КлючУпаковки,
	|	РС.КлючСерии КАК КлючСерии
	|ИЗ
	|	Справочник.КонтурМаркировка_КлючиНоменклатуры1С КАК Спр
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_КлючиАналитикиНоменклатуры1С КАК РС
	|		ПО Спр.КлючНоменклатуры = РС.КлючНоменклатуры
	|			И Спр.КлючХарактеристики = РС.КлючХарактеристики
	|			И Спр.КлючУпаковки = РС.КлючУпаковки
	|			И Спр.КлючСерии = РС.КлючСерии
	|			И Спр.Ссылка = РС.КлючНоменклатуры1С
	|ГДЕ
	|	Спр.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Запись = РегистрыСведений.КонтурМаркировка_КлючиАналитикиНоменклатуры1С.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Удалить();
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти