
// #Область СлужебныеПеременныеИМетодыФормы

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		Результат = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		Результат = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

// #КонецОбласти

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьКонтекст();
	УстановитьЗаголовок();
	НастроитьЭлементыФормы();
	УстановитьПредставлениеВидовПродукции(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	МодульКлиента().СохранитьИзмененияНаФорме("ЗаписатьИЗакрыть", ЭтаФорма, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если НРег(Страна) = НРег("Россия") Тогда
		ПроверяемыеРеквизиты.Добавить("ИНН");
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВидыПродукцииПредставлениеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СписокВыбора = СписокВидовПродукции();
	ЗаголовокВыбора = НСтр("ru = 'Виды продукции'");
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ВидыПродукцииПредставлениеПослеПометки", ЭтаФорма);
	МодульКлиента().ПоказатьДиалогОтметкиЭлементовВСписке(ОписаниеОбработчика, СписокВыбора, ЗаголовокВыбора);
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	Если Не МодульКлиента().ПроверитьУстановленнуюВерсиюМодуля() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьЗаполнениеПолей() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьНаСервере();
	
	Оповестить("КонтурМаркировка_СервисПровайдер_Изменен", Ссылка);
	
	ОповеститьОбИзменении(Ссылка);
	
	ПровестиОпросПользователяИЗакрыть();
	
КонецПроцедуры

// #КонецОбласти


// #Область ПроверкаЗаполнения

&НаКлиенте
Функция ПроверитьЗаполнениеПолей()
	
	ОчиститьСообщения();
	
	Возврат ПроверитьЗаполнениеПолейНаСервере();
	
КонецФункции

&НаСервере
Функция ПроверитьЗаполнениеПолейНаСервере()
	
	ЕстьОшибки = Не ПроверитьЗаполнение();
	
	Если Не ЗначениеЗаполнено(ВидыПродукции) Тогда
		ТекстОшибки = НСтр("ru = 'Необходимо заполнить Виды продукции'");
		МодульОбъекта().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор, "ВидыПродукцииПредставление");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Возврат Не ЕстьОшибки;
	
КонецФункции

// #КонецОбласти

// #Область ОпросыПользователей

&НаКлиенте
Процедура ПровестиОпросПользователяИЗакрыть()
	
	КлючиСценариев = МодульКлиента().Перечисление_КлючиСценариевДляОпросов();
	ОписаниеОпроса = МодульКлиента().ОпросПользователяПоСценарию(КлючиСценариев.СервисПровайдеры);
	
	Если ЗначениеЗаполнено(ОписаниеОпроса) Тогда
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПослеОпросаПользователя", ЭтаФорма);
		МодульКлиента().ОткрытьФормуОпросаПользователя(ОписаниеОпроса, ЭтаФорма, ОписаниеОбработчика);
		Возврат;
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОпросаПользователя(РезультатВыбора, ДопПараметры = Неопределено) Экспорт
	
	Закрыть();
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьНаСервере()
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		ОбъектСП = Ссылка.ПолучитьОбъект();
	Иначе
		ОбъектСП = Справочники.КонтурМаркировка_СервисПровайдеры.СоздатьЭлемент();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ОбъектСП, ЭтаФорма, , "ВидыПродукции");
	ОбъектСП.ВидыПродукции.Загрузить(РеквизитФормыВЗначение("ВидыПродукции"));
	
	ОбъектСП.Записать();
	Ссылка = ОбъектСП.Ссылка;
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтекст()
	
	Ссылка = Параметры.Ссылка;
	
	Параметры.Свойство("СсылкаДляКопирования", СсылкаДляКопирования);
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		ОбъектСП = Ссылка.ПолучитьОбъект();
	ИначеЕсли ЗначениеЗаполнено(СсылкаДляКопирования) Тогда
		ОбъектСП = СсылкаДляКопирования.ПолучитьОбъект();
	Иначе
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ОбъектСП, , "Ссылка, ВидыПродукции");
	ВидыПродукции.Загрузить(ОбъектСП.ВидыПродукции.Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы()
	
	СписокВыбора = Элементы.Страна.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().НаименованияСтранМира();
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовок()
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		
		СтрокаЗаголовка = СокрЛП(Ссылка);
		
	ИначеЕсли ЗначениеЗаполнено(СсылкаДляКопирования) Тогда
		
		СтрокаЗаголовка = НСтр("ru = 'Копирование'");
		
	Иначе
		
		СтрокаЗаголовка = НСтр("ru = 'Создание'");
		
	КонецЕсли;
	
	Заголовок = МодульОбъекта().ПараметрыВСтроку(НСтр(
	"ru = 'Сервис-провайдер: %1'"), СтрокаЗаголовка);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПредставлениеВидовПродукции(Форма)
	
	Форма.КоличествоВидовПродукции = Форма.ВидыПродукции.Количество();
	
	Если Не ЗначениеЗаполнено(Форма.ВидыПродукции) Тогда
		Форма.ВидыПродукцииПредставление = НСтр("ru = 'Выбрать'");
		Возврат;
	КонецЕсли;
	
	Представление = "";
	МаксимальнаяДлина = 60;
	ДлинаПредставления = 0;
	КоличествоДобавлено = 0;
	
	ОкончаниеСтроки = НСтр("ru = ' ( + еще %1 )'");
	Разделитель = "";
	
	Для Каждого Стр Из Форма.ВидыПродукции Цикл
		
		ТекПредставление = Разделитель + Строка(Стр.ВидПродукции);
		ДлинаПредставления = ДлинаПредставления + СтрДлина(ТекПредставление);
		Разделитель = ", ";
		
		ЭтоПерваяСтрока = (КоличествоДобавлено = 0);
		ЭтоПоследняяСтрока = (КоличествоДобавлено + 1 = Форма.КоличествоВидовПродукции);
		
		Если ЭтоПоследняяСтрока Тогда
			МаксимальнаяДлина = МаксимальнаяДлина + СтрДлина(ОкончаниеСтроки);
		КонецЕсли;
		
		Если ДлинаПредставления > МаксимальнаяДлина И Не ЭтоПерваяСтрока Тогда
			КоличествоЕще = Форма.КоличествоВидовПродукции - КоличествоДобавлено;
			Представление = Представление + СтрЗаменить(ОкончаниеСтроки, "%1", КоличествоЕще);
			Прервать;
		КонецЕсли;
		
		Представление = Представление + ТекПредставление;
		КоличествоДобавлено = КоличествоДобавлено + 1;
		
	КонецЦикла;
	
	Форма.ВидыПродукцииПредставление = Представление;
	
КонецПроцедуры

&НаСервере
Функция СписокВидовПродукции()
	
	Результат = Новый СписокЗначений;
	
	Для Каждого ВидПродукции Из Перечисления.КонтурМаркировка_ВидыПродукции Цикл
		ПараметрыОтбора = Новый Структура("ВидПродукции", ВидПродукции);
		Пометка = ЗначениеЗаполнено(ВидыПродукции.НайтиСтроки(ПараметрыОтбора));
		Результат.Добавить(ВидПродукции, , Пометка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВидыПродукцииПредставлениеПослеПометки(СписокЭлементов, ДопПараметры = Неопределено) Экспорт
	
	Если СписокЭлементов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВидыПродукции.Очистить();
	Для каждого Элемент Из СписокЭлементов Цикл
		Если Элемент.Пометка Тогда
			Стр = ВидыПродукции.Добавить();
			Стр.ВидПродукции = Элемент.Значение;
		КонецЕсли;
	КонецЦикла;
	
	УстановитьПредставлениеВидовПродукции(ЭтаФорма);
	
КонецПроцедуры

// #КонецОбласти
