
//#Область ПрограммныйИнтерфейс

// Открывает рабочий стол модуля маркировки
//
Процедура ОткрытьОсновнуюФорму() Экспорт
	
	ОткрытьФорму(ВзаимодействиеКонтурМаркировкаВызовСервера.ПутьКОсновнойФормеМодуля());
	
КонецПроцедуры

// Открывает форму модуля маркировки
//
Процедура ОткрытьФормуМодуля() Экспорт
	
	ОткрытьФорму(ВзаимодействиеКонтурМаркировкаВызовСервера.ПутьКФормеМодуля());
	
КонецПроцедуры

// Находит или создает документ учета в маркировке по документу 1С и открывает его форму
// Проходит авторизацию для нормализации, если в документ загружены коды
//
// Параметры:
//  Документ1С - ДокументСсылка - документ 1С;
//  ВызывающаяФорма - ФормаКлиентскогоПриложения - вызывающая форма;
//
Процедура ОткрытьФормуДокументаУчетаПоДокументу1С(Документ1С, ВызывающаяФорма) Экспорт
	
	ДокументУчета = МодульКонтурМаркировкаКлиент().НайтиИлиСоздатьДокументУчетаПоДокументу1С(Документ1С, ВызывающаяФорма);
	
	МодульКонтурМаркировкаКлиент().ОткрытьФормуДокументаУчета(ДокументУчета);
	
КонецПроцедуры

// Открывает форму документа учета через модуль маркировки
//
// Параметры:
//  ДокументУчета - СправочникСсылка.КонтурМаркировка_ДокументыУчета - документ учета, который нужно открыть
//
Процедура ОткрытьФормуДокументаУчета(ДокументУчета) Экспорт
	
	Если Не ЗначениеЗаполнено(ДокументУчета) Тогда
		ВызватьИсключение НСтр("ru = 'Не указан документ учета'");
	КонецЕсли;
	
	МодульКонтурМаркировкаКлиент().ОткрытьФормуДокументаУчета(ДокументУчета);
	
КонецПроцедуры

// Открывает форму операции через модуль маркировки
//
// Параметры:
//  Операция - СправочникСсылка.КонтурМаркировка_Операции - операция, которую нужно открыть
//
Процедура ОткрытьФормуОперации(Операция) Экспорт
	
	Если Не ЗначениеЗаполнено(Операция) Тогда
		ВызватьИсключение НСтр("ru = 'Не указана операция'");
	КонецЕсли;
	
	МодульКонтурМаркировкаКлиент().ОткрытьФормуОперации(Операция);
	
КонецПроцедуры

// Открывает форму кода через модуль маркировки
//
// Параметры:
//  КодМаркировки - Строка - нормализованный код, карточку которого нужно открыть
//
Процедура ОткрытьФормуКодаМаркировки(КодМаркировки) Экспорт
	
	Если Не ЗначениеЗаполнено(КодМаркировки) Тогда
		ВызватьИсключение НСтр("ru = 'Не указан код маркировки'");
	КонецЕсли;
	
	МодульКонтурМаркировкаКлиент().ОткрытьФормуКодаМаркировки(КодМаркировки);
	
КонецПроцедуры

// Открывает форму товара через модуль маркировки
//
// Параметры:
//  Товар - СправочникСсылка.КонтурМаркировка_Товары - товар, который нужно открыть
//
Процедура ОткрытьФормуТовара(Товар) Экспорт
	
	Если Не ЗначениеЗаполнено(Товар) Тогда
		ВызватьИсключение НСтр("ru = 'Не указан товар'");
	КонецЕсли;
	
	МодульКонтурМаркировкаКлиент().ОткрытьФормуТовара(Товар);
	
КонецПроцедуры

// Открывает форму организации через модуль маркировки
//
// Параметры:
//  Организация - СправочникСсылка.КонтурМаркировка_Организации - организация, которую нужно открыть
//
Процедура ОткрытьФормуОрганизации(Организация) Экспорт
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		ВызватьИсключение НСтр("ru = 'Не указана организация'");
	КонецЕсли;
	
	МодульКонтурМаркировкаКлиент().ОткрытьФормуОрганизации(Организация);
	
КонецПроцедуры

// Открывает форму склада через модуль маркировки
//
// Параметры:
//  Склад - СправочникСсылка.КонтурМаркировка_Склады - склад, который нужно открыть
//
Процедура ОткрытьФормуСклада(Склад) Экспорт
	
	Если Не ЗначениеЗаполнено(Склад) Тогда
		ВызватьИсключение НСтр("ru = 'Не указан склад'");
	КонецЕсли;
	
	МодульКонтурМаркировкаКлиент().ОткрытьФормуСклада(Склад);
	
КонецПроцедуры

// Открывает форму вида агрегата через модуль маркировки
//
// Параметры:
//  ВидАгрегата - СправочникСсылка.КонтурМаркировка_ВидыАгрегатов - вид агрегата, который нужно открыть
//
Процедура ОткрытьФормуВидаАгрегата(ВидАгрегата) Экспорт
	
	Если Не ЗначениеЗаполнено(ВидАгрегата) Тогда
		ВызватьИсключение НСтр("ru = 'Не указан вид агрегата'");
	КонецЕсли;
	
	МодульКонтурМаркировкаКлиент().ОткрытьФормуВидаАгрегата(ВидАгрегата);
	
КонецПроцедуры

// Открывает форму сервис провайдера через модуль маркировки
//
// Параметры:
//  СервисПровайдер - СправочникСсылка.КонтурМаркировка_СервисПровайдеры - вид агрегата, который нужно открыть
//
Процедура ОткрытьФормуСервисПровайдера(СервисПровайдер) Экспорт
	
	Если Не ЗначениеЗаполнено(СервисПровайдер) Тогда
		ВызватьИсключение НСтр("ru = 'Не указан сервис-провайдер'");
	КонецЕсли;
	
	МодульКонтурМаркировкаКлиент().ОткрытьФормуСервисПровайдера(СервисПровайдер);
	
КонецПроцедуры

// Открывает форму площадки через модуль маркировки
//
// Параметры:
//  Площадка - СправочникСсылка.КонтурМаркировка_Площадки - площадка;
//
Процедура ОткрытьФормуПлощадки(Площадка) Экспорт
	
	Если Не ЗначениеЗаполнено(Площадка) Тогда
		ВызватьИсключение НСтр("ru = 'Не указана площадка'");
	КонецЕсли;
	
	МодульКонтурМаркировкаКлиент().ОткрытьФормуПлощадки(Площадка);
	
КонецПроцедуры

// Открывает форму шаблона этикетки через модуль маркировки
//
// Параметры:
//  ШаблонЭтикетки - СправочникСсылка.КонтурМаркировка_ШаблоныЭтикеток - шаблон этикетки, который нужно открыть
//
Процедура ОткрытьФормуШаблонаЭтикетки(ШаблонЭтикетки) Экспорт
	
	Если Не ЗначениеЗаполнено(ШаблонЭтикетки) Тогда
		ВызватьИсключение НСтр("ru = 'Не указан шаблона этикетки'");
	КонецЕсли;
	
	МодульКонтурМаркировкаКлиент().ОткрытьФормуШаблонаЭтикетки(ШаблонЭтикетки);
	
КонецПроцедуры

// Открывает форму списка коэффицентов для расчета количества кодов по количеству товаров
//
Процедура ОткрытьФормуСпискаКоэффициентовПересчета() Экспорт
	
	МодульКонтурМаркировкаКлиент().ОткрытьФормуСпискаКоэффициентовПересчета();
	
КонецПроцедуры

// Открывает форму коэффицента для расчета количества кодов по количеству товаров
//
// Параметры:
//  КлючНоменклатуры1С - СправочникСсылка.КонтурМаркировка_КлючиНоменклатуры1С - ключ номенклатуры 1С
//
Процедура ОткрытьФормуКоэффициентаПересчета(КлючНоменклатуры1С) Экспорт
	
	МодульКонтурМаркировкаКлиент().ОткрытьФормуКоэффициентаПересчета(КлючНоменклатуры1С);
	
КонецПроцедуры

// Открывает форму списка настроек подписания
//
Процедура ОткрытьФормуСпискаНастроекПодписания() Экспорт
	
	МодульКонтурМаркировкаКлиент().ОткрытьФормуСпискаНастроекПодписания();
	
КонецПроцедуры

// Открывает форму настройки подписания
//
// Параметры:
//  Организация    - СправочникСсылка.КонтурМаркировка_Организации - организация;
//  Пользователь   - СправочникСсылка.КонтурМаркировка_Пользователи - пользователь;
//  Сертификат     - СправочникСсылка.КонтурМаркировка_Сертификаты - сертификат;
//
Процедура ОткрытьФормуНастройкиПодписания(Организация, Пользователь) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("Пользователь", Пользователь);
	
	МодульКонтурМаркировкаКлиент().ОткрытьФормуНастройкиПодписания(ПараметрыФормы);
	
КонецПроцедуры

// Открывает форму сертификата
//
// Параметры:
//  Сертификат     - СправочникСсылка.КонтурМаркировка_Сертификаты - сертификат;
//
Процедура ОткрытьФормуСертификата(Сертификат) Экспорт
	
	МодульКонтурМаркировкаКлиент().ОткрытьФормуСертификата(Сертификат);
	
КонецПроцедуры

// Открывает форму Мобильного ТСД через модуль маркировки
//
// Параметры:
//  МобильныйТСД - СправочникСсылка.КонтурМаркировка_МобильныеТСД - Мобильный ТСД
//
Процедура ОткрытьФормуМобильноеУстройство(МобильноеУстройство) Экспорт
	
	Если Не ЗначениеЗаполнено(МобильноеУстройство) Тогда
		ВызватьИсключение НСтр("ru = 'Не указан Мобильный ТСД'");
	КонецЕсли;
	
	МодульКонтурМаркировкаКлиент().ОткрытьФормуМобильноеУстройство(МобильноеУстройство);
	
КонецПроцедуры

//#КонецОбласти // ПрограммныйИнтерфейс

//#Область СлужебныйПрограммныйИнтерфейс

// Создает форму МодульКлиента обработки Контур.Маркировка
// 
// Возвращаемое значение:
//  ФормаКлиентскогоПриложения - форма модуля клиента маркировки;
//
Функция МодульКонтурМаркировкаКлиент() Экспорт
	
	ПараметрыФормы = ВзаимодействиеКонтурМаркировкаВызовСервера.ПараметрыСозданияМодуляКлиента();
	ИдентификаторСеанса = Строка(ПараметрыФормы.ИдентификаторСеанса);
	ПутьКФормеМодуляКлиента = ПараметрыФормы.ПутьКФормеМодуляКлиента;
	
	Возврат ВзаимодействиеКонтурМаркировкаКлиентПовтИсп.МодульКонтурМаркировкаКлиент(ПутьКФормеМодуляКлиента, ИдентификаторСеанса);
	
КонецФункции

//#КонецОбласти

// #Область УстаревшиеМетоды

// Устарела. следует использовать ОткрытьФормуДокументаУчетаПоДокументу1С
//
Процедура ОткрытьФормуДокументаУчетаПоДокументу(Документ1С) Экспорт
	
	ДокументУчета = ВзаимодействиеКонтурМаркировкаВызовСервера.НайтиДокументУчетаПоДокументу1С(Документ1С);
	
	Если Не ЗначениеЗаполнено(ДокументУчета) Тогда
		ДокументУчета = ВзаимодействиеКонтурМаркировкаВызовСервера.СоздатьДокументУчетаПоДокументу1С(Документ1С);
	КонецЕсли;
	
	МодульКонтурМаркировкаКлиент().ОткрытьФормуДокументаУчета(ДокументУчета);
	
КонецПроцедуры

// #КонецОбласти
