//	Copyright (C) 2012-2025 Engineer Mareev Enterprises
//	Модуль для УТ 10.3 Экспортирует сообщения orders из документа Перемещение товаров
//	Экспортирует ORDERS c характеристиками или сериями товара. 

//	$Перемещение товаров как отгрузка (неордерная схема) 
//  Экспорт сообщений ORDERS:
//	 - В 1С оператор (руч.) оформляет документ "Перемещение товаров", который при проведении (авт.) помечается к Экспорту.
//	 - 1С (авт.) экспортирует сообщение ORDERS.

#Область ПрограммныйИнтерфейс

//	Функция ПолучитьИмяСообщения возвращает имя сообщения DESPATCH
Функция ПолучитьИмяСообщения() Экспорт
	Возврат "orders";
КонецФункции

//	Функция ПолучитьМетаданные возвращает метаданные сообщения
Функция ПолучитьМетаданные() Экспорт
	Возврат Метаданные.Документы.ПеремещениеТоваров;
КонецФункции

//	Процедура ЭкспортироватьПеремещениеТоваровКакОтгрузка экспортирует одно перемещение товаров, как отгрузка со склада-отправителя
Процедура Экспортировать(ERPData, Перемещение) Экспорт
	
	АктуализироватьУИДыСтрок(Перемещение.Ссылка);   
	
	//	Заголовок заказа
	EmeWmsERPEngine.AppendHeaderLine(ERPData);
	
	ERPData.header.order_id       	= Перемещение.УникальныйИдентификатор();
	Если Константы.EmeWmsСоздаватьУникальныеСообщения.Получить() Тогда
		ERPData.header.id	  		= Новый УникальныйИдентификатор;
	Иначе
		ERPData.header.id	  		= ERPData.header.order_id;
	КонецЕсли;
	
	НаименованияРеквизитов = "Номер, Дата, СкладОтправитель, СкладПолучатель, Организация, Комментарий, ЗонаДоставки, ДатаДоставки";  //тут
	РеквизитыДокумента   = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Перемещение.Ссылка, НаименованияРеквизитов);
	
	ERPData.header.order_no		  	= СокрЛП(РеквизитыДокумента.Номер)+"/"+Формат(Год(РеквизитыДокумента.Дата),"ЧГ=4");
	ERPData.header.order_date	  	= РеквизитыДокумента.Дата;
	ERPData.header.erp_doc_type	  	= ПолучитьМетаданные().Имя;
	ERPData.header.whs_code 	  	= EmeWmsУтилиты.ПолучитьКодСкладаEMEПоСсылке(РеквизитыДокумента.СкладОтправитель, 
	РеквизитыДокумента.Организация);
	ERPData.header.vendor_code	 	= EmeWmsУтилиты.ПолучитьКодОрганизацииEMEПоСсылке(РеквизитыДокумента.Организация);
	
	ERPData.header.customer_id  	= Перемещение.Организация.УникальныйИдентификатор();
	ERPData.header.customer_code  	= Перемещение.Организация.ИНН;
	ERPData.header.customer_name  	= Перемещение.Организация.Наименование;   
	
	СведенияОбОрганизации 			= УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Перемещение.Организация, Перемещение.Дата);
	АдресОрганизации				= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "ФактическийАдрес");
	ERPData.header.customer_addr	= АдресОрганизации;
	
	РеквизитыПолучателя			 	= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РеквизитыДокумента.СкладПолучатель, "Наименование, Код");
	ERPData.header.delivery_id    	= РеквизитыДокумента.СкладПолучатель.УникальныйИдентификатор();
	ERPData.header.delivery_code  	= РеквизитыПолучателя.Код;	
	ERPData.header.delivery_name  	= РеквизитыПолучателя.Наименование;
	ERPData.header.delivery_addr  	= АдресОрганизации;
	
	ERPData.header.comment        	= Лев(РеквизитыДокумента.Комментарий, 128);
		
		//280125  Если склад МХ добавлять датудоставки и зону
		Если LA_ОбщийМодуль.ЭтоСкладМХ(РеквизитыДокумента.СкладПолучатель) Тогда
			ERPData.header.despatch_date 	= РеквизитыДокумента.ДатаДоставки;  //тут
			Если Не ЗначениеЗаполнено(ERPData.header.despatch_date) Тогда
				ERPData.header.despatch_date = РеквизитыДокумента.Дата;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(РеквизитыДокумента.ЗонаДоставки) Тогда           // проверить
				ЗонаДоставки = РеквизитыДокумента.ЗонаДоставки; 
				Попытка
					ERPData.header.despatch_date = Дата(Формат(ERPData.header.despatch_date, "ДФ=ггггММдд")
					+ Формат(ЗонаДоставки.ВремяОтправления, "ДФ=ччммсс"));
				Исключение
				КонецПопытки;
				
				ERPData.header.route_no = ЗонаДоставки.Код;
				ERPData.header.priority = ЗонаДоставки.ПриоритетЗоныДоставки;
			КонецЕсли;
		КонецЕсли;		
		
//	Использование серий в интеграции
	ИспользоватьСерии = Константы.EmeWmsИспользоватьСерии.Получить();	
	
	//	Строки перемещения
	EmeWmsERPEngine.SelectChild(ERPData, "lines");
	Для Каждого СтрокаТовара Из Перемещение.Товары Цикл
		Если Не ЗначениеЗаполнено(СтрокаТовара.Номенклатура) ИЛИ СтрокаТовара.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;   
		
		РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТовара.Номенклатура, "БазоваяЕдиницаИзмерения, Код, 
		|ВестиУчетПоСериям, ВестиУчетПоХарактеристикам");
		
		Если Не ЗначениеЗаполнено(РеквизитыНоменклатуры.БазоваяЕдиницаИзмерения) Тогда
			Продолжить;
		КонецЕсли;   
		
		EmeWmsERPEngine.AppendChildLine(ERPData);
		
		ERPData.lines.id			= СтрокаТовара.EmeWmsУИДСтроки;
		ERPData.lines.order_line_no	= СтрокаТовара.НомерСтроки;
		ERPData.lines.goods_id		= СтрокаТовара.Номенклатура.УникальныйИдентификатор();
		ERPData.lines.goods_code	= СокрЛП(РеквизитыНоменклатуры.Код);
		ERPData.lines.quantity		= EmeWmsУтилиты.ПересчетВДругуюЕдиницу(СтрокаТовара.Количество, 
		СтрокаТовара.ЕдиницаИзмерения,
		РеквизитыНоменклатуры.БазоваяЕдиницаИзмерения);
		
															   
		Если ЗначениеЗаполнено(РеквизитыНоменклатуры.БазоваяЕдиницаИзмерения) Тогда
			ERPData.lines.mu_code = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыНоменклатуры.БазоваяЕдиницаИзмерения, "Код"); 
		КонецЕсли;															   
		
		// Серии или серийные номера
		Если Не ИспользоватьСерии Тогда
			РеквизитыНоменклатуры.ВестиУчетПоСериям = Ложь;
		КонецЕсли;
		
		Если РеквизитыНоменклатуры.ВестиУчетПоСериям Тогда // Серии
			Если НЕ СтрокаТовара.СерияНоменклатуры.Пустая() Тогда  
				РеквизитыСерии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТовара.СерияНоменклатуры, "Наименование,СрокГодности");
				
				// Когда Серия - это партия, укажем Серию из документа
				Если ЗначениеЗаполнено(РеквизитыСерии.Наименование) Тогда   
					ERPData.lines.lot_no = РеквизитыСерии.Наименование;      
					ERPData.lines.bbd	 = РеквизитыСерии.СрокГодности;  
				КонецЕсли;
			КонецЕсли;
		Иначе // Характеристики	
			Если РеквизитыНоменклатуры.ВестиУчетПоХарактеристикам Тогда
				Если НЕ СтрокаТовара.ХарактеристикаНоменклатуры.Пустая() Тогда
					ERPData.lines.lot_no = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовара.ХарактеристикаНоменклатуры, "Наименование");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;   
		
		// Поставщик из строки табличной части товары
		Если ЗначениеЗаполнено(СтрокаТовара.Поставщик) Тогда
			ERPData.lines.supplier_id    =	СтрокаТовара.Поставщик.УникальныйИдентификатор();
		КонецЕсли;		
		
		Если СтрокаТовара.Номенклатура.ПометкаУдаления Тогда
			EmeWmsЭкспортНоменклатуры.ПометитьКЭкспортуБезусловно(СтрокаТовара.Номенклатура);
		ИначеЕсли НЕ EmeWmsЭкспортНоменклатуры.Экспортирован(СтрокаТовара.Номенклатура) Тогда
			EmeWmsЭкспортНоменклатуры.РазрешитьЭкспортСГруппами(СтрокаТовара.Номенклатура);
		КонецЕсли;
	КонецЦикла;		
	
КонецПроцедуры

#КонецОбласти

#Область ЭкспортныеСлужебныеПроцедурыИФункции

//	Функция РазрешенКЭкспорту возвращает Истина, если перемещение товаров разрешено к экспорту.
Функция РазрешенКЭкспорту(ПеремещениеТоваров) Экспорт
	
	ДатаЗапускаИнтеграции = Константы.EmeWmsДатаЗапускаИнтеграции.Получить();
	Если ЗначениеЗаполнено(ДатаЗапускаИнтеграции)
			И ПеремещениеТоваров.Дата < ДатаЗапускаИнтеграции Тогда
		ОтменитьЭкспорт(ПеремещениеТоваров);
		Возврат Ложь;
	КонецЕсли;	

	Если ПеремещениеТоваров.ПометкаУдаления Тогда
		ОтменитьЭкспорт(ПеремещениеТоваров);
		Возврат Ложь;
	КонецЕсли;

	Если НЕ ПеремещениеТоваров.Проведен Тогда
		ОтменитьЭкспорт(ПеремещениеТоваров);
		Возврат Ложь;
	КонецЕсли;
	
	// Экспорт когда склада-отправитель из EME.WMS, а склад получатель - нет. 
	КодСкладаПолучателя = EmeWmsУтилиты.ПолучитьКодСкладаEMEПоСсылке(ПеремещениеТоваров.СкладПолучатель, ПеремещениеТоваров.Организация);
	КодСкладаОтправителя = EmeWmsУтилиты.ПолучитьКодСкладаEMEПоСсылке(ПеремещениеТоваров.СкладОтправитель,  ПеремещениеТоваров.Организация);
	Если НЕ (КодСкладаПолучателя = неопределено И КодСкладаОтправителя <> неопределено) Тогда 
		// Если оба склада из WMS, отменить экспорт. Перемещения Transfer в этой интеграции не используются
		Если НЕ (КодСкладаПолучателя <> неопределено И КодСкладаОтправителя <> неопределено) Тогда 
			ОтменитьЭкспорт(ПеремещениеТоваров);
		КонецЕсли;    

		Возврат Ложь;
	КонецЕсли;    

	Если ПеремещениеИмпортировано(ПеремещениеТоваров) Тогда   	
		ОтменитьЭкспорт(ПеремещениеТоваров);
		Возврат Ложь;
	КонецЕсли;                            
		
	Возврат Истина;
	
КонецФункции

//	Процедура ОтменитьЭкспорт отменяет экспорт документа РТУ.
Процедура ОтменитьЭкспорт(Документ) Экспорт
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуПеремещенийТоваровКакОтгрузка.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПеремещениеТоваров.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Ложь;
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
КонецПроцедуры

//	Процедура ПодтвердитьЭкспорт подтверждает экспорт перемещения товаров.
Процедура ПодтвердитьЭкспорт(ПеремещениеТоваровСсылка) Экспорт

	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуПеремещенийТоваровКакОтгрузка.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПеремещениеТоваров.Установить(ПеремещениеТоваровСсылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Ложь;
		Запись.ДатаЭкспорта = ТекущаяДата();
		НаборЗаписей.Записать();
	КонецЦикла;	

КонецПроцедуры

//	Процедура ПометитьКЭкспорту помечает перемещение товаров к экспорту.
Процедура ПометитьКЭкспорту(ПеремещениеТоваров) Экспорт

	Если Не РазрешенКЭкспорту(ПеремещениеТоваров) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуПеремещенийТоваровКакОтгрузка.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПеремещениеТоваров.Установить(ПеремещениеТоваров.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Истина;
		Запись.ДатаЭкспорта = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsПометкиКЭкспортуПеремещенийТоваровКакОтгрузка.СоздатьМенеджерЗаписи();
	НоваяЗапись.ПеремещениеТоваров = ПеремещениеТоваров.Ссылка;
	НоваяЗапись.КЭкспорту = Истина;
	НоваяЗапись.ДатаЭкспорта = ТекущаяДата();
    НоваяЗапись.Записать(); 
		 
КонецПроцедуры

//	Процедура ПометитьКЭкспорту помечает перемещение товаров на событии при записи перемещения товаров.
Процедура ПометитьКЭкспортуПриЗаписиПеремещенийТоваровКакОтгрузка(Источник, Отказ) Экспорт
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//	Помечать, если включен режим пометок к экспорту
	Если Константы.EmeWmsПометкаВключена.Получить() Тогда
		ПометитьКЭкспорту(Источник);
	КонецЕсли;		 
КонецПроцедуры  

//	Функция ПолучитьВыборкуСсылок возвращает выборку ссылок для экспорта
Функция ПолучитьВыборкуСсылок() Экспорт
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	EmeWmsПометкиКЭкспортуПеремещенийТоваров.ПеремещениеТоваров КАК Ссылка
		|ИЗ
		|	РегистрСведений.EmeWmsПометкиКЭкспортуПеремещенийТоваровКакОтгрузка КАК EmeWmsПометкиКЭкспортуПеремещенийТоваров
		|ГДЕ
		|	EmeWmsПометкиКЭкспортуПеремещенийТоваров.КЭкспорту";
		
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции  

//	Функция ПомеченКЭкспорту возвращает Истина, если перемещение товаров помечено к экспорту.
Функция ПомеченКЭкспорту(ПеремещениеТоваров) Экспорт
	
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуПеремещенийТоваровКакОтгрузка.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПеремещениеТоваров.Установить(ПеремещениеТоваров.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Возврат Запись.КЭкспорту;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#Область ЛокальныеСлужебныеПроцедурыИФункции     

//	Создать новые УИДы строк ТЧ товары документа и исправить дубли, если возникли (при копировании)
Процедура АктуализироватьУИДыСтрок(ДокументСсылка)
	//	Проверим наличие строк к заполнению реквизита EmeWmsУИДСтроки, прежде чем получать Объект
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИСТИНА КАК ИзменятьEmeWmsУИДСтроки
		|ИЗ
		|	Документ.ПеремещениеТоваров.Товары КАК ТЧТовары
		|ГДЕ
		|	ТЧТовары.Ссылка = &Ссылка
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(ТЧТовары.EmeWmsУИДСтроки) 
		|	<> КОЛИЧЕСТВО(РАЗЛИЧНЫЕ 
		|		ВЫБОР
		|			КОГДА ТЧТовары.EmeWmsУИДСтроки > """"
		|				ТОГДА ТЧТовары.EmeWmsУИДСтроки
		|			ИНАЧЕ NULL
		|		КОНЕЦ)";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	// Для исключения дублей УИД в строках ТЧ
	КлючиСтрок 					= Новый Соответствие;
	БылиСозданыИдентификаторы 	= Ложь;

	Документ = ДокументСсылка.ПолучитьОбъект();
	Для Каждого СтрокаТовара Из Документ.Товары Цикл 
		// Генерация специальных UID строк документа при выгрузке
		Если НЕ ЗначениеЗаполнено(СтрокаТовара.EmeWmsУИДСтроки) ИЛИ КлючиСтрок.Получить(СтрокаТовара.EmeWmsУИДСтроки) <> Неопределено Тогда
			СтрокаТовара.EmeWmsУИДСтроки 	= Новый УникальныйИдентификатор();
			БылиСозданыИдентификаторы 		= Истина;
		КонецЕсли;
		КлючиСтрок.Вставить(СтрокаТовара.EmeWmsУИДСтроки, 0);
	КонецЦикла;	
	
	Если БылиСозданыИдентификаторы Тогда
		// При записи не перепроводить, не регистрировать по подписке к Эксопрту
		Документ.ОбменДанными.Загрузка = Истина;
		Документ.Записать();
	КонецЕсли; 
	
КонецПроцедуры

//	Проверить, было импортировано перемещение, или нет
Функция ПеремещениеИмпортировано(Документ)
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеПеремещенийТоваровКакОтгрузка.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Возврат Истина;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции

#КонецОбласти




