
// Создает товары маркировки по номенклатуре 1С на основании штрихкодов.
//
// Параметры:
//  НоменклатураИлиМассив - СправочникСсылка, Массив - номенклатура 1С или массив ссылок номенклатуры;
//  ТолькоСоздаватьНовые - Булево - Истина, если нужно только создавать новые товары, без обновления существующих;
//
// Возвращаемое значение:
//  Структура - результат создания/обновления товаров, см. Товары_СоздатьОбновитьПоИнформацииИзСервиса();
//
Функция СоздатьТоварыМаркировкиПоНоменклатуре1С(НоменклатураИлиМассив, ТолькоСоздаватьНовые = Истина) Экспорт

	МассивНоменклатуры = Новый Массив;
	Если ТипЗнч(НоменклатураИлиМассив) = Тип("Массив") Тогда
		МассивНоменклатуры = НоменклатураИлиМассив;
	ИначеЕсли ЗначениеЗаполнено(НоменклатураИлиМассив) Тогда
		МассивНоменклатуры.Добавить(НоменклатураИлиМассив);
	КонецЕсли;

	МодульМаркировка = ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	МассивGTIN = МодульМаркировка.Номенклатура1С_МассивGTIN(МассивНоменклатуры, Ложь);

	Возврат МодульМаркировка.Товары_СоздатьОбновитьПоИнформацииИзСервиса(МассивGTIN, ТолькоСоздаватьНовые);

КонецФункции
