
// #Область ОписаниеПеременных

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		Результат = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		Результат = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

// #КонецОбласти

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьТипыЭлементов();
	ЗаполнитьСпискиВыбора();
	ЗаполнитьСпискиЗначений();
	
	Если Параметры.Свойство("ДокументУчета") И ЗначениеЗаполнено(Параметры.ДокументУчета) Тогда
		ДокументУчета = Параметры.ДокументУчета;
		ПрочитатьИнформациюПоДокументУчетаНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьЭлементыФормы();
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДокументУчетаПриИзменении(Элемент)
	
	ПрочитатьИнформациюПоДокументУчетаНаСервере();
	НастроитьЭлементыФормы();
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументУчетаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МодульКлиента().ОткрытьФормуДокументаУчета(ДокументУчета, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Документ1СПриИзменении(Элемент)
	
	Документ1СПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьСкрытыеПоляПриИзменении(Элемент)
	
	НастроитьЭлементыФормы();
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовТаблицыФормыТоварыДокумента

&НаКлиенте
Процедура ТоварыДокументаПриАктивизацииСтроки(Элемент)
	
	ТоварыМаркировки_УстановитьОтборСтрок();
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовТаблицыФормыОперации

&НаКлиенте
Процедура СписокОперацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеСтроки = СписокОпераций.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
	"ПослеВыбораСпособаОткрытияОперации"
	, ЭтаФорма
	, ДанныеСтроки.ОперацияСсылка);
	
	СпособыОткрытия = МодульКлиента().СписокСпособовОткрытияЗначения();
	МодульКлиента().ПоказатьДиалогВыбораИзМеню(ЭтаФорма, ОписаниеОбработчика, СпособыОткрытия, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораСпособаОткрытияОперации(Результат, Операция = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СпособыОткрытияЗначения = МодульКлиента().Перечисление_СпособыОткрытияЗначения();
	
	Если Результат.Представление = СпособыОткрытияЗначения.ВФормеОбъекта Тогда
		МодульКлиента().ОткрытьФормуОперации(Операция, ЭтаФорма);
	Иначе
		МодульКлиента().ОткрытьФормуРедактораОперации(Операция, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаКодов

&НаКлиенте
Процедура ТаблицаКодовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПараметрыОтбора = ПараметрыОтбораКодовПоДаннымСтроки(Элемент.ТекущиеДанные);
	АдресТаблицы = ПоместитьКодыДокументаВХранилище(ПараметрыОтбора);
	
	МодульКлиента().ОткрытьФормуПросмотраТаблицы(ЭтаФорма, АдресТаблицы, Истина);
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиКомандФормы

// Команды ТаблицаКодов

&НаКлиенте
Процедура ОбновитьИнформациюОКодахИзИБ(Команда)
	
	ЗаполнитьИнформациюОКодахПоДокументу();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнформациюИзГИСМТ(Команда)
	
	Если НЕ ЗначениеЗаполнено(ДокументУчета) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ВыполнитьАвторизацию_ОрганизацияПоУмолчанию() Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьСтатусыКодовДокументаНаСервере();
	ЗаполнитьИнформациюОКодахПоДокументу();
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьДатуПечатиКодов(Команда)
	
	Если Не ЗначениеЗаполнено(ДокументУчета) Тогда
		Возврат;
	КонецЕсли;
	
	СброситьДатуПечатиКодовНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьДатуПечатиСОтбором(Команда)
	
	Если НЕ ЗначениеЗаполнено(ДокументУчета) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = ПараметрыОтбораКодовПоТекущейСтроке();
	
	СброситьДатуПечатиКодовНаСервере(ПараметрыОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьИнформациюОКодахСОтбором(Команда)
	
	ПараметрыОтбора = ПараметрыОтбораКодовПоТекущейСтроке();
	
	Если НЕ ЗначениеЗаполнено(ДокументУчета) Тогда
		Возврат;
	КонецЕсли;

	АдресТаблицыКодов = ПоместитьКодыДокументаВХранилище(ПараметрыОтбора);
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПослеЗавершенияРедактированияКодов", ЭтаФорма);
	
	МодульКлиента().ОткрытьФормуГрупповоеИзменениеИнформацииОКодах(ЭтаФорма, АдресТаблицыКодов, ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗавершенияРедактированияКодов(РезультатЗакрытия, ДопПараметры = Неопределено) Экспорт

	Если РезультатЗакрытия Тогда
		ЗаполнитьИнформациюОКодахПоДокументу();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасформироватьАгрегатыСОтбором(Команда)
	
	Если НЕ ЗначениеЗаполнено(ДокументУчета) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = ПараметрыОтбораКодовПоТекущейСтроке();
	
	РасформироватьАгрегатыВДокументеУчета(ПараметрыОтбора);
	ЗаполнитьИнформациюОКодахПоДокументу();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереформироватьТранспортныеАгрегатыСОтбором(Команда)
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПереформироватьТранспортныеАгрегатыПослеСогласия", ЭтаФорма);
	
	ТекстВопроса = НСтр("ru='Коды агрегатов SSCC будут переформированы с учетом настройки модуля.
	|Вы уверены, что хотите выполнить команду?'");
	
	МодульКлиента().ПоказатьДиалогВопроса(ОписаниеОбработчика, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереформироватьТранспортныеАгрегатыПослеСогласия(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПереформироватьТранспортныеАгрегатыИспользоватьВложенныеКоды", ЭтаФорма);
	
	ТекстВопроса = НСтр("ru='Изменить транспортные упаковки вложенных кодов?'");
	МодульКлиента().ПоказатьДиалогВопроса(ОписаниеОбработчика, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереформироватьТранспортныеАгрегатыИспользоватьВложенныеКоды(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = ПараметрыОтбораКодовПоТекущейСтроке();
	ИспользоватьВложенныеКоды = Результат = КодВозвратаДиалога.Да;
	
	ПереформироватьТранспортныеАгрегаты(ДокументУчета, ПараметрыОтбора, ИспользоватьВложенныеКоды);
	ЗаполнитьИнформациюОКодахПоДокументу();
	
КонецПроцедуры

// Команды Группировки

&НаКлиенте
Процедура ИзменитьПараметрыГруппировкиКодов(Команда)
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПослеВыбораПолейГруппировкиКодов", ЭтаФорма);
	МодульКлиента().ПоказатьДиалогОтметкиЭлементовВСписке(ОписаниеОбработчика
	, ПараметрыГруппировкиКодов.Скопировать()
	, НСтр("ru='Выберите поля группировки'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПолейГруппировкиКодов(Результат, ДопПараметры = Неопределено) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьОтмеченныеПоля = Ложь;
	
	Для Каждого ИмяПоляГруппировки Из Результат Цикл
		
		Если ИмяПоляГруппировки.Пометка Тогда
			ЕстьОтмеченныеПоля = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьОтмеченныеПоля Тогда
		ПараметрыГруппировкиКодов = Результат.Скопировать();
	КонецЕсли;
	
	ЗаполнитьИнформациюОКодахПоДокументу();
	НастроитьВидимость_ТаблицаКодов();
	
КонецПроцедуры

// Команды ОсновнаяИнформация

&НаКлиенте
Процедура ОбновитьИнформациюИзИБ(Команда)
	
	ПрочитатьИнформациюПоДокументУчетаНаСервере();
	НастроитьЭлементыФормы();
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДанные(Команда)
	
	Если Модифицированность Тогда
		
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("СохранитьИзмененияПослеСогласия", ЭтаФорма);
		МодульКлиента().ПодтвердитьДействияТехническогоСпециалиста(ОписаниеОбработчика);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИзмененияПослеСогласия(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ЗаписатьДанныеНаСервере();
		НастроитьЭлементыФормы();
		
		Модифицированность = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьДокументУчета(Команда)
	
	ПерезаполнитьДокументУчетаНаСервере();
	НастроитьЭлементыФормы();
	
	Модифицированность = Ложь;
	
КонецПроцедуры

// Команды Контур.Маркировка Администратор

&НаКлиенте
Процедура ОткрытьОсновнуюФорму(Команда)
	
	МодульКлиента().ОткрытьФормуАдминистратораМаркировки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНовоеСвязанноеОкно(Команда)
	
	МодульКлиента().ОткрытьФормуРедактораДокументаУчета(, ЭтаФорма);
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

// ПриСозданииНаСервере

&НаСервере
Процедура УстановитьТипыЭлементов()
	
	ОписаниеОбъектовИС = МодульОбъекта().ОписаниеОбъектовИС();
	
	МодульОбъекта().УстановитьОграничениеПоТипу(Элементы.ТоварыДокументаНоменклатура, ОписаниеОбъектовИС.Номенклатура);
	Если ЗначениеЗаполнено(ОписаниеОбъектовИС.Характеристика) Тогда
		МодульОбъекта().УстановитьОграничениеПоТипу(Элементы.ТоварыДокументаХарактеристика, ОписаниеОбъектовИС.Характеристика);
		УстановитьСвязьХарактеристикиСНоменклатурой(Элементы.ТоварыДокументаХарактеристика);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОписаниеОбъектовИС.Упаковка) Тогда
		МодульОбъекта().УстановитьОграничениеПоТипу(Элементы.ТоварыДокументаУпаковка, ОписаниеОбъектовИС.Упаковка);
		УстановитьСвязьУпаковкиСНоменклатурой(Элементы.ТоварыДокументаУпаковка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвязьУпаковкиСНоменклатурой(Элемент)
	
	ПутьКДанным = "Элементы.ТоварыДокумента.ТекущиеДанные.Номенклатура";
	СвязиПараметров = Новый Массив;
	СвязиПараметров.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", ПутьКДанным));
	СвязиПараметров.Добавить(Новый СвязьПараметраВыбора("Номенклатура", ПутьКДанным));
	Элемент.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиПараметров);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвязьХарактеристикиСНоменклатурой(Элемент)
	
	ОписаниеОбъектовИС = МодульОбъекта().ОписаниеОбъектовИС();
	ПутьКРеквизиту = ОписаниеОбъектовИС.Номенклатура + ".Реквизиты.ИспользованиеХарактеристик";
	ЕстьОбщиеХарактеристики = МодульОбъекта().ЕстьНеобходимыеМетаданные(ПутьКРеквизиту);
	
	ПутьКДанным = "Элементы.ТоварыДокумента.ТекущиеДанные.Номенклатура";
	СвязиПараметров = Новый Массив;
	СвязиПараметров.Добавить(Новый СвязьПараметраВыбора("Номенклатура", ПутьКДанным));
	
	Если Не ЕстьОбщиеХарактеристики Тогда
		СвязиПараметров.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", ПутьКДанным));
	КонецЕсли;
	
	Элемент.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиПараметров);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбора()
	
	СтатусыДокументовУчета = МодульОбъекта().Перечисление_СтатусыДокументовУчета();
	МодульОбъекта().ЗаполнитьСписокВыбора(Элементы.ОсновнойСтатус.СписокВыбора, СтатусыДокументовУчета);
	
	ТребуемыеДействия = МодульОбъекта().Перечисление_ТребуемыеДействияДокументовУчета();
	МодульОбъекта().ЗаполнитьСписокВыбора(Элементы.ТребуемоеДействие.СписокВыбора, ТребуемыеДействия);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиЗначений()
	
	ПараметрыГруппировкиКодов.Очистить();
	Для Каждого Значение Из Перечисление_ПоляГруппировкиКодов() Цикл
		ПараметрыГруппировкиКодов.Добавить(Значение, , Истина);
	КонецЦикла;
	
КонецПроцедуры

// ПриОткрытии

&НаКлиенте
Процедура НастроитьЭлементыФормы()
	
	НастроитьВидимость();
	УстановитьЗаголовок();
	
	ТоварыМаркировки_УстановитьОтборСтрок();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимость()
	
	Элементы.Кнопка_ПерезаполнитьДокументУчета.Доступность = ЗначениеЗаполнено(Документ1С);
	
	НастроитьВидимость_ТоварыДокумента();
	НастроитьВидимость_ТоварыМаркировки();
	НастроитьВидимость_ТаблицаКодов();

КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимость_ТоварыДокумента()
	
	Для Каждого ИмяКолонки Из МодульКлиента().Перечисление_СкрываемыеПоляТоваровДокумента() Цикл 
		Элементы["ТоварыДокумента" + ИмяКолонки].Видимость = ОтображатьСкрытыеПоля;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТоварыДокумента) И Не ОтображатьСкрытыеПоля Тогда
		УстановитьВидимостьКолонкиТоваров("Характеристика");
		УстановитьВидимостьКолонкиТоваров("Упаковка");
		УстановитьВидимостьКолонкиТоваров("Серия");
		УстановитьВидимостьКолонкиТоваров("Цена");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимость_ТоварыМаркировки()
	
	Для Каждого ИмяКолонки Из МодульКлиента().Перечисление_СкрываемыеПоляТоваровМаркировки() Цикл
		Элементы["ТоварыМаркировки" + ИмяКолонки].Видимость = ОтображатьСкрытыеПоля;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимость_ТаблицаКодов()
	
	Для Каждого Колонка Из ПараметрыГруппировкиКодов Цикл
		Элементы["ТаблицаКодов" + Колонка.Значение].Видимость = Колонка.Пометка;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовок()
	
	ШаблонЗаголовка = НСтр("ru='Контур.Маркировка (Администратор) Редактор документа: %1'");
	ЭтаФорма.Заголовок = МодульКлиента().ПараметрыВСтроку(ШаблонЗаголовка, ДокументУчета);
	
КонецПроцедуры

// ТоварыДокумента

&НаСервере
Процедура ТоварыДокументы_РассчитатьИтоги()
	
	ИтогоЦена = ТоварыДокумента.Итог("Цена");
	ИтогоКоличество = ТоварыДокумента.Итог("Количество");
	ИтогоКоличествоУпаковок = ТоварыДокумента.Итог("КоличествоУпаковок");
	
КонецПроцедуры

// ТоварыМаркировки

&НаКлиенте
Процедура ТоварыМаркировки_УстановитьОтборСтрок()
	
	Если ОтображатьСкрытыеПоля Тогда
		Элементы.ТоварыМаркировки.ОтборСтрок = Неопределено;
		Возврат;
	КонецЕсли;
	
	СтрокаДокумента = Элементы.ТоварыДокумента.ТекущиеДанные;
	Если СтрокаДокумента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КлючСтрокиДокумента = СтрокаДокумента.КлючСтрокиДокумента;
	НеПодлежитМаркировке = СтрокаДокумента.НеПодлежитМаркировке;
	
	Если НеПодлежитМаркировке Тогда
		ПараметрыОтбора = Новый ФиксированнаяСтруктура("КлючСтрокиДокумента", МодульОбъекта().ПустойУникальныйИдентификатор());
	Иначе
		ПараметрыОтбора = Новый ФиксированнаяСтруктура("КлючСтрокиДокумента", КлючСтрокиДокумента);
	КонецЕсли;
	Элементы.ТоварыМаркировки.ОтборСтрок = ПараметрыОтбора;
	
КонецПроцедуры

// Таблица кодов

Процедура ТаблицаКодов_РассчитатьИтоги()
	
	ИтогКоличествоКодовДокумента = ТаблицаКодовДокумента.Итог("КоличествоКодов");
	
КонецПроцедуры

// ЗаполнитьКонтекстФормы

&НаСервере
Процедура ПрочитатьИнформациюПоДокументУчетаНаСервере()
	
	ЗаполнитьОсновнуюИнформацию();
	ЗаполнитьИнформациюОКодахПоДокументу();
	ЗаполнитьОперацииПоДокументу();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОсновнуюИнформацию()
	
	ОписаниеДокумента = ОписаниеДокументаУчета();
	
	ЭтаФорма.ТоварыДокумента.Очистить();
	ЭтаФорма.ТоварыМаркировки.Очистить();
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ОписаниеДокумента,, "ТоварыМаркировки, ТоварыДокумента");
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ОписаниеДокумента.ДопРеквизиты);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ОписаниеДокумента.Статусы);
	
	ВерсияДанных1С = Неопределено;
	Если ЗначениеЗаполнено(Документ1С) Тогда
		ВерсияДанных1С = ЗначениеРеквизитаОбъекта_Марк(Документ1С, "ВерсияДанных");
	КонецЕсли;
	
	ЭтаФорма.ТоварыДокумента.Загрузить(ОписаниеДокумента.ТоварыДокумента);
	ЭтаФорма.ТоварыМаркировки.Загрузить(ОписаниеДокумента.ТоварыМаркировки);
	
	ТоварыДокументы_РассчитатьИтоги();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнформациюОКодахПоДокументу()
	
	ЭтаФорма.ТаблицаКодовДокумента.Очистить();
	
	Если ЗначениеЗаполнено(ДокументУчета) Тогда
		ОписаниеКодов = ОписаниеКодовДокументаУчета(ПараметрыГруппировкиКодов);
		ЭтаФорма.ТаблицаКодовДокумента.Загрузить(ОписаниеКодов);
	КонецЕсли;
	
	ТаблицаКодов_РассчитатьИтоги();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОперацииПоДокументу()
	
	СписокОпераций.Очистить();
	
	Если ЗначениеЗаполнено(ДокументУчета) Тогда
		
		ИнтерактивныеОперации = МодульОбъекта().ТипыИнтерактивныхОпераций();
		СтатусыОпераций = МодульОбъекта().Перечисление_СтатусыОпераций();
		
		ТаблицаОпераций = МодульОбъекта().ДокументУчета_СписокОпераций(ДокументУчета, ИнтерактивныеОперации);
		СписокОпераций.Загрузить(ТаблицаОпераций);
		
		Для Каждого Стр Из СписокОпераций Цикл
			
			Если Стр.Статус = СтатусыОпераций.Новый Тогда
				Стр.ТребуемоеДействие = "Начать работу";
				Стр.НомерКартинки = 0;
			ИначеЕсли Стр.Статус = СтатусыОпераций.ОперацияЗавершена
				Или Стр.Статус = СтатусыОпераций.ОперацияОтменена
				Или Стр.Статус = СтатусыОпераций.ПринятЧастично Тогда
				Стр.ТребуемоеДействие = "Работа завершена";
				Стр.НомерКартинки = 4;
			ИначеЕсли Стр.Статус = СтатусыОпераций.ОшибкаЗаполнения
				Или Стр.Статус = СтатусыОпераций.ОшибкаОбработки
				Или Стр.Статус = СтатусыОпераций.ОшибкаОтменыОперации Тогда
				Стр.ТребуемоеДействие = "Исправить ошибки";
				Стр.НомерКартинки = 2;
			ИначеЕсли Стр.Статус = СтатусыОпераций.НеУдалосьРаспознатьКоды Тогда
				Стр.ТребуемоеДействие = "Редактировать список кодов";
				Стр.НомерКартинки = 3;
			Иначе
				Стр.ТребуемоеДействие = "Обрабатывается";
				Стр.НомерКартинки = 3;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	КоличествоОпераций = СписокОпераций.Количество();
	
КонецПроцедуры

// ПроцедурыИФункцииОбработки

&НаКлиенте
Функция ПараметрыОтбораКодовПоТекущейСтроке()
	
	ТекущиеДанные = Элементы.ТаблицаКодовДокумента.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ПараметрыОтбораКодовПоДаннымСтроки(ТекущиеДанные);
	
КонецФункции

&НаКлиенте
Функция ПараметрыОтбораКодовПоДаннымСтроки(ТекущиеДанные)
	
	ИменаПолейГруппировки = Новый Массив;
	
	Для Каждого ИмяПоля Из ПараметрыГруппировкиКодов Цикл
		
		Если ИмяПоля.Пометка Тогда
			ИменаПолейГруппировки.Добавить(ИмяПоля.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	Результат = Новый Структура(МодульКлиента().СоединитьСтроку(ИменаПолейГруппировки, ","));
	ЗаполнитьЗначенияСвойств(Результат, ТекущиеДанные);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПерезаполнитьДокументУчетаНаСервере()
	
	МодульОбъекта().ПерезаполнитьДокументУчета(ДокументУчета, Документ1С);
	ПрочитатьИнформациюПоДокументУчетаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеНаСервере()

	ОписаниеДокумента = МодульОбъекта().НовоеОписаниеДокументаУчета();
	
	ОписаниеДокумента.Ссылка = ДокументУчета;
	
	ЗаполнитьЗначенияСвойств(ОписаниеДокумента, ЭтаФорма,, "ТоварыМаркировки, ТоварыДокумента");
	ЗаполнитьЗначенияСвойств(ОписаниеДокумента.Статусы, ЭтаФорма);
	ЗаполнитьЗначенияСвойств(ОписаниеДокумента.ДопРеквизиты, ЭтаФорма);
	
	Для Каждого Стр Из ТоварыДокумента Цикл
		ЗаполнитьЗначенияСвойств(ОписаниеДокумента.ТоварыДокумента.Добавить(), Стр,, "КлючНоменклатуры1С");
	КонецЦикла;
	
	Для Каждого Стр Из ТоварыМаркировки Цикл
		ЗаполнитьЗначенияСвойств(ОписаниеДокумента.ТоварыМаркировки.Добавить(), Стр);
	КонецЦикла;
	
	МодульОбъекта().ЗаписатьДокументУчета(ОписаниеДокумента);
	
	ПрочитатьИнформациюПоДокументУчетаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКолонкиТоваров(ИмяКолонки)
	
	ЕстьЗначения = Ложь;
	
	Для Каждого Стр Из ТоварыДокумента Цикл
		Если ЗначениеЗаполнено(Стр[ИмяКолонки]) Тогда
			ЕстьЗначения = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Элементы["ТоварыДокумента" + ИмяКолонки].Видимость = ЕстьЗначения;
	
КонецПроцедуры

&НаСервере
Процедура Документ1СПриИзмененииНаСервере()
	
	ОписаниеДокумента1С = МодульОбъекта().ОписаниеДокумента1СВМаркировке(Документ1С);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ОписаниеДокумента1С);
	
КонецПроцедуры

&НаСервере
Функция ОписаниеДокументаУчета() Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДокументУчета) Тогда
		Возврат МодульОбъекта().Новый_ДокументУчета();
	КонецЕсли;
	
	ОписаниеДокумента = МодульОбъекта().ДокументУчета_ПрочитатьДокумент(ДокументУчета);
	ОписаниеДокументаУчета_ДобавитьИнформациюКоличествоКодов(ОписаниеДокумента);
	
	Возврат ОписаниеДокумента;
	
КонецФункции

&НаСервере
Функция ОписаниеКодовДокументаУчета(ПараметрыГруппировки = Неопределено)

	Результат = МодульОбъекта().ТаблицаКодовДокумента(ДокументУчета);
	ТаблицаКодов_ЗаполнитьКоличествоВложенныхКодов(Результат);
	
	Если ЗначениеЗаполнено(ПараметрыГруппировки) Тогда
		
		ПоляГруппировки = Новый Массив;
		
		Для Каждого ПолеГруппировки Из ПараметрыГруппировки Цикл
			
			Если ПолеГруппировки.Пометка Тогда
				ПоляГруппировки.Добавить(ПолеГруппировки.Значение);
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		ПоляГруппировки = Перечисление_ПоляГруппировкиКодов();
	КонецЕсли;
	
	Результат.Свернуть(МодульОбъекта().СоединитьСтроку(ПоляГруппировки, ","), 
	МодульОбъекта().СоединитьСтроку(Перечисление_ИменаКолонокСчетчиков(), ","));
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура СброситьДатуПечатиКодовНаСервере(ПараметрыОтбора = Неопределено)

	Если НЕ ЗначениеЗаполнено(ДокументУчета) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаКодов = МодульОбъекта().ТаблицаКодовДокумента(ДокументУчета);
	
	Если ЗначениеЗаполнено(ПараметрыОтбора) Тогда
		ПараметрыОтбора_ВосстановитьТипы(ПараметрыОтбора);
		ТаблицаКодовДокумента = ТаблицаКодов.Скопировать(ПараметрыОтбора);
	КонецЕсли;
	
	КодыМаркировки = ТаблицаКодов.ВыгрузитьКолонку("КодМаркировки");
	
	Если ЗначениеЗаполнено(КодыМаркировки) Тогда
		МодульОбъекта().ОчиститьИнформациюОКодах(КодыМаркировки, "ДатаПечати");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьКодыДокументаВХранилище(ПараметрыОтбора = Неопределено)
	
	Если НЕ ЗначениеЗаполнено(ДокументУчета) Тогда
		Возврат ПоместитьВоВременноеХранилище(МодульОбъекта().ТаблицаНовыхКодов(), ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли;
	
	ТаблицаКодов = МодульОбъекта().ТаблицаКодовДокумента(ДокументУчета);
	Если ЗначениеЗаполнено(ПараметрыОтбора) Тогда
		ПараметрыОтбора_ВосстановитьТипы(ПараметрыОтбора);
		ТаблицаКодов = ТаблицаКодов.Скопировать(ПараметрыОтбора);
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаКодов, ЭтаФорма.УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура РасформироватьАгрегатыВДокументеУчета(ПараметрыОтбора = Неопределено)
	
	Если НЕ ЗначениеЗаполнено(ДокументУчета) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаКодовДокумента = МодульОбъекта().ТаблицаКодовДокумента(ДокументУчета);
	
	Если ЗначениеЗаполнено(ПараметрыОтбора) Тогда
		ПараметрыОтбора_ВосстановитьТипы(ПараметрыОтбора);
		ТаблицаКодовДокумента = ТаблицаКодовДокумента.Скопировать(ПараметрыОтбора);
	КонецЕсли;
	
	Для Каждого Стр Из ТаблицаКодовДокумента Цикл
		
		Если Стр.ОбщийТипУпаковки = Перечисления.КонтурМаркировка_ОбщиеТипыУпаковок.ЕдиницаТовара Тогда
			Продолжить;
		КонецЕсли;
		
		МодульОбъекта().КодМаркировки_РасформироватьАгрегат(Стр.КлючКода);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ОписаниеДокумента1СВМаркировке(Документ1С)
	
	Результат = НовоеОписаниеДокумента1С();
	
	Если ЗначениеЗаполнено(Документ1С) Тогда
		
		Результат.Документ1С 		= Документ1С;
		Результат.ТипДокумента 		= Документ1С.Метаданные().Имя;
		Результат.ВерсияДанных1С 	= ЗначениеРеквизитаОбъекта_Марк(Документ1С, "ВерсияДанных");
		
		Результат.КлючДокумента1С 		= МодульОбъекта().КлючОбъекта1С(Документ1С);
		Результат.ТипКлючаДокумента1С 	= МодульОбъекта().ТипКлючаОбъекта1С(Документ1С);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция НовоеОписаниеДокумента1С()
	
	Результат = Новый Структура;
	Результат.Вставить("Документ1С");
	Результат.Вставить("ВерсияДанных1С");
	Результат.Вставить("ТипДокумента");
	Результат.Вставить("КлючДокумента1С");
	Результат.Вставить("ТипКлючаДокумента1С");
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПереформироватьТранспортныеАгрегаты(ДокументУчета, ПараметрыОтбора, ИспользоватьВложенныеКоды)
	
	ИспользоватьSSCC18 = МодульОбъекта().НастройкиМодуля().ИспользоватьSSCC18;
	
	ТаблицаКодов = МодульОбъекта().КодыДокументов_Прочитать(ДокументУчета);
	МодульОбъекта().ТаблицаКодов_ПрочитатьВсюИнформацию(ТаблицаКодов);
	
	Если ЗначениеЗаполнено(ПараметрыОтбора) Тогда
		ПараметрыОтбора_ВосстановитьТипы(ПараметрыОтбора);
		ТаблицаКодов = ТаблицаКодов.Скопировать(ПараметрыОтбора);
	КонецЕсли;
	
	Если ИспользоватьВложенныеКоды Тогда
		МодульОбъекта().ДобавитьВсеВложенныеКодыВТаблицуКодов(ТаблицаКодов);
		МодульОбъекта().ТаблицаКодов_ПрочитатьВсюИнформацию(ТаблицаКодов);
	КонецЕсли;
	
	ДлинаКода18 = 18;
	ЛидирующиеНули = "00";
	ДлинаКодаПереформирования = 18;
	Если ИспользоватьSSCC18 Тогда
		ДлинаКодаПереформирования = 20;
	КонецЕсли;
	
	СтрокиДляЗаписи = Новый Массив;
	ОтборТранспортныхКодов = Новый Структура("ТипШтрихкода", Перечисления.КонтурМаркировка_ТипыШтрихкодов.SSCC);
	
	Для Каждого Стр Из ТаблицаКодов.НайтиСтроки(ОтборТранспортныхКодов) Цикл
		
		Если СтрДлина(Стр.КодМаркировки) = ДлинаКодаПереформирования Тогда
			
			Если ИспользоватьSSCC18 Тогда
				НовыйКодАгрегата = Прав(Стр.КодМаркировки, ДлинаКода18);
			Иначе
				НовыйКодАгрегата = ЛидирующиеНули + Стр.КодМаркировки;
			КонецЕсли;
			
			Стр.КодМаркировки = НовыйКодАгрегата;
			Стр.ПолныйКод = НовыйКодАгрегата;
			
			СтрокиДляЗаписи.Добавить(Стр);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(СтрокиДляЗаписи) Тогда
		ТекстСообщения = НСтр("ru='Не найдены подходящие коды для переформирования.'");
		МодульОбъекта().СообщитьПользователюЛок(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	НоваяТаблицаКодов = ТаблицаКодов.Скопировать(СтрокиДляЗаписи);
	НоваяТаблицаКодов.ЗаполнитьЗначения("", "ХешСуммаКодаМаркировки");
	МодульОбъекта().КодыМаркировки_Записать(НоваяТаблицаКодов);
	
КонецПроцедуры

&НаСервере
Процедура ОписаниеДокументаУчета_ДобавитьИнформациюКоличествоКодов(ОписаниеДокумента)
	
	ОписаниеДокумента.ТоварыДокумента.Колонки.Добавить("КоличествоКодов");
	
	КоличествоКодовДокумента = МодульОбъекта().КодыДокументов_КоличествоКодовПоСтрокам(ОписаниеДокумента.Ссылка);
	
	Для Каждого Стр Из ОписаниеДокумента.ТоварыДокумента Цикл
		
		СтрКоличество = КоличествоКодовДокумента.Найти(Стр.КлючСтрокиДокумента, "КлючСтрокиДокумента");
		
		Если ЗначениеЗаполнено(СтрКоличество) Тогда
			Стр.КоличествоКодов = СтрКоличество.Количество;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ТаблицаКодов_ЗаполнитьКоличествоВложенныхКодов(ТаблицаКодов)
	
	ТаблицаКодов_ДобавитьКолонкиСчетчиков(ТаблицаКодов);
	
	ТаблицаВложенныхКодов = ТаблицаКодов.Скопировать();
	МодульОбъекта().ДобавитьВсеВложенныеКодыВТаблицуКодов(ТаблицаВложенныхКодов);
	
	Индексы = ТаблицаВложенныхКодов.Индексы.Добавить("КлючАгрегата");
	
	Для Каждого Стр Из ТаблицаКодов Цикл
		
		Если Стр.ОбщийТипУпаковки = Перечисления.КонтурМаркировка_ОбщиеТипыУпаковок.ЕдиницаТовара Тогда
			Продолжить;
		КонецЕсли;
		
		ТаблицаКодов_ЗаполнитьВложенныеКодыАгрегата(Стр, Стр.КлючКода, ТаблицаВложенныхКодов);
		
	КонецЦикла;
	
	ТаблицаВложенныхКодов.Индексы.Удалить(Индексы);
	
КонецПроцедуры

&НаСервере
Процедура ТаблицаКодов_ЗаполнитьВложенныеКодыАгрегата(ВерхнеУровневыйАгрегат, КлючТекущегоАгрегата, ТаблицаКодов)

	ВложенныеКоды = ТаблицаКодов.НайтиСтроки(Новый Структура("КлючАгрегата", КлючТекущегоАгрегата));
	
	Для Каждого Стр Из ВложенныеКоды Цикл

		Если Стр.ОбщийТипУпаковки = Перечисления.КонтурМаркировка_ОбщиеТипыУпаковок.ЕдиницаТовара Тогда
			ВерхнеУровневыйАгрегат.КоличествоВложенныхКИЗ = ВерхнеУровневыйАгрегат.КоличествоВложенныхКИЗ + 1;
		ИначеЕсли Стр.ОбщийТипУпаковки = Перечисления.КонтурМаркировка_ОбщиеТипыУпаковок.ГрупповаяУпаковка Тогда
			ВерхнеУровневыйАгрегат.КоличествоВложенныхКИГУ = ВерхнеУровневыйАгрегат.КоличествоВложенныхКИГУ + 1;
			ТаблицаКодов_ЗаполнитьВложенныеКодыАгрегата(ВерхнеУровневыйАгрегат, Стр.КлючКода, ТаблицаКодов);
		ИначеЕсли Стр.ОбщийТипУпаковки = Перечисления.КонтурМаркировка_ОбщиеТипыУпаковок.ТранспортнаяУпаковка Тогда
			ВерхнеУровневыйАгрегат.КоличествоВложенныхКИТУ = ВерхнеУровневыйАгрегат.КоличествоВложенныхКИТУ + 1;
			ТаблицаКодов_ЗаполнитьВложенныеКодыАгрегата(ВерхнеУровневыйАгрегат, Стр.КлючКода, ТаблицаКодов);
		ИначеЕсли Стр.ОбщийТипУпаковки = Перечисления.КонтурМаркировка_ОбщиеТипыУпаковок.Набор Тогда
			ВерхнеУровневыйАгрегат.КоличествоВложенныхНаборов = ВерхнеУровневыйАгрегат.КоличествоВложенныхНаборов + 1;
			ТаблицаКодов_ЗаполнитьВложенныеКодыАгрегата(ВерхнеУровневыйАгрегат, Стр.КлючКода, ТаблицаКодов);
		Иначе
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ТаблицаКодов_ДобавитьКолонкиСчетчиков(ТаблицаКодов)
	
	ТипЧисло = Новый ОписаниеТипов("Число");
	
	Для Каждого ИмяКолонки Из Перечисление_ИменаКолонокСчетчиков() Цикл
		ТаблицаКодов.Колонки.Добавить(ИмяКолонки, ТипЧисло);
	КонецЦикла;
	
	ТаблицаКодов.ЗаполнитьЗначения(0, "КоличествоВложенныхКИТУ, КоличествоВложенныхКИГУ, КоличествоВложенныхКИЗ, КоличествоВложенныхНаборов");
	ТаблицаКодов.ЗаполнитьЗначения(1, "КоличествоКодов");
	
КонецПроцедуры

Процедура ПараметрыОтбора_ВосстановитьТипы(ПараметрыОтбора)
	
	Если ПараметрыОтбора.Свойство("КлючСтрокиДокумента") 
		И ЗначениеЗаполнено(ПараметрыОтбора.КлючСтрокиДокумента)
		И ТипЗнч(ПараметрыОтбора.КлючСтрокиДокумента) <> Тип("УникальныйИдентификатор") Тогда
		
		ПараметрыОтбора.КлючСтрокиДокумента = Новый УникальныйИдентификатор(ПараметрыОтбора.КлючСтрокиДокумента);
		
	КонецЕсли;
	
КонецПроцедуры

// МодульМаркировки

&НаСервере
Функция ЗначенияПолейПоУмолчанию()
	
	Возврат МодульОбъекта().ЗначенияПолейПоУмолчанию();
	
КонецФункции

&НаСервере
Процедура ОбновитьСтатусыКодовДокументаНаСервере()

	МодульОбъекта().ОбновитьСтатусыКодовДокумента(ДокументУчета);
	
КонецПроцедуры

&НаСервере
Функция ЗначениеРеквизитаОбъекта_Марк(Ссылка, ИмяРеквизита)

	Возврат МодульОбъекта().ЗначениеРеквизитаОбъекта_Марк(Ссылка, ИмяРеквизита);

КонецФункции

// Перечисления

&НаСервере
Функция Перечисление_ИменаКолонокСчетчиков()

	Результат = Новый Массив;
	Результат.Добавить("КоличествоВложенныхКИТУ");
	Результат.Добавить("КоличествоВложенныхНаборов");
	Результат.Добавить("КоличествоВложенныхКИГУ");
	Результат.Добавить("КоличествоВложенныхКИЗ");
	Результат.Добавить("КоличествоКодов");
	
	Возврат Новый ФиксированныйМассив(Результат);
	
КонецФункции

&НаСервере
Функция Перечисление_ПоляГруппировкиКодов() Экспорт

	Результат = Новый Массив;
	Результат.Добавить("КлючСтрокиДокумента");
	Результат.Добавить("КлючНоменклатуры1С");
	Результат.Добавить("Товар");
	Результат.Добавить("ДатаПроизводства");
	Результат.Добавить("ДатаСрокаГодности");
	Результат.Добавить("ИдентификаторВСД");
	Результат.Добавить("Статус");
	Результат.Добавить("ОбщийТипУпаковки");
	
	Возврат Новый ФиксированныйМассив(Результат);
	
КонецФункции

// МодульКлиента

&НаКлиенте
Функция ВыполнитьАвторизацию_ОрганизацияПоУмолчанию()
	
	Результат = Ложь;
	
	ЗначенияПоУмолчанию = ЗначенияПолейПоУмолчанию();
	Организация = ЗначенияПоУмолчанию.Организация;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		Результат = ВыполнитьАвторизацию(Организация);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ВыполнитьАвторизацию(Организация)
	
	Возврат МодульКлиента().ВыполнитьАвторизацию(Организация, МодульКлиента());
	
КонецФункции

&НаКлиенте
Процедура ВызватьОбработчикОповещения(ОписаниеОбработчика, Результат)
	
	МодульКлиента().ВызватьОбработчикОповещения(ОписаниеОбработчика, Результат);
	
КонецПроцедуры

