
// #Область СлужебныеПеременныеИМетодыФормы

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента = Неопределено Тогда
		
		Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
			КэшМодуляКлиента = ВладелецФормы.МодульКлиента();
		Иначе
			ПутьКФорме = ПутьКФормеМодуляКлиента();
			КэшМодуляКлиента = ОткрытьФорму(ПутьКФорме);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат КэшМодуляКлиента;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

// #КонецОбласти

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Плагины_Отображение = Перечисление_ВариантыОтображенияПлагинов().Все;
	
	ЗаполнитьСписокПлагиновИзСервиса();
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Плагины_СтрокаПоискаПриИзменении(Элемент)
	
	УстановитьФильтрСпискаПлагинов();
	
КонецПроцедуры

&НаКлиенте
Процедура Плагины_ОтображениеПриИзменении(Элемент)
	
	УстановитьФильтрСпискаПлагинов();
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовТаблицыФормыПлагины_Список

&НаКлиенте
Процедура Плагины_СписокПриАктивизацииСтроки(Элемент)
	
	ТекСтрока = Элемент.ТекущиеДанные;
	
	Если НЕ ТекСтрока = Неопределено Тогда
		
		Если Элементы.ГруппаПраво.Видимость = Ложь Тогда
			Элементы.ГруппаПраво.Видимость = Истина;
		КонецЕсли;
		
		Элементы.Плагин_Загружен.Видимость = ТекСтрока.Загружен;
		Элементы.Плагин_Загрузить.Видимость = НЕ ТекСтрока.Загружен;
		
		Элементы.Ссылка_ОткрытьПодробноеОписание.Видимость = ЗначениеЗаполнено(ТекСтрока.СсылкаНаСправку);
		
	Иначе
		
		Элементы.ГруппаПраво.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Плагин_Загрузить(Команда)
	
	ТекДанные = Элементы.Плагины_Список.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Результат = ЗагрузитьПлагинИзСервиса(
		ТекДанные.Идентификатор, 
		ТекДанные.Представление, 
		ТекДанные.Версия
	);
	
	Если Не Результат.Успешно Тогда
		ВызватьИсключение("Не удалось загрузить плагин: "+Результат.ОписаниеОшибки);
	КонецЕсли;
	
	Оповестить("КонтурПлагины_ЗагруженНовыйПлагин");
	ЗаполнитьСписокПлагиновИзСервиса();
	
КонецПроцедуры

&НаКлиенте
Процедура Плагины_СортировкаПопулярность(Команда)
	
	Плагины_Список.Сортировать("Популярность Убыв");
	Элементы.ГруппаПодменюСортировка.Заголовок = "По популярности";
	Элементы.ГруппаПодменюСортировка.Картинка = Элементы.Картинка_СортировкаУбыв.Картинка;
	
КонецПроцедуры

&НаКлиенте
Процедура Плагины_СортировкаДатаВыпуска(Команда)
	
	Плагины_Список.Сортировать("ДатаОбновления Убыв");
	Элементы.ГруппаПодменюСортировка.Заголовок = "По дате обновления";
	Элементы.ГруппаПодменюСортировка.Картинка = Элементы.Картинка_СортировкаУбыв.Картинка;
	
КонецПроцедуры

&НаКлиенте
Процедура Плагины_СортировкаНаименование(Команда)
	
	Плагины_Список.Сортировать("Представление");
	Элементы.ГруппаПодменюСортировка.Заголовок = "По наименованию";
	Элементы.ГруппаПодменюСортировка.Картинка = Элементы.Картинка_СортировкаВозр.Картинка;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодробноеОписание(Команда)
	
	ТекущиеДанные = Элементы.Плагины_Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.СсылкаНаСправку) Тогда
		МодульКлиента().ОткрытьИнтернетСтраницу(ТекущиеДанные.СсылкаНаСправку);
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокПлагиновИзСервиса()
	
	Плагины_Список.Очистить();
	
	СлужебныеКоманды = МодульОбъекта().Перечисление_СлужебныеКомандыБиблиотекиПлагинов();
	
	ПараметрыЗагруженных = Новый Структура;
	МодульОбъекта().КонтурПлагины_ОбработатьСлужебнуюКоманду(
		СлужебныеКоманды.ПолучитьСписокЗагруженныхПлагинов,
		ПараметрыЗагруженных
	);
	
	ЗагруженныеПлагины = Новый Соответствие;
	Для Каждого Плагин Из ПараметрыЗагруженных.Результат Цикл
		ЗагруженныеПлагины.Вставить(Плагин.Идентификатор, Истина);
	КонецЦикла;
	
	ПараметрыСобытия = МодульОбъекта().Новый_ПараметрыСлужебногоСобытия();
	
	МодульОбъекта().КонтурПлагины_ОбработатьСлужебнуюКоманду(
		СлужебныеКоманды.ПолучитьСписокТиповыхПлагинов,
		ПараметрыСобытия
	);
	
	МассивПлагинов = ПараметрыСобытия.Результат;
	
	Для Каждого Плагин Из МассивПлагинов Цикл
		
		НоваяСтрока = Плагины_Список.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Плагин);
		
		Если ЗагруженныеПлагины[Плагин.Идентификатор] = Истина Тогда
			НоваяСтрока.Загружен = Истина;
		Иначе
			НоваяСтрока.КартинкаЗагружен = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Плагины_Список.Сортировать("Представление");
	
КонецПроцедуры

&НаКлиенте
Функция ЗагрузитьПлагинИзСервиса(Идентификатор, Представление, Версия)
	
	СлужебныеКоманды = МодульКлиента().Перечисление_СлужебныеКомандыБиблиотекиПлагинов();
	
	ПараметрыСобытия = Новый Структура();
	ПараметрыСобытия.Вставить("ДвоичныеДанные", Неопределено);
	ПараметрыСобытия.Вставить("Идентификатор", Идентификатор);
	ПараметрыСобытия.Вставить("Представление", Представление);
	ПараметрыСобытия.Вставить("Версия", Версия);
	
	МодульКлиента().КонтурПлагины_ОбработатьСлужебнуюКоманду(
		СлужебныеКоманды.ЗагрузитьПлагин,
		ПараметрыСобытия
	);
	
	Результат = ПараметрыСобытия.Результат;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура УстановитьФильтрСпискаПлагинов()
	
	СтруктураОтбора = Новый Структура;
	
	Если ЗначениеЗаполнено(Плагины_СтрокаПоиска) Тогда
		СтруктураОтбора.Вставить("Представление", Плагины_СтрокаПоиска);
	КонецЕсли;
	
	Если Плагины_Отображение = Перечисление_ВариантыОтображенияПлагинов().Рекомендованные Тогда
		СтруктураОтбора.Вставить("Рекомендован", Истина);
	КонецЕсли;
	
	Элементы.Плагины_Список.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураОтбора);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция Перечисление_ВариантыОтображенияПлагинов()
	
	Результат = Новый Структура;
	Результат.Вставить("Все", "Все");
	Результат.Вставить("Рекомендованные", "Рекомендованные");
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти
