
// #Область СлужебныеПеременныеИМетодыФормы

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		Результат = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		Результат = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

// #КонецОбласти

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("КлючКода", КлючКода);
	Параметры.Свойство("Организация", Организация);
	
	Если Не ЗначениеЗаполнено(КлючКода) Тогда
		ВызватьИсключение НСтр("ru = 'Не указан код маркировки'");
	КонецЕсли;
	
	ЗаполнитьКонтекстФормы();
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.ТекущийЭлемент = Элементы.КодМаркировки;
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИнформацияОКоде(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КодМаркировки", КодМаркировки);
	ПараметрыФормы.Вставить("ВидПродукции", ВидПродукцииИзТовара());
	ПараметрыФормы.Вставить("Владелец", Владелец);
	
	МодульКлиента().ОткрытьФормуОбработки("Форма_ИнформацияОКоде", ЭтаФорма, ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура НайтиДокументыИОперации(Команда)
	
	ЗаполнитьСвязи();
	
	Элементы.Связи.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВАгрегат(Команда)
	
	Операция = СоздатьОперацию(МодульКлиента().Перечисление_ТипыОпераций().ДобавлениеВАгрегат);
	МодульКлиента().ОткрытьФормуОперации(Операция, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзъятьИзАгрегата(Команда)
	
	Операция = СоздатьОперацию(МодульКлиента().Перечисление_ТипыОпераций().ИзъятиеИзАгрегата);
	МодульКлиента().ОткрытьФормуОперации(Операция, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВАТК(Команда)
	
	Операция = СоздатьОперацию(МодульКлиента().Перечисление_ТипыОпераций().ДобавлениеВАТК);
	МодульКлиента().ОткрытьФормуОперации(Операция, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзъятьИзАТК(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ИзъятиеИзАТК;
	Операция = СоздатьОперацию(ТипОперации);
	МодульКлиента().ОткрытьФормуОперации(Операция, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатус(Команда)
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не МодульКлиента().ВыполнитьАвторизацию(Организация, ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьСтатусКода(Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТоварыАгрегатаИзГИСМТ(Команда)
	
	ЗаполнитьТоварыАгрегатаИзГИСМТНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВложенныеКодыИзГИСМТ(Команда)
	
	ЗаполнитьВложенныеКодыИзГИСМТНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВложенныеКоды(Команда)
	
	Если Не ЗначениеЗаполнено(Элементы.ВложенныеКоды.ВыделенныеСтроки) Тогда
		Возврат;
	КонецЕсли;
	
	Кнопки = РежимДиалогаВопрос.ДаНет;
	ТекстВопроса = НСтр("ru = 'Выбранные коды будут удалены из агрегата, продолжить?'");
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("УдалитьВложенныеКодыПослеСогласия", ЭтаФорма);
	МодульКлиента().ПоказатьДиалогВопроса(ОписаниеОбработчика, ТекстВопроса, Кнопки);
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВложенныеКодыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ВложенныеКоды.ТекущиеДанные;
	
	Если Поле = Элементы.ВложенныеКодыКодМаркировки Тогда
		МодульКлиента().ОткрытьФормуКодаМаркировки(ТекущиеДанные.КлючКода, Организация, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеОперацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Поле = Элементы.СвязиДокументИлиОперация Тогда
		ДокументИлиОперация = Элемент.ТекущиеДанные.ДокументИлиОперация;
		Если ТипЗнч(ДокументИлиОперация) = Тип("СправочникСсылка.КонтурМаркировка_ДокументыУчета") Тогда
			МодульКлиента().ОткрытьФормуДокументаУчета(ДокументИлиОперация, ЭтаФорма);
		Иначе
			МодульКлиента().ОткрытьФормуОперации(ДокументИлиОперация, ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
		
	Если Поле = Элементы.СвязиКодМаркировки Тогда
		ВыбранныйКлючКода = Элемент.ТекущиеДанные.КлючКода;
		Если ВыбранныйКлючКода <> КлючКода Тогда
			МодульКлиента().ОткрытьФормуКодаМаркировки(ВыбранныйКлючКода, Организация, ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КлючНоменклатуры1СНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("КлючНоменклатуры1СПослеВыбора", ЭтаФорма);
	МодульКлиента().ОткрытьФормуВыбораКлючаНоменклатуры1С(ОписаниеОбработчика, КлючНоменклатуры1С, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КлючНоменклатуры1СОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МодульКлиента().ОткрытьФормуКлючаНоменклатуры1С(КлючНоменклатуры1С, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МодульКлиента().ОткрытьФормуТовара(Товар, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидАгрегатаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(ВидАгрегата) Тогда
		МодульКлиента().ОткрытьФормуВидаАгрегата(ВидАгрегата, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиОповещений

&НаКлиенте
Процедура КлючНоменклатуры1СПослеВыбора(РезультатВыбора, ДопПараметры = Неопределено) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КлючНоменклатуры1С = РезультатВыбора;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВложенныеКодыПослеСогласия(Ответ, ДопПараметры = Неопределено) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		УдалитьВложенныеКодыНаСервере();
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьЭлементыФормы()
	
	ЭтоТранспортнаяУпаковка = ОбщийТипУпаковки = Перечисления.КонтурМаркировка_ОбщиеТипыУпаковок.ТранспортнаяУпаковка;
	ПоказатьВложенныеКодыТовары = ЭтоТранспортнаяУпаковка Или ЗначениеЗаполнено(КоличествоВложенныхКодов);
	
	Элементы.ЗакладкаВложенныеКоды.Видимость = ПоказатьВложенныеКодыТовары;
	Элементы.ЗакладкаВложенныеТовары.Видимость = ПоказатьВложенныеКодыТовары;
	Элементы.ДляВнутреннегоУчета.Видимость = ДляВнутреннегоУчета;
	Элементы.ГруппаСтатусГИСМТ.Видимость = Не ДляВнутреннегоУчета;
	Элементы.Кнопка_ОбновитьСтатус.Видимость = ЗначениеЗаполнено(Организация);
	Элементы.ДатаПечати.Видимость = ЗначениеЗаполнено(ДатаПечати);
	Элементы.ДляВнутреннегоУчета.Видимость = ДляВнутреннегоУчета;
	Элементы.ВидАгрегата.Видимость = ЗначениеЗаполнено(ВидАгрегата);
	Элементы.Кнопка_ЗаполнитьТоварыИзСервиса.Видимость = ЭтоТранспортнаяУпаковка;
	Элементы.НомерПартии.Видимость = ЗначениеЗаполнено(НомерПартии);
	Элементы.Количество.Видимость = ЗначениеЗаполнено(Количество);
	
	ТипКода = ТипКодаПоТипуУпаковкиКодаМаркировки();
	Если Не ЗначениеЗаполнено(ТипКода) Тогда
		ТипКода = НСтр("ru = 'Неизвестный тип кода'");
	КонецЕсли;
	
	ЭтаФорма.Заголовок = ТипКода + ": " + КодМаркировки;
	
	Если ОбщийТипУпаковки = Перечисления.КонтурМаркировка_ОбщиеТипыУпаковок.АТК Тогда
		Элементы.ИзменитьСоставАТК.Видимость = Истина;
	КонецЕсли;
	
	Если ОбщийТипУпаковки = Перечисления.КонтурМаркировка_ОбщиеТипыУпаковок.ТранспортнаяУпаковка Тогда
		Элементы.ИзменитьСоставАгрегата.Видимость = Истина;
	КонецЕсли;
	
	Если ДатаСодержитВремя(ДатаСрокаГодностиВремя) Тогда
		Элементы.ДатаСрокаГодности.Видимость = Ложь;
		Элементы.ДатаСрокаГодностиВремя.Видимость = Истина;
	Иначе
		Элементы.ДатаСрокаГодности.Видимость = Истина;
		Элементы.ДатаСрокаГодностиВремя.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвязи()
	
	РезультатЗапроса = МодульОбъекта().КодМаркировки_СвязиОбъектов(КлючКода);
	
	Связи.Загрузить(РезультатЗапроса);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтекстФормы()
	
	КлючКодаСтрокой = Строка(КлючКода);
	
	ТаблицаКодов = МодульОбъекта().Новый_ТаблицаКодов();
	Стр = ТаблицаКодов.Добавить();
	Стр.КлючКода = КлючКода;
	
	МодульОбъекта().ТаблицаКодов_ДобавитьКлючиВложенныхКодов(ТаблицаКодов);
	МодульОбъекта().ТаблицаКодов_ПрочитатьВсюИнформацию(ТаблицаКодов);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ТаблицаКодов[0]);
	ДатаСрокаГодностиВремя = ТаблицаКодов[0].ДатаСрокаГодности;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Организация = ПодобратьОрганизацию();
	КонецЕсли;
	
	ВложенныеКоды.Очистить();
	Для Каждого Стр Из ТаблицаКодов Цикл
		Если Стр.КлючАгрегата = КлючКода Тогда
			ЗаполнитьЗначенияСвойств(ВложенныеКоды.Добавить(), Стр);
		КонецЕсли;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(МодульОбъекта().ТоварыАгрегатов_Прочитать(КлючКода), "ВложенныеТовары");
	
	Если ОбщийТипУпаковки = Перечисления.КонтурМаркировка_ОбщиеТипыУпаковок.ТранспортнаяУпаковка Тогда
		ЗаполнитьВложенныеТоварыАгрегатов();
	Иначе
		ЗаполнитьВложенныеТовары();
	КонецЕсли;
	
	КоличествоВложенныхКодов = ВложенныеКоды.Количество();
	КоличествоВложенныхТоваров = ВложенныеТовары.Количество();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВложенныеТовары()
	
	ТаблицаТоваров = ВложенныеКоды.Выгрузить(, "Товар, КлючНоменклатуры1С");
	ТаблицаТоваров.Колонки.Добавить("КоличествоУпаковок", Новый ОписаниеТипов("Число"));
	ТаблицаТоваров.ЗаполнитьЗначения(1, "КоличествоУпаковок");
	ТаблицаТоваров.Свернуть("Товар, КлючНоменклатуры1С", "КоличествоУпаковок");
	
	ВложенныеТовары.Очистить();
	Для Каждого Стр Из ТаблицаТоваров Цикл
		Если ЗначениеЗаполнено(Стр.Товар)
			Или ЗначениеЗаполнено(Стр.КлючНоменклатуры1С) Тогда
			ЗаполнитьЗначенияСвойств(ВложенныеТовары.Добавить(), Стр);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВложенныеТоварыАгрегатов()
	
	ЗначениеВРеквизитФормы(МодульОбъекта().ТоварыАгрегатов_Прочитать(КлючКода), "ВложенныеТовары");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТоварыАгрегатаИзГИСМТНаСервере()
	
	ТаблицаКодов = МодульОбъекта().Новый_ТаблицаКодов();
	ТаблицаКодов.Добавить().КлючКода = КлючКода;
	МодульОбъекта().ТоварыАгрегатов_ЗаполнитьИзГИСМТ(ТаблицаКодов, Организация);
	
	ЗаполнитьКонтекстФормы();
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВложенныеКодыИзГИСМТНаСервере()
	
	ТаблицаКодов = МодульОбъекта().Новый_ТаблицаКодов();
	ТаблицаКодов.Добавить().КлючКода = КлючКода;
	МодульОбъекта().ТаблицаКодов_ЗаполнитьВложенныеКодыИзГИСМТ(ТаблицаКодов, Организация);
	
	ЗаполнитьКонтекстФормы();
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаСервере
Процедура УдалитьВложенныеКодыНаСервере()
	
	ТаблицаКодов = МодульОбъекта().Новый_ТаблицаКодов();
	ТаблицаКодов.Добавить().КлючКода = КлючКода;
	
	МодульОбъекта().ТаблицаКодов_ДобавитьКлючиВложенныхКодов(ТаблицаКодов);
	МодульОбъекта().ТаблицаКодов_ПрочитатьВсюИнформацию(ТаблицаКодов);
	ИндексКодМаркировки = ТаблицаКодов.Индексы.Добавить("КодМаркировки");
	
	Для Каждого ИдентификаторСтроки Из Элементы.ВложенныеКоды.ВыделенныеСтроки Цикл
		Стр = ВложенныеКоды.НайтиПоИдентификатору(ИдентификаторСтроки);
		СтрКода = ТаблицаКодов.Найти(Стр.КодМаркировки, "КодМаркировки");
		Если СтрКода <> Неопределено Тогда
			СтрКода.КодАгрегата = Неопределено;
			СтрКода.КлючАгрегата = Неопределено;
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаКодов.Индексы.Удалить(ИндексКодМаркировки);
	МодульОбъекта().ТаблицаКодов_ЗаписатьВсюИнформацию(ТаблицаКодов);
	
	ЗаполнитьКонтекстФормы();
	
КонецПроцедуры

&НаСервере
Функция ВидПродукцииИзТовара()
	
	Если ЗначениеЗаполнено(Товар) Тогда
		Результат = МодульОбъекта().ЗначениеРеквизитаОбъекта_Марк(Товар, "ВидПродукции");
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ТипКодаПоТипуУпаковкиКодаМаркировки()
	
	ОбщиеТипыУпаковок = Перечисления.КонтурМаркировка_ОбщиеТипыУпаковок;
	
	СоответствиеТипов = Новый Соответствие;
	СоответствиеТипов.Вставить(ОбщиеТипыУпаковок.ЕдиницаТовара, "КИ");
	СоответствиеТипов.Вставить(ОбщиеТипыУпаковок.ГрупповаяУпаковка, "КИГУ");
	СоответствиеТипов.Вставить(ОбщиеТипыУпаковок.ТранспортнаяУпаковка, "КИТУ");
	СоответствиеТипов.Вставить(ОбщиеТипыУпаковок.Комплект, "КИК");
	СоответствиеТипов.Вставить(ОбщиеТипыУпаковок.Набор, "КИН");
	СоответствиеТипов.Вставить(ОбщиеТипыУпаковок.АТК, "АТК");
	
	Возврат СоответствиеТипов[ОбщийТипУпаковки];
	
КонецФункции

&НаСервере
Функция СоздатьОперацию(ТипОперации)
	
	Операция = МодульОбъекта().Операция_Создать(ТипОперации);
	ОписаниеОперации = МодульОбъекта().Операция_ПрочитатьОперацию(Операция);
	ОписаниеОперации.Организация = Организация;
	ОписаниеОперации.ВидПродукции = ВидПродукции;
	ОписаниеОперации.ДопРеквизиты.КлючКода = КлючКода;
	ОписаниеОперации.ДопРеквизиты.КодМаркировки = КодМаркировки;
	
	Если ЗначениеЗаполнено(ОписаниеОперации.Склад)
		И ОписаниеОперации.Склад.Организация <> Организация Тогда
		ОписаниеОперации.Склад = Неопределено;
	КонецЕсли;
	
	МодульОбъекта().Операция_Записать(ОписаниеОперации);
	
	Возврат Операция;
	
КонецФункции

&НаСервере
Функция ПодобратьОрганизацию()
	
	Если ЗначениеЗаполнено(Владелец) Тогда
		Результат = МодульОбъекта().Организация_НайтиПоИНН(Владелец.ИНН);
	Иначе
		Результат = МодульОбъекта().НастройкиМодуля().ОрганизацияПоУмолчанию;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОбновитьСтатусКода(Организация)
	
	ТаблицаКодов = МодульОбъекта().Новый_ТаблицаКодов();
	Стр = ТаблицаКодов.Добавить();
	Стр.КлючКода = КлючКода;
	Стр.КодМаркировки = КодМаркировки;
	
	МодульОбъекта().ТаблицаКодов_ДобавитьКлючиВсехВложенныхКодов(ТаблицаКодов);
	МодульОбъекта().ТаблицаКодов_ПрочитатьВсюИнформацию(ТаблицаКодов);
	
	Если МодульОбъекта().ТаблицаКодов_ОбновитьСтатусы(ТаблицаКодов, Организация) Тогда
		МодульОбъекта().ТаблицаКодов_ЗаписатьИнформациюИСтатусыКодов(ТаблицаКодов);
		ЗаполнитьКонтекстФормы();
		НастроитьЭлементыФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДатаСодержитВремя(Дата)
	
	Возврат (Дата > НачалоДня(Дата));
	
КонецФункции

// #КонецОбласти
