
&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		Результат = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		Результат = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

&НаКлиенте
Процедура Сохранить(Команда)
	
	Если НЕ ЗначениеЗаполнено(ПарольТехническогоСпециалиста) Тогда
		
		ТекстПредупреждения = НСтр("ru='Введите ключ!'");
		МодульКлиента().СообщитьПользователюЛок(ТекстПредупреждения);
		
		Возврат;
		
	КонецЕсли;
	
	Результат = ПроверитьВведенныйПароль(ПарольТехническогоСпециалиста);
	
	Если Результат Тогда
		
		РезультатЗакрытияФормы = Истина;
		
		Закрыть(РезультатЗакрытияФормы);
		
	Иначе
		
		ТекстПредупреждения = НСтр("ru='Неверный ключ!'");
		МодульКлиента().СообщитьПользователюЛок(ТекстПредупреждения);
		
		ПарольТехническогоСпециалиста = "";
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьВведенныйПароль(ПарольТехническогоСпециалиста)
	
	Возврат МодульОбъекта().ПроверитьВведенныйПарольТехническогоСпециалиста(ПарольТехническогоСпециалиста);
	
КонецФункции
