
// #Область СлужебныеПеременныеИМетодыФормы

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента = Неопределено Тогда
		
		Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
			КэшМодуляКлиента = ВладелецФормы.МодульКлиента();
		Иначе
			ПутьКФорме = ПутьКФормеМодуляКлиента();
			КэшМодуляКлиента = ОткрытьФорму(ПутьКФорме);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат КэшМодуляКлиента;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

// #КонецОбласти


// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьОтборыСписков();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурМаркировка_НастройкаПодписания_Запись" Тогда
		Элементы.НастройкиБезДоверенности.Обновить();
		Элементы.НастройкиПоДоверенности.Обновить();
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти


// #Область ОбработчикиСобытийЭлементовФормы

&НаСервереБезКонтекста
Процедура НастройкиБезДоверенностиПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	НастройкиПодписанияПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиБезДоверенностиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	НастройкиПодписанияПередНачаломДобавления(Элемент, Отказ, Копирование);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиБезДоверенностиПередНачаломИзменения(Элемент, Отказ)
	
	НастройкиПодписанияПередНачаломИзменения(Элемент, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиБезДоверенностиПередУдалением(Элемент, Отказ)
	
	Если Не Отказ Тогда
		ТекущиеДанные = Элемент.ТекущиеДанные;
		НастройкиПодписанияПередУдалением(ТекущиеДанные.Организация, ТекущиеДанные.Сертификат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура НастройкиПоДоверенностиПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	НастройкиПодписанияПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПоДоверенностиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	НастройкиПодписанияПередНачаломДобавления(Элемент, Отказ, Копирование);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПоДоверенностиПередНачаломИзменения(Элемент, Отказ)
	
	НастройкиПодписанияПередНачаломИзменения(Элемент, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПоДоверенностиПередУдалением(Элемент, Отказ)
	
	Если Не Отказ Тогда
		ТекущиеДанные = Элемент.ТекущиеДанные;
		НастройкиПодписанияПередУдалением(ТекущиеДанные.Организация, ТекущиеДанные.Сертификат);
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти


// #Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтборыСписков()
	
	УстановитьОтборНастроекПодписанияБезДоверенности();
	УстановитьОтборНастроекПодписанияПоДоверенности();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборНастроекПодписанияБезДоверенности()
	
	Пользователь = Справочники.КонтурМаркировка_Пользователи.ПустаяСсылка();
	ДобавитьФиксированныйОтборПоПользователю(НастройкиБезДоверенности, Пользователь);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборНастроекПодписанияПоДоверенности()
	
	Пользователь = МодульОбъекта().Пользователи_ТекущийПользователь();
	ДобавитьФиксированныйОтборПоПользователю(НастройкиПоДоверенности, Пользователь);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьФиксированныйОтборПоПользователю(ДинамическийСписок, Пользователь)
	
	Если МодульОбъекта().ВерсияПлатформыНиже("8.3.3") Тогда
		ЭлементОтбора = ДинамическийСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Иначе
		ЭлементОтбора = ДинамическийСписок.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	КонецЕсли;
	
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Пользователь");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Пользователь;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура НастройкиПодписанияПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	ТекДата = НачалоДня(ТекущаяДатаСеанса());
	
	Для Каждого Строка Из Строки Цикл
		
		ТекстИНН = "ИНН: " + Строка.Значение.Данные["Сертификат.ИНН"];
		Строка.Значение.Оформление["Сертификат.ИНН"].УстановитьЗначениеПараметра("Текст", ТекстИНН);
		
		ДатаОкончания = Строка.Значение.Данные["Сертификат.ДатаОкончания"];
		ДатаОкончанияСтрокой = Формат(ДатаОкончания, "ДФ=dd.MM.yyyy");
		СертификатПросрочен = ДатаОкончания < ТекДата;
		ОсталосьМеньшеМесяца = ДатаОкончания >= ТекДата И ДатаОкончания <= ДобавитьМесяц(ТекДата, 1);
		
		Если СертификатПросрочен Тогда
			
			ТекстДатаОкончания = НСтр("ru = 'Действовал до '") + ДатаОкончанияСтрокой;
			ЦветТекстаДатаОкончания = WebЦвета.Красный;
			
		Иначе
			
			ТекстДатаОкончания = НСтр("ru = 'Действует до '") + ДатаОкончанияСтрокой;
			
			Если ОсталосьМеньшеМесяца Тогда
				ЦветТекстаДатаОкончания = WebЦвета.Оранжевый;
			Иначе
				ЦветТекстаДатаОкончания = Новый Цвет;
			КонецЕсли;
			
		КонецЕсли;
		
		Строка.Значение.Оформление["Сертификат.ДатаОкончания"].УстановитьЗначениеПараметра("Текст", ТекстДатаОкончания);
		Строка.Значение.Оформление["Сертификат.ДатаОкончания"].УстановитьЗначениеПараметра("ЦветТекста", ЦветТекстаДатаОкончания);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПодписанияПередНачаломДобавления(Элемент, Отказ, Копирование)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Копирование", Копирование);
	
	Если Копирование Тогда
		ПараметрыФормы.Вставить("Сертификат", ТекущиеДанные.Сертификат);
		ПараметрыФормы.Вставить("Организация", ТекущиеДанные.Организация);
		ПараметрыФормы.Вставить("Пользователь", ТекущиеДанные.Пользователь);
	Иначе
		ПараметрыФормы.Вставить("ВидСертификата", ВидСертификатаПоРазделу(Элемент));
	КонецЕсли;
	
	МодульКлиента().ОткрытьФормуНастройкиПодписания(ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПодписанияПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", ТекущиеДанные.Организация);
	ПараметрыФормы.Вставить("Пользователь", ТекущиеДанные.Пользователь);
	МодульКлиента().ОткрытьФормуНастройкиПодписания(ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура НастройкиПодписанияПередУдалением(Организация, Сертификат)
	
	МодульОбъекта().ПортальныйТокен_Удалить(Сертификат);
	
КонецПроцедуры

&НаКлиенте
Функция ВидСертификатаПоРазделу(Элемент)
	
	ВидыСертификатов = МодульКлиента().Перечисление_ВидыСертификатов();
	
	Если Элемент = Элементы.НастройкиПоДоверенности Тогда
		Результат = ВидыСертификатов.НаФизЛицо;
	Иначе
		Результат = ВидыСертификатов.НаОрганизацию;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти
