
// #Область СлужебныеПеременныеИМетодыФормы

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		КэшМодуляКлиента = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		КэшМодуляКлиента = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	Возврат КэшМодуляКлиента;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

// #КонецОбласти

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьКонтекстФормы();
	НастроитьЭлементыФормы();
	УстановитьЗаголовокФормы();
	УстановитьУсловноеОФормление();
	РасчитатьОбщийОбъем(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	МодульКлиента().СохранитьИзмененияНаФорме("СохранитьИЗакрыть", ЭтаФорма, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТаблицаРедактораОбъемПриИзменении(Элемент)
	
	РасчитатьОбщийОбъем(ЭтаФорма);
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда, ДопПараметры = Неопределено) Экспорт
	
	СохранитьНаСервере();
	
	Закрыть(ОбщийОбъем);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбъем(Команда)
	
	Обработчик = МодульКлиента().ОписаниеОбработчикаОповещения("УстановитьОбъемПослеВвода", ЭтаФорма);
	КвалификаторыЧисла = Новый КвалификаторыЧисла(6, 3, ДопустимыйЗнак.Неотрицательный);
	ОписаниеЧисла = Новый ОписаниеТипов("Число", , , КвалификаторыЧисла);
	Подсказка = НСтр("ru = 'Объем, л'");
	
	МодульКлиента().ПоказатьДиалогВводаЗначения(Обработчик, , Подсказка, ОписаниеЧисла);
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьКонтекстФормы()
	
	Операция = Параметры.Операция;
	Организация = Параметры.Организация;
	КлючСтрокиОперации = Параметры.КлючСтрокиОперации;
	КлючНоменклатуры1С = Параметры.КлючНоменклатуры1С;
	Товар = Параметры.Товар;
	
	Параметры.Свойство("НоминальныйОбъем", НоминальныйОбъем);
	Параметры.Свойство("НоминальныйОбъемВКегах", НоминальныйОбъемВКегах);
	
	ТаблицаКодов = МодульОбъекта().КодыОпераций_Прочитать(Операция, КлючСтрокиОперации);
	МодульОбъекта().КодыМаркировки_Прочитать(ТаблицаКодов);
	МодульОбъекта().ПолныеКоды_Прочитать(ТаблицаКодов);
	
	Для каждого СтрКода Из ТаблицаКодов Цикл
		
		Стр = ТаблицаРедактора.Добавить();
		Стр.КлючКода = СтрКода.КлючКода;
		Стр.КодМаркировки = СтрКода.КодМаркировки;
		ОбъемИзКода = МодульОбъекта().ОбъемИзПолногоКода(СтрКода.ПолныйКод);
		Если ЗначениеЗаполнено(ОбъемИзКода) Тогда
			Стр.Количество = ОбъемИзКода;
			Стр.ЭтоОбъемИзКода = Истина;
		Иначе
			Стр.Количество = СтрКода.Количество;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	
	ТаблицаКодов = МодульОбъекта().Новый_ТаблицаКодов();
	Для каждого Стр Из ТаблицаРедактора Цикл
		ТаблицаКодов.Добавить().КлючКода = Стр.КлючКода;
	КонецЦикла;
	МодульОбъекта().КодыМаркировки_Прочитать(ТаблицаКодов);
	
	Индекс = ТаблицаКодов.Индексы.Добавить("КлючКода");
	Для каждого Стр Из ТаблицаРедактора Цикл
		Если Не Стр.ЭтоОбъемИзКода Тогда
			СтрКода = ТаблицаКодов.Найти(Стр.КлючКода, "КлючКода");
			СтрКода.Количество = Стр.Количество;
		КонецЕсли;
	КонецЦикла;
	ТаблицаКодов.Индексы.Удалить(Индекс);
	
	МодульОбъекта().КодыМаркировки_Записать(ТаблицаКодов);
	
	Модифицированность = Ложь;
	
	ЗаписатьМетрики();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьМетрики()
	
	КоличествоКодов = 0;
	РазныеОбъемы = Новый Соответствие;
	Для каждого Стр Из ТаблицаРедактора Цикл
		Если ЗначениеЗаполнено(Стр.Количество) Тогда
			РазныеОбъемы.Вставить(Стр.Количество, Стр.Количество);
			КоличествоКодов = КоличествоКодов + 1;
		КонецЕсли;
	КонецЦикла;
	
	Действие = МодульОбъекта().Перечисление_ДействияМетрики().ЗаписьВБазу;
	МодульОбъекта().Метрика_Функциональность_РедактированиеОбъемаКодов(Организация);
	МодульОбъекта().Метрика_РедактированиеОбъемаКодов(Действие, Организация, КоличествоКодов, РазныеОбъемы.Количество());
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы()
	
	Элементы.НоминальныйОбъем.Видимость = НоминальныйОбъемВКегах;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокФормы()
	
	Если ЗначениеЗаполнено(КлючНоменклатуры1С) Тогда
		АналитикаНоменклатуры = МодульОбъекта().АналитикаНоменклатуры1С(КлючНоменклатуры1С);
		Заголовок = МодульОбъекта().ПредставлениеНоменклатуры1С(АналитикаНоменклатуры);
	ИначеЕсли ЗначениеЗаполнено(Товар) Тогда
		Заголовок = СокрЛП(Товар);
	Иначе
		Заголовок = НСтр("ru = 'Заполнение объема'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОФормление()
	
	УстановитьОформлениеЭтоОбъемИзКода();
	УстановитьОформлениеИспользоватьНоминальныйОбъем();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеЭтоОбъемИзКода()
	
	ТаблицаФормы = Элементы.ТаблицаРедактора;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + "Количество");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".ЭтоОбъемИзКода");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеИспользоватьНоминальныйОбъем()
	
	ТаблицаФормы = Элементы.ТаблицаРедактора;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + "Количество");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".Количество");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НоминальныйОбъемВКегах");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<номинальный объем>'"));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбъемПослеВвода(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ИдСтроки Из Элементы.ТаблицаРедактора.ВыделенныеСтроки Цикл
		Стр = ТаблицаРедактора.НайтиПоИдентификатору(ИдСтроки);
		Если Не Стр.ЭтоОбъемИзКода Тогда
			Стр.Количество = Результат;
		КонецЕсли;
	КонецЦикла;
	
	РасчитатьОбщийОбъем(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РасчитатьОбщийОбъем(Форма)
	
	ОбщийОбъем = 0;
	
	Для Каждого Стр Из Форма.ТаблицаРедактора Цикл
		
		Если ЗначениеЗаполнено(Стр.Количество) Тогда
			Количество = Стр.Количество;
		ИначеЕсли Форма.НоминальныйОбъемВКегах Тогда
			Количество = Форма.НоминальныйОбъем;
		Иначе
			Количество = 0;
		КонецЕсли;
		
		ОбщийОбъем = ОбщийОбъем + Количество;
		
	КонецЦикла;
	
	Форма.ОбщийОбъем = ОбщийОбъем;
	
КонецПроцедуры

// #КонецОбласти



