
// #Область СлужебныеПеременныеИМетодыФормы

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		Результат = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		Результат = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

// #КонецОбласти


// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьКонтекстФормы();
	УстановитьДоступность();
	ПоказатьТекстТекущегоУведомления();
	УстановитьОтображениеКнопокДля_8_2();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МодульКлиента().Метрика_Функциональность_ОткрытиеФормыНовостей();
	
КонецПроцедуры

// #КонецОбласти


// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПредыдущееУведомление(Команда)
	
	Если НомерТекущегоУведомления = 1 Тогда
		Возврат;
	КонецЕсли;
	
	НомерТекущегоУведомления = НомерТекущегоУведомления - 1;
	УстановитьДоступность();
	ПоказатьТекстТекущегоУведомления();
	
КонецПроцедуры

&НаСервере
Процедура СледующееУведомлениеНаСервере()
	
	Если НомерТекущегоУведомления = ТаблицаУведомлений.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	НомерТекущегоУведомления = НомерТекущегоУведомления + 1;
	УстановитьДоступность();
	ПоказатьТекстТекущегоУведомления();
	
КонецПроцедуры

&НаКлиенте
Процедура СледующееУведомление(Команда)
	
	СледующееУведомлениеНаСервере();
	
КонецПроцедуры

// #КонецОбласти


// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПоказатьТекстТекущегоУведомления()
	
	Если ТаблицаУведомлений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаУведомления = ТаблицаУведомлений[НомерТекущегоУведомления - 1];
	ТекстУведомленияHTML = СтрокаУведомления.ТекстУведомления;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступность()
	
	Элементы.КнопкаПредыдущееУведомление.Доступность = (НомерТекущегоУведомления > 1);
	Элементы.КнопкаСледующееУведомление.Доступность = (НомерТекущегоУведомления < ТаблицаУведомлений.Количество());
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтекстФормы()
	
	тзУведомлений = МодульОбъекта().СформироватьТаблицуНовостей();
	ТаблицаУведомлений.Загрузить(тзУведомлений);
	НомерТекущегоУведомления = 1;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтображениеКнопокДля_8_2()
	
	Если МодульОбъекта().ВерсияПлатформыНиже("8.3") Тогда
		Элементы.КнопкаПредыдущееУведомление.Отображение = ОтображениеКнопки.Текст;
		Элементы.КнопкаСледующееУведомление.Отображение = ОтображениеКнопки.Текст;
	КонецЕсли;

КонецПроцедуры

// #КонецОбласти






