
// #Область СлужебныеПеременныеИМетодыФормы

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		Результат = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		Результат = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

// #КонецОбласти

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ВидСертификата", ВидСертификата);
	Параметры.Свойство("ОтпечатокСертификата", ОтпечатокСертификата);
	
	НастроитьЭлементыФормы();
	
	Если МодульОбъекта().МожноИспользоватьКриптографиюНаСервере() Тогда
		СертификатыРасположеныНаСервере = Истина;
		МассивСертификатов = МодульОбъекта().Плагин_СписокСертификатов();
		ЗаполнитьСписокСертификатов(МассивСертификатов, СертификатыРасположеныНаСервере);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если МодульКлиента().МожноИспользоватьКриптографиюНаКлиенте() Тогда
		СертификатыРасположеныНаСервере = Ложь;
		МассивСертификатов = МодульКлиента().Плагин_СписокСертификатов();
		ЗаполнитьСписокСертификатов(МассивСертификатов, СертификатыРасположеныНаСервере);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтпечатокСертификата) Тогда
		НайденныеСтроки = Список.НайтиСтроки(Новый Структура("ОтпечатокСертификата", ОтпечатокСертификата));
		Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
			Элементы.Список.ТекущаяСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокСертификатовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбработкаВыбораСертификата();
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьСертификат(Команда)
	
	ОбработкаВыбораСертификата();
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьЭлементыФормы()
	
	Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	
	Если МодульОбъекта().ФайловыйРежимИБ() Тогда
		Элементы.СписокРасположение.Видимость = Ложь;
		Элементы.Список.КартинкаСтрок = Новый Картинка;
	КонецЕсли;
	
	УстановитьОформлениеСпискаСертификатов();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеСпискаСертификатов()
	
	ТаблицаФормы = Элементы.Список;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ТаблицаФормы.ПутьКДанным + "СрокДействия");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение	 = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".СрокДействияЗаканчивается");
	ЭлементОтбора.ВидСравнения	 = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокСертификатов(МассивСертификатов, СертификатыРасположеныНаСервере)
	
	Для каждого ДанныеСертификата Из МассивСертификатов Цикл
		
		Если СертификатУжеЕстьВСписке(ДанныеСертификата) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЭтоВалидныйСертификат(ДанныеСертификата) Тогда
			Продолжить;
		КонецЕсли;
		
		ОписаниеСертификата = МодульОбъекта().ОписаниеСертификатаПоДаннымИзПлагина(ДанныеСертификата);
		Если ЗначениеЗаполнено(ВидСертификата)
			И ОписаниеСертификата.ВидСертификата <> ВидСертификата Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Список.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеСертификата);
		НоваяСтрока.ОписаниеСертификата = ОписаниеСертификата;
		
		ДатаОкончания = ДанныеСертификата.ДатаОкончания;
		СрокДействияЗаканчивается = МодульОбъекта().СрокДействияСертификатаЗаканчивается(ДатаОкончания);
		
		Если СрокДействияЗаканчивается Тогда
			СрокДействия = НСтр("ru = 'Сертификат закончится'");
		Иначе
			СрокДействия = НСтр("ru = 'Действует до'");
		КонецЕсли;
		
		НоваяСтрока.СрокДействияЗаканчивается = СрокДействияЗаканчивается;
		НоваяСтрока.СрокДействия = СрокДействия + " " + Формат(ДатаОкончания, "ДФ='dd MMMM yyyy'");
		
		Если СертификатыРасположеныНаСервере Тогда
			НоваяСтрока.НомерКартинки = 1;
			НоваяСтрока.Расположение = НСтр("ru = 'На сервере'");
		Иначе
			НоваяСтрока.НомерКартинки = 2;
			НоваяСтрока.Расположение = НСтр("ru = 'На компьютере'");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораСертификата()
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОповеститьОВыборе(ТекущиеДанные.ОписаниеСертификата);
	
КонецПроцедуры

&НаСервере
Функция СертификатУжеЕстьВСписке(ДанныеСертификата)
	
	Отбор = Новый Структура("ОтпечатокСертификата", ДанныеСертификата.Отпечаток);
	
	НайденныеСтроки = Список.НайтиСтроки(Отбор);
	
	Возврат ЗначениеЗаполнено(НайденныеСтроки);
	
КонецФункции

&НаСервере
Функция ЭтоВалидныйСертификат(ДанныеСертификата)
	
	Результат = Ложь;
	
	Если ТипЗнч(ДанныеСертификата) = Тип("Структура")
		
		И ДанныеСертификата.Свойство("Субъект") И ТипЗнч(ДанныеСертификата.Субъект) = Тип("Соответствие")
		И ДанныеСертификата.Субъект["CN"] <> Неопределено
		И (ДанныеСертификата.Субъект["ИНН"] <> Неопределено ИЛИ ДанныеСертификата.Субъект["ИННЮЛ"] <> Неопределено)
		
		И ДанныеСертификата.Свойство("Издатель") И ТипЗнч(ДанныеСертификата.Издатель) = Тип("Соответствие")
		И ДанныеСертификата.Издатель["CN"] <> Неопределено
		
		И Не МодульОбъекта().СрокДействияСертификатаИстек(ДанныеСертификата.ДатаОкончания)
		
	Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти
