
// #Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка
		Или Не ЗначениеЗаполнено(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ДополнительныеСвойства.Свойство("ОтключитьЗаполнениеКлюча") Тогда
		ЗаполнитьКлюч();
		ДобавитьОтборПоКлючу();
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьКлюч()
	
	Если ЭтотОбъект.Количество() > 1 Тогда
		ВызватьИсключение НСтр("ru = 'Записывать статус кода ГИС МТ можно только по одной записи'");
	КонецЕсли;
	
	Запись = ЭтотОбъект[0];
	ИменаПолейАналитики = ИменаПолейАналитики();
	ТекстЗапроса = ТекстЗапросаДляПоискаКлюча(ИменаПолейАналитики);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Для каждого ИмяПоля Из ИменаПолейАналитики Цикл
		Запрос.УстановитьПараметр(ИмяПоля, Запись[ИмяПоля]);
	КонецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Запись.КлючСтатусаКода = ОбщегоНазначенияКонтурМаркировка.НовыйУникальныйИдентификаторПервойВерсии();
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Запись.КлючСтатусаКода = Выборка.КлючСтатусаКода;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьОтборПоКлючу()
	
	Отбор.КлючСтатусаКода.Установить(ЭтотОбъект[0].КлючСтатусаКода);
	
КонецПроцедуры

Функция ИменаПолейАналитики()
	
	Результат = Новый Массив;
	Для каждого Измерение Из Метаданные().Измерения Цикл
		Если Измерение.Имя <> "КлючСтатусаКода" Тогда
			Результат.Добавить(Измерение.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаДляПоискаКлюча(ИменаПолейАналитики)
	
	Результат =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Т.КлючСтатусаКода КАК КлючСтатусаКода
	|ИЗ
	|	РегистрСведений.КонтурМаркировка_СтатусыКодовГИСМТ КАК Т
	|ГДЕ
	|	&УсловияАналитики";
	
	Разделитель = "";
	УсловияАналитики = "";
	Для каждого ИмяПоля Из ИменаПолейАналитики Цикл
		Условие = СтрЗаменить("Т.%1 = &%1", "%1", ИмяПоля);
		УсловияАналитики = УсловияАналитики + Разделитель + Условие;
		Разделитель = " И ";
	КонецЦикла;
	
	Возврат СтрЗаменить(Результат, "&УсловияАналитики", УсловияАналитики);
	
КонецФункции

// #КонецОбласти
