// Copyright (C) 2012 - 2025 Engineer Mareev Enterprises
// Версия для УТ10.3

//	$Номенклатура
//	Выгрузка данных о группах номенклатуры
//	- В 1C при записи группа номенклатуры помечается к экспорту.
//	- 1С (авт.) экспортирует сообщение CLASSIFIER.
//	- EME.WMS (авт.) импортирует сообщение CLASSIFIER.
//	- EME.WMS (руч.) создает или изменяет группу товаров.

#Область ПрограммныйИнтерфейс  

//	Процедура Экспортировать экспортирует один элемент группы
Процедура Экспортировать(ERPData, Товар) Экспорт
	
	EmeWmsERPEngine.AppendHeaderLine(ERPData);
	ERPData.header.classifier_id = Товар.УникальныйИдентификатор();
	Если Константы.EmeWmsСоздаватьУникальныеСообщения.Получить() Тогда
		ERPData.header.id	= Новый УникальныйИдентификатор;
	Иначе
		ERPData.header.id	= ERPData.header.classifier_id;		
	КонецЕсли;
	
	ERPData.header.parent_id		= ?(ЗначениеЗаполнено(Товар.Родитель), Товар.Родитель.УникальныйИдентификатор(),"");
	ERPData.header.code				= СокрЛП(Товар.Код);
	ERPData.header.name				= Товар.Наименование;
	ERPData.header.classifier		= ПолучитьПолныйПуть(Товар, Ложь);
	ERPData.header.error_code		= ""; 	
	ERPData.header.error_more		= ""; 	

КонецПроцедуры

//	Функция ПолучитьИмяСообщения возвращает имя сообщения
Функция ПолучитьИмяСообщения() Экспорт
	Возврат "classifier";
КонецФункции

//	Функция ПолучитьМетаданные возвращает метаданные сообщения
Функция ПолучитьМетаданные() Экспорт
	Возврат Метаданные.Справочники.Номенклатура;
КонецФункции

#КонецОбласти  

#Область ЭкспортныеСлужебныеПроцедурыИФункции  

//	Функция ПолучитьВыборкуСсылок возвращает выборку ссылок для экспорта
Функция ПолучитьВыборкуСсылок() Экспорт
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	EmeWmsПометкиКЭкспортуНоменклатуры.Номенклатура КАК Ссылка
		|ИЗ
		|	РегистрСведений.EmeWmsПометкиКЭкспортуНоменклатуры КАК EmeWmsПометкиКЭкспортуНоменклатуры
		|ГДЕ
		|	EmeWmsПометкиКЭкспортуНоменклатуры.КЭкспорту";
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выбрать();
КонецФункции

//	Функция РазрешенКЭкспорту возвращает Истина, если это группа, не помеченная к удалению и не услуги
Функция РазрешенКЭкспорту(Товар) Экспорт
	
	Если Товар.ПометкаУдаления Тогда
		РазрешенЭкспорт = ПроверитьПодчиненныеТовары(Товар);
		
		Если Не РазрешенЭкспорт Тогда
			ОтменитьЭкспорт(Товар);				
		КонецЕсли;
		
		Возврат РазрешенЭкспорт;
	КонецЕсли;

	Если НЕ Товар.ЭтоГруппа Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;
	
КонецФункции

//	#IBS 2021 24.05.2021 Функция РазрешенКЭкспорту возвращает Истина, если товар разрешен к экспорту
Функция ТоварыГруппыРазрешеныКЭкспорту(ТоварСсылка) Экспорт
	
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Номенклатура.Установить(ТоварСсылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Возврат Запись.РазрешенКЭкспорту;
	КонецЦикла;
	
	Возврат ложь;
	
КонецФункции      

//	#IBS Ширяев 12.03.2025 Функция проверяет, есть ли в группе материальный товар (УТ10.3)
//	Не услуга и не работа - это не хранится на складе WMS
Функция ВГруппеЕстьМатериальныйТовар(ГруппаСсылка) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
        |ИЗ
        |	Справочник.Номенклатура КАК Номенклатура
        |ГДЕ Номенклатура.Ссылка В ИЕРАРХИИ(&Группа)
		|И (НЕ Номенклатура.ЭтоГруппа)
		|И (НЕ Номенклатура.ПометкаУдаления)";
		
	Запрос.УстановитьПараметр("Группа", ГруппаСсылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл  
		ТоварСсылка = Выборка.Ссылка;
		ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.Ссылка, "ВидНоменклатуры");
		ТипНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидНоменклатуры, "ТипНоменклатуры");
		Если ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Услуга Тогда
			Возврат Истина;
		КонецЕсли;           
		
		Если Не ТоварСсылка.Услуга Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ложь;
	
КонецФункции      

// #IBS 12.03.2025 Установить флаг разрешения товаров группы
Процедура РазрешитьЭкспортТоваровГруппы(Товар, Разрешить) Экспорт
	Перем Запрос, Счетчик;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "Выбрать
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В ИЕРАРХИИ(&ГруппаТовара)";
	Запрос.УстановитьПараметр("ГруппаТовара", Товар.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Разрешить Тогда
			Если НЕ ТоварРазрешенКЭкспорту(Выборка.Ссылка) Тогда
				РазрешитьЭкспорт(Выборка.Ссылка);	
			КонецЕсли;
		Иначе
			Если ТоварРазрешенКЭкспорту(Выборка.Ссылка) Тогда
				ЗапретитьЭкспорт(Выборка.Ссылка);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	// Также группы родительской иерарархии разрешить
	Товар1 = Товар.Родитель;
	Пока Товар1 <> Справочники.Номенклатура.ПустаяСсылка() Цикл
		Если Разрешить Тогда     
			Если НЕ ТоварРазрешенКЭкспорту(Товар1) Тогда
				РазрешитьЭкспорт(Товар1);
			КонецЕсли;
		КонецЕсли;
		Товар1 = Товар1.Родитель;
	КонецЦикла;
	
КонецПроцедуры

// 	#IBS 10.11.2021 Разрешает экспорт товара и всей иерархии классификатора
Процедура РазрешитьЭкспортТовараСРодителями(ТоварСсылка) Экспорт
	Перем Ссылка1;
	
	Если ТоварСсылка = неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Ссылка1 = ТоварСсылка;
	Пока НЕ Ссылка1.Пустая() Цикл
		РазрешитьЭкспорт(Ссылка1);		
		Ссылка1 = Ссылка1.Родитель;
	КонецЦикла
		
КонецПроцедуры
 
// #IBS 12.03.2025 Разрешить экспорт группы номенклатур
Процедура РазрешитьЭкспорт(Товар) Экспорт

	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Номенклатура.Установить(Товар.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Истина;
		Запись.РазрешенКЭкспорту = Истина;
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsПометкиКЭкспортуНоменклатуры.СоздатьМенеджерЗаписи();
	НоваяЗапись.Номенклатура = Товар.Ссылка;
	НоваяЗапись.КЭкспорту = Истина;
	НоваяЗапись.РазрешенКЭкспорту = Истина;
    НоваяЗапись.Записать(); 
	
КонецПроцедуры

// #IBS 03.03.2023 Запретить экспорт группы (номенклатуры)
Процедура ЗапретитьЭкспорт(Товар) Экспорт

	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Номенклатура.Установить(Товар.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Если Запись.РазрешенКЭкспорту Тогда
			Запись.КЭкспорту = Ложь;
			Запись.РазрешенКЭкспорту = Ложь;
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

//	Процедура ОтменитьЭкспорт отменяет экспорт документа.
Процедура ОтменитьЭкспорт(Товар) Экспорт

	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Номенклатура.Установить(Товар.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Ложь;
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
КонецПроцедуры

//	Процедура ПометитьКЭкспорту помечает товар к экспорту.
// Разобраться IBS
Процедура ПометитьКЭкспорту(Товар) Экспорт
  
	Если Не РазрешенКЭкспорту(Товар) Тогда
        Возврат;
    КонецЕсли;	
	
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Номенклатура.Установить(Товар.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Истина;
		Запись.Дата = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsПометкиКЭкспортуНоменклатуры.СоздатьМенеджерЗаписи();
	НоваяЗапись.Номенклатура = Товар.Ссылка;
	НоваяЗапись.КЭкспорту = Истина;
	НоваяЗапись.Дата = ТекущаяДата();
    НоваяЗапись.Записать(); 
 
КонецПроцедуры

//	Функция ПомеченКЭкспорту возвращает Истина, если товар помечен к экспорту.
Функция ПомеченКЭкспорту(Товар) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	EmeWmsПометкиКЭкспортуНоменклатуры.КЭкспорту КАК КЭкспорту
		|ИЗ
		|	РегистрСведений.EmeWmsПометкиКЭкспортуНоменклатуры КАК EmeWmsПометкиКЭкспортуНоменклатуры
		|ГДЕ
		|	EmeWmsПометкиКЭкспортуНоменклатуры.Номенклатура = &ТоварСсылка";
	Запрос.УстановитьПараметр("ТоварСсылка", Товар.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.КЭкспорту;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции

//	Процедура ПодтвердитьЭкспорт подтверждает экспорт товара.
Процедура ПодтвердитьЭкспорт(Товар) Экспорт

	Попытка
		НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуНоменклатуры.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Номенклатура.Установить(Товар.Ссылка);
		НаборЗаписей.Прочитать();
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат
	КонецПопытки;

	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Ложь;
		Запись.ДатаЭкспорта = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
 
КонецПроцедуры

//	Процедура ПометитьКЭкспорту помечает товар к экспорту на событии при записи номеклатуры.
Процедура ПометитьКЭкспортуПриЗаписиНоменклатуры(Источник, Отказ) Экспорт

	ПометитьКЭкспорту(Источник);
 
КонецПроцедуры

//	Процедура ПометитьКЭкспорту помечает товар к экспорту на событии при записи упаковки.
Процедура ПометитьКЭкспортуПриЗаписиУпаковки(Источник, Отказ) Экспорт
	// #IBS 04.03.2024 Помечать, если включен режим пометок к экспорту
	Если Константы.EmeWmsПометкаВключена.Получить() Тогда
		Если Источник.Владелец.Метаданные().Имя = "Номенклатура" Тогда 
			ПометитьКЭкспорту(Источник.Владелец.ПолучитьОбъект());
		КонецЕсли;
	КонецЕсли; 	
КонецПроцедуры

//	Процедура ПометитьКЭкспорту помечает товар к экспорту на событии при записи штрихкода.
Процедура ПометитьКЭкспортуПриЗаписиШтрихкода(Источник, Отказ, Замещение) Экспорт
	
	Для Каждого Запись Из Источник Цикл 
		Товар = Запись.Владелец;
		ПометитьКЭкспорту(Товар.ПолучитьОбъект());
	КонецЦикла
	
КонецПроцедуры

#КонецОбласти  

#Область ЛокальныеСлужебныеПроцедурыИФункции  

// #IBS 27.11.2023 Проверить, есть ли подчиненные товары, не помеченные на удаление
Функция ЕстьПодчиненныеТовары(ГруппаСсылка)
	Номенклатура = Справочники.Номенклатура;
	Отбор = Новый Структура("ПометкаУдаления");
	Отбор.ПометкаУдаления = Ложь;
	Выборка = Номенклатура.Выбрать(ГруппаСсылка,,Отбор);
	Пока Выборка.Следующий()  Цикл
		Если НЕ Выборка.ЭтоГруппа Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;	
	
	Возврат Ложь;
КонецФункции      

// #IBS 27.11.2023 Проверить, есть ли подчиненные товары, не помеченные на удаление
Функция ПроверитьПодчиненныеТовары(Группа)
	Перем Запрос, Выборка;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	Номенклатура.Ссылка КАК Ссылка
        |ИЗ
        |	Справочник.Номенклатура КАК Номенклатура
        |ГДЕ Номенклатура.Ссылка В ИЕРАРХИИ(&Группа)
		|И (НЕ Номенклатура.ЭтоГруппа)
		|И (НЕ Номенклатура.ПометкаУдаления)";
		
	Запрос.УстановитьПараметр("Группа", Группа.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Истина;
	КонецЦикла;

	Возврат Ложь;
КонецФункции

// Проверяет разрешение к экспорту в регистре 
Функция ТоварРазрешенКЭкспорту(ТоварСсылка)
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	EmeWmsПометкиКЭкспортуНоменклатуры.РазрешенКЭкспорту КАК РазрешенКЭкспорту
		|ИЗ
		|	РегистрСведений.EmeWmsПометкиКЭкспортуНоменклатуры КАК EmeWmsПометкиКЭкспортуНоменклатуры
		|ГДЕ
		|	EmeWmsПометкиКЭкспортуНоменклатуры.Номенклатура = &ТоварСсылка";
		
	Запрос.УстановитьПараметр("ТоварСсылка", ТоварСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.РазрешенКЭкспорту;
	КонецЦикла;
	
	Возврат ложь;
КонецФункции  

//	Функция ПолучитьПолныйПуть возвращает полный путь классификатора товара.
//  IBS здесь все как для товара
Функция ПолучитьПолныйПуть(Знач Товар, Знач Код)
	
	ПолныйПуть = "";
	
	Если ЗначениеЗаполнено(Товар.Родитель) Тогда
		Пока Истина Цикл
			Если Товар.ЭтоГруппа Тогда
				Если ПолныйПуть <> "" Тогда
					ПолныйПуть = "#" + ПолныйПуть;
				КонецЕсли;
				Если Код Тогда
					ПолныйПуть = СокрЛП(Товар.Код) + ПолныйПуть;
				Иначе
					ПолныйПуть = Товар.Наименование + ПолныйПуть;
				КонецЕсли;
			КонецЕсли;
			Если ЗначениеЗаполнено(Товар.Родитель) Тогда
				Товар = Товар.Родитель;
			Иначе
				Прервать;
			КонецЕсли
		КонецЦикла
	КонецЕсли;
	
	Возврат ПолныйПуть;
	
КонецФункции

//	Функция ПолучитьДробь безопасно возвращает дробное значение
Функция ПолучитьДробь(Знач Числитель, Знач Знаменатель)
	
	Если Числитель = 0 Или Знаменатель = 0 Тогда
		Возврат Числитель;
	КонецЕсли;
	
	Возврат Числитель / Знаменатель;
	
КонецФункции

//	Процедура ПреобразоватьРазмер преобразует размер к сантиметрам.
Процедура ПреобразоватьРазмер(Размер, ЕдиницаИзмерения)
	
	//	Множитель преобразования к метрам
	Множитель = ПолучитьДробь(ЕдиницаИзмерения.Числитель, ЕдиницаИзмерения.Знаменатель);
	Размер = Размер * Множитель * 100.;
	
	Если Размер < 1. Тогда
		Размер = 1.
	КонецЕсли;
	
КонецПроцедуры

//	Процедура ПреобразоватьОбъем преобразует объем к кубическим сантиметрам.
Процедура ПреобразоватьОбъем(Объем, ЕдиницаИзмерения)
	
	//	Множитель преобразования к кубическим метрам
	Множитель = ПолучитьДробь(ЕдиницаИзмерения.Числитель, ЕдиницаИзмерения.Знаменатель);
	Объем = Объем * Множитель * 1000000.;
	
КонецПроцедуры

//	Процедура ПреобразоватьВес преобразует вес к килограммам.
Процедура ПреобразоватьВес(Вес, ЕдиницаИзмерения)
	
	//	Множитель преобразования к килограммам
	Множитель = ПолучитьДробь(ЕдиницаИзмерения.Числитель, ЕдиницаИзмерения.Знаменатель);
	Вес = Вес * Множитель * 1.;
	
КонецПроцедуры

#КонецОбласти  
