//	Copyright (C) 2012-2025 Engineer Mareev Enterprises
//	Модуль для КА 1.1

//	$Контрагенты
//	Выгрузка данных о контрагентах
//	- В 1C при записи контрагент помечается к экспорту.
//	- 1С (авт.) экспортирует сообщение CLIENTS.
//	- EME.WMS (авт.) импортирует сообщение CLIENTS.

#Область ПрограммныйИнтерфейс  

//	Процедура Экспортировать экспортирует одного Контрагента.
Процедура Экспортировать(ERPData, Контрагент) Экспорт   
	
	РеквизитыКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Контрагент, "Код, Наименование, Покупатель, Поставщик, ИНН, КПП, ОсновнойМенеджерПокупателя");
	
	//	Заголовок Clients
	EmeWmsERPEngine.AppendHeaderLine(ERPData);
	ERPData.header.id				= Контрагент.УникальныйИдентификатор();
	ERPData.header.code				= СокрЛП(РеквизитыКонтрагента.Код); // ibs в интерфейсе ERP этот код есть
	ERPData.header.name				= РеквизитыКонтрагента.Наименование;
		
	АдресДоставки 	 		= УправлениеКонтактнойИнформацией.ПолучитьАдресИзКонтактнойИнформации(Контрагент,"Фактический");
	ERPData.header.ADDRESS 	= АдресДоставки;
	ERPData.header.INN 		= РеквизитыКонтрагента.ИНН;
	ERPData.header.KPP 		= РеквизитыКонтрагента.КПП;
	ERPData.header.FP_OUT_CODE = ""; // Код стратегии подборки, надо выяснить, чем заполнять.
	ERPData.header.PHONE 	= УправлениеКонтактнойИнформацией.ПолучитьТелефонИзКонтактнойИнформации(Контрагент);
		
	ERPData.header.POSTAL_CODE = Лев(АдресДоставки,6); // Упрощенный вариант
	
	Если РеквизитыКонтрагента.Покупатель и РеквизитыКонтрагента.Поставщик Тогда
		ERPData.header.TYPE		= "CUS; SPL";
	ИначеЕсли РеквизитыКонтрагента.Поставщик Тогда
		ERPData.header.TYPE		= "SPL";
	Иначе
		ERPData.header.TYPE		= "CUS";
	КонецЕсли;
	
	//	Вид контактной информации: Почта для возвратов поставщикам
	ВидыКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.НайтиПоКоду("000000060");
	Если ЗначениеЗаполнено(ВидыКонтактнойИнформации) Тогда
		ERPData.header.EMAIL	= ОбщийМодуль_ЛА.ПолучитьEmailПоВиду(Контрагент, ВидыКонтактнойИнформации);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РеквизитыКонтрагента.ОсновнойМенеджерПокупателя) Тогда
		ERPData.header.manager_email = LA_ОбщийМодуль.СлужебныйАДресЭлектроннойПочтыПользователя(РеквизитыКонтрагента.ОсновнойМенеджерПокупателя);
	КонецЕсли;
	
КонецПроцедуры

//	Функция ПолучитьИмяСообщения возвращает имя сообщения
Функция ПолучитьИмяСообщения() Экспорт
	Возврат "clients";
КонецФункции

//	Функция ПолучитьМетаданные возвращает метаданные сообщения
Функция ПолучитьМетаданные() Экспорт
	Возврат Метаданные.Справочники.Контрагенты;
КонецФункции

#КонецОбласти  

#Область ЭкспортныеСлужебныеПроцедурыИФункции  

//	Функция ПолучитьВыборкуСсылок возвращает выборку ссылок для экспорта
Функция ПолучитьВыборкуСсылок() Экспорт
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	EmeWmsПометкиКЭкспортуКонтрагентов.Контрагент.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрСведений.EmeWmsПометкиКЭкспортуКонтрагентов КАК EmeWmsПометкиКЭкспортуКонтрагентов
		|ГДЕ
		|	EmeWmsПометкиКЭкспортуКонтрагентов.КЭкспорту";
		
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции

//	Функция РазрешенКЭкспорту возвращает Истина, если Контрагент разрешен к экспорту.
Функция РазрешенКЭкспорту(Контрагент) Экспорт
	
	Если Контрагент.ПометкаУдаления Тогда
		Возврат Ложь;
	КонецЕсли;

	Если Контрагент.ЭтоГруппа Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;
	
КонецФункции

//	Признака КЭкспорту нет, по умолчанию разрешен экспорт всех контрагентов
Процедура РазрешитьЭкспорт(Контрагент) Экспорт

	Возврат;

КонецПроцедуры
	
//	Процедура ПометитьКЭкспорту помечает Контрагент к экспорту.
Процедура ПометитьКЭкспорту(Контрагент) Экспорт
	
	Если Не РазрешенКЭкспорту(Контрагент) Тогда
        Возврат;
    КонецЕсли;	
	
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуКонтрагентов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Контрагент.Установить(Контрагент.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Истина;
		Запись.Дата = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsПометкиКЭкспортуКонтрагентов.СоздатьМенеджерЗаписи();
	НоваяЗапись.Контрагент = Контрагент.Ссылка;
	НоваяЗапись.КЭкспорту = Истина;
	НоваяЗапись.Дата = ТекущаяДата();
    НоваяЗапись.Записать(); 
 
КонецПроцедуры

//	Функция ПомеченКЭкспорту возвращает Истина, если Контрагент помечен к экспорту.
Функция ПомеченКЭкспорту(Контрагент) Экспорт
	
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуКонтрагентов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Контрагент.Установить(Контрагент.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Возврат Запись.КЭкспорту;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

//	Процедура ПодтвердитьЭкспорт подтверждает экспорт Контрагента.
Процедура ПодтвердитьЭкспорт(Контрагент) Экспорт

	Попытка
		НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуКонтрагентов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Контрагент.Установить(Контрагент.Ссылка);
		НаборЗаписей.Прочитать();
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат
	КонецПопытки;

	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Ложь;
		Запись.ДатаЭкспорта = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
 
КонецПроцедуры

//	Процедура ПометитьКЭкспорту помечает Контрагент к экспорту на событии при записи номеклатуры.
Процедура ПометитьКЭкспортуПриЗаписиКонтрагента(Источник, Отказ) Экспорт
	// #IBS 04.03.2024 Помечать, если включен режим пометок к экспорту
	Если Константы.EmeWmsПометкаВключена.Получить() Тогда
		ПометитьКЭкспорту(Источник);
	КонецЕсли; 
КонецПроцедуры

//	Процедура ПометитьКЭкспорту помечает Контрагент к экспорту на событии при записи НоменклатурыКонтрагента.
Процедура ПометитьКЭкспортуПриЗаписиНоменклатурыКонтрагента(Источник, Отказ, Замещение) Экспорт
	Для Каждого Запись Из Источник Цикл 
		
		Отбор = Новый Структура();
		Отбор.Вставить("Партнер", Запись.Владелец);
		Выборка = Справочники.Контрагенты.Выбрать(,,Отбор); // Из справочника контрагенты по партнеру
		
		Пока Выборка.Следующий() Цикл
			ПометитьКЭкспорту(Выборка.Ссылка.ПолучитьОбъект());
		КонецЦикла;
	КонецЦикла
КонецПроцедуры

//	Функция Экспортирован возвращает Истина, если контрагент был экспортирован или помечен к экспорту
Функция Экспортирован(Контрагент) Экспорт
	
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуКонтрагентов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Контрагент.Установить(Контрагент.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Если ЗначениеЗаполнено(Запись.ДатаЭкспорта) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции


#КонецОбласти  

#Область ЛокальныеСлужебныеПроцедурыИФункции  

//	Функция ПолучитьПолныйПуть возвращает полный путь классификатора Контрагента.
Функция ПолучитьПолныйПуть(Знач Контрагент, Знач Код)
	
	ПолныйПуть = "";
	
	Если ЗначениеЗаполнено(Контрагент.Родитель) Тогда
		Пока Истина Цикл
			Если Контрагент.ЭтоГруппа Тогда
				Если ПолныйПуть <> "" Тогда
					ПолныйПуть = "#" + ПолныйПуть;
				КонецЕсли;
				Если Код Тогда
					ПолныйПуть = СокрЛП(Контрагент.Код) + ПолныйПуть;
				Иначе
					ПолныйПуть = Контрагент.Наименование + ПолныйПуть;
				КонецЕсли;
			КонецЕсли;
			Если ЗначениеЗаполнено(Контрагент.Родитель) Тогда
				Контрагент = Контрагент.Родитель;
			Иначе
				Прервать;
			КонецЕсли
		КонецЦикла
	КонецЕсли;
	
	Возврат ПолныйПуть;
	
КонецФункции

//	Функция ПолучитьДробь безопасно возвращает дробное значение
Функция ПолучитьДробь(Знач Числитель, Знач Знаменатель)
	
	Если Числитель = 0 Или Знаменатель = 0 Тогда
		Возврат Числитель;
	КонецЕсли;
	
	Возврат Числитель / Знаменатель;
	
КонецФункции

//	Процедура ПреобразоватьРазмер преобразует размер к сантиметрам.
Процедура ПреобразоватьРазмер(Размер, ЕдиницаИзмерения)
	
	//	Множитель преобразования к метрам
	Множитель = ПолучитьДробь(ЕдиницаИзмерения.Числитель, ЕдиницаИзмерения.Знаменатель);
	Размер = Размер * Множитель * 100.;
	
	Если Размер < 1. Тогда
		Размер = 1.
	КонецЕсли;
	
КонецПроцедуры

//	Процедура ПреобразоватьОбъем преобразует объем к кубическим сантиметрам.
Процедура ПреобразоватьОбъем(Объем, ЕдиницаИзмерения)
	
	//	Множитель преобразования к кубическим метрам
	Множитель = ПолучитьДробь(ЕдиницаИзмерения.Числитель, ЕдиницаИзмерения.Знаменатель);
	Объем = Объем * Множитель * 1000000.;
	
КонецПроцедуры

//	Процедура ПреобразоватьВес преобразует вес к килограммам.
Процедура ПреобразоватьВес(Вес, ЕдиницаИзмерения)
	
	//	Множитель преобразования к килограммам
	Множитель = ПолучитьДробь(ЕдиницаИзмерения.Числитель, ЕдиницаИзмерения.Знаменатель);
	Вес = Вес * Множитель * 1.;
	
КонецПроцедуры

#КонецОбласти  
