// #Область ПрограммныйИнтерфейс

Процедура ДокументПриСозданииНаСервереПосле(Форма) Экспорт
	
	Документ1С = ДокументИзФормыДокумента(Форма);
	Если Не ЗначениеЗаполнено(Документ1С) Тогда
		Возврат;
	КонецЕсли;
	
	КомандыДокумента = КомандыДокумента1С(Документ1С);
	
	ОбщийМодуль("КонтурИнтеграция").ОпределитьКоманды(Форма, КомандыДокумента);
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныйПрограммныйИнтерфейс

Функция КомандыДокумента1С(Документ1С) Экспорт
	
	Попытка
		Результат = ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка().КонтурИнтеграция_КомандыДокумента1С(Документ1С);
	Исключение
		Результат = Новый Массив;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

Функция ОбщийМодуль(ИмяОбщегоМодуля)
	
	Если Метаданные.ОбщиеМодули.Найти(ИмяОбщегоМодуля) = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Общий модуль не существует: '") + ИмяОбщегоМодуля;
	КонецЕсли;
	
	Возврат Вычислить(ИмяОбщегоМодуля);
	
КонецФункции

Функция ДокументИзФормыДокумента(ФормаДокумента)
	
	Попытка
		Результат = ФормаДокумента.Объект.Ссылка;
	Исключение
		Результат = Неопределено;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти
