// Copyright (C) 2012-2025 Engineer Mareev Enterprises

//	Модуль для УТ10.3 экспорт документов Поступления товаров услуг на товары с сериями и характеристиками

//	$Приход товаров (не ордерная схема)
//  Экспорт сообщений ASN:
//	 - В 1C (руч.) оператор оформляет документ "Поступление товаров услуг", который при проведении в статусе "В работе" (авт.) помечается к экспорту.
//	 - 1C (авт.) экспортирует сообщение ASN.
//	 - EME.WMS (авт.) импортирует сообщение ASN и создает документ ASN.

#Область ПрограммныйИнтерфейс   

//	Функция ПолучитьИмяСообщения возвращает имя сообщения
Функция ПолучитьИмяСообщения() Экспорт
	Возврат "asn";
КонецФункции

//	Функция ПолучитьМетаданные возвращает метаданные сообщения
Функция ПолучитьМетаданные() Экспорт
	Возврат Метаданные.Документы.ПоступлениеТоваровУслуг;
КонецФункции

// #IBS 09.04.2025 Процедура Экспортировать экспортирует один документ Поступление товаров услуг с сериями (или характеристиками)
Процедура Экспортировать(ERPData, Документ) Экспорт
	
	АктуализироватьУИДыСтрок(Документ.Ссылка);
	
	//	Заголовок заказа
	EmeWmsERPEngine.AppendHeaderLine(ERPData);
	
	ERPData.header.asn_id       = Документ.УникальныйИдентификатор();

	Если Константы.EmeWmsСоздаватьУникальныеСообщения.Получить() Тогда
		ERPData.header.id	  	= Новый УникальныйИдентификатор;
	Иначе
		ERPData.header.id	  	= ERPData.header.asn_id;		
	КонецЕсли;

	ERPData.header.asn_reg_no	  =	СокрЛП(Документ.Номер)+"/"+Формат(Год(Документ.Дата),"ЧГ=4");
	ERPData.header.asn_date	  	  =	Документ.Дата;
	ERPData.header.erp_doc_type	  = ПолучитьМетаданные().Имя;
	ERPData.header.ref_reg_no  	  =	Документ.НомерВходящегоДокумента;
	
	Контрагент = Документ.Контрагент; 
		
	ERPData.header.supplier_id    =	Контрагент.УникальныйИдентификатор();
	ERPData.header.supplier_code  =	СокрЛП(Контрагент.Код);
	ERPData.header.supplier_name  =	Контрагент.Наименование;
	
	EmeWmsЭкспортКонтрагентов.РазрешитьЭкспорт(Контрагент);
		
	ERPData.header.whs_to_code 	  =	EmeWmsУтилиты.ПолучитьКодСкладаEMEПоСсылке(Документ.СкладОрдер);  // Код склада EME
	ERPData.header.vendor_to_code =	EmeWmsУтилиты.ПолучитьКодОрганизацииEMEПоСсылке(Документ.Организация);
	ERPData.header.comment        =	Лев(Документ.Комментарий, 128);
																				  
	//	Использование серий в интеграции
	ИспользоватьСерииНастройка = Константы.EmeWmsИспользоватьСерии.Получить();	

	//	Строки заказа
	EmeWmsERPEngine.SelectChild(ERPData, "lines");
	Для Каждого СтрокаТовара Из Документ.Товары Цикл 
		Товар = СтрокаТовара.Номенклатура;
				
		EmeWmsERPEngine.AppendChildLine(ERPData);
		
		ERPData.lines.id			= СтрокаТовара.EmeWmsУИДСтроки;
		ERPData.lines.asn_line_no	= СтрокаТовара.НомерСтроки;
		ERPData.lines.goods_id		= СтрокаТовара.Номенклатура.УникальныйИдентификатор();
		ERPData.lines.goods_code	= СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовара.Номенклатура, "Код"));
		ERPData.lines.quantity		= СтрокаТовара.Количество;
		// Для основной единицы - берется значение из номенклатуры, для кода по классификатору
		ЕдиницаИзмерения 			= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовара.Номенклатура, "БазоваяЕдиницаИзмерения");
		ERPData.lines.mu_code		= ЕдиницаИзмерения.Код; 
		
		// Выгружаем серии или характеристики товара
		ИспользоватьСерии 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Товар, "ВестиУчетПоСериям"); 

		// Серии или серийные номера
		Если Не ИспользоватьСерииНастройка Тогда
			ИспользоватьСерии = Ложь;
		КонецЕсли;
		
		Если ИспользоватьСерии Тогда // Серии
			// Здесь в сериях номер не заполняется, только наименование, содержащее номер и дату документа в виде текста.
			СерийныйНомер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовара.СерияНоменклатуры, "Наименование");
			СрокГодности = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовара.СерияНоменклатуры, "СрокГодности");
			Если ЗначениеЗаполнено(СерийныйНомер) Тогда 
				ERPData.lines.lot_no = СерийныйНомер;
				ERPData.lines.bbd = СрокГодности;
			КонецЕсли;
		Иначе // Характеристики
			ИспользоватьХарактеристики = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Товар,  "ВестиУчетПоХарактеристикам");
			Если ИспользоватьХарактеристики Тогда
				Если ЗначениеЗаполнено(СтрокаТовара.ХарактеристикаНоменклатуры) Тогда
					ERPData.lines.lot_no = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовара.ХарактеристикаНоменклатуры, "Наименование");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		//#COA Чепиков 27.05.2025 в строках ASN необходимо передавать клиента под которого пришла поставка
		Если ЗначениеЗаполнено(СтрокаТовара.Заказ) И ТипЗнч(СтрокаТовара.Заказ) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			Покупатель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовара.Заказ, "Контрагент");
			
			Если ЗначениеЗаполнено(Покупатель) Тогда
				ERPData.lines.customer_id = Покупатель.УникальныйИдентификатор();
				
				Если Не EmeWmsЭкспортКонтрагентов.Экспортирован(Покупатель) Тогда
					EmeWmsЭкспортКонтрагентов.ПометитьКЭкспорту(Покупатель);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		//#COA Чепиков 27.05.2025 в строках АСН нужно передавать цену
		ERPData.lines.price = СтрокаТовара.Цена;
		
		Если НЕ EmeWmsЭкспортНоменклатуры.Экспортирован(СтрокаТовара.Номенклатура) Тогда
			EmeWmsЭкспортНоменклатуры.РазрешитьЭкспортСГруппами(СтрокаТовара.Номенклатура);
		КонецЕсли;
		// EmeWmsЭкспортНоменклатуры.ПометитьКЭкспортуБезусловно(СтрокаТовара.Номенклатура);
	КонецЦикла;	  
	
КонецПроцедуры   

#КонецОбласти

#Область ЭкспортныеСлужебныеПроцедурыИФункции

//	Функция ПолучитьВыборкуСсылок возвращает выборку ссылок для экспорта
Функция ПолучитьВыборкуСсылок() Экспорт
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	EmeWmsПометкиКЭкспортуПоступленийТоваровУслуг.ПоступлениеТоваровУслуг КАК Ссылка
		|ИЗ
		|	РегистрСведений.EmeWmsПометкиКЭкспортуПоступленийТоваровУслуг КАК EmeWmsПометкиКЭкспортуПоступленийТоваровУслуг
		|ГДЕ
		|	EmeWmsПометкиКЭкспортуПоступленийТоваровУслуг.КЭкспорту";
		
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции

//	#IBS 09.04.2025 Функция РазрешенКЭкспорту возвращает Истина, если документ Поступление товаров услуг разрешен к экспорту.
Функция РазрешенКЭкспорту(Документ) Экспорт
	
	ДатаЗапускаИнтеграции = Константы.EmeWmsДатаЗапускаИнтеграции.Получить();
	Если ЗначениеЗаполнено(ДатаЗапускаИнтеграции)
			И Документ.Дата < ДатаЗапускаИнтеграции Тогда
		ОтменитьЭкспорт(Документ);
		Возврат Ложь;
	КонецЕсли;	
	
	Если Документ.ПометкаУдаления Тогда
		ОтменитьЭкспорт(Документ);
		Возврат Ложь;
	КонецЕсли;
	
	//#COA Чепиков 27.05.2025 по результатам тестирования, пожелание Заказчика выгружать не проведенные. 
	//Проводить при импорте Receipt в статусе "Закрыт".
	//Если Не Документ.Проведен Тогда
	//	ОтменитьЭкспорт(Документ);
	//	Возврат Ложь;
	//КонецЕсли;
	
	// Настройку ордерной схемы получим из маппинга
	Если EmeWmsУтилиты.ПолучитьИспользованиеОрдернойСхемыВПриходеДляСклада(Документ.СкладОрдер) Тогда
		ОтменитьЭкспорт(Документ);
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ВДокументеЕстьМатериальныйТовар(Документ) Тогда
		ОтменитьЭкспорт(Документ);
		Возврат Ложь;
	КонецЕсли;
	
	// #COA 24.11.2023 по ИЗ к Экспорту в статусе "В работе"
	//Если Документ.Статус <> Перечисления.СтатусыПриходныхОрдеров.ВРаботе Тогда
	//	ОтменитьЭкспорт(Документ);       
	//	Возврат Ложь;
	//КонецЕсли;   
	
	// #IBS 12.02.2024 По складам не WMS не экспортировать
	КодСклада = EmeWmsУтилиты.ПолучитьКодСкладаEMEПоСсылке(Документ.СкладОрдер);
	Если НЕ ЗначениеЗаполнено(КодСклада) Тогда
		ОтменитьЭкспорт(Документ);
		Возврат Ложь;
	КонецЕсли;

	// Не выгружать заново импортированные документы
	Если ПоступлениеТоваровУслугИмпортировано(Документ) Тогда
		ПодтвердитьЭкспорт(Документ);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат истина;
	
КонецФункции

//	Процедура ПометитьКЭкспорту помечает документ к экспорту
Процедура ПометитьКЭкспорту(Документ) Экспорт

	Если Не РазрешенКЭкспорту(Документ) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТовара Из Документ.Товары Цикл 
		Если НЕ EmeWmsЭкспортНоменклатуры.Экспортирован(СтрокаТовара.Номенклатура) Тогда
			EmeWmsЭкспортНоменклатуры.РазрешитьЭкспортСГруппами(СтрокаТовара.Номенклатура);
		КонецЕсли;   		
	КонецЦикла;

	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуПоступленийТоваровУслуг.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПоступлениеТоваровУслуг.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Истина;
		Запись.Дата = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
  	НоваяЗапись = РегистрыСведений.EmeWmsПометкиКЭкспортуПоступленийТоваровУслуг.СоздатьМенеджерЗаписи();
	НоваяЗапись.ПоступлениеТоваровУслуг = Документ.Ссылка;
	НоваяЗапись.КЭкспорту = Истина;
	НоваяЗапись.Дата = ТекущаяДата();
    НоваяЗапись.Записать(); 
		 
КонецПроцедуры

//	Процедура ОтменитьЭкспорт отменяет экспорт документа.
Процедура ОтменитьЭкспорт(Документ) Экспорт

	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуПоступленийТоваровУслуг.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПоступлениеТоваровУслуг.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Ложь;
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
КонецПроцедуры

//	Функция ПомеченКЭкспорту возвращает Истина, если ПТУ помечено к экспорту.
Функция ПомеченКЭкспорту(Документ) Экспорт
	
	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуПоступленийТоваровУслуг.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПоступлениеТоваровУслуг.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Возврат Запись.КЭкспорту;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

//	#IBS 05.05.2023 Процедура ПодтвердитьЭкспорт подтверждает экспорт приходного ордера.
Процедура ПодтвердитьЭкспорт(Документ) Экспорт

	НаборЗаписей = РегистрыСведений.EmeWmsПометкиКЭкспортуПоступленийТоваровУслуг.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПоступлениеТоваровУслуг.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КЭкспорту = Ложь;
		Запись.ДатаЭкспорта = ТекущаяДата();
		НаборЗаписей.Записать();
		Возврат;
	КонецЦикла;
	
КонецПроцедуры

//	#IBS 05.05.2023 Процедура ПометитьКЭкспорту помечает ПТУ к экспорту при записи.
Процедура ПометитьКЭкспортуПриЗаписиПоступленияТоваровУслуг(Источник, Отказ) Экспорт

	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ПометитьКЭкспорту(Источник);
		 
КонецПроцедуры

#КонецОбласти

#Область ЛокальныеСлужебныеПроцедурыИФункции

// #IBS 19.06.2023 Создать новые УИДы строк и исправить дубли, если возникли
Функция АктуализироватьУИДыСтрок(ДокументСсылка)
	Документ = ДокументСсылка.ПолучитьОбъект();
	// Для УИД строк ТЧ
	КлючиСтрок = Новый Соответствие;
	БылиСозданыИдентификаторы = Ложь;
	Для Каждого СтрокаТовара Из Документ.Товары Цикл 
		// Генерация специальных UID строк документа при выгрузке
		Если НЕ ЗначениеЗаполнено(СтрокаТовара.EmeWmsУИДСтроки) ИЛИ КлючиСтрок.Получить(СтрокаТовара.EmeWmsУИДСтроки) <> Неопределено Тогда
			СтрокаТовара.EmeWmsУИДСтроки = Новый УникальныйИдентификатор();
			БылиСозданыИдентификаторы = Истина;
		КонецЕсли;
		КлючиСтрок.Вставить(СтрокаТовара.EmeWmsУИДСтроки, 0);
	КонецЦикла;	
	
	Если БылиСозданыИдентификаторы Тогда
		// При записи не перепроводить, не регистрировать по подписке к Эксопрту
		Документ.ОбменДанными.Загрузка = Истина;			
		Документ.Записать();
	КонецЕсли;
КонецФункции

// Проверить, был импортирован документ ПТУ, или нет.
Функция ПоступлениеТоваровУслугИмпортировано(Документ)
	
	НаборЗаписей = РегистрыСведений.EmeWmsОтметкиОбИмпортеПоступленийТоваровУслуг.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Возврат Истина;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции

// Проверить, есть ли в документе товары для склада
Функция ВДокументеЕстьМатериальныйТовар(Документ)  
	
	Для Каждого СтрокаТовара из Документ.Товары Цикл
		Если EmeWmsЭкспортНоменклатуры.ЭтоМатериальныйТовар(СтрокаТовара.Номенклатура) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции
	
#КонецОбласти
