#Область ПолучениеКонтактнойИнформации

//	Возвращает таблицу, содержащую контактную информацию объекта.
Функция КонтактнаяИнформацияОбъекта(СсылкаИлиОбъект, ВидИлиТипКонтактнойИнформации = Неопределено, Дата = Неопределено, ТолькоПредставление = Истина) Экспорт

	// ПолучитьДрайвер() используем только когда различаются вызываемые модули
	Возврат УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(СсылкаИлиОбъект, ВидИлиТипКонтактнойИнформации, Дата);
	
КонецФункции

//	Функция находит актуальное значение адреса в контактной информации.
Функция ПолучитьАдресИзКонтактнойИнформации(Объект, ТипАдреса = "", Дата = Неопределено) Экспорт

	// ПолучитьДрайвер() используем только когда различаются вызываемые модули
	Возврат ФормированиеПечатныхФорм.ПолучитьАдресИзКонтактнойИнформации(Объект, ТипАдреса, Дата);	
	
КонецФункции

//	Функция находит актуальное значение телефона в контактной информации.
Функция ПолучитьТелефонИзКонтактнойИнформации(Объект) Экспорт       

	// ПолучитьДрайвер() используем только когда различаются вызываемые модули
	Возврат ФормированиеПечатныхФорм.ПолучитьТелефонИзКонтактнойИнформации(Объект); 
	
КонецФункции

#КонецОбласти
